{
  "source_file": "NPS Interview Transcript_011225_Jeanette, Ocorian.docx",
  "paragraphs": [
    "NPS Interview Transcript",
    "Interview Date: 01.12.25",
    "Jeanette: Jeanette Rooms, Ocorian",
    "Project: ES",
    "Score: 6",
    "TRANSCRIPT OVERVIEW",
    "https://otter.ai/u/PY8fgkNWUFZGxxVfOhIIFqoGONc?view=summary",
    "Jeanette, Chief People Officer, discussed her experience with Korn Ferry for recruiting senior roles. She highlighted issues with Korn Ferry's lack of female consultants, which hindered diversity efforts. Compensation details were delayed, causing negotiation delays and nearly losing a candidate. Despite finding two good candidates, the process was prolonged, initially expected to take 2-3 months but lasting 5-6 months. Communication was inefficient, with reports often arriving too late. Rooms emphasized the need for better assertiveness and urgency from Korn Ferry. She noted improvements were needed in their service delivery.",
    "Jeanette' Role and Relationship with Korn Ferry",
    "Jeanette introduces herself as the Chief People Officer at a company, working closely with the CEO.",
    "She has been involved with Korn Ferry for over a decade, primarily for executive headhunting.",
    "Korn Ferry was appointed by Chantal based on existing relationships, without a competitive pitch.",
    "Jeanette mentions that Shane, the head of talent, usually handles contract details, but she was involved at some point.",
    "Challenges with Korn Ferry's Candidate Slate",
    "Jeanette highlights the difficulty in getting Korn Ferry to present a mixed slate of candidates, emphasizing the need for women.",
    "She notes that all consultants from Korn Ferry were men, which made it harder to include women in the shortlist.",
    "The lack of female consultants at Korn Ferry made it challenging to attract more women candidates.",
    "Jeanette expresses frustration with the compensation-related issues, particularly for the Chief Digital Officer role.",
    "Compensation and Negotiation Issues",
    "Jeanette found it difficult to get detailed information about candidates' current compensation from Korn Ferry.",
    "The lack of timely compensation information delayed the negotiation process and almost led to losing a candidate.",
    "The back-and-forth communication about compensation details was inefficient and prolonged the process.",
    "Despite the challenges, Jeanette ended up with a better candidate than initially expected.",
    "Benchmarking and Negotiation Support",
    "Korn Ferry did not provide much support in terms of benchmarking or understanding the compensation structure.",
    "Jeanette mentions that they had their own benchmarking tools and relied on Korn Ferry's vague expectations.",
    "Korn Ferry negotiated on behalf of the candidates but did not manage to finalize the deal until Chantal took over.",
    "The quality and quantity of candidates were not up to Jeanette's expectations, especially for the CDO role.",
    "Communication and Project Management",
    "Jeanette found the communication and project management from Korn Ferry to be inefficient.",
    "Reports often arrived too late for thorough review before calls, making it difficult to prepare.",
    "The consultants from Korn Ferry were hesitant and did not proactively present the best candidates.",
    "Chantelle had to take a more assertive role in managing the process and making decisions.",
    "Overall Experience and Comparison with Previous Engagements",
    "Jeanette acknowledges that they eventually found two good candidates but felt the process was unnecessarily prolonged.",
    "The initial expectation was to fill the roles within two to three months, but it took much longer.",
    "Jeanette compared the experience with Korn Ferry unfavorably to her previous engagements with other headhunters.",
    "She emphasized the lack of pace, urgency, and assertiveness from Korn Ferry, which was frustrating.",
    "Feedback and Future Engagements",
    "Jeanette provided feedback to Korn Ferry, expressing her frustrations and the need for improvement.",
    "She mentions that Stuart from Korn Ferry had already reached out to her for a follow-up meeting.",
    "Teresa Allan, the Teresa Allan, assures Jeanette that the feedback will be used to improve future engagements.",
    "Jeanette is open to future engagements with Korn Ferry if improvements are made based on the feedback.",
    "FULL TRANSCRIPT",
    "Jeanette  0:14  ",
    "Hi, I'm well you.",
    "Teresa Allan  0:18  ",
    "Yeah, good. Thank you. Nice to meet you. You too. Thanks for agreeing to take part in the interview. No problem. I'll try and keep it as brief as possible, especially on a Monday morning, just to give you a little bit of context. So I am the managing partner at Magnus consulting. We've been working with Korn Ferry for the last five years, so we know their business well, and we're running these as a third party. So you can speak more freely to encourage to to encourage that. Are you all right if I record this so my team can help me make notes? Excellent, great. So we'll jump straight in, if you could just start by explaining your role in the business and your relationship with Korn Ferry to date.",
    "Jeanette  1:06  ",
    "So I'm Chief People Officer at Korn Ferry I've been here 14 months, 15 months now, and I work very closely with the CEO. So when we are looking at recruiting senior roles, I get heavily involved in that. And hence my involvement with Korry. I've known Korn Ferry over too many years of experience for various things, actually, generally, generally headhunting for execs, though, to be fair. Jeanette were appointed by Chantal on this occasion because, I think she had just recently been chatting to Stuart. I think it was and so when she was looking, I think she reached out to them, and the conversation had kind of started before I was even involved in it, really. So they were pointed. I'm just trying to remember if I got involved in the contract I did at some stage, actually, although we have a habit head of talent here, and so Shane, Shane will Holland will have, he's actually left the business now, he will have gone through the detail of the contract rather than me. Great.",
    "Teresa Allan  2:21  ",
    "Okay, so it wasn't a competitive pitch. It was just given straight to them based on existing relationships. Yeah, okay, great. And you gave it a six, I believe. So talk me through your experience. Kind of where, where didn't it meet your expectations?",
    "Jeanette  2:39  ",
    "We had two roles with them, working them at the same time, Chief Digital Officer and group capability centers, head, oh, I think I've frozen. Think I froze there. I can hear I can hear you. I'm going to turn my camera off just for a few, few minutes, if that's all right, to help with the quality. Yeah, great.",
    "Teresa Allan  3:02  ",
    "I'll do I'll do the same. And then thank you. So",
    "Jeanette  3:06  ",
    "we were running with two roles. There were a couple of things that stand out in my mind, really, and it's unfortunate for them that they were near the end, because then they stick with you. So the first thing was, our CEO is very keen on having a mixed slate. So we had to remind the guys a number of times that we want to see women as well as men. So it was quite difficult to get them to bring women to the short list. And in addition to that, we noticed that all the consultants from Korn Ferry were all men. So it's very difficult to actually not. I'm not going to make a judgment on it. I think it would be easier naturally to attract more women into these roles, if there were more women actually doing the profiling and doing the shortlisting. It's just one of those things, and it just means that the people picking the short lists are all male rather than female. So that was one thing for us that didn't really sit very well. And then the more impactful thing for me was the fun and games around the compensation. So for both of the roles, although particularly for the Chief Digital Officer role, trying to get out of them what current comp was, was impossible. And the fact that actually it was left until we were at office stage, before they had even providing us with any information. And even then, they kept having to go back and forth to the candidate all of the time, which put us on the back foot for negotiating. Yeah, so you know it was, it was really not good that it took until my asking them, can you find current compensation? Can you really identify what that meant? So when they say it's this kind of fancy title bonus, what does that actually mean? So is it, is it a guaranteed? Was it based on performance? Was it based on the fact they'd only just joined? Was it based on is it something that's accrued throughout the year? Is it a guaranteed? I mean, all of these things that I would expect then to have understood we had to keep going back and forth and back and forth, which means it took us forever to put an offer together. We nearly lost the one of the candidates because of it, because they had another offer. And so I don't know whether the other organization was just quicker to put an offer together or whatever it was, but the the timing around finding out what the person's actual compensation was took forever, and in the end, we didn't actually end up bagging the candidate that we wanted, because actually what our offer was looking like in the end ended were up just not being good enough what they were after. So I don't believe that would have been as difficult. I mean, as it happens, I actually believe we ended up with a better candidate. And I'm I find them knowing that, although the guys would have known that, because this, the guy we've ended up with was my, my preferred candidate, as it happened. But that whole back and forth about compensation, and then not really understanding some of the compensation that we people were being paid, I was just, I was very disappointed with",
    "Teresa Allan  6:22  ",
    "that, okay, did they give you, I mean, going in terms of, obviously, you know, having that visibility of their current compensation, but in terms of benchmarking, what your offer was, did they, did they offer any insight there, using their benchmarking Tools? Or was that?",
    "Jeanette  6:41  ",
    "No, I mean, we have our own benchmark, as you can imagine, and there is only so much. And of course, at this level role, you're not only talking about bone, but you're talking about equity levels. And so therefore future compensation, we didn't get any support. As far as that was concerned, we got a very blanket the expectation is around about half a million, or whatever the number was, you know, which is fine, but it's very, yeah, yeah. You know, it was like we, he expects the value of his future equity to be around this much, right? Okay, and what about, how would he, what would he take in terms of balance of what's fixed and what's variable, we had to ask all of those questions. So they were constantly going back and forth. Okay, did they? Did they negotiate on your behalf with the candidates? Yes, they did. And we got right to the very, very end. And then by the stage we were, we were a little fed up of going back and forth that, frankly, in the end, Chantelle just said, I'm going to ring him directly. And so in the end, she ended up speaking to him herself, right,",
    "Teresa Allan  7:49  ",
    "which moved it along. Yes, okay, and going back to your kind of wanting that mixed slate and not having enough women in terms of the other candidates that they did put forward, how was the quality and quantity of those",
    "Jeanette  8:08  ",
    "and the quality was? The reality is, and this is not, I don't think this is at Korn Ferry's feet, to be fair, is there are simply less women in that very senior CDO role, the ones they put forward were in one layer down. So we, I understood that, but we had to ask them for them.",
    "Teresa Allan  8:34  ",
    "Okay? So they, they so they weren't necessarily meeting your expectations in seniority, because there weren't essentially that many available",
    "Jeanette  8:43  ",
    "for that CDO role. Yes, the GCC role, we believe there probably could have been more. But there is also mitigating circumstances, in fact, that we're placing the role in Mauritius, but the issue of it was the fact that we had to keep requesting more than once, that they also put females in front of us to consider, to consider, not just males, right? Okay? And again, our made up story about that is the fact that it's because they were all men looking for females rather than females looking for females.",
    "Teresa Allan  9:19  ",
    "Yeah. I mean, would, I mean, did you get a sense in, you know, if you don't know, you don't know that the people, the candidates, they put forward, were coming from them doing a kind of an out and out search, or was it from their network? Majority?",
    "Teresa Allan  9:37  ",
    "Differently, I don't know.",
    "Teresa Allan  9:39  ",
    "Okay, we can pick up with them, yeah, in terms of the experience of, like, just, you know, day to day communication and project management did, how did that work for you?",
    "Jeanette  9:53  ",
    "Um, it's not the best I've worked with. I've worked with better headhunters in terms of efficiency, and, you know, getting reports to us, we were having regular calls, and the reports would often land an hour or two before the call, with seven new CVS and everything on you have no hope in hell of getting to it. Yeah, yeah.",
    "Teresa Allan  10:15  ",
    "And in terms of, like, the communication style, I'm assuming there's multiple stakeholders making these senior decisions. Did, was that something that they did, they managed to kind of get, get a collective decision from you all. How did that work?",
    "Jeanette  10:28  ",
    "Do you know, do you mean? Do you mean the ultimate decision, or do you mean who we're going to take forward on?",
    "Teresa Allan  10:36  ",
    "Yeah, I mean and just general, I'll be honest",
    "Jeanette  10:40  ",
    "with you. We ended up running the calls. Okay? It always felt very hesitant, is the way I would describe it. And you probably don't know Chantelle, but Chantelle is, is fairly high energy and ready to go, and must talk about it, and blah, blah. So in actual fact, she ended up saying, Well, talk me through those then, you know, he they would say, here's the report. Fine. And then write, yeah. And they would always assume what they'd always assume we'd have chance to read everything, which I don't know how, because, as I said, it never arrived early enough, generally. And then it was a case of, okay, so who do you want to talk to us about? Then, you know, we were asking them, rather than saying, coming forward and saying, here are the seven, which is what I would have done, here are the seven. You can look at the seven in your own time. However, these are the three that we highly recommend. Let's talk about these three. You know that it just wasn't assertive enough. Yeah, yeah. And with someone like Chantelle, and they know Chantelle, you need to be quite on the front foot, right?",
    "Teresa Allan  11:46  ",
    "Yeah, absolutely. Well, I mean, these, yeah, like all of you, are very seedy people and very busy time, and it costs money. There's a million dollars of Yes, done, and",
    "Jeanette  11:56  ",
    "it is what we're paying them for, ultimately, that they put forward. You know, they see these people all of the time, and we briefed them. I know we did a really good job on briefing them. I know we did, and yet they always seemed a little kind of hesitant. I mean, look, don't get me wrong, right? Chantal is all over it. She'll ask you really difficult questions. She wants to get into the detail, but if you step forward and say, let's just talk about these three today, then that's really going to help the call to",
    "Teresa Allan  12:25  ",
    "go, Well, yeah, yeah, just I get it, owning it, okay, yeah. In terms of, I mean, what did anything? Did anything kind of stand out for you in terms of, or, or just met your expectations? That went, Okay,",
    "Jeanette  12:42  ",
    "look, we got there in the end. Let's, you know, let's be clear, we did actually find two very, very good candidates in the end. And ultimately, you know, that's what we were looking for. It just took way, way longer than we thought we were at it for the best part of, what, five months, six months, yeah, it took a long time.",
    "Teresa Allan  13:04  ",
    "Did you have an expectation of when you wanted the role filled?",
    "Jeanette  13:08  ",
    "When the first day we met them, they came into the office and Chantelle said, we really need to get an offer two to three months. We're really, really in a hurry. Okay?",
    "Teresa Allan  13:19  ",
    "And was that because, I mean, obviously you've talked through the issues with the compensation, slowing things up, but before that, so say, if you hit the two month mark, did you have any options on the table that, or was it that you just wasn't there wasn't the right candidates there. Yeah, it",
    "Jeanette  13:36  ",
    "just, yeah, they just weren't hitting the right brief. Okay,",
    "Teresa Allan  13:40  ",
    "on that brief. I mean, how much did they help craft it, or push back on it, or ask questions, and how much, I mean, did they, if they're two months in and they weren't hitting the right brief, what was the kind of I suppose, your understanding of their understanding",
    "Jeanette  13:54  ",
    "of it. So the initial brief was done with Chantelle, largely, I was in the room, but she was definitely briefing. She had a very, very clear view about what she wanted. I hadn't really been around overly long, and I wasn't really involved in recruitment. I dived in then at that stage, just to help push it all along, really. But I think after a couple of months, we did have very clear conversations with them. Said this, these just don't feel right, guys, this is what we think we're missing. And it was on one of our regular weekly calls, and they were invariably three or four of them on the calls. We're just not it's not just they didn't seem to instinctively pick up that it wasn't quite right, right? They just kept pushing forward. Yeah, it did feel a little bit like that. Whereas I would have liked a little more insight to say, you know, to come forward again and say, Look, guys, this doesn't feel like it's quite right. Let's really nail it down as to what's missing. What is it you want more of? What is it you want less of? We instigated those conversations, right? Okay, that's really helpful.",
    "Teresa Allan  15:07  ",
    "You mentioned, obviously, having experience of working with other Headhunters, where it's gone better is, I mean, is there anything apart from, obviously, what we've discussed that's been standout, that you would, that would, for you be, you know, a good experience,",
    "Jeanette  15:25  ",
    "I think, for me, with these things, right? They, I mean, they're in a very difficult position. Let's be clear, no one likes to pay a lot of money to these guys to find them someone. They just don't, right, so it's very, very difficult. I do get that. But when we do appoint someone, and the rates, you know, we you end up paying these guys a lot of money for people, because we're looking for very senior people. And I, the expectation for me, and I've certainly received it elsewhere, is the pace and the assertiveness and being on top of data and knowing everything about comp and I and I just didn't I it was the sense of pace and urgency and assertiveness that I think Chantelle and I found really frustrating throughout the process, as well as the profiles not being right. But it really exacerbated itself at the end, though, when we just had so much problem trying to get details out of comp, right?",
    "Teresa Allan  16:24  ",
    "Okay, in terms, I mean, you've obviously said you've used Korn Ferry before. How is this experience compared to your previous ones?",
    "Jeanette  16:36  ",
    "Not as good. Oh, yeah, it was a different team, yeah, to be fair, I can't it's a while ago, right? I've been doing this way too long. It's a while ago, and I don't even remember the last time I use them, but I when Chantel said to me, we're using Korn Ferry, I didn't have any concerns about it. I thought, good. She's gone to a good company, you know, so the reputation goes before them, and my previous experiences led me to believe it was okay, yeah, yeah. Did you feed",
    "Teresa Allan  17:10  ",
    "any of this back to them? Do you think they got a sense of your frustration? We definitely did. We definitely did, yeah, yeah,",
    "Jeanette  17:15  ",
    "in numerous emails and occasional calls with ConsultantS and I think Adam was the guy dealing with the comp. It was like, come on. You know, guys, this isn't okay. We really expect this to be quicker. I thought you would have known this. Why did you not know about this? Have you asked about this? Have you asked about this? And we fed back on calls numerous times. We need to see more women's profiles numerous times so they they couldn't have been in any doubt.",
    "Teresa Allan  17:43  ",
    "And what was their response when they didn't put",
    "Jeanette  17:47  ",
    "them forward? It's really hard to find females in these positions. And Chantal was like, No, I don't accept that. Yeah, just not looking hard enough. And then that. It was then that Chantelle said, Could it be because there are no women to look actually looking for women.",
    "Teresa Allan  18:02  ",
    "Yeah. Okay, interesting. I mean, obviously you don't sound like you've had a great experience at all.",
    "Jeanette  18:13  ",
    "It was fine to start with, I have to be honest and the gut, don't get me wrong, the guys are all really personable and lovely guys. Of course, they are right. It was just it didn't go anywhere near as quickly. And I would say the frustrations got worse as we as we gradually went through it. And then when you get to the very end, and you just on the closing line, I think when we were left with a little bit of a Whoa, you know, I'm not sure we'll go back there again, because that was really hard work at the end.",
    "Teresa Allan  18:43  ",
    "Yeah, okay, great. Well, I think probably that's everything I need to know, unless there's anything else that you think would be good to share. Nope, I think that's probably it. Okay. Well, I mean, I do appreciate your honesty. There's lots of beautiful thought there. Then I will, and if you're comfortable, I will write this up and be quite direct and feeding it back to them and where you can improve in the future, happy to and it might mean, I mean, would if somebody, if one of their managers, wanted to reach out and follow up to you, would you be open to that?",
    "Jeanette  19:18  ",
    "I would actually, I think ConsultantS has already reached out and tried to book breakfast or something with me. My diary is like a lunatic asylum, so Jen does her best, yeah, to try and accommodate stuff like that, but he definitely has already reached out, so I acknowledge them for that I really do great.",
    "Teresa Allan  19:36  ",
    "Okay, well, what I'll do is I'll write this up and I will, I'll speak to him myself and talking through it, and then he can make a plan of best fit forward. Bye."
  ],
  "text": "NPS Interview Transcript\n\nInterview Date: 01.12.25\n\nJeanette: Jeanette Rooms, Ocorian\n\nProject: ES\n\nScore: 6\n\nTRANSCRIPT OVERVIEW\n\nhttps://otter.ai/u/PY8fgkNWUFZGxxVfOhIIFqoGONc?view=summary\n\nJeanette, Chief People Officer, discussed her experience with Korn Ferry for recruiting senior roles. She highlighted issues with Korn Ferry's lack of female consultants, which hindered diversity efforts. Compensation details were delayed, causing negotiation delays and nearly losing a candidate. Despite finding two good candidates, the process was prolonged, initially expected to take 2-3 months but lasting 5-6 months. Communication was inefficient, with reports often arriving too late. Rooms emphasized the need for better assertiveness and urgency from Korn Ferry. She noted improvements were needed in their service delivery.\n\nJeanette' Role and Relationship with Korn Ferry\n\nJeanette introduces herself as the Chief People Officer at a company, working closely with the CEO.\n\nShe has been involved with Korn Ferry for over a decade, primarily for executive headhunting.\n\nKorn Ferry was appointed by Chantal based on existing relationships, without a competitive pitch.\n\nJeanette mentions that Shane, the head of talent, usually handles contract details, but she was involved at some point.\n\nChallenges with Korn Ferry's Candidate Slate\n\nJeanette highlights the difficulty in getting Korn Ferry to present a mixed slate of candidates, emphasizing the need for women.\n\nShe notes that all consultants from Korn Ferry were men, which made it harder to include women in the shortlist.\n\nThe lack of female consultants at Korn Ferry made it challenging to attract more women candidates.\n\nJeanette expresses frustration with the compensation-related issues, particularly for the Chief Digital Officer role.\n\nCompensation and Negotiation Issues\n\nJeanette found it difficult to get detailed information about candidates' current compensation from Korn Ferry.\n\nThe lack of timely compensation information delayed the negotiation process and almost led to losing a candidate.\n\nThe back-and-forth communication about compensation details was inefficient and prolonged the process.\n\nDespite the challenges, Jeanette ended up with a better candidate than initially expected.\n\nBenchmarking and Negotiation Support\n\nKorn Ferry did not provide much support in terms of benchmarking or understanding the compensation structure.\n\nJeanette mentions that they had their own benchmarking tools and relied on Korn Ferry's vague expectations.\n\nKorn Ferry negotiated on behalf of the candidates but did not manage to finalize the deal until Chantal took over.\n\nThe quality and quantity of candidates were not up to Jeanette's expectations, especially for the CDO role.\n\nCommunication and Project Management\n\nJeanette found the communication and project management from Korn Ferry to be inefficient.\n\nReports often arrived too late for thorough review before calls, making it difficult to prepare.\n\nThe consultants from Korn Ferry were hesitant and did not proactively present the best candidates.\n\nChantelle had to take a more assertive role in managing the process and making decisions.\n\nOverall Experience and Comparison with Previous Engagements\n\nJeanette acknowledges that they eventually found two good candidates but felt the process was unnecessarily prolonged.\n\nThe initial expectation was to fill the roles within two to three months, but it took much longer.\n\nJeanette compared the experience with Korn Ferry unfavorably to her previous engagements with other headhunters.\n\nShe emphasized the lack of pace, urgency, and assertiveness from Korn Ferry, which was frustrating.\n\nFeedback and Future Engagements\n\nJeanette provided feedback to Korn Ferry, expressing her frustrations and the need for improvement.\n\nShe mentions that Stuart from Korn Ferry had already reached out to her for a follow-up meeting.\n\nTeresa Allan, the Teresa Allan, assures Jeanette that the feedback will be used to improve future engagements.\n\nJeanette is open to future engagements with Korn Ferry if improvements are made based on the feedback.\n\nFULL TRANSCRIPT\n\nJeanette  0:14  \n\nHi, I'm well you.\n\nTeresa Allan  0:18  \n\nYeah, good. Thank you. Nice to meet you. You too. Thanks for agreeing to take part in the interview. No problem. I'll try and keep it as brief as possible, especially on a Monday morning, just to give you a little bit of context. So I am the managing partner at Magnus consulting. We've been working with Korn Ferry for the last five years, so we know their business well, and we're running these as a third party. So you can speak more freely to encourage to to encourage that. Are you all right if I record this so my team can help me make notes? Excellent, great. So we'll jump straight in, if you could just start by explaining your role in the business and your relationship with Korn Ferry to date.\n\nJeanette  1:06  \n\nSo I'm Chief People Officer at Korn Ferry I've been here 14 months, 15 months now, and I work very closely with the CEO. So when we are looking at recruiting senior roles, I get heavily involved in that. And hence my involvement with Korry. I've known Korn Ferry over too many years of experience for various things, actually, generally, generally headhunting for execs, though, to be fair. Jeanette were appointed by Chantal on this occasion because, I think she had just recently been chatting to Stuart. I think it was and so when she was looking, I think she reached out to them, and the conversation had kind of started before I was even involved in it, really. So they were pointed. I'm just trying to remember if I got involved in the contract I did at some stage, actually, although we have a habit head of talent here, and so Shane, Shane will Holland will have, he's actually left the business now, he will have gone through the detail of the contract rather than me. Great.\n\nTeresa Allan  2:21  \n\nOkay, so it wasn't a competitive pitch. It was just given straight to them based on existing relationships. Yeah, okay, great. And you gave it a six, I believe. So talk me through your experience. Kind of where, where didn't it meet your expectations?\n\nJeanette  2:39  \n\nWe had two roles with them, working them at the same time, Chief Digital Officer and group capability centers, head, oh, I think I've frozen. Think I froze there. I can hear I can hear you. I'm going to turn my camera off just for a few, few minutes, if that's all right, to help with the quality. Yeah, great.\n\nTeresa Allan  3:02  \n\nI'll do I'll do the same. And then thank you. So\n\nJeanette  3:06  \n\nwe were running with two roles. There were a couple of things that stand out in my mind, really, and it's unfortunate for them that they were near the end, because then they stick with you. So the first thing was, our CEO is very keen on having a mixed slate. So we had to remind the guys a number of times that we want to see women as well as men. So it was quite difficult to get them to bring women to the short list. And in addition to that, we noticed that all the consultants from Korn Ferry were all men. So it's very difficult to actually not. I'm not going to make a judgment on it. I think it would be easier naturally to attract more women into these roles, if there were more women actually doing the profiling and doing the shortlisting. It's just one of those things, and it just means that the people picking the short lists are all male rather than female. So that was one thing for us that didn't really sit very well. And then the more impactful thing for me was the fun and games around the compensation. So for both of the roles, although particularly for the Chief Digital Officer role, trying to get out of them what current comp was, was impossible. And the fact that actually it was left until we were at office stage, before they had even providing us with any information. And even then, they kept having to go back and forth to the candidate all of the time, which put us on the back foot for negotiating. Yeah, so you know it was, it was really not good that it took until my asking them, can you find current compensation? Can you really identify what that meant? So when they say it's this kind of fancy title bonus, what does that actually mean? So is it, is it a guaranteed? Was it based on performance? Was it based on the fact they'd only just joined? Was it based on is it something that's accrued throughout the year? Is it a guaranteed? I mean, all of these things that I would expect then to have understood we had to keep going back and forth and back and forth, which means it took us forever to put an offer together. We nearly lost the one of the candidates because of it, because they had another offer. And so I don't know whether the other organization was just quicker to put an offer together or whatever it was, but the the timing around finding out what the person's actual compensation was took forever, and in the end, we didn't actually end up bagging the candidate that we wanted, because actually what our offer was looking like in the end ended were up just not being good enough what they were after. So I don't believe that would have been as difficult. I mean, as it happens, I actually believe we ended up with a better candidate. And I'm I find them knowing that, although the guys would have known that, because this, the guy we've ended up with was my, my preferred candidate, as it happened. But that whole back and forth about compensation, and then not really understanding some of the compensation that we people were being paid, I was just, I was very disappointed with\n\nTeresa Allan  6:22  \n\nthat, okay, did they give you, I mean, going in terms of, obviously, you know, having that visibility of their current compensation, but in terms of benchmarking, what your offer was, did they, did they offer any insight there, using their benchmarking Tools? Or was that?\n\nJeanette  6:41  \n\nNo, I mean, we have our own benchmark, as you can imagine, and there is only so much. And of course, at this level role, you're not only talking about bone, but you're talking about equity levels. And so therefore future compensation, we didn't get any support. As far as that was concerned, we got a very blanket the expectation is around about half a million, or whatever the number was, you know, which is fine, but it's very, yeah, yeah. You know, it was like we, he expects the value of his future equity to be around this much, right? Okay, and what about, how would he, what would he take in terms of balance of what's fixed and what's variable, we had to ask all of those questions. So they were constantly going back and forth. Okay, did they? Did they negotiate on your behalf with the candidates? Yes, they did. And we got right to the very, very end. And then by the stage we were, we were a little fed up of going back and forth that, frankly, in the end, Chantelle just said, I'm going to ring him directly. And so in the end, she ended up speaking to him herself, right,\n\nTeresa Allan  7:49  \n\nwhich moved it along. Yes, okay, and going back to your kind of wanting that mixed slate and not having enough women in terms of the other candidates that they did put forward, how was the quality and quantity of those\n\nJeanette  8:08  \n\nand the quality was? The reality is, and this is not, I don't think this is at Korn Ferry's feet, to be fair, is there are simply less women in that very senior CDO role, the ones they put forward were in one layer down. So we, I understood that, but we had to ask them for them.\n\nTeresa Allan  8:34  \n\nOkay? So they, they so they weren't necessarily meeting your expectations in seniority, because there weren't essentially that many available\n\nJeanette  8:43  \n\nfor that CDO role. Yes, the GCC role, we believe there probably could have been more. But there is also mitigating circumstances, in fact, that we're placing the role in Mauritius, but the issue of it was the fact that we had to keep requesting more than once, that they also put females in front of us to consider, to consider, not just males, right? Okay? And again, our made up story about that is the fact that it's because they were all men looking for females rather than females looking for females.\n\nTeresa Allan  9:19  \n\nYeah. I mean, would, I mean, did you get a sense in, you know, if you don't know, you don't know that the people, the candidates, they put forward, were coming from them doing a kind of an out and out search, or was it from their network? Majority?\n\nTeresa Allan  9:37  \n\nDifferently, I don't know.\n\nTeresa Allan  9:39  \n\nOkay, we can pick up with them, yeah, in terms of the experience of, like, just, you know, day to day communication and project management did, how did that work for you?\n\nJeanette  9:53  \n\nUm, it's not the best I've worked with. I've worked with better headhunters in terms of efficiency, and, you know, getting reports to us, we were having regular calls, and the reports would often land an hour or two before the call, with seven new CVS and everything on you have no hope in hell of getting to it. Yeah, yeah.\n\nTeresa Allan  10:15  \n\nAnd in terms of, like, the communication style, I'm assuming there's multiple stakeholders making these senior decisions. Did, was that something that they did, they managed to kind of get, get a collective decision from you all. How did that work?\n\nJeanette  10:28  \n\nDo you know, do you mean? Do you mean the ultimate decision, or do you mean who we're going to take forward on?\n\nTeresa Allan  10:36  \n\nYeah, I mean and just general, I'll be honest\n\nJeanette  10:40  \n\nwith you. We ended up running the calls. Okay? It always felt very hesitant, is the way I would describe it. And you probably don't know Chantelle, but Chantelle is, is fairly high energy and ready to go, and must talk about it, and blah, blah. So in actual fact, she ended up saying, Well, talk me through those then, you know, he they would say, here's the report. Fine. And then write, yeah. And they would always assume what they'd always assume we'd have chance to read everything, which I don't know how, because, as I said, it never arrived early enough, generally. And then it was a case of, okay, so who do you want to talk to us about? Then, you know, we were asking them, rather than saying, coming forward and saying, here are the seven, which is what I would have done, here are the seven. You can look at the seven in your own time. However, these are the three that we highly recommend. Let's talk about these three. You know that it just wasn't assertive enough. Yeah, yeah. And with someone like Chantelle, and they know Chantelle, you need to be quite on the front foot, right?\n\nTeresa Allan  11:46  \n\nYeah, absolutely. Well, I mean, these, yeah, like all of you, are very seedy people and very busy time, and it costs money. There's a million dollars of Yes, done, and\n\nJeanette  11:56  \n\nit is what we're paying them for, ultimately, that they put forward. You know, they see these people all of the time, and we briefed them. I know we did a really good job on briefing them. I know we did, and yet they always seemed a little kind of hesitant. I mean, look, don't get me wrong, right? Chantal is all over it. She'll ask you really difficult questions. She wants to get into the detail, but if you step forward and say, let's just talk about these three today, then that's really going to help the call to\n\nTeresa Allan  12:25  \n\ngo, Well, yeah, yeah, just I get it, owning it, okay, yeah. In terms of, I mean, what did anything? Did anything kind of stand out for you in terms of, or, or just met your expectations? That went, Okay,\n\nJeanette  12:42  \n\nlook, we got there in the end. Let's, you know, let's be clear, we did actually find two very, very good candidates in the end. And ultimately, you know, that's what we were looking for. It just took way, way longer than we thought we were at it for the best part of, what, five months, six months, yeah, it took a long time.\n\nTeresa Allan  13:04  \n\nDid you have an expectation of when you wanted the role filled?\n\nJeanette  13:08  \n\nWhen the first day we met them, they came into the office and Chantelle said, we really need to get an offer two to three months. We're really, really in a hurry. Okay?\n\nTeresa Allan  13:19  \n\nAnd was that because, I mean, obviously you've talked through the issues with the compensation, slowing things up, but before that, so say, if you hit the two month mark, did you have any options on the table that, or was it that you just wasn't there wasn't the right candidates there. Yeah, it\n\nJeanette  13:36  \n\njust, yeah, they just weren't hitting the right brief. Okay,\n\nTeresa Allan  13:40  \n\non that brief. I mean, how much did they help craft it, or push back on it, or ask questions, and how much, I mean, did they, if they're two months in and they weren't hitting the right brief, what was the kind of I suppose, your understanding of their understanding\n\nJeanette  13:54  \n\nof it. So the initial brief was done with Chantelle, largely, I was in the room, but she was definitely briefing. She had a very, very clear view about what she wanted. I hadn't really been around overly long, and I wasn't really involved in recruitment. I dived in then at that stage, just to help push it all along, really. But I think after a couple of months, we did have very clear conversations with them. Said this, these just don't feel right, guys, this is what we think we're missing. And it was on one of our regular weekly calls, and they were invariably three or four of them on the calls. We're just not it's not just they didn't seem to instinctively pick up that it wasn't quite right, right? They just kept pushing forward. Yeah, it did feel a little bit like that. Whereas I would have liked a little more insight to say, you know, to come forward again and say, Look, guys, this doesn't feel like it's quite right. Let's really nail it down as to what's missing. What is it you want more of? What is it you want less of? We instigated those conversations, right? Okay, that's really helpful.\n\nTeresa Allan  15:07  \n\nYou mentioned, obviously, having experience of working with other Headhunters, where it's gone better is, I mean, is there anything apart from, obviously, what we've discussed that's been standout, that you would, that would, for you be, you know, a good experience,\n\nJeanette  15:25  \n\nI think, for me, with these things, right? They, I mean, they're in a very difficult position. Let's be clear, no one likes to pay a lot of money to these guys to find them someone. They just don't, right, so it's very, very difficult. I do get that. But when we do appoint someone, and the rates, you know, we you end up paying these guys a lot of money for people, because we're looking for very senior people. And I, the expectation for me, and I've certainly received it elsewhere, is the pace and the assertiveness and being on top of data and knowing everything about comp and I and I just didn't I it was the sense of pace and urgency and assertiveness that I think Chantelle and I found really frustrating throughout the process, as well as the profiles not being right. But it really exacerbated itself at the end, though, when we just had so much problem trying to get details out of comp, right?\n\nTeresa Allan  16:24  \n\nOkay, in terms, I mean, you've obviously said you've used Korn Ferry before. How is this experience compared to your previous ones?\n\nJeanette  16:36  \n\nNot as good. Oh, yeah, it was a different team, yeah, to be fair, I can't it's a while ago, right? I've been doing this way too long. It's a while ago, and I don't even remember the last time I use them, but I when Chantel said to me, we're using Korn Ferry, I didn't have any concerns about it. I thought, good. She's gone to a good company, you know, so the reputation goes before them, and my previous experiences led me to believe it was okay, yeah, yeah. Did you feed\n\nTeresa Allan  17:10  \n\nany of this back to them? Do you think they got a sense of your frustration? We definitely did. We definitely did, yeah, yeah,\n\nJeanette  17:15  \n\nin numerous emails and occasional calls with ConsultantS and I think Adam was the guy dealing with the comp. It was like, come on. You know, guys, this isn't okay. We really expect this to be quicker. I thought you would have known this. Why did you not know about this? Have you asked about this? Have you asked about this? And we fed back on calls numerous times. We need to see more women's profiles numerous times so they they couldn't have been in any doubt.\n\nTeresa Allan  17:43  \n\nAnd what was their response when they didn't put\n\nJeanette  17:47  \n\nthem forward? It's really hard to find females in these positions. And Chantal was like, No, I don't accept that. Yeah, just not looking hard enough. And then that. It was then that Chantelle said, Could it be because there are no women to look actually looking for women.\n\nTeresa Allan  18:02  \n\nYeah. Okay, interesting. I mean, obviously you don't sound like you've had a great experience at all.\n\nJeanette  18:13  \n\nIt was fine to start with, I have to be honest and the gut, don't get me wrong, the guys are all really personable and lovely guys. Of course, they are right. It was just it didn't go anywhere near as quickly. And I would say the frustrations got worse as we as we gradually went through it. And then when you get to the very end, and you just on the closing line, I think when we were left with a little bit of a Whoa, you know, I'm not sure we'll go back there again, because that was really hard work at the end.\n\nTeresa Allan  18:43  \n\nYeah, okay, great. Well, I think probably that's everything I need to know, unless there's anything else that you think would be good to share. Nope, I think that's probably it. Okay. Well, I mean, I do appreciate your honesty. There's lots of beautiful thought there. Then I will, and if you're comfortable, I will write this up and be quite direct and feeding it back to them and where you can improve in the future, happy to and it might mean, I mean, would if somebody, if one of their managers, wanted to reach out and follow up to you, would you be open to that?\n\nJeanette  19:18  \n\nI would actually, I think ConsultantS has already reached out and tried to book breakfast or something with me. My diary is like a lunatic asylum, so Jen does her best, yeah, to try and accommodate stuff like that, but he definitely has already reached out, so I acknowledge them for that I really do great.\n\nTeresa Allan  19:36  \n\nOkay, well, what I'll do is I'll write this up and I will, I'll speak to him myself and talking through it, and then he can make a plan of best fit forward. Bye."
}
