{
  "source_file": "NPS Interview Transcript_011025_Vanessa, Heidelberg Materials.docx",
  "paragraphs": [
    "NPS Interview Transcript",
    "Interview Date: 01.10.25",
    "Client: Vanessa, Heidelberg Materials",
    "Project: Executive Search",
    "Score: 10",
    "FULL TRANSCRIPT",
    "Interviewer",
    "On your experience of working with CompanyA and engagements to date so we can feedback to them kind of recommendations of how they can improve their customer service and continue to kind of you know add value. So if you can be as as transparent as you feel you know you're you're able to be then that.\nHelps us and hopefully in turn helps you too.",
    "\nSpeaker2\nYeah, it's going to be easy because I'm really extremely satisfied about services they delivered and I had already given a feedback to the senior consultant who was on my file. I wrote an e-mail with with some positive feedback, so this is going to be easy for me.",
    "\nInterviewer\nBrilliant. So if we could start off, if you could just explain to me your role and the engagements that you've had with CompanyA to date.",
    "\nSpeaker2\nYes. So I'm HR director for the Benelux region, part of the executive committee of ClientCompany Benelux and like a few months ago we wanted to search for a new procurement director, so.\nAlso part of the executive committee and the the search was highly confidential because the previous procurement director was still in place. So we had decided decided to dismiss her, to fire her.\nAnd we wanted to start with the search before letting go the other person. So I contacted several headhunters of executive search. Of course, one of them was CompanyA. I I had already worked in other companies.\nCompanies with the senior consultant. His name is OT and so well based on the on the approach they proposed, I decided to work with CompanyA.",
    "\nInterviewer\nGreat. So you had you'd already had experience of CompanyA in previous roles.",
    "\nSpeaker2\nYes, but also the consultant OT. He worked at Page Executive before and there I worked several times with Page Executive, but with this same consultant. And then when he moved to CompanyA, I think I had one collaboration with.",
    "\nInterviewer\nOK, great. And so so from your experience is has this been your first and only engagement with CompanyA so far?",
    "\nSpeaker2\nYes.\nYes, indeed, yes. With ClientCompany in my current role, yes.",
    "\nInterviwer\nOK, brilliant. And obviously you've worked with OT before. Is that the primary reason that you selected them when you? How many other consultancies did you consider?",
    "\nSpeaker2\nTwo other two others.\nUm.\nPart of it is indeed the the trust that I have in OT as a consultant, but the other part is because I really wanted them to explain to me how they would guarantee confidentiality.\nBecause Belgium is a very small country, everybody knows everybody. So if you say to a candidate that you're looking for a procurement director in the industry and you give some information on the company, then they could immediately find.\nFind out for who it is and then the confidentiality would be broken. Um so, but they really convinced me because they have put like 2 sheets of arguments and approach on the way they.\nThey handle this type of missions, this type of assignments and also with like some references of other clients of similar situations where it had to be really strictly confidential and they they really they their approach really convinced me.",
    "\nInterviewer\nOK, great. And from, I suppose from day one, did you outline kind of how you prefer to work? How was the communication across the whole engagement?",
    "\nSpeaker2\nUm.\nBut they actually were in the lead of how to work together. So they did like a intake conversation. I explained the profile I was looking for. I really took some time because I think that's the most important part, the better you explain the profile you are looking for. \nTherefore, the more chances you have, they come with the right profiles. I also explained my way of working, what I was expecting in terms of timings of reports, reactivity, which is very important to me.\nAnd I clearly also expressed that I expect them to respect the candidates because a headhunter or a recruitment agency is actually also ambassador of our image, of our reputation.\nSo that's something really important. So we set like the frame, the way we would work together, communicate and that worked really well actually.",
    "\nInterviewer\nBrilliant. Did they help you in building out that profile? Did they bring their success factors, their success profiles to the table?",
    "\nSpeaker2\nYes, they did. They they actually made the the profile description themselves. What they also did is in the very beginning they sent me like some LinkedIn profiles of people where I could then say like not this profile, but this is what I'm looking for.\nAnd that really helped to to narrow down the profile.",
    "\nInterviwer\nRight, so.",
    "\nSpeaker2\nSo this this was really helpful too. Yes, they they did a huge part of the job there in defining the profile we need.",
    "\nInterviwer\nAnd did they use any of their other tools? When they, I suppose they had shortlisted candidates, did they do an assessment on them? Was that useful if they did?",
    "\nSpeaker2\nYes, the ones they had selected and the ones that I have met, they all these candidates have done a an assessment, yes. And it was the CompanyA assessment because we have all our own assessments, but it was actually included in in their package in their approach. So they went through this.\nAssessment and was in the report. There were I think like two or three pages on this assessment and then they matched actually the results from the assessment with the profile we need.",
    "\nInterviwer\nOK. So did you find their assessment, um, kind of added value? Was it, how did it compare to your assessment that you have in house?",
    "\nSpeaker2\nYeah.\nWe did not do the internal assessment for these candidates because we didn't want them to have two assessments.\nThe thing is, I'm not a huge fan of assessments.\nSo I think, you know, interview reports are more relevant than assessment reports.\nUm, but they they did a great job on the assessment analysis and when I met with the candidates.\nIt made sense. I mean, what was written in the report of the assessment was aligned with the person I had in front of me, so.\nSeems that their assessment system works well, yeah.",
    "\nInterviewer\nWorks, yeah. And in terms of the quality and quantity of candidates, did that meet your expectations?",
    "\nSpeaker2\nYeah, definitely. Because in the end they submitted and I have met with three candidates and all three of them were really excellent candidates to that point that I wasn't able. \nTo put like a preference order, they were quite different, but really excellent candidates. All three of them could do the job and match with our company culture.\nReally, this was. I have never seen this to have really three excellent candidates on the same level, and so that's also the reason why the three candidates have met with our general manager.\nNormally this never happens. It's only you know the the selected one.\nOnly one candidate meets with the general manager, but here the three were really so excellent that our general manager has taken the time to meet with all three of them.",
    "\nInterviewer\nWow, have you made a selection now?",
    "\nSpeaker2\nIt has started two weeks ago, one week and a half ago, yes.",
    "\nInterviewer\nBrilliant. And in terms of, I suppose seeing it through end to end, did did the CompanyA team support on kind of contract negotiations, compensation or was that was that your responsibility?",
    "\nSpeaker2\nThat was my responsibility, yes.\nAnd I wouldn't like them to be involved because, you know, their fee is a percentage of the gross salary. So for me there would be a conflict of interest if they would actually negotiate this.",
    "\nInterviewer\nA contact. Yeah, interesting.",
    "\nSpeaker2\nBut of course they had given me the salary expectations of the candidates, so I had something to build on. I also had given a budget range, so the candidates they presented were all within this range, so no issues there, which was good.\nAnd then we made a nice proposal, which was then what? What they did help is once that I had sent the offer to the candidate to the selected one, they helped and they gave support.\nTo actually like they contacted the candidate, they say, what do you think about the proposal? And they helped to argument, you know, also because we have a kind of a special bonus system.\nAnd so they they explained that the candidate had to look at the total package not only to the let's say the the basis package, the the gross salary, but also to all the advantages we offer. So they helped to to actually convince the candidate to accept the the offer.",
    "\nInterviewer\nGreat. And in terms of follow up, do you expect any support from them for the candidate or yourself now they're in place? Would that be useful or relevant?",
    "\nSpeaker2\nOh, definitely. And I hope they will do so because I so the the the person, her first name is Anne. So since she's there, I, you know, regularly I pass by her office, I say, Anne, how are you doing? Does this meet your expectations, etcetera?\nEverything OK, but she will probably not give the same feedback to me then to an external and to confer it. So I hope really that they will do a follow up with and like when she's here like for a few weeks and then maybe within three months or within six months.\nGive her a call and really ask like how is it going and then give me the feedback because that's really valuable for me to have this, yeah.",
    "\nInterviewer\nAbsolutely. And I mean, is there anything that you would have changed about your engagement with CompanyA?",
    "\nSpeaker2\nNo, the only thing is I I cannot recall in details, but I remember when they had sent me the first candidate report, they had only sent it forty-eight hours before the interview.\nAnd so I told them that for me this was too short. Also because it was the interview was on a Monday morning, I think like it's 7:30 and they had sent me then the candidate reports on Friday evening. So I said to them like, listen, this is too short even.\nThe business day is too short for me because I have meetings like all day, so I need some more time. So please send me the report like like three or four business days before, because for me it's important to read very carefully the report.\nAnd I prepare my interview based on the report. So this I explained. So they adapted for the following interviews and there was also some information missing, but I can't recall what it was, but information that was important to me to have in the report and so they were.\nVery reactive and they adapted it for the next reports. So this is something I really liked. And then wow, no.\nReally. They were really excellent, very reactive. Also there was like a interview last minute change, like in the morning I had to change an interview that was supposed to take place in the evening.\nAnd they they were very reactive, changed it, called the candidate, made sure that you know it was explained transparently to the candidate. The reasons why the interview was postponed actually.\nSo it went all very, very smoothly. Um.\nNo, they were very client oriented.\nVery service oriented, very reactive. You know, I I I really felt like like a client. I really felt like a lot of support from them reactivity.\nSo it was really a great collaboration, yeah.",
    "\nInterviewer\nFantastic. So would you would you use them again?",
    "\nSpeaker2\nFor Exco positions, yes. For other positions, no, because actually their fees are quite higher than all the other headhunters in Belgium.\nYeah. So that's something that, you know, we are in the industry, we are quite pragmatic. And so for senior managers, I would work with other executive search companies, but for Exco level or general management of course there again.\nAnd I would work with with CompanyA, definitely, yes. And I had to say in the same period, actually I was also looking for a legal director and I worked with a headhunter that is specialized in legal positions. So the only thing they do is legal.\nProfiles.\nAnd it was, it was a mess really. And I will never work with these people again. Never. And if I would have to do this again because it was also exco level and it was kind of in the same period, I would work with CompanyA, definitely.",
    "\nInterviewer\nOK, that's good to know. Would you ever consider using CompanyA beyond search as as in more of a consultancy level, whether it's leadership development or succession planning or org design?",
    "\nSpeaker2\nNo, not really, because I think their core business is headhunting and I have partnerships for, for example, for leadership. We have a partnership with a provider which is really excellent and expert in leadership.\nUm, I know they also do like salary benchmarks. Um.\nThese are typically the kind of things that would be decided by our group in Germany. So not really locally if we would do some exercise like this. And on the other hand, I have quite a big HR team. I have thirty-six people in my team, so I have quite some internal.\nExpertise actually. So there are quite a lot of projects that I can handle internally because I have the expertise. So no, for me, contrary is really executive search.",
    "\nInterviewer\nOK, great. I think that's it. So unless, is there anything else that you want to share that would be useful?",
    "\nSpeaker2\nOK.\nNo, I think I've I've given all the feedback that I would like to give. So it's a overall very, very positive feedback. They should continue as they do. And I yeah, I I have already shared my feedback, so I know they they know that I'm very happy with the collaboration.\nSo no, I think I've said everything."
  ],
  "text": "NPS Interview Transcript\n\nInterview Date: 01.10.25\n\nClient: Vanessa, Heidelberg Materials\n\nProject: Executive Search\n\nScore: 10\n\nFULL TRANSCRIPT\n\nInterviewer\n\nOn your experience of working with CompanyA and engagements to date so we can feedback to them kind of recommendations of how they can improve their customer service and continue to kind of you know add value. So if you can be as as transparent as you feel you know you're you're able to be then that.\nHelps us and hopefully in turn helps you too.\n\n\nSpeaker2\nYeah, it's going to be easy because I'm really extremely satisfied about services they delivered and I had already given a feedback to the senior consultant who was on my file. I wrote an e-mail with with some positive feedback, so this is going to be easy for me.\n\n\nInterviewer\nBrilliant. So if we could start off, if you could just explain to me your role and the engagements that you've had with CompanyA to date.\n\n\nSpeaker2\nYes. So I'm HR director for the Benelux region, part of the executive committee of ClientCompany Benelux and like a few months ago we wanted to search for a new procurement director, so.\nAlso part of the executive committee and the the search was highly confidential because the previous procurement director was still in place. So we had decided decided to dismiss her, to fire her.\nAnd we wanted to start with the search before letting go the other person. So I contacted several headhunters of executive search. Of course, one of them was CompanyA. I I had already worked in other companies.\nCompanies with the senior consultant. His name is OT and so well based on the on the approach they proposed, I decided to work with CompanyA.\n\n\nInterviewer\nGreat. So you had you'd already had experience of CompanyA in previous roles.\n\n\nSpeaker2\nYes, but also the consultant OT. He worked at Page Executive before and there I worked several times with Page Executive, but with this same consultant. And then when he moved to CompanyA, I think I had one collaboration with.\n\n\nInterviewer\nOK, great. And so so from your experience is has this been your first and only engagement with CompanyA so far?\n\n\nSpeaker2\nYes.\nYes, indeed, yes. With ClientCompany in my current role, yes.\n\n\nInterviwer\nOK, brilliant. And obviously you've worked with OT before. Is that the primary reason that you selected them when you? How many other consultancies did you consider?\n\n\nSpeaker2\nTwo other two others.\nUm.\nPart of it is indeed the the trust that I have in OT as a consultant, but the other part is because I really wanted them to explain to me how they would guarantee confidentiality.\nBecause Belgium is a very small country, everybody knows everybody. So if you say to a candidate that you're looking for a procurement director in the industry and you give some information on the company, then they could immediately find.\nFind out for who it is and then the confidentiality would be broken. Um so, but they really convinced me because they have put like 2 sheets of arguments and approach on the way they.\nThey handle this type of missions, this type of assignments and also with like some references of other clients of similar situations where it had to be really strictly confidential and they they really they their approach really convinced me.\n\n\nInterviewer\nOK, great. And from, I suppose from day one, did you outline kind of how you prefer to work? How was the communication across the whole engagement?\n\n\nSpeaker2\nUm.\nBut they actually were in the lead of how to work together. So they did like a intake conversation. I explained the profile I was looking for. I really took some time because I think that's the most important part, the better you explain the profile you are looking for. \nTherefore, the more chances you have, they come with the right profiles. I also explained my way of working, what I was expecting in terms of timings of reports, reactivity, which is very important to me.\nAnd I clearly also expressed that I expect them to respect the candidates because a headhunter or a recruitment agency is actually also ambassador of our image, of our reputation.\nSo that's something really important. So we set like the frame, the way we would work together, communicate and that worked really well actually.\n\n\nInterviewer\nBrilliant. Did they help you in building out that profile? Did they bring their success factors, their success profiles to the table?\n\n\nSpeaker2\nYes, they did. They they actually made the the profile description themselves. What they also did is in the very beginning they sent me like some LinkedIn profiles of people where I could then say like not this profile, but this is what I'm looking for.\nAnd that really helped to to narrow down the profile.\n\n\nInterviwer\nRight, so.\n\n\nSpeaker2\nSo this this was really helpful too. Yes, they they did a huge part of the job there in defining the profile we need.\n\n\nInterviwer\nAnd did they use any of their other tools? When they, I suppose they had shortlisted candidates, did they do an assessment on them? Was that useful if they did?\n\n\nSpeaker2\nYes, the ones they had selected and the ones that I have met, they all these candidates have done a an assessment, yes. And it was the CompanyA assessment because we have all our own assessments, but it was actually included in in their package in their approach. So they went through this.\nAssessment and was in the report. There were I think like two or three pages on this assessment and then they matched actually the results from the assessment with the profile we need.\n\n\nInterviwer\nOK. So did you find their assessment, um, kind of added value? Was it, how did it compare to your assessment that you have in house?\n\n\nSpeaker2\nYeah.\nWe did not do the internal assessment for these candidates because we didn't want them to have two assessments.\nThe thing is, I'm not a huge fan of assessments.\nSo I think, you know, interview reports are more relevant than assessment reports.\nUm, but they they did a great job on the assessment analysis and when I met with the candidates.\nIt made sense. I mean, what was written in the report of the assessment was aligned with the person I had in front of me, so.\nSeems that their assessment system works well, yeah.\n\n\nInterviewer\nWorks, yeah. And in terms of the quality and quantity of candidates, did that meet your expectations?\n\n\nSpeaker2\nYeah, definitely. Because in the end they submitted and I have met with three candidates and all three of them were really excellent candidates to that point that I wasn't able. \nTo put like a preference order, they were quite different, but really excellent candidates. All three of them could do the job and match with our company culture.\nReally, this was. I have never seen this to have really three excellent candidates on the same level, and so that's also the reason why the three candidates have met with our general manager.\nNormally this never happens. It's only you know the the selected one.\nOnly one candidate meets with the general manager, but here the three were really so excellent that our general manager has taken the time to meet with all three of them.\n\n\nInterviewer\nWow, have you made a selection now?\n\n\nSpeaker2\nIt has started two weeks ago, one week and a half ago, yes.\n\n\nInterviewer\nBrilliant. And in terms of, I suppose seeing it through end to end, did did the CompanyA team support on kind of contract negotiations, compensation or was that was that your responsibility?\n\n\nSpeaker2\nThat was my responsibility, yes.\nAnd I wouldn't like them to be involved because, you know, their fee is a percentage of the gross salary. So for me there would be a conflict of interest if they would actually negotiate this.\n\n\nInterviewer\nA contact. Yeah, interesting.\n\n\nSpeaker2\nBut of course they had given me the salary expectations of the candidates, so I had something to build on. I also had given a budget range, so the candidates they presented were all within this range, so no issues there, which was good.\nAnd then we made a nice proposal, which was then what? What they did help is once that I had sent the offer to the candidate to the selected one, they helped and they gave support.\nTo actually like they contacted the candidate, they say, what do you think about the proposal? And they helped to argument, you know, also because we have a kind of a special bonus system.\nAnd so they they explained that the candidate had to look at the total package not only to the let's say the the basis package, the the gross salary, but also to all the advantages we offer. So they helped to to actually convince the candidate to accept the the offer.\n\n\nInterviewer\nGreat. And in terms of follow up, do you expect any support from them for the candidate or yourself now they're in place? Would that be useful or relevant?\n\n\nSpeaker2\nOh, definitely. And I hope they will do so because I so the the the person, her first name is Anne. So since she's there, I, you know, regularly I pass by her office, I say, Anne, how are you doing? Does this meet your expectations, etcetera?\nEverything OK, but she will probably not give the same feedback to me then to an external and to confer it. So I hope really that they will do a follow up with and like when she's here like for a few weeks and then maybe within three months or within six months.\nGive her a call and really ask like how is it going and then give me the feedback because that's really valuable for me to have this, yeah.\n\n\nInterviewer\nAbsolutely. And I mean, is there anything that you would have changed about your engagement with CompanyA?\n\n\nSpeaker2\nNo, the only thing is I I cannot recall in details, but I remember when they had sent me the first candidate report, they had only sent it forty-eight hours before the interview.\nAnd so I told them that for me this was too short. Also because it was the interview was on a Monday morning, I think like it's 7:30 and they had sent me then the candidate reports on Friday evening. So I said to them like, listen, this is too short even.\nThe business day is too short for me because I have meetings like all day, so I need some more time. So please send me the report like like three or four business days before, because for me it's important to read very carefully the report.\nAnd I prepare my interview based on the report. So this I explained. So they adapted for the following interviews and there was also some information missing, but I can't recall what it was, but information that was important to me to have in the report and so they were.\nVery reactive and they adapted it for the next reports. So this is something I really liked. And then wow, no.\nReally. They were really excellent, very reactive. Also there was like a interview last minute change, like in the morning I had to change an interview that was supposed to take place in the evening.\nAnd they they were very reactive, changed it, called the candidate, made sure that you know it was explained transparently to the candidate. The reasons why the interview was postponed actually.\nSo it went all very, very smoothly. Um.\nNo, they were very client oriented.\nVery service oriented, very reactive. You know, I I I really felt like like a client. I really felt like a lot of support from them reactivity.\nSo it was really a great collaboration, yeah.\n\n\nInterviewer\nFantastic. So would you would you use them again?\n\n\nSpeaker2\nFor Exco positions, yes. For other positions, no, because actually their fees are quite higher than all the other headhunters in Belgium.\nYeah. So that's something that, you know, we are in the industry, we are quite pragmatic. And so for senior managers, I would work with other executive search companies, but for Exco level or general management of course there again.\nAnd I would work with with CompanyA, definitely, yes. And I had to say in the same period, actually I was also looking for a legal director and I worked with a headhunter that is specialized in legal positions. So the only thing they do is legal.\nProfiles.\nAnd it was, it was a mess really. And I will never work with these people again. Never. And if I would have to do this again because it was also exco level and it was kind of in the same period, I would work with CompanyA, definitely.\n\n\nInterviewer\nOK, that's good to know. Would you ever consider using CompanyA beyond search as as in more of a consultancy level, whether it's leadership development or succession planning or org design?\n\n\nSpeaker2\nNo, not really, because I think their core business is headhunting and I have partnerships for, for example, for leadership. We have a partnership with a provider which is really excellent and expert in leadership.\nUm, I know they also do like salary benchmarks. Um.\nThese are typically the kind of things that would be decided by our group in Germany. So not really locally if we would do some exercise like this. And on the other hand, I have quite a big HR team. I have thirty-six people in my team, so I have quite some internal.\nExpertise actually. So there are quite a lot of projects that I can handle internally because I have the expertise. So no, for me, contrary is really executive search.\n\n\nInterviewer\nOK, great. I think that's it. So unless, is there anything else that you want to share that would be useful?\n\n\nSpeaker2\nOK.\nNo, I think I've I've given all the feedback that I would like to give. So it's a overall very, very positive feedback. They should continue as they do. And I yeah, I I have already shared my feedback, so I know they they know that I'm very happy with the collaboration.\nSo no, I think I've said everything."
}
