{
  "client": "Lisa Bolger, PartnerRe",
  "interview_date": "02.10.25",
  "project": "Executive Search",
  "score": 9,
  "overview": "Lisa Bolger, Chief People Officer at PartnerRe (1,350 employees, ELT of 15), has had a very positive relationship with CompanyA over the last 18 months. CompanyA has won the majority of tenders against Spencer Stuart and Heidrick & Struggles. The relationship started with consultant K in Zurich, then transitioned to AC who has been the main contact. Lisa praised CompanyA's tailored approach, thoughtful questions, alignment with PartnerRe's needs, and flexibility in negotiations. AC's communication style matches well with the CEO. There have been some challenges with ongoing US searches involving multiple stakeholders, but overall the experience has been excellent. Lisa is planning to transition out of her role by early next year.",
  "what_went_well": [
    "Tailored, customer-centric approach - 'no one size fits all', focuses on what PartnerRe needs rather than what CompanyA offers",
    "Thoughtful questions and preparation - extensive preparation and great questions that really understand client needs, especially CEO preferences",
    "Winning tender approach - thoughtful questions and alignment focus has been the USP in winning tenders against competitors",
    "Flexibility in negotiations - AC has been flexible with retainer vs overall fee structures, accommodating PartnerRe's negotiation style while maintaining necessary terms",
    "AC's communication style - open, honest, insightful, matches CEO's thoughtful style, not afraid to challenge and put hard stuff on the table",
    "Stakeholder management - respects lines of authority, agreed upfront on main point of contact, challenges biases appropriately",
    "Use of CompanyA resources - leader profiles used for 75% of candidates, benchmarking conversations, sharing of data and resources",
    "Partnership approach - AC and Lisa communicate frequently via text and Teams, open channels, easy to reach",
    "Personal touch - good support during pre-onboarding and onboarding phases, hands-on cooperation",
    "Quality of candidates - overall satisfaction, though some challenging searches, got there in the end",
    "Reactive to needs - continues to adapt as needs surface"
  ],
  "challenges_pain_points": [
    "US team communication - need for more listening on US side compared to European side, sometimes tendency to 'over talk' rather than listen",
    "Ongoing claims role search in US - challenges coordinating meetings and interviews with different stakeholders, difficulty scheduling last-minute interviews with CFF",
    "Perception of overselling - on one search (second attempt after failed search with another agency), concern that CompanyA might be overselling candidates to prove they can do better",
    "Some challenging searches - one candidate pulled out after offer, some searches took longer than ideal",
    "Timeline management - some delays, though nothing insurmountable",
    "Multiple stakeholder coordination - challenges when person leading engagement is not the hiring manager"
  ],
  "gaps_identified": [
    "US team listening and communication - need for more listening, less talking, especially when trying to prove capability after a failed search with another agency",
    "Multi-stakeholder coordination - challenges managing searches with multiple stakeholders across US and Europe, especially when hiring manager is different from engagement lead",
    "Balance between selling and fitting - need to maintain balance between presenting good candidates and ensuring authentic fit, avoiding perception of overselling",
    "Timeline and logistics management - some delays and coordination issues, especially with last-minute scheduling requests",
    "Cultural alignment - US team may need better understanding of PartnerRe's culture (undersell and over deliver) to avoid overselling perception"
  ],
  "key_themes": [
    "Customer-centricity wins - focusing on client needs rather than CompanyA's offerings is the key differentiator",
    "Thoughtful questions and alignment - taking time to understand client needs, CEO preferences, and company culture drives success",
    "Communication style matching - AC's style matches CEO's thoughtful approach, creating strong rapport",
    "Flexibility and partnership - willingness to be flexible in fee structures while maintaining necessary terms builds trust",
    "Relationship business - PartnerRe values personal touch and relationship-focused approach over tech-enabled solutions",
    "Execution focus - PartnerRe is execution-focused culture, values getting things done over extensive consulting",
    "Authentic challenge - clients appreciate consultants who challenge appropriately, don't just say yes to CEO",
    "Stakeholder respect - respecting lines of authority and agreed communication structures is important",
    "Cultural sensitivity - understanding client culture (undersell/over deliver) helps avoid mismatched approaches",
    "Multi-stakeholder complexity - searches with multiple stakeholders across regions require careful coordination"
  ],
  "actions_recommendations": [
    "Improve US team listening and communication - train US team on listening skills, especially when working on challenging searches or second attempts",
    "Better multi-stakeholder coordination - develop processes for managing searches with multiple stakeholders across regions, especially when hiring manager differs from engagement lead",
    "Maintain balance in candidate presentation - ensure US team understands importance of authentic fit over selling, especially when trying to prove capability",
    "Continue thoughtful questioning approach - maintain the focus on understanding client needs that has been successful in winning tenders",
    "Leverage communication style matching - continue matching consultant styles to client preferences (AC's match with CEO has been very successful)",
    "Maintain flexibility in negotiations - continue the flexible approach to fee structures that accommodates client needs",
    "Improve timeline and logistics management - better coordination for multi-stakeholder searches, especially around scheduling",
    "Cultural awareness training - ensure US team understands PartnerRe's culture (undersell/over deliver) to avoid overselling perception",
    "Continue personal touch - maintain the relationship-focused approach that PartnerRe values over tech-enabled solutions"
  ],
  "additional_insight": "Lisa noted that PartnerRe is an execution-focused culture that 'starts late and finishes strong' - they're not market makers or trendsetters. They value the personal, tangible, relationship-based approach over analytics and data. The company doesn't use a lot of consultants and prefers to 'just get it done.' Lisa is planning to transition out of her role by March-April-May next year to pursue coaching, and she specifically requested that AC lead the search for her replacement because his approach fits their culture. This shows the value of style matching. The fact that CompanyA has won the majority of tenders against top competitors (Spencer Stuart, Heidrick & Struggles) demonstrates the effectiveness of their customer-centric, thoughtful approach."
}

