{
  "client": "Greg Aarssen, TriSummit Utilities Inc.",
  "interview_date": "01.12.25",
  "project": "Executive Search",
  "score": 10,
  "overview": "Greg Aarssen, director and chair of compensation and governance committees at TriSummit Utilities (a Canadian utility holding company), had his first direct experience with CompanyA for a CEO search. The company needed to replace their CEO who resigned, and CompanyA was chosen over three other firms based on their deep understanding of the business, culture, and existing relationships with Alta Gas (the parent company). The process was completed in two months instead of the expected 4-5 months. CompanyA conducted both an internal candidate assessment and external market survey. The internal candidate was ultimately selected after extensive psychometric testing. Greg praised the responsiveness, proactive communication, and personalized approach of ConsultantA and Craig King.",
  "what_went_well": [
    "Speed and efficiency - completed in 2 months instead of expected 4-5 months",
    "Deep understanding of business and culture - CompanyA had long-standing relationships with Alta Gas and understood the nuts and bolts of the business",
    "Dual-path approach - effectively tested internal candidate while conducting market survey",
    "Market survey was comprehensive - looked beyond industry to natural gas, oil, energy, and broader sectors, finding interesting candidates with similar skills",
    "Flexibility and willingness to get the job done - consultants made themselves available at various times (early morning, late evening) to accommodate schedules",
    "Assessment tools provided confidence - extensive battery of tests on internal candidate confirmed suitability, eliminating need to test external candidates",
    "Proactive communication - Greg never felt in the dark, received regular updates even when CompanyA was dealing with external candidates",
    "Communication style match - open, honest, to-the-point communication that matched Greg's preferences (he noted this is rare in his experience)",
    "ConsultantA and Craig King built immediate rapport - felt like they had worked together for a long time within first 15 minutes",
    "Flexibility in fee negotiations - respectful of the company's negotiation style while maintaining necessary terms"
  ],
  "challenges_pain_points": [
    "Compensation benchmarking conflict - CompanyA couldn't provide compensation review because they were involved in the search (conflict of interest), requiring separate engagement with Meridian Consulting",
    "CompanyA's marketing and visibility - Greg only knew of them through golf sponsorship and wouldn't have heard of them otherwise; suggests need for better marketing/education",
    "Succession planning gaps - the company's succession matrix had names but no real assessment of capability, creating blind spots that the assessment process revealed"
  ],
  "gaps_identified": [
    "Marketing and brand awareness - CompanyA is not well-known outside of golf sponsorship; competitors like Hugessen are more visible in corporate governance education",
    "Compensation benchmarking services - when CompanyA is involved in search, they can't provide independent compensation validation, creating need for third-party services",
    "Succession planning depth - companies have succession matrices but lack real assessment of capability; opportunity for CompanyA to provide evaluation services",
    "Board-level coaching and development - opportunity identified for third-party assistance in board-level coaching, especially given shareholder need for external validation",
    "Education and thought leadership - opportunity to provide more educational content (one-pagers, conversations) rather than long papers, especially for older executives"
  ],
  "key_themes": [
    "Speed and agility are critical differentiators - completing searches faster than competitors",
    "Business and cultural understanding drives selection - deep knowledge of client's business and culture is highly valued",
    "Communication style matching is important - adapting to client's preferred communication style (direct, honest, to-the-point)",
    "Assessment tools provide confidence and eliminate blind spots in internal candidate evaluation",
    "Market surveys validate internal candidates and provide external benchmarks",
    "Third-party validation is important for shareholders - external experts provide credibility that internal voices cannot",
    "Marketing and visibility need improvement - golf sponsorship story needs better explanation and broader reach",
    "Succession planning is a growth opportunity - companies need help evaluating their succession matrices",
    "Board services represent untapped opportunity - especially for coaching and development"
  ],
  "actions_recommendations": [
    "Improve marketing and brand visibility - expand beyond golf sponsorship to corporate governance education, director training, and thought leadership",
    "Better articulate golf sponsorship story - explain the 'realizing potential' narrative more clearly in marketing materials",
    "Develop succession planning evaluation services - help companies assess capability gaps in their succession matrices",
    "Create board-level coaching and development offerings - leverage the need for third-party validation that shareholders require",
    "Develop educational content formats - create one-pagers and conversation opportunities rather than long papers, especially for senior executives",
    "Consider compensation benchmarking structure - explore ways to provide independent compensation validation even when involved in searches, or partner more effectively with third parties",
    "Maintain flexibility and responsiveness - continue the approach of making consultants available at various times to accommodate client schedules",
    "Leverage business understanding - continue to invest in deep knowledge of client businesses and cultures as a key differentiator"
  ],
  "additional_insight": "Greg noted that CompanyA is 'not inexpensive' and clients need to be able to pay for quality, suggesting this is part of their 'high grading' strategy. He also mentioned that his company's shareholders are 'cheap' (not just frugal) and tend to cut corners on important investments, which creates challenges. The board spends significant time on people issues (30-45 minutes per meeting, plus committee time and individual preparation), indicating a substantial opportunity for CompanyA's broader services. Greg is planning to meet with ConsultantA to discuss succession planning services, showing strong potential for expanded engagement."
}

