{
  "id": "t-008",
  "client": "Tony Seupaul",
  "interviewDate": "2025-09-18",
  "project": "Exec Search",
  "score": 10,
  "overview": "Tony is the Executive Vice President and Chief Physician Executive at\nCarilion Clinic and reports directly to the CEO. They have partnered with\nKorn Ferry on multiple executive searches this year (five completed, a sixth\nin progress), primarily for department chairs and a Cardiovascular Institute\nDirector.\nThe relationship is longstanding and trusted, with consistent success even in\nchallenging searches. Strengths include Korn Ferry’s market reputation,\ncandidate sourcing ability, and deep understanding of their context and\nculture. Communication was described as highly responsive, efficient, and\naligned with their expectations for fast-moving searches.\nNo significant shortcomings were raised. The only points noted were that\ncompensation benchmarking is handled internally (not a gap but a structural\nnecessity), and that while Korn Ferry’s assessment tools are helpful, Tony\nwas complementary of their own in-house processes.\nTony strongly endorsed Korn Ferry and confirmed they would continue to\nuse them for future searches.\nWhat Went Well",
  "whatWentWell": [
    "Consistent success across multiple searches. Korn Ferry has delivered strong results even in challenging searches. \"It's been excellent...I wouldn't stick with Korn Ferry and this team if we did not have success. And we've had consistent success, even in some pretty difficult searches\"",
    "Strong reputation and market presence. \"I think Korn Ferry does have a very strong reputation as one of the elite search firms, and so that provides some gravity.\"",
    "Deep understanding of Carilion's context. The team's knowledge of Carilion's organisation and leadership needs creates alignment and efficiency. \"They know me, and they know Carilion Clinic exceptionally well, and so when they go to market, their filter...provides a level of refinement and focus... that creates efficiency, alignment, and so far, a lot of success.\"",
    "Responsive, efficient communication. Updates and feedback cycles were rapid, which was critical given Carilion's insistence on efficient searches. \"they will text me if there's a change or something I need to know.",
    "We'll communicate at any time, any day. And when I reach out to them, they're very responsive. In fact, I emailed...the team this morning and got a response back shortly thereafter for some feedback on a finalist interview that we completed this Tuesday evening. And yeah, they're quick...because timing in these searches is very important for me, for the candidate, I insist on very efficient searches, so that there's very little downtime for candidates and for our teams, and Korn Ferry's been able to deliver on that.\"",
    "Quality of candidates. Tony praised both the quality and the calibre of hires made. \"It's been superb... we've upgraded our talent pool with these searches, which is what my expectation was.\"",
    "Trust and psychological safety. The long-term relationship has built trust, enabling honest dialogue. \"We've developed a degree of psychological safety and understanding that they can say anything, I can say anything. We built up enough trust to be completely honest with each other.\"",
    "Challenges/ Pain Points / Gaps Identified (raised by interviewee) No significant pain points were raised. Instead, the interviewee highlighted a few contextual factors shaping how Korn Ferry fits into their processes: Compensation benchmarking.",
    "Managed internally for governance reasons. While Korn Ferry could contribute data points, final decisions rely on internal analysis. \"At the end of the day, the fair market value has to be done locally from a board perspective... if Korn Ferry had that information, it could help inform us as a data point, but it would not be the benchmark we would use in our final analysis.\"",
    "Assessment tools. Korn Ferry's leadership assessments are valued but sit alongside Carilion Clinic's existing internal tools. \"I think Korn Ferry's tool is good, it's helpful, and again it's just one additional data point for us as we think through how we assess our candidates.\" Key Themes"
  ],
  "challengesPainPoints": [],
  "gapsIdentified": [],
  "keyThemes": [
    "Trusted, long-term partnership - Korn Ferry has built credibility with Carilion over multiple engagements, delivering consistent results and strengthening trust with each search.",
    "Personal history as a candidate strengthened trust and continuity – Tony had previously been a finalist in a Korn Ferry-led search, including for their current role.",
    "Reputation and market presence matter - Being recognised as a leading search firm provides influence with candidates and supports sourcing. Efficiency and responsiveness are critical- Fast cycles and responsive communication aligned with Carilion's expectations and contributed directly to successful outcomes. Deep client understanding improves outcomes- Knowledge of the organisation and its leadership needs helped refine candidate shortlists and align decisions.",
    "Complementary role in compensation and assessment - Korn Ferry supports on data collection and assessment, but ultimate responsibility lies with Carilion Clinic's internal structures. Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Maintain high responsiveness – Continue to provide quick turnaround on communications and candidate feedback, as this is highly valued by Tony.",
    "Highlight market reputation as a differentiator – Emphasise Korn Ferry's status as a top-tier firm to reinforce its draw with candidates.",
    "Leverage deep client knowledge as a proof point – Showcase how understanding Carilion Clinic's culture and needs has enabled efficient, successful outcomes.",
    "Position assessment tools as additive – Present assessments as valuable complements to internal processes, reinforcing alignment rather than duplication. Additional Insight"
  ],
  "additionalInsight": "This was a general reflection, not a response to Korn Ferry’s current\npractices. Tony noted that while AI could play a role in logistics or market\nreach in the future, today the value of Korn Ferry lies in its people-first\napproach. “For me…the human touch, the relationship is the key ingredient\nto a successful recruitment… as it pertains to the interaction between me\nand my team and the Korn Ferry team, I don’t think AI or tech innovation\nwould enhance that in any meaningful way.”"
}