{
  "id": "t-006",
  "client": "Greg Austin",
  "interviewDate": "2025-09-02",
  "project": "Executive Search",
  "score": 6,
  "overview": "Greg valued the candidate experience he experienced when he was bought\nin by Korn Ferry on the HR side of the business and the psychometric\ntesting.\nHowever, as a client, they were dissatisfied with the quality of candidates,\nthe fact that the successful hire was a referral they provided despite high\nfees, and the lack of proactive solutions.\nCompared with competitors, Korn Ferry was seen as less engaged and less\nknowledgeable, and the interviewee stated they would not use Korn Ferry\nagain.\nWhat Went Well",
  "whatWentWell": [
    "Strong candidate-side experience [Greg was bought in by Korn Ferry on the HR side of the business]. \"it was excellent as a candidate...couldn't have done it any differently. I think the consultant I felt was working with me and on my behalf, and, you know, we had really detailed conversations around role, expectation, package, expectation, how that will get negotiated...the consultant, was on the ball from day one, managing all of our side of things.\"",
    "Psychometric testing and reporting. \"The psychometric testing piece was very detailed and very good reporting came out... that really helped with a couple of candidates... that was really valuable and a valuable activity\"",
    "Candidate reporting. \"there was a decent candidate shortlist of information we got about people was, was good. They just, they just felt short generally for quality\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "Candidate quality. Shortlisted candidates were described as \"average\" and unsuitable. \"Some of the people on the shortlist had minimal experience... after five minutes, you knew they just were nowhere near what you wanted.\"",
    "Successful candidate sourced by the client, not Korn Ferry. \"We've just paid 70 grand in fees for someone that we gave them, which feels a bit of a stink.\"",
    "Limited understanding of the matrix role. \"I think they struggled to understand what the matrix nature of the organization of the business was, what the role was. And I think that lack of understanding has probably led to the quality of candidates not being as what it should be Lack of proactivity.",
    "Emphasis was placed on how difficult the role was, rather than presenting solutions. \"It was almost an element of, this is really difficult, and I'm going to keep telling you it's difficult, rather than try to find me a solution.\"",
    "Weak guidance on compensation and package. Consultant did not demonstrate clarity or ownership in salary and benefits discussions. \"When it came to saying, right, perhaps our candidate, let's negotiate. What does she expect? And the answer was, I don't know.\"",
    "Unclear offer process. There was disagreement over who should lead the offer. \"My view was that that initial offer and negotiation should come by the by the agency, and then we put it in writing once it's been agreed. But he felt that was our role, not his.\"",
    "Engagement dynamic felt one-sided. \"We did both [have] fairly regular contact, although it was frequently based on when Thomas was available, maybe not when we were available.\"",
    "Mandated use undermined relationship. \"Nobody actually wanted to use Korn Ferry... it was pushed on them by the group.\" Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "Alignment on candidate quality expectations. Some candidates presented were seen as not sufficiently experienced for the seniority required.",
    "Clarity on complex or new role types. Client felt the nature of the matrix COO role was not fully understood, which affected alignment.",
    "Proactive guidance. The client felt they heard more about difficulties than about potential solutions.",
    "Support on package and compensation. There was a lack of clarity on what the candidate wanted and how to structure the offer.",
    "Flexibility in communication. Engagement often depended on consultant availability rather than client need.",
    "Sense of partnership. The client wanted to feel valued and supported, not simply managed through a mandated process. Key Themes"
  ],
  "keyThemes": [
    "Inconsistent experience candidate/client side. \"Candidate experience was so good on the other side... it was a marked difference.\"",
    "Trust and value gap. Paying high fees while sourcing the hire internally damaged confidence.",
    "Role misalignment. A lack of shared clarity around the matrix COO role undermined candidate quality. \"We've sort of both bumbled off into the future trying to find something without necessarily understanding it... when I came in, we sat down to say, right, okay, you keep telling me, this is a difficult role. What's the problem with what's the difficulty? And how do we, how do we find the right person? And how do we, how do we define it in order for you to find the right candidate that's out there? And I'm not sure that happened, probably in as detailed ways it could have or should have done at the early stages.\"",
    "Value-add expectations shaped by other providers. Hunter Healthcare offers strong market knowledge, proactive updates, and value-add connections. \"As soon as we talked about the brief, [Hunter Healthcare] came back with suggestions about the role... immediately, there was a sense of they understood the marketplace and the environment...then we got the brief from them around what we'd do, how we'd go about it...Those had some value add stuff around we're going to make some introductions, and there's some seminars and invites that they've opened up to us to in the health space and at a UK level, which would benefit some of my colleagues on the medical side and operational side in the business...fundamentally it was that market understanding that they soon...They knew people in that space. They knew the organizations they couldn't talk to, and they could articulate the what, the how, the why. And the lead consultant has been on the phone every week, without fail. Never had to chase them, and they're proactively engaging with us as we go through this.\"",
    "Future business risk. Client stated clearly they would not use Korn Ferry again. \"Would you use them again? – No and to be honest, we have a senior role now, but I've gone somewhere else...I spoke to have a couple of headhunters, and got a much different sort of feeling of being a client, actually wanting to work with us...actually made you feel welcome. And you know they wanted your business. And you know you got the value added stuff up front around it, it felt to a degree that Korn Ferry because they have the group relationship, almost took us for granted a little bit.\" Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Work closely with clients on candidate quality – align expectations early and make sure shortlists reflect the requirements.",
    "Spend more time clarifying complex briefs – particularly for new or matrix-style roles, so expectations are well understood on both sides.",
    "Provide proactive options – when challenges arise, frame potential adjustments or creative approaches.",
    "Offer clearer guidance on compensation – bring market benchmarks and candidate expectations into discussions earlier to support confident decisions.",
    "Adapt engagement around client needs – be flexible on scheduling and provide updates in line with client availability.",
    "Reinforce partnership – show commitment by adding insights, sharing value-add activity, and ensuring clients feel their business is important. Additional Insight"
  ],
  "additionalInsight": ""
}