{
  "id": "t-009",
  "client": "Andre Buckles",
  "interviewDate": "2025-09-18",
  "project": "Professional Search",
  "score": 7,
  "overview": "Andre, who leads Talent Acquisition for OCC, engaged Korn Ferry for a\nconfidential Controller search, building on an established partnership in\nassessments and leadership development.\nOverall, the process was positive: candidate quality was strong, consultant\nexpertise helped reshape the role, and assessment data was impactful in the\nfinal decision.\nThe main areas for improvement were communication style and cadence at\nthe outset and ensuring stronger pipeline continuity until the hire was fully\nsecured. Andre confirmed they would rehire Korn Ferry, provided\nexpectations on responsiveness and cadence are set more clearly upfront.\nWhat Went Well",
  "whatWentWell": [
    "Established partnership and trusted expertise. Korn Ferry was already a trusted partner, engaged on assessments, leadership behaviors, and development. \"OCC's engage[ment] with Korn Ferry actually predates this particular search, and we've worked with them as a partner, primarily in our assessment and organizational development functions.",
    "They've been partners to us in developing our list of leadership behaviors. We use them for pre hire assessments at some levels, and we also have partnered with them to deliver 360 feedback and other sort of ongoing development opportunities. So they're well-established partner to OCC\"",
    "Strong credibility. Korn Ferry was selected from three firms based on the team's expertise, capabilities, and recent relevant placements. \"They provided us insight into their capabilities and recent placements at the controller level. Given...[the] dedicated focus of her team, that really allowed us to make the decision to the business to Korn Ferry.\"",
    "Role-shaping expertise. Consultant credibility, particularly with CPA expertise, helped broaden the talent pool beyond the initial framing. \"As Anne's a CPA... she was really additive in terms of saying, you're calling this X, this is how it looks in the market... as we re-categorize[d] it as more than a controller...[and that] opened up the pool of talent... Ann helped us identify that fairly clearly to say, if you know, if you think you want just an operator to work nothing else, this is what you're going to get. But if you strive for that successor material, or somebody else who has a longer runway, this is what you need to start focusing on.\"",
    "Candidate quality and fit. The shortlist was relevant and led to a strong appointment. \"I think the quality was there, right? We didn't interview anyone where we said they just don't meet the qualifications.\"",
    "Assessment impact on final choice. The structured review session created confidence in the selection. \"That formal assessment review... was incredibly powerful... if you just look at it in a vacuum, without context and without an organizational psychologist explaining it to you, it's easy to misinterpret things, and in the course of that discussion, that's where we had the aha moment that said this is the person we need to make an offer to.\"",
    "Flexibility and coverage. The team ensured continuity even when individual consultants were unavailable. \"when Anne was unavailable for various reasons, Priya stepped up and responded and communicated. So I never felt like I can't reach anyone.\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "Initial communication misalignment. Delays and reliance on calls rather than fast responses created frustration at the start. \"we are a time sensitive organization...we're hearing back within two three hours.",
    "Sometimes it would be overnight, sometimes it would be a little bit longer. And on occasion, instead of just replying to an email, there was a request to have a conversation, set up a call, and so forth. And in my view, I understand why sometimes discussing and having dialog is impactful, but I always don't have the luxury of being able to carve out those times to do so\"",
    "Contingency planning. When the process narrowed to a single finalist, there was a concern about backup options. \"We potentially dodged a bullet, because if things had not ended up working out with our candidate choice...I was not quite comfortable that we had a ready backup pool we'd be able to immediately bring in and continue the process... if I engage other search firms, what we'll have happen is that they will essentially keep sharing candidates, and we keep interviews going until an offer is accepted in the background checks been cleared, right? And then it's upon them. If we do end up interviewing additional people, and the person does confirm their start date, you know, they then manage the, you know, compensation around it was great to meet you client, selected another person, and so on and so forth.\"",
    "Assessment rollout communication. The assessment review was highly valuable, but the rollout created small delays.",
    "Andre noted some issues were internal, yet also pointed to communication gaps - in particular, the lack of a proactive alert that results were being sent. \"And when came to actually getting the results, there hadn't been a communication from the team beyond sending it to a dedicated mailbox that we had set up...So the first couple came through. I missed them because I failed to look for the mailbox, but there also wasn't any communication from the team that said, heads up, they're going to start going out to you now, right? It was only when I followed up and said, Hey, I'm not seeing any of these. And they said, Oh, they're in your dedicated mailbox. And then I found them right? But oftentimes, when we've got a million things going on at once, we're not always thinking back to looking in those places. And yes, that was on me, and I should have followed up and looked where I said, but that sort of proactive nudge that says, Hey...This is where things are standing. That was missing, and that led to a little bit of a delay in terms of being able to actually have it\" Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "Communication expectations – Early misalignment highlighted the need to agree not just cadence, but also preferred style (e.g. fast email replies vs calls) and SLAs for responsiveness.",
    "Contingency planning – Preference for candidates to keep flowing until the hire is fully confirmed, to avoid over-reliance on one finalist.",
    "Assessment communication – Andre acknowledged part of the responsibility but highlighted the need for more proactive notifications when results are issued, to avoid delays and reduce reliance on chasing. Key Themes"
  ],
  "keyThemes": [
    "Trusted and established partner Korn Ferry's long-standing relationship and credibility in assessments positioned them strongly for the search.",
    "Consultant credibility and market insight. Specialist expertise (CPA background) added value in shaping role requirements and aligning candidate expectations.",
    "Combination of data and expertise. Assessment tools and structured reviews provided objectivity alongside consultant judgment. \"You can misinterpret things if you look at them in a vacuum... but with an organizational psychologist explaining, it gave us insights we missed in the interview.\"",
    "Communication and cadence matter. Misalignment early on reinforced the importance of agreeing ways of working from the start.",
    "Rehire potential with refinements. Andre confirmed they would re-engage Korn Ferry, with improvements around communication expectations. \"I would say that in general, it was a positive experience. If we had search to do over again, I would rehire them, as long as we did some early setting of communication preferences, timeliness of responses, that sort of thing\" Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Set clear communication expectations upfront – agree SLAs, channels (email vs calls), and cadence to avoid misalignment.",
    "Consider sustaining candidate pipeline until close – maintain a flow of candidates until an offer is fully secured, and ensure this practice is applied consistently across Korn Ferry.",
    "Embed proactive assessment notifications as standard – build into process to provide alerts when outputs are sent, so clients don't have to chase; make this a shared behaviour across teams.",
    "Leverage consultant expertise as a proof point – highlight this case to demonstrate how Korn Ferry's market knowledge (e.g. reframing role scope) widened the talent pool and led to a successful hire, even when the client had not initially considered this approach."
  ],
  "additionalInsight": ""
}