{
  "id": "t-007",
  "client": "Harry Boot",
  "interviewDate": "2025-09-11",
  "project": "Search (2x board members)",
  "score": 9,
  "overview": "Harry has a long-standing relationship with Korn Ferry, having known them\nfor nearly two/three decades and previously been placed by them. Although\nother options were recommended by investors, he chose Korn Ferry based\non trust and confidence in their ability to deliver.\nHe praised the calibre of candidates, the collaborative and flexible briefing\nprocess, their data-driven approach, and their ability to accommodate his\ndemanding schedule.\nThe only improvement raised was a desire for a candidate with more\nexperience in the Asian market and noting that consultancy work may be\ncostly for his small company, though he strongly endorsed Korn Ferry for\nsenior-level recruitment and said he would choose the same team again.\nWhat Went Well",
  "whatWentWell": [
    "Long-term trusted relationship: Korn Ferry has supported Harry across his career and remains a go-to partner. \"I've been dealing with Korn Ferry literally... I mean, they've now placed me, I think, in two jobs... so I've known them for probably two, close to two decades...maybe even three decades.\"",
    "Trusted to deliver. \"When the need ultimately arises, yeah, you're going to go to people that you know and that you trust and believe that also, at the end of the day, can deliver.\"",
    "Collaborative and realistic: The team balanced client ambitions with market realism, adapting as the process evolved. \"I had a list ready of what I was looking for, and they put some more realism into it... that developed as we went along as well...And that's what I appreciated as well, the flexibility\"",
    "High calibre of candidates: A strong shortlist demonstrated both quality and reach, even for a small company. \"It was just really, really good...really high calibre people.\" \"We had to work through a list of 30 people... for a small company of our size, to get that many candidates... that's a combination of them doing a good sales job.\"",
    "Hands-on candidate fit: The search focused on individuals willing to contribute, reflecting exactly the profile requested. \"One of the individuals is now with us...So willing to roll up their sleeves, not sitting at 30,000 foot... but really wanting to get into the details and seeing how they can help us... I was looking at a very particular profile of people\"",
    "Use of data alongside expertise. \"There's also a model... ranking them using the database of Korn Ferry to rank these people in the key competencies that we're looking for... so it's not just [subjective]...it's also factual.\"",
    "Clear and upfront compensation discussions: Early, transparent conversations avoided wasted time later. \"We clearly identified right in the beginning what the packages needed to look like... having that sort of dialogue upfront...[was] super important.\"",
    "Flexibility and cadence in communication. \"They found time... very much trying to accommodate my stupid, crazy schedule... I honestly couldn't have asked for more.\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "Limited candidate expertise in Asian market: \"I would have liked to see someone with a lot more Asian experience... but I also have to be fair to Korn Ferry — not necessarily a lot of those people exist, right? Because it's a very young market.\"",
    "Cost considerations for broader consultancy. \"I'm a small company...and they are, of course, costly, right? I mean, these guys are not cheap...I can only spend $1 once, and I don't have that many dollars, right? So...I got to be very frugal and make sure that I spend it wisely. So...would they come to me top of the list for an organizational development? No, I don't think I would put them on top of the list, but something like, you know, recruitment in that sort of level, absolutely, you know, that's where I think the dollars are very well spent.\" Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "Cost sensitivity: Consultancy work seen as expensive for a small company, so recruitment is the priority area for spend. Key Themes"
  ],
  "keyThemes": [
    "Trust built over time. A long-standing relationship, reinforced by being personally placed, created confidence in delivery.",
    "Collaborative and flexible approach. The briefing process was co-created, with Korn Ferry balancing client ambitions and market realism, and adapting as needs evolved.",
    "Combination of data and expertise. Korn Ferry's database was used to rank candidates in key competencies, bringing objectivity and complementing the consultants' judgment.",
    "Candidates matched the hands-on profile sought. Korn Ferry delivered candidates aligned to Harry's request.",
    "Strong endorsement for future work. Harry would use the same team again. \"If it would happen again, I would choose exactly the same team, right? I wouldn't change that.\" \"something like, you know, recruitment in that sort of level, absolutely, you know, that's where I think the dollars are very well spent\" Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Continue leveraging trust and long-term relationships – maintain consistent points of contact and familiarity.",
    "Keep collaborative, flexible briefing style – clients value realism balanced with ambition.",
    "Maintain balance of data-driven assessment and consultant judgment – reinforces objectivity and credibility.",
    "Leverage candidate fit as a proof point – highlight this case to demonstrate Korn Ferry's ability to deliver candidates closely aligned with client needs, while recognising that exact matches depend on market availability."
  ],
  "additionalInsight": ""
}