{
  "id": "t-017",
  "client": "Mike Arshinskiy",
  "interviewDate": "2025-10-13",
  "project": "Professional Search",
  "score": 10,
  "overview": "Mike, Technology Director at Inflexion, supports their portfolio companies in\nenterprise technology, product innovation, and software engineering\nthroughout the investment lifecycle. Mike had worked with Dan previously,\nbefore he joined Korn Ferry, and this engagement marked Mike’s first formal\nexperience with Korn Ferry as a firm.\nDan was described as an honest, thoughtful partner who guided both the\nsearch strategy and execution, maintaining clear, proactive communication\nthroughout. Candidate quality, adaptability, and candidate management\nwere all praised. Some improvement areas were noted around search\nstructure, resourcing, and assessments which was seen as less effective in\nproviding the desired level of depth and insight.\nWhat Went Well",
  "whatWentWell": [
    "Trusted, collaborative partnership. Dan was viewed as a genuine partner. \"Dan was a really good partner in this journey. I could ask him, 'What do you think about that? Is this the right thing to do?'...He was always honest with me\"",
    "Strategic and consultative approach. \"Dan really guided the strategy of the search as well, not just execution of it.\"",
    "Creative and adaptable search methodology. \"[Dan] always finds more creative and original approaches...'[let's] look into [this] adjacent industry, maybe somebody who's been in and out of this industry'\"",
    "Good candidate quality and alignment. \"We interviewed 16 [candidates] in total... it was exactly as we planned out... we had a good representation...and it was according to the search strategy.\"",
    "Clear, proactive communication. Mike described communication as consistent, transparent, and responsive. \"[Dan] communicated with me really well... weekly calls... proactive in saying, 'Let's move to something else' when we'd reached the end of a search pool.\"",
    "Strong candidate engagement and closure. Candidate experience and relationship management were handled with care.",
    "In reference handling candidate outcomes: \"He handled it very well...with grace...one of the individuals... told me [Dan] did a great job [explaining] why...[and] the reasons\"",
    "Adaptable and responsive approach. The team adjusted quickly when search focus was re-defined. \"We moved away from that [consulting] strategy, and I think Dan reacted relatively fast to that.\"",
    "Enhanced value through assessment support. Dan added value by facilitating direct interpretation of assessment results. \"He connected me with the individual who runs those assessments...he explained the profile...showed what was worth looking at... that was super helpful and to the credit of Korn Ferry for being flexible.\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "Search process and early resourcing. Early-stage mapping took longer than planned. \"We mapped out all private equity firms and their value creation teams so... we [could] identify fruitful hunting ground...I felt like this came slightly later in the search than it should have...I think it's more of the function of junior research analyst who was on the search...it felt like Dan had to pull the weight.\"",
    "Variation in delivery experience. The experience reflected Dan's partnership strength rather than a consistent firm-wide standard. \"I didn't feel like I was working exactly with Korn Ferry... Dan comes with quite creative approaches. I'm not sure that's endemic of Korn Ferry, I think it's more functional. I didn't get to experience Korn Ferry beyond them in the search...the junior research analyst was average at best.\"",
    "Resourcing balance and process efficiency. Dan's hands-on engagement with candidates was valued, though it may have limited resource capacity for early stage searching. \"Dan spent a lot of time [with candidates], and it's absolutely fine and right, but that meant there was less resource doing the research, and that's why [the] search took slightly longer...[it took] two weeks longer than was planned which for searches, is not a huge deal...I would expect [Korn Ferry] to just [do a] slightly better job at run of the mill skilled operations, like mapping out candidate tracking...benchmarking.\"",
    "Assessment service experience. The assessment outputs were seen as less insightful and not fully aligned with expectations. \"It took a long time and the insights were lacking...I [asked] specifically [for] data on peers, data on up...[but they] didn't do what was instructed, didn't answer the questions that we [had] discussed.\" Mike noted that the assessment experience compared less favourably to other providers in terms of candour and actionable insight. \"Pebble were very clear...they helped us assess [how the candidate would perform]...it's useful information to have, and it's actionable\" KF4D usability. \"it needs to be reworked, it has a treasure trove of valuable information... it's incredibly hard to get out.\" Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "Process and resourcing of search. Mike observed that the search process could be more structured, with more adequate capability and resource allocation.",
    "Consistency of delivery across teams. Mike highlighted that overall quality depended largely on the lead consultant.",
    "Depth of assessments and actionable insight. Assessment outputs were described as limited in insight and less aligned to the defined requirements.",
    "Ease of access to insight. Mike noted that KF4D, while comprehensive, was not always easy to navigate to find the insight. Key Themes"
  ],
  "keyThemes": [
    "Consultative and strategic partnership. The relationship was described as open, trusted, and highly collaborative, with Dan acting as a true partner throughout the process.",
    "Effective communication and relationship management. Clear, consistent communication with both Mike and the candidates, built confidence and kept the process moving efficiently.",
    "Engagement process and consistency. While overall delivery was positive, Mike noted opportunities for improved processes, balanced resourcing, and consistency across teams.",
    "Assessment depth and value. Assessments were viewed as less detailed and actionable than expected, with potential to provide clearer insight comparable to other providers. Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Maintain consultative, partnership-led approach. Continue the strategic, collaborative style and creative search methods that underpin client trust and satisfaction.",
    "Strengthen search process and support. Ensure early-stage mapping and research are adequately resourced to balance consultant involvement and maintain pace.",
    "Reinforce consistency across teams. Standardise communication, reporting, and delivery practices to align all engagements with Dan's partnership style.",
    "Enhance assessment quality and insight. Review assessment design, ownership, and outputs to ensure greater depth, clarity, and alignment with client needs.",
    "Simplify platforms and documentation. Improve usability of internal systems so data and insights are easier for clients to access and interpret. Additional Insight"
  ],
  "additionalInsight": "Mike’s experience was shaped primarily by Dan’s personal approach -\nhonest, communicative, and strategically minded rather than the Korn Ferry\nbrand.\nMike contrasted Korn Ferry’s assessment experience with competitor\nPebble, whose feedback was described as clear, candid, and practical.\nPebble’s assessments were seen as more tailored and directly relevant to\nperformance and team dynamics.\nDan’s ability to maintain engagement with both successful and unsuccessful\ncandidates was viewed positively and reinforced the firm’s reputation for\nprofessionalism."
}