{
  "id": "t-014",
  "client": "Vanessa Didden",
  "interviewDate": "2025-10-01",
  "project": "Executive Search",
  "score": 10,
  "overview": "Vanessa Didden, HR Director in the Benelux region at Heidelberg Materials,\nengaged Korn Ferry to conduct a confidential search for a new Procurement\nDirector. The search was sensitive as the incumbent was still in post.\nHaving previously worked with senior consultant Olivier Top, in other\ncompanies, Vanessa chose Korn Ferry based on trust, a proven relationship,\nand a convincing confidentiality approach. The engagement was described\nas highly successful - efficient, collaborative, and service-oriented. Three\nshortlisted candidates were all of exceptional quality, and the selected\ncandidate has since started successfully.\nMinor adjustments were made early in the process regarding report timing\nand format, which Korn Ferry quickly addressed and adapted to. Vanessa\npraised their reactivity, professionalism, and ability to represent Heidelberg\nMaterials’ image credibly. They would use Korn Ferry again for executive-\nlevel roles but consider other firms for less senior hires due to cost.\nWhat Went Well",
  "whatWentWell": [
    "Confidentiality handled expertly: The search required utmost discretion, which was a decisive factor in choosing Korn Ferry. \"They really convinced me because they had two sheets of approach on the way they [would] handle this...assignment... with references of other clients [in] similar situations where it had to be really strictly confidential.\"",
    "Strong trust and consultant continuity: Vanessa had an existing relationship with the consultant, which reinforced confidence. [in reference to the selection of Korn Ferry] \"Part of it is indeed the trust I have in Olivier Top as a consultant\"",
    "Thorough intake and profile definition: Korn Ferry took the lead in structuring collaboration and built a clear, aligned understanding of the profile. \"They did an intake conversation... I explained the profile...and they made the profile description themselves...At the very beginning they sent me...some LinkedIn profiles so I could say not this [one], but this is what I'm looking for. And that really helped narrow [it] down.\"",
    "Exceptional candidate quality and cultural fit: Three strong candidates were shortlisted, all capable and aligned with company culture. \"All three of them could do the job and match with our company culture...I have never seen this to have really three excellent candidates on the same level, and so that's also the reason why the three candidates have met with our general manager.",
    "Assessment process aligned and credible: Assessments were insightful and aligned with interview impressions. \"What was written in the report of the assessment was aligned with the person I had in front of me...their assessment system works well.\"",
    "Highly responsive and service-oriented: Korn Ferry demonstrated adaptability and efficiency throughout the process. \"They were very client- oriented, very service-oriented, very reactive... I really felt like a client. I really felt a lot of support...it was a really great collaboration\" \"They were very reactive and they adapted it [the timing delivery and the report content] for the next reports, they were really excellent, very reactive\"",
    "Proactive candidate management and offer support: Korn Ferry effectively helped secure acceptance of the final offer. \"They helped convince the candidate to accept the offer... they explained that the candidate [should] look at the total package...all the advantages we offer.\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "Timing of candidate reports: The first candidate report was received too close to the interview, limiting preparation time. This was corrected for the following reports. \"They sent the first candidate report...48 hours before the interview...I told them that this was too short\"",
    "Initial report content: An early report lacked specific details required for the interview, this was also quickly corrected. \"There was also some information missing... but they were very reactive and adapted it for the next reports.\" Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "Earlier delivery of reports. Initial feedback highlighted the need for more lead time before interviews; the process was adapted swiftly following clarification.",
    "Consistency in candidate reports. Small omissions in an early report were noticed and addressed swiftly. Key Themes"
  ],
  "keyThemes": [
    "Trust and relationship continuity. Past positive experiences and consultant continuity drove confidence in Korn Ferry's ability to deliver.",
    "Exemplary candidate quality and cultural alignment. Exceptional candidate calibre and cultural alignment reinforced the perception of premium value.",
    "Client-centric service. Reactivity, transparency, and professionalism underpinned a highly positive client experience.",
    "Confidentiality and professionalism as differentiators. Vanessa selected Korn Ferry for their structured, credible approach to handling sensitive executive searches in a small market.",
    "Premium positioning justified for senior mandates. While fees were acknowledged as higher than competitors, Vanessa viewed Korn Ferry's service as worth the investment for Excos and general management searches, recognising the firm's value at senior level and strong alignment with complex, high-stakes roles. Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Reinforce timely information sharing. Ensure report delivery timelines allow sufficient preparation time before interviews; make this a standard behaviour across engagements.",
    "Continue responsive, client-led communication. Preserve the highly valued reactivity and transparency demonstrated in this engagement, maintaining the \"trusted partner\" experience.",
    "Extend candidate lifecycle engagement. Introduce a consistent post- placement follow-up to gather feedback from both client and candidate, reinforcing relationship depth and demonstrating ongoing partnership value. \"I really hope that they will do a follow up with [our placement]...when she's [been] here for a few weeks and then maybe within three or six months....Give her a call and really ask like how is it going and then give me the feedback because that's really valuable for me\" Additional Insight"
  ],
  "additionalInsight": "Benchmarked experience. Vanessa contrasted Korn Ferry’s\nprofessionalism with a poor experience using a specialist legal recruiter in\nparallel, reinforcing Korn Ferry’s credibility and reputation. “In the same\nperiod, I worked with a [legal] headhunter…I was looking for a legal\ndirector…it was a mess… I will never work with these people again. If I [had]\nto do this again…I would work with Korn Ferry definitely”\nUse reserved for senior-level searches. While highly satisfied with Korn\nFerry’s performance, the client noted that fees are best justified for ExCo\nand general management roles, viewing the firm as a premium partner for\ntop-tier searches only. “For ExCo positions, yes. For other positions, no,\nbecause actually their fees are higher than all the other headhunters in\nBelgium.”\nPerception of Korn Ferry as a specialist headhunting firm. Vanessa\nsees Korn Ferry’s core strength in executive search and would not\nnecessarily look to extend into leadership or consulting services, given\nexisting partnerships and internal capability. [in answer to whether they\nwould consider using Korn Ferry beyond search] “Not really because I think\ntheir core business is headhunting…we have a partnership with a provider\nwhich is really excellent and expert in leadership…I know they also do salary\nbenchmarks…these are typically the king of things that would be decided by\nour group in Germany…on the other hand I have quite a big HR team so\nhave internal expertise”"
}