{
  "id": "t-013",
  "client": "Stephen Zelkowicz",
  "interviewDate": "2025-09-29",
  "project": "Consulting",
  "score": 10,
  "overview": "Stephen Zelkowicz, Chair of the Compensation Committee at DLH Holdings\n(NASDAQ-listed government contractor) said Korn Ferry was already the\noutside compensation consultant when he joined. After becoming Chair, he\nled a competitive review involving four other firms to ensure value and\nservice standards remained high. The committee chose to stay with Korn\nFerry on retainer, citing confidence in the relationship, consistent delivery,\nand the firm’s ability to provide specialist expertise when required.\nHe described the engagement as a partnership, valuing Korn Ferry’s\nstructured cadence, competitive pricing, and responsiveness despite the\ncompany’s smaller scale. The only improvement noted was occasional\nquality-control errors in presentation materials. He has since recommended\nKorn Ferry to others and would consider using them more broadly as DLH\nHoldings grows.\nWhat Went Well",
  "whatWentWell": [
    "Long-standing trusted partnership: Korn Ferry has advised the compensation committee for several years and remains a valued partner. \"They've been our consultant for quite a few years... they're doing a great job.\"",
    "Proactive and structured communication: The team established a clear cadence from the outset. \"They're pretty proactive...[they] put a calendar together [and showed us] this is what public companies do. This is the natural cadence or natural timeline of a public company. And the first quarter you need to do this. The second quarter you need to do that. So we had that conversation, and they put it down on paper\"",
    "Industry knowledge and benchmarking expertise: \"they always bring in outside or internal experts...They have other clients also in the in the industry and bigger clients than us, they bring that expertise and knowledge.\" \"...when we benchmark, we use public data... it's helpful that they're able to do it so quickly...[they] make it very easily to digest and easy for the other committee members.\"",
    "Effective relationship management: \"I think they play a good role within the dynamics, you know, of the committee. I do appreciate them. They understand the personalities of our committee.\"",
    "Partnership approach: Korn Ferry's retainer model and willingness to tailor support reinforced a collaborative, partnership-based relationship. \"I feel it's more of a partnership.",
    "It's more of, hey, I need you. Can you help me out now or tomorrow and they take that approach, and they did whatever they could to keep our business, which I appreciated\"",
    "Value recognised despite lower-cost alternatives: While some competitors quoted around 30% less, pricing was viewed as fair and competitive given the trust and service quality. \"They were very competitive on the pricing side\" \"we consider price but [at] the same time we consider the quality of the relationship, and it was helpful to know that so and so is offering 30% less than what you are Korn Ferry...we weren't going to pay double of what we were paying, but the same time...it was that balance of let's try to get the best. We established we wanted to keep working with them.\"",
    "Supportive of smaller-scale clients: Stephen valued Korn Ferry's continued engagement and flexibility despite their smaller size, noting proactive fee stability and attentiveness. \"Even though we're a smaller company... they work with us, which I really appreciated.\" \"For the last few years, they haven't changed their fees... I appreciate that they recognize that, and they've been proactive about that.\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "Accuracy/quality control in materials: Occasional errors in materials provided. \"I always trust their work. But...there are times where I have found mistakes...which I'm kind of surprised about. It could be a certain formula wasn't used properly. Or...something that's not the median...\" Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "Quality assurance in deliverables. Occasional calculation/formula errors in presentations slightly undermined confidence. Key Themes"
  ],
  "keyThemes": [
    "Partnership and trust underpin retention. The decision to remain with Korn Ferry despite cheaper alternatives reflects a deep trust in the relationship and the perceived quality of service.",
    "Commitment to quality and continuous improvement. Occasional presentation errors were noted, but the relationship remains strong, supported by open feedback and mutual respect for high standards.",
    "Supportive partnership for smaller clients. Korn Ferry's flexibility and proactive fee management have reinforced their reputation as a partner capable of balancing large-firm expertise with small-cap pragmatism.",
    "Advocacy and future use. Stephen has recommended Korn Ferry to peers and expressed willingness to engage them again as the organisation grows. \"I have introduced them to people I know who are in the private sector. I've done that two or three times. I've made introductions...\" Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Strengthen internal quality control. Implement additional checks on deliverables to ensure accuracy and maintain client confidence before materials are circulated.",
    "Grow the partnership alongside client scale. Continue to adapt delivery and support as DLH Holdings matures, ensuring Korn Ferry remains a trusted strategic partner through future phases of growth. Additional Insight"
  ],
  "additionalInsight": "AI and workforce evolution. Stephen highlighted the broader importance of\nunderstanding AI’s impact on the workforce, skill development, and\ncompensation structures. While not specific feedback for Korn Ferry, it\nsuggests potential for advisory conversations on the intersection of AI, talent,\nand pay strategy. “AI awareness is something always on my mind… it’s\nconfusing, but it’s changing how younger generations develop within the\nworkforce.”"
}