{
  "id": "t-016",
  "client": "Cana Iwahara",
  "interviewDate": "2025-10-10",
  "project": "Executive Search",
  "score": 10,
  "overview": "Cana, leads the HR function for private markets within Macquarie asset\nmanagement, and also covers another business within Macquarie which\nincludes other investment teams. Korn Ferry is regarded as the go-to\nexecutive search partner for senior-level roles, led primarily by Jerry, and\nhave been engaged consecutively for multiple senior searches over recent\nyears.\nThe relationship is long-standing and trusted, underpinned by\nresponsiveness, persistence, and high-quality relationship management.\nKorn Ferry’s pitch preparation, market knowledge, and commitment to\ndelivery continue to stand out. A minor improvement area noted was\nconsistency of delivery across different project teams, though the overall\nrelationship is viewed positively.\nCana concluded “I really love working with Korn Ferry. I really love Jerry and\nhis team - they’re really amazing.”\nWhat Went Well",
  "whatWentWell": [
    "Go-to partner for senior searches. Korn Ferry is regarded as the default partner for executive and senior MD searches within Macquarie. \"For me, Korn Ferry is the go-to for executive search... we consistently have at least two or three searches going on\"",
    "Jerry's strong relationship management. \"Jerry's very good at relationship management...he's very communicative. He really takes the time to build the relationship with us and also the candidates. Always informed, always acts quickly and puts strong candidates forward...keeping us in the loop and having updates on every call, and really moving the process along.\"",
    "Consistent pitch performance against competitors. \"Korn Ferry kept winning [in pitches against other SHREKS]...it's been the most competitive between Korn Ferry and this other boutique firm...unless there are roles where we need certain industry expertise or something Korn Ferry can't do, we'll definitely put them in front of the hiring manager.\"",
    "Strong candidate quality. Searches typically produce high-calibre candidates aligned to role requirements. \"typically they really help us find great people.\"",
    "Persistence through lengthy processes. The firm maintains commitment and pace despite Macquarie's consensus-driven hiring structure and extended timelines. \"They never stop, and they keep going even if we're difficult and even if we're slow...it's a really great partnership\"",
    "High-quality pitch preparation and expertise. Pitches are well-prepared and reflect strong market knowledge. \"They're extremely well prepared...they're very knowledgeable in the market...it [the pitch] ends up being quite an impressive conversation.\"",
    "Comprehensive process management. \"They do everything... ultimately we have the offer conversation and discussions about compensation, but outside of that, they really do everything.\"",
    "Positive candidate experience and follow-up. \"He takes the time to build the relationships with...the candidates\" \"I think you know they [Korn Ferry] do stay in touch [with placed candidates] ...they can also give the hires advice on how to best on board into Macquarie and be successful.\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "Inconsistent experience across teams. The quality of delivery has varied when other consultants have led searches. \"I wasn't as impressed...we had a talent search...the person that was on it was fine but then he ended up leaving so wasn't as engaged...Jerry took over and we were able to move the process along pretty quickly...it depends on the team that you're working with.\" Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "Consistency in consultant engagement and delivery quality. Key Themes"
  ],
  "keyThemes": [
    "Established, trusted, and consecutive partnership. Korn Ferry has delivered multiple searches over consecutive years and remains the default choice for senior hiring.",
    "Consistently successful against competitors. Korn Ferry has repeatedly outperformed other major consultancies and boutique firms in pitches.",
    "Relationship excellence. The partnership thrives on strong communication, responsiveness, and transparency led by Jerry's partnership.",
    "Persistence through long processes. Korn Ferry's determination and continuity through consensus-driven decision-making underpin client confidence.",
    "High candidate quality and experience. Searches produce strong shortlists and consultants invest time in candidate relationships. Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Maintain high standards of engagement and delivery. Continue the strong preparation, responsiveness, and persistence that differentiate Korn Ferry across searches.",
    "Ensure consistency across teams. Align communication, updates, and delivery quality so all projects reflect the same standard demonstrated by Jerry's team.",
    "Maintain proactive post-placement contact. Continue informal follow-ups with placed candidates and hiring managers to sustain relationship continuity.",
    "Potential opportunity to share market insights. Cana expressed interest in light-touch periodic benchmarking or compensation insights. \"if we could get more comp benchmarking surveys. I know that when we used to work... with Heidrick & Struggles, they would send us an annual comp report which was helpful.\" Additional Insight"
  ],
  "additionalInsight": "Key HR priorities include:\n• Diversity, Equity & Inclusion: increasing diverse representation in\nsenior hiring.\n• Digital and AI integration: expanding technological capability and data-\nled decision-making across the business.\n• Talent development for new growth areas: including private equity\nadjacencies and entrepreneurial fund structures.\nHave used Korn Ferry for forensic referencing. “I’ve always had a good\nexperience. I did hear that there was some sort of negative experience but I\ncan’t remember what it was because I wasn’t involved in the hire…My\npreference is not to do forensic referencing but when the hiring manager\nwanted it, we’ve done it a few times.”"
}