{
  "id": "t-018",
  "client": "Briony McKinn",
  "interviewDate": "2025-10-13",
  "project": "Executive Search",
  "score": 9,
  "overview": "For the last 18 months Briony has led the team that partners closely with\nIVC’s UK-based group executives and their leadership teams on HR\nbusiness partnering activities. Briony also oversees a small centre of\nexcellence focused on leadership development, which is managed internally\ndue to limited budget allocation. Briony had worked with Korn Ferry before\non leadership development in a previous role, where the experience had\nbeen very positive.\nWithin IVC, Korn Ferry is “one of the go-to” search firms used for permanent\nexecutive roles, with usage varying across functions. Briony primarily\nengages Korn Ferry for finance searches led by Rebecca Moreland, who\nhas an established, long-standing relationship with their Group CFO.\nOver the past year, Briony has partnered with Korn Ferry on four searches.\nThe relationship is valued for responsiveness, delivery quality, and strong\nunderstanding of stakeholder needs.\nWhat Went Well",
  "whatWentWell": [
    "Go-to partner for searches. Korn Ferry is a trusted, go-to partner for senior finance hiring. \"they're not the only search firm that we use for our exec roles, but they certainly [are] one of the go-to search firms that are used...I use them extensively for finance...but there are other parts of the organization [that] use Korn Ferry for CEO, general management type roles.\" \"we've got a really good relationship\"",
    "Strong stakeholder understanding. Rebecca's deep familiarity with the CFO's style and expectations supports successful alignment. \"she [Rebecca] understands what he's [CFO] looking for, the things that are going to both delight and not delight him\"",
    "Invested time in building relationships. The team spent time understanding how different stakeholders work and how best to collaborate. \"I also appreciate the time that she [Rebecca] and a number of her team have taken to also get to know me...how I work with [the CFO], and how we...work as a team...to get the best experience possible\"",
    "High-touch and responsive communication. Preferred communication styles were discussed and followed. \"Rebecca and I have an incredibly good relationship, we will text, we will call... weekends, late into the evening... absolutely respectful of each other...all of them are super responsive.\"",
    "End-to-end process ownership. \"they are absolutely key...they [are] very much involved...from the get-go and through to the end...comp negotiation...references...informal checks\"",
    "Comprehensive inclusion of assessments and insight. Assessments are seen as valuable inclusions that differentiate Korn Ferry from some competitors. [in reference to a different project] \"We did decide to appoint [a SHREK]...but they were not going to [do] any of their assessments...that was all going to be plus. And I just thought...have I been spoiled just because of the relationship we have with Korn Ferry? But for me, I find for some of these key C suite roles...it's the basic thing nowadays...I do appreciate that side of and also to the comp Intel as well.\"",
    "Strong candidate attraction and storytelling. Korn Ferry plays a key role in shaping IVC's story for senior candidates, particularly in a private equity context. \"They are instrumental in helping us tell the story around what is attractive to candidates\"",
    "Professional and accommodating support. \"Lucy is the absolute benchmark of EAs I have ever worked with...[the] support team make[s] a real difference to how successful something is... or not\" Challenges/ Pain Points None explicitly mentioned Gaps Identified (raised by interviewee)"
  ],
  "challengesPainPoints": [],
  "gapsIdentified": [
    "None explicitly mentioned Key Themes"
  ],
  "keyThemes": [
    "Established and trusted partner. Korn Ferry is seen as a long-term, reliable partner with consistent delivery across consecutive searches.",
    "Stakeholder fluency and relationship depth. Strong understanding of the CFO, Briony and the team underpins alignment, trust, and smooth collaboration.",
    "Communication tailored to preference. Korn Ferry actively aligns to each stakeholder's preferred communication style, maintaining responsiveness and accessibility.",
    "Comprehensive, integrated service. Assessments, compensation intelligence, and referencing form part of the standard service, with competitors often charging extra for similar elements.",
    "Proactive and accommodating partnership. The team are easy to work with, supportive in practical ways, and committed to client needs. Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Continue responsive, relationship-led engagement. Maintain close contact with key stakeholders and flexibility in communication and availability. Additional Insight"
  ],
  "additionalInsight": "Scope of engagement. Korn Ferry is currently engaged for executive\nsearch only. Leadership development is delivered in-house at IVC due to\nbudget priorities, though Briony previously had an excellent experience with\nKorn Ferry’s development offering in a previous role at another organisation.\nPricing and value. Fees are viewed as consistent with market norms.\nBriony considers Korn Ferry’s service to fully justify the cost, reflecting\n\n\nquality delivery and long-term partnership value. “for the money that we pay,\nthe service absolutely backs it up…Rebecca is also very fair, when I’ve said\nto her this is our fourth search in 12 months, ‘what can you do for me?’ she\ntakes that on board.”\nBriony noted that some search processes in the market now use online\nportals for data sharing and feedback. While this can be efficient, Briony\nsuggested it may not suit all senior stakeholders. “some of my leaders that I\nwork with, particularly in the tech space and some even in the finance space\n[will] very happily log into a portal [and say] ‘right, here's where all of my stuff\nis, this is my one shop’ [but there are some stakeholders who are] used to\ngetting a report sent through on email, feedback on a phone call…so I think\nit very much depends on the stakeholders that you’re working with as to\nwhether or not that would be something that’s valued or not.”"
}