{
  "id": "t-019",
  "client": "Dawn Willoughby",
  "interviewDate": "2025-10-14",
  "project": "Executive Search",
  "score": 10,
  "overview": "Dawn, Chair of the Governance Committee at IFF engaged Korn Ferry\nthrough an RFP to support significant changes to the non-executive board.\nHaving previously interacted with Korn Ferry as a candidate, Dawn\nreconnected with them in this governance role. Although the selection\ncommittee had not previously worked with Jane before, she was well known\nin the market and quickly established credibility through her network and\ndepth of knowledge.\nKorn Ferry was chosen for its strategic approach, strong network, and\nsenior-level engagement. Dawn described the experience as “excellent,”\nhighlighting Jane’s expertise, responsiveness, and partnership through a\ncomplex and evolving process.\nMinor areas for improvement related to communication structure and the\ninclusion of additional candidate data. Korn Ferry has since been re-\nengaged for CEO succession work, reflecting high trust and satisfaction.\nWhat Went Well",
  "whatWentWell": [
    "Strategic, holistic approach. Korn Ferry's proposal stood out for its broad, long-term view of board composition rather than a transactional search focus. \"we were also impressed with the strategic point of view that Korn Ferry brought during the RFP process...a broad look on how to shape a board...[thinking] about timing, committee considerations, etc, so the strategic view mattered versus opportunistic...so that's what set Korn Ferry apart.\"",
    "Senior engagement and commitment. Direct involvement from senior leadership reinforced confidence and signalled long-term commitment. \"Gary not only met with the selection committee but also met with our chair...and he may have also had connection with our CEO...that showed us commitment to our long-term partnership, and was a big difference maker\"",
    "Adaptability through changing priorities. The team managed shifting internal timelines and priorities while maintaining candidate engagement. \"We have had a bit of on and off again on our side and...Jane and her whole team were able to work with us during all of that and keep the candidates interested... if there were any missteps, it was from our side.\"",
    "Responsive and accessible communication. Jane's responsiveness and dedication were repeatedly commended. \"[Jane] is a dynamo... I don't think [she] ever took a weekend or evening of... the way she and her team work.\" \"she said if you get a communication to any of us, we'll get the team engaged.\"",
    "Strong candidate quality and balanced assessment. Dawn was confident in both the quality and fairness of the process. When one early shortlist was viewed as below the usual standard, the team responded quickly with a refreshed, higher-calibre slate that aligned with expectations. \"We had some candidates come in through board members that got put into the pool...and instead of just going with them, [Korn Ferry] would come up with other options so we had people to compare against...they were excellent candidates\" \"whether we brought forward a candidate or Korn Ferry found a candidate, they were all treated as equal. And let's really look at the full slate and how this impacts the total board. So yes, the slate was always good.\" \"There was one slate that wasn't as strong for one of the candidates and for one of the positions we were looking to fill...I did say 'these don't feel at the calibre of what we've delivered for the other candidates, is there a reason for that?'...they came back with a slate that was an A list slate, just like they had for the other roles.\"",
    "Market insight and reputation awareness. Jane's knowledge of candidates and ability to provide informal context was valued. \"Jane and her team's approach... she's so networked...I do feel like utilising Korn Ferry, we got a bit of an upper hand on knowledge...which is obviously critically important to have as we're thinking about the top- level calibre that that we want\" \"Jane knows these people well, and knows how they're thought of in the industry, and is very willing to say 'I know this person has x reputation, but they also have this y reputation that maybe is not as public. And we need to think about those things.'\"",
    "Proactive and pragmatic guidance. Jane added value by prompting IFF to think through broader implications when considering candidates. \"Jane also was really helpful, just from, 'let's think about it from this angle. You know, what does this person bring? Or, is there baggage that would come with their name on your board, sort of thing?' She obviously has a strong network, so was able to do some back door references to help us understand if there were things that we would need to check out in more depth during our interview process. So all of that worked out terrifically.\"",
    "Analytical insight and tools. Korn Ferry's use of a tailored board matrix helped visualise needs and gaps. \"One of the areas that Jane and [her] team pulled together as we started changing candidates and configuring and determining what an end state for our board look[s] like [was a] matrix, not a normal skills matrix, a little more in depth to see here's what the end state looks like, and what gaps do we have to fill as we think about the final one or two candidates that we pull in? So that was really helpful\"",
    "Extended partnership. Success with board recruitment led to further work on CEO succession. \"We also did a bit of an RFP on CEO succession...separate from our NED searches, obviously had Korn Ferry in the mix and did select [them], specifically working with Jane knowing that CEO being a board member is critical and [because we] had such a good experience with her on the NED searches...it just shows from the initial RFP process where she outlined the strategic approach and long term partnership value is playing out for us here\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "Communication structure not formalised. While communication was effective overall, there was no agreed structure for how updates should flow among multiple stakeholders. \"we didn't really talk about a formal communication process...they didn't necessarily have a point person...we were all running fast on our side [and] I did think when I get a chance to take a breath with all these searches going on, I would recap with Jane [on] how can we be more effective with you on this, because I tend to just email or text her. I did ask her briefly about that, and she said, if you get a communication to any of us, we'll get the team engaged. So perhaps an efficiency would be for me to understand who do you want me to connect with on your side, but it worked out fine because I always use Jane as my point of contact, and she is a dynamo.\"",
    "Additional candidate data requested. \"[what] would be meaningful...and we did add it to our profiles [as] I don't think we had market cap in there originally [but] It's important to see, obviously different industries have different scales they're looking at...I liked seeing that with the candidates...Perhaps seeing some TSR during the 10 years for the CEO candidates and CFF candidates, particularly where it's more easily measurable...it is important to see what were the results...we didn't necessarily need that data point, because Jane knows these people well\" Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "• Communication process not formally defined among stakeholders. • Limited visibility of performance metrics (e.g., market cap, TSR) in candidate profiles. • Reliance on Jane's personal network noted as a potential continuity consideration. Key Themes"
  ],
  "keyThemes": [
    "Strategic partnership. Korn Ferry was viewed as a strategic, long-term advisor, focused on shaping a balanced and future-ready board.",
    "Credibility and consultant expertise. Jane's deep market knowledge, responsiveness, and network were key differentiators, creating high trust and confidence.",
    "Adaptability and resilience. The team's ability to stay aligned through client-driven delays and changes strengthened perceptions of partnership and commitment.",
    "Expanding relationship scope. Strong performance in board recruitment has led to continued engagement, including CEO succession, reinforcing Korn Ferry's role as a trusted advisor. Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Maintain the strength of the partnership. Continue building on the trusted, collaborative relationship and strategic alignment demonstrated so far.",
    "Agree communication structure early. Confirm primary contacts and update cadence when multiple stakeholders are involved.",
    "Include quantitative metrics. Consider integrating business scale and performance data (e.g. market cap, TSR) into future candidate summaries where relevant.",
    "Consider future continuity. As the relationship evolves, keep visibility of key contacts and shared knowledge within the broader team to ensure consistency over time. Additional Insight"
  ],
  "additionalInsight": "While no assessment or benchmarking tools were used for these board\nsearches, Korn Ferry supported with consistent background checks,\nincluding for candidates introduced through other channels."
}