{
  "id": "t-015",
  "client": "Lisa Bolger",
  "interviewDate": "2025-10-02",
  "project": "Executive Search",
  "score": 9,
  "overview": "Lisa, Chief People Officer at PartnerRe, has partnered with Korn Ferry over\nthe past 18 months following a change in CEO and subsequent executive\nreshuffles. They partner with external search firms for ELT and key strategic\nroles that cannot be filled through succession. Korn Ferry is one of three\npartners (including Spencer Stuart and Heidrick & Struggles) and has won\nthe majority of tenders over the last two years - the relationship remains non-\nexclusive.\nLisa highlighted Korn Ferry’s tailored, thoughtful approach, cultural fit, and\nflexibility structuring searches and fees. Minor challenges were noted around\nmulti-region communication and listening balance on a US-led search;\ndelivery has otherwise been positive and ongoing.\nWhat Went Well",
  "whatWentWell": [
    "Tailored, thoughtful approach: Korn Ferry's preparation, questioning, and challenge-based style stood out. \"What really swung the success of Korn Ferry's pitches [is that they really take] the time to ask thoughtful questions, really quiz our executives, mainly our CEO, on his actual needs, his preferences, how he likes things...Asking really great questions to tease that out and not been afraid to challenge which I love...the thoughtful questions, the alignment...\"",
    "Cultural alignment and partnership: The collaboration felt natural and client-centred. \"I've really enjoyed that kind of partnership, and that it felt very natural...the right questions, appropriately commercial, but not too commercial, appropriately big picture, but also focusing in on, what really makes PartnerRe tick...what I appreciate about Korn Ferry is there's no such thing as one size fits all...I certainly experienced [customer centricity]\" \"we're a bit of a hands on culture...very execution focused, more about actions versus principles, more about outcomes versus concepts...from that perspective, the approach of Korn Ferry works well\"",
    "Strong lead consultant relationship: Andy Cannon was described as an excellent partner whose approach matched the CEO's style. \"Andy Cannon has been an excellent partner for us...[he is] very open, very honest, brings a lot of value to the table...[and is] not afraid to put the hard stuff on the table.\"",
    "Flexibility and adaptability: \"Korn Ferry have terms and conditions they absolutely have to meet, but I've really appreciated the flexibility, whether it's different aspects of the retainer versus the overall fee, or how we structure the overall fee. There's always some nuance...and that flexibility and that ability to really think about how we can meet the partnering needs has very much been appreciated.\"",
    "Open and accessible communication: \"Andy and I will communicate quite a lot, whether it [be] text or let's just jump on a Teams call... there's open communication from both sides.\"",
    "Use of broader expertise and data: \"We've done a number of the leader profiles... and certainly having conversations around benchmark... I've used their data for other things as well...I would say there's a real partnership there. I'm like I actually need something in this area, have you got something that would help, while it's not everyday...there's been a sharing of all the resourced that are available to us.\"",
    "Clear preference despite competition: \"We have three partners that we lean on... If I look at who's won the vast majority of the tenders in the last two years, it's been heavily weighted towards Korn Ferry\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "Listening balance: In a US-based search, the need for deeper listening and local sensitivity was noted. \"There's probably a little bit more listening needed on the US side than the European side... sometimes to prove you want to do a great job, you can over-talk. I think there's just that opportunity really, really just listen...\"",
    "Cross-team communication and coordination: \"[There's] an opportunity to work on communication when there are multiple teams around the table\"",
    "Scheduling process friction: Minor issues arose around short-notice meeting arrangements. \"I haven't had an issue with the ones I'm leading. I'm not leading the claims one, but I know there's been some [difficulty] trying to get meetings in the diary with CFF, or interviews in the diary with the CFF last minute, which is never going to work for her, you know. So there's just one or two kind[s] of things like that after popping up, but nothing that's insurmountable\"",
    "Challenging searches and candidate withdrawal: \"We've had some challenging searches... we've had one that's pulled out which is always a bit of a challenge when we make an offer\" Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "Listening consistency in repeat or sensitive searches. In a search previously managed by another firm, consultants' enthusiasm occasionally came across as over-talking when Lisa saw scope to apply learnings.",
    "Cross-team coordination and logistics. Lisa observed a need to further streamline coordination across regions, especially when multiple teams are engaged in scheduling and communication. Key Themes"
  ],
  "keyThemes": [
    "Tailored, questioning approach drives success. Lisa consistently highlighted Korn Ferry's thoughtful preparation, questioning, and listening as core differentiators that shaped both the tender and delivery success.",
    "Trusted partnership and cultural alignment. The relationship was described as natural and respectful, grounded in shared values and an understanding of PartnerRe's pragmatic, action-oriented culture.",
    "Flexibility and adaptability. Flexibility in both engagement design and pricing created a sense of partnership and responsiveness to the client's needs and volume of work.",
    "Constructive challenge valued. Korn Ferry's willingness to ask difficult questions and offer honest advice was viewed as a key strength that built trust.",
    "Continuous improvement in listening and coordination. While collaboration was described as strong overall, the client noted opportunities to refine listening balance and strengthen communication processes when multiple regions or stakeholders are involved. Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Reinforce listening-first behaviours across all engagements. Maintain emphasis on reflective listening and client-led dialogue, especially in complex or sensitive repeat mandates.",
    "Clarify coordination and scheduling expectations. Agree communication cadence and scheduling parameters at the outset of multi-stakeholder or cross-regional engagements.",
    "Continue flexible, partnership-based approach. Sustain adaptability around engagement models, reinforcing the collaborative dynamic valued by PartnerRe.",
    "Monitor post-placement phase. Ensure early check-ins with placed candidates and hiring leaders to sustain the personal, relationship-led experience."
  ],
  "additionalInsight": ""
}