{
  "id": "t-012",
  "client": "Dr. Nina Johanna Haltern",
  "interviewDate": "2025-09-29",
  "project": "Executive Search",
  "score": 8,
  "overview": "Dr. Nina, Head of HR at Tengelmann Twenty-One, engaged Korn Ferry for a\nrole reporting to the CFO. Whilst this was Dr Nina’s first direct engagement,\ntheir Chief People Officer had previously partnered with Korn Ferry,\nincluding on the successful appointment of the current CFO - prompting the\ndecision to use them again given their established knowledge of the\nenvironment and company.\nOverall, they were very happy with the candidate quality, the team’s\nunderstanding of the role, and the range of profiles presented. The\nsuccessful hire was seen as a strong outcome.\nAreas for improvement centred on flexibility, response times, and a desire\nfor quicker interim updates to reassure stakeholders. They would use Korn\nFerry again but noted that their CFO had initial reservations about\nresponsiveness and engagement.\nWhat Went Well",
  "whatWentWell": [
    "Good candidate quality and role understanding: Korn Ferry demonstrated strong understanding of the unique role context and delivered convincing profiles. \"they had a really good understanding of what we needed, the role was a bit special especially for a German context...and they came out with good profiles...profiles were really convincing...the candidates were really good\"",
    "Strong sector knowledge: Korn Ferry targeted the right people and broadened scope when requested. \"they approached the right people in the right industries...[and] broaden[ed] the scope when we asked them to do so\"",
    "Range of profiles presented: \"What I also like[d] was...the range of candidates in terms of very different types of people, both from a personal point of view, but also in terms of company cultural background.\"",
    "Brand credibility supported outreach: The Korn Ferry name added weight and improved candidate responsiveness. \"It was also helpful to have them approaching the candidates because... their name helps...people are more probable to answer to Korn Ferry than to a no name.\"",
    "Regular touchpoints and positive working relationship: \"We had a regular touch point, but then on top we also had these spontaneous meetings.\" \"I also like the people involved, I [had] nice conversations with them...they were always supportable\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "Perceived rigid processes versus boutique firms: Korn Ferry's structured methodology sometimes felt slower and less pragmatic compared to smaller boutique firms. \"smaller boutique consultancies [seem] more pragmatic to me... with Korn Ferry, I sometimes [had] the impression they really need[ed] to follow their standard procedure which obviously makes sense because it's part of quality management... [but] sometimes I would have liked them to be a bit more...flexible.\"",
    "Quality versus pace: While the quality of candidates was valued, they would have preferred receiving initial profiles earlier to provide feedback, rather than waiting weeks for a polished shortlist. \"It was not quantity versus quality, but rather quality versus pace... it would have been better to just get...the first profile to work with...and tell them [yes] that's going in the right direction or it would be good to have some more experience in this...maybe a bit more adaptivity would have helped\"",
    "Slow start created impression of disengagement: \"in the very beginning [the CFO] really had the impression they [Korn Ferry] didn't want to do the job...she had the impression it was too low level for them and there was something missing from her perspective\"",
    "Process clarity around compensation: \"We had a candidate who was very interesting for us but came up with an idea of a package far beyond what we were able to or willing to pay...he maybe didn't play very honestly from the first moment...[but] it makes sense to talk about packages early in the process\"",
    "Best practice in data handling: \"[Korn Ferry said] we are going to send [profiles] by email [but] I didn't want to have any profiles in my inbox...[I'd rather you] share your drive, you can put them there, and once the search is finished, I'm going to close the drive then I'm perfectly fine with all the data security\"",
    "Response times could have been faster: Emails sometimes went unanswered for extended periods. \"Sometimes it took 30 hours or so but you have an email to three [people] so you would have thought at least one of them could just tell me, look, we are going to answer maybe tomorrow, but [we got nothing]\" Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "Limited early visibility of profiles. Dr Nina would have valued seeing initial profiles sooner to give feedback and reassure stakeholders, rather than waiting weeks for a polished shortlist.",
    "Best practice in data handling. Profiles were sent by email rather than via the customer's preferred secure method (shared drive), which felt outdated compared to best practice. Key Themes"
  ],
  "keyThemes": [
    "Future engagement considered positively. Dr Nina confirmed they would use Korn Ferry again. \"Yes, absolutely [would use them again]...I'm really happy with the result.\" \"We found somebody we are very happy with\"",
    "Candidate quality strong, but pace questioned. The final shortlist was convincing, but the waiting period created tension and reinforced the need for quicker interim updates.",
    "Balance of structure and flexibility. Korn Ferry's thorough, polished process was valued, but stakeholders wanted more agility to fit their working style.",
    "Perception of engagement at the outset. A slow start and the need for an escalation call gave the impression that Korn Ferry was disengaged, though this improved later. Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Agree communication and progress expectations upfront. Define response SLAs, update cadence, and how interim progress (e.g., early draft profiles or search signals) will be shared balancing Korn Ferry's structured process with the client's preference for visible momentum.",
    "Manage key stakeholders proactively. Engage senior stakeholders early and maintain direct, transparent communication throughout to prevent misperceptions of disinterest or delay.",
    "Uphold best practice in data handling and client experience. Adopt modern, secure, and client-preferred ways to share profiles and materials (e.g., shared drives rather than PDFs or email) to reinforce operational best practice and responsiveness."
  ],
  "additionalInsight": ""
}