{
  "id": "t-010",
  "client": "Shannon Fulmer",
  "interviewDate": "2025-09-22",
  "project": "Exec Search",
  "score": 6,
  "overview": "Shannon, Senior Director of HR, engaged Korn Ferry for the search of a\nsenior role in their association. The firm was chosen based on prior\nassociation-sector experience, including the API President search.\nWhile Korn Ferry demonstrated strong initial credibility and well-structured\ncandidate packaging, challenges emerged around communication\nalignment, candidate relevance, and understanding the unique dynamics of\nassociations.\nUltimately, the client appointed a strong internal candidate. Shannon\nreported that this first engagement was a difficult experience and would be\nhesitant to use Korn Ferry again.\nWhat Went Well",
  "whatWentWell": [
    "Strong initial credibility. Korn Ferry was selected due to prior successful work with associations, including the API President search. \"we chose Korn Ferry because they had worked with associations before...[and] because they had done the API President search and found someone for them... our outgoing president had worked with them before and felt they were the ones to go with.\"",
    "Efficient coordination and support. Administrative support was singled out as a strength. \"Their administrative assistant was a phenom... quite the talented calendar keeper.\"",
    "Well-structured interview process. Korn Ferry provided thorough candidate packages and relevant interview questions for the board. \"The packaging was great... the questions were good. It helped them stay on track. It helped keep them in line with time. \" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "Bypassing agreed governance. The consultant sometimes went directly to the Board Chair, overriding the recruitment policy. \"twice when he went to him, he got time frames changed and meetings changed, and that not would not have happened had the internal group been able to have the conversation with our board members.\"",
    "Listening and responsiveness. Feedback sometimes required repeating before being actioned, particularly around narrowing candidate numbers. \"It took me calling him twice to get that to stop.\"",
    "Candidate quality and fit. External candidates were put forward despite clear feedback they were not appropriate, undermining confidence in alignment. \"she looks brilliant...[but] we were really looking for that person that could be a mediator, that could be someone who brings people to the table. And so she was an immediate no from our board members, as well as two of the internal people who had worked with her directly. And Charlie was like, Well, I don't understand this. Why would you not consider her? And they had literally just explained why they wouldn't.\"",
    "Overemphasis on volume. At times, outreach felt volume-driven rather than strategic, including contacting unsuitable or politically sensitive individuals. \"It felt more like he was trying to get us bodies...we told them, hey, listen, we need two or three people, if that right, because we had a very strong internal candidate who we actually ended up going with. But we wanted to be sure. We said, you know, this is the bar. They got to be as good as our internal candidate, or better.\"",
    "Compensation misalignment. At least one candidate presented was significantly above the disclosed range. \"He brought us someone who... was well over a million dollars in salary, and he knew ours was like at 600, 700,000 total.\"",
    "Limited association understanding. The consultant struggled to fully grasp the unique operational and governance model of associations, where both board and members play central roles. Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "Governance and association context. The consultant did not fully adapt to the association's governance structure, at times bypassing the internal recruitment committee in favor of the board chair and struggled to recognise the operational nuances of a small membership-driven association.",
    "Candidate alignment. Some recommendations did not reflect the client's clear criteria or feedback, creating unnecessary friction (e.g., pushing a candidate already ruled out, or presenting one far outside the compensation range).",
    "Assessment tool relevance. The provided assessment added little value in this search, as the internal candidate was clearly the strongest option. Key Themes"
  ],
  "keyThemes": [
    "Sector credibility drove selection. Prior work with the national association gave Korn Ferry initial trust and an advantage in pitching.",
    "Process support was valued. Candidate packaging and structured materials enabled board members to engage effectively.",
    "Governance alignment was critical. Deference to the Board Chair over the agreed committee undermined trust and created tension.",
    "Strategic focus vs. volume. The client wanted a small pool of high-quality candidates to benchmark against a strong internal, not broad outreach. Impact on future relationship. The challenges affected confidence in re- engagement. While Shannon acknowledged Korn Ferry's strong reputation, she noted they \"would not... be on top of the list to call\" right now for future searches. Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Respect governance structures. Confirm and adhere to agreed decision- making processes from the outset.",
    "Strengthen responsiveness. Act on client feedback promptly to build trust.",
    "Listen and tailor outreach. Align search strategy, candidate pool size, and compensation levels with client guidance from the outset.",
    "Draw on association-specific expertise. Where relevant, deploy consultants experienced in member-driven governance models."
  ],
  "additionalInsight": ""
}