{
  "id": "t-026",
  "client": "Gerd Pircher and Marco Trovo",
  "interviewDate": "2025-10-29",
  "project": "Executive Search",
  "score": 10,
  "overview": "HSBC Continental engaged Korn Ferry to run a senior search for a Head of\nGlobal Transaction Solutions following an internal resignation. The\norganisation initially attempted to source candidates themselves but turned\nto Korn Ferry due to their deep market roots and understanding of a niche\nproduct area.\nOverall, the experience was very positive. Both main stakeholders\ndescribed high-quality candidates, a large and committed project team,\nhighly reactive communication, strong longlist breadth, and smooth logistics.\nThe only area for improvement raised was a desire for more assertive\nsupport during compensation discussions, where the Gerd expected the\nconsultants to challenge the candidate position more strongly. Both\nstakeholders stated they would use Korn Ferry again.\nWhat Went Well",
  "whatWentWell": [
    "Deep market knowledge and relevant expertise Korn Ferry brought insight into a highly specialised product area, which had been difficult to recruit for internally. \"We needed someone with deep roots within this particular branch of the market... that's why we used Korn Ferry because they have deep roots and knowledge of the market itself.\"",
    "Large, committed project team The Gerd valued the breadth of support and the level of seniority involved. \"They provided us not just a senior partner, but two senior partners and other two or three people... three, four people trying to help, investigating, asking questions, finding solutions and providing proposals.\"",
    "High candidate quality and quantity Candidate supply met expectations for a complex, senior search. \"Yes, I would say yes\" (on both quality and quantity).",
    "Clear communication and strong organisational support Stakeholders appreciated precise updates and easy coordination. \"They were brilliant, extremely precise, extremely comprehensive.\" Strong follow-through and responsiveness to feedback The second stakeholder highlighted exceptional reactivity as interviews progressed. \"We kept giving feedback... and we could sense and feel a real reaction to that, so real reactivity.\" Excellent longlist breadth and creativity Stakeholders praised the thoughtful, expansive candidate slate, which reflected the brief accurately. \"I liked the overall breadth and quality of the long list.\" \"They absolutely did... they threw the net widely... and delivered on that.\" Smooth logistics for a senior, complex hire Scheduling and process management were handled effectively despite demanding internal schedules. \"Everything was really easy... my life is a very complicated one... but it all worked fine.\"",
    "Strong stakeholder endorsement Both interviewees stated they would work with Korn Ferry again. \"I would say yes, yes.\" \"They are perfectly matching our expectation.\" \"I would advise other people using them.\" \"All the merit... goes to Korn Ferry, so well done.\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "These were noted as minor and did not detract from the overall positive outcome. Perceived candidate-leaning stance during compensation guidance The Gerd expected more robust challenge of the candidate's expectations. \"I would have expected a little bit more of support... I would have appreciated a little bit more of challenging behaviour versus the candidate.\" Initial uncertainty in the first briefing (raised by stakeholder 2) One stakeholder felt the nuance of the brief was not initially understood. \"My experience of the actual briefing call was not a good one... I felt they didn't fully grasp what we wanted.\" However, this was fully resolved: \"But they did. I was wrong... we had a great candidate slate.\" Gerd did the negotiation autonomously Korn Ferry was not asked to manage the final offer and did not advise on compensation benchmarking. (Not a complaint but a factual point raised.) \"We did it autonomously... we had our numbers in our mind.\" Unclear whether candidate onboarding follow-up occurred The Marco or Gerd did not know if Korn Ferry followed up with the hire. \"I don't know. I have no idea if they did follow up... there was no need for them to support us.\" Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "Stronger challenge during compensation discussions Gerd expected consultants to take a firmer stance on starting position and negotiation strategy. Initial clarity in briefing Although ultimately successful, one stakeholder felt the first meeting did not fully convey the nuances of the brief. Key Themes"
  ],
  "keyThemes": [
    "Breadth and quality of candidate pool A strong longlist, including non-obvious profiles, was repeatedly highlighted by both stakeholders.",
    "Responsiveness and proactive adaptation Feedback loops were quick, and the team adjusted based on Gerd reactions. High calibre delivery team The involvement of multiple senior individuals differentiated Korn Ferry from other head-hunters the Gerd had used.",
    "Strong partnership and Gerd satisfaction Both stakeholders expressed high satisfaction and intent to reuse Korn Ferry. Opportunity around negotiation guidance The only recurring improvement point was around supporting the Gerd more assertively during compensation discussions. Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "• Strengthen support during compensation discussions - provide clearer guidance, challenge candidate expectations when appropriate, and support the Gerd in establishing negotiation strategy. • Reinforce clarity during the initial briefing - ensure full alignment on nuanced or non-standard briefs from the outset to avoid early uncertainty. • Maintain high reactivity and feedback adoption - this was repeatedly praised and should continue as a core strength. • Continue wide-net sourcing for niche roles - stakeholders valued the creativity and breadth of the longlist. Additional Insight"
  ],
  "additionalInsight": "Brand prestige is not a decision factor for Gerd.\nGerd suggested that brand name carries little weight and can even imply\nunnecessarily higher fees to him. What matters is execution quality,\nresponsiveness, and ability to understand a nuanced brief."
}