{
  "id": "t-020",
  "client": "Kristin Skogen Lund",
  "interviewDate": "2025-10-15",
  "project": "Executive Search",
  "score": 10,
  "overview": "Kristin, Chair of the Supervisory Board at Delivery Hero, led the\norganisation’s first engagement with Korn Ferry to recruit two roles, following\na less satisfactory experience with a competitor. The selection was\ninfluenced by Kristin’s prior positive experience with both Korn Ferry and\nMette during searches in previous organisations. Kristin had also been\nassessed by Korn Ferry several times as an executive.\nKristin described the engagement as swift and efficient, producing a strong\nlong-list of candidates from which the preferred individual was successfully\nappointed. Kristin was “very happy” with the process, describing it as\n“superb,” and noted that the team “went the extra mile.” Feedback from other\nstakeholders was also positive.\nWhat Went Well",
  "whatWentWell": [
    "High-quality candidate pool and successful outcome. Korn Ferry produced a strong longlist and successfully placed the preferred candidate. \"I've been very happy with it... [they came] up with a very good list of candidates and I was surprised by the long list. It was very good with six, seven candidates that we all could have hired in the end...our top choice...has now joined and seems to be [a] very good hire. So that worked really well.\"",
    "Trusted and effective partnership. Kristin highlighted the value of an established working relationship and Mette's understanding of their expectations. \"it has quite a lot to do with the individual...she knows me, she knows exactly what I would be looking for.\" \"I trust them and really feel that they're stretching to make me happy and make us satisfied. You always get...the impression that they always go that extra mile for you. And I really think they do.\"",
    "Clear and efficient communication. \"we had meetings, not too many...they provided the deck with a list...it was just swift, efficient, clear\"",
    "Positive stakeholder satisfaction. \"the HR director...[was] incredibly happy...she wrote to me 'I can't believe how well this went, this candidate that ended up with us...he's brilliant.' It's been a very good experience...[and] that's felt by more than me\"",
    "Good experience with multiple consultants. \"I'm very happy with the team, Mette...but also Phoebe\" \"she has a colleague called Stieg, I [have] used him quite a few times, and I know him well and trust him...I see him as a Norwegian market type of person. He's really good there.\"",
    "Challenges/ Pain Points None explicitly mentioned. Gaps Identified (raised by interviewee)"
  ],
  "challengesPainPoints": [],
  "gapsIdentified": [
    "None explicitly mentioned. Key Themes"
  ],
  "keyThemes": [
    "Superb experience and strong outcome. The engagement was described as \"superb,\" with Korn Ferry going \"the extra mile\" to deliver a swift, successful process.",
    "Trusted relationship and partnership strength. Trust and familiarity with Mette underpinned a strong, collaborative and confident relationship.",
    "High candidate quality and stakeholder satisfaction. The shortlist and final appointment met all expectations, with unanimous positive feedback from the board, HR, and nomination committee. Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Maintain high delivery standards. Continue the structured, efficient approach and focus on delivering strong, well-qualified candidate pools.",
    "Sustain partnership quality and trust. Leverage trusted consultant relationships while ensuring consistent quality across supporting team members.",
    "Continue clear stakeholder communication. Maintain transparent progress updates and proactive liaison between client, candidate, and company. Additional Insight"
  ],
  "additionalInsight": "Kristin’s previous experiences with Korn Ferry in both assessment and\nsearch contexts have been positive. The current engagement reinforced the\nfirm’s reputation for reliability, professionalism, and delivery excellence.\nAt present, the board is stable with no immediate hiring needs. Discussions\nfocus on governance, structural change, and ongoing portfolio matters.\nTechnology and AI are more active topics at management level than at board\nlevel."
}