{
  "id": "t-028",
  "client": "Leslie Fall",
  "interviewDate": "2025-10-29",
  "project": "Professional Search",
  "score": 7,
  "overview": "Leslie, CEO and founder of Aquifer, engaged Korn Ferry to recruit a Chief\nSuccess Officer after two failed searches with other firms. Leslie had\npreviously worked with Korn Ferry while faculty at Dartmouth, and more\nrecently three years ago, to appoint a Chief Learning Officer - an experience\ndescribed as a “good search” that delivered “the right person” and a strong\ncandidate panel they “wouldn’t have been able to achieve” independently.\nFor this latest search, Leslie approached Matthew directly after researching\nKorn Ferry and their expertise. Leslie was encouraged by his\nresponsiveness and willingness to help despite acknowledging that the\nassignment was “a little under” his typical remit. The early stages moved\nquickly, with the team demonstrating enthusiasm and urgency to start\nsourcing.\nHowever, as the process progressed, several operational and\ncommunication issues undermined confidence and trust. Leslie recognised\nthe team’s intent and effort, praising their commitment and describing\nStephanie as particularly professional and empathetic. Yet, they felt that\nsystemic process weaknesses affected the overall experience.\nLeslie described Korn Ferry staff as “hard-working and well-intentioned,” but\nnoted that the firm’s systems “failed them,” citing issues around\ncommunication, scheduling, quality control, and client recovery. They valued\nKorn Ferry’s openness to feedback and said they would be comfortable\ndiscussing these points further with senior leadership to help improve future\ndelivery.\nWhat Went Well",
  "whatWentWell": [
    "Quick mobilisation and strong early engagement. Leslie appreciated how rapidly Matthew and the team responded, showing genuine interest and urgency. \"They dove right in, they were like 'let's get this done before you go on vacation, so we can start sourcing people' [which I thought was] awesome. I raced together, got the information, we had a couple of really quick meetings, and they really dove right into sourcing people. And when I came back from vacation, they had a list\"",
    "High-quality sourcing and strong early pipeline. The initial list of candidates met expectations and provided reassurance that the firm could deliver. \"They had a great list of people, and we really worked our way through those...we got down to two candidates who were out on the open market, looking for jobs, compared to everybody else...good candidates. And so I said, 'Okay, we're going to jump on these in case one of these is really great'\"",
    "Professionalism and empathy from Stephanie. Stephanie was commended for her approach, composure, and ability to manage difficult moments constructively. \"Loved her [Stephanie]. I would have hired her out from underneath them. She was great...she was doing customer recovery and I appreciated that... she leaned in and said the right things...that's just what I needed to hear\"",
    "Commitment and effort across the team. Leslie acknowledged the team's work ethic and intent to do the right thing throughout the search. \"I think these are good people who work hard, are well intended, who were trying to do the right thing for us...it's clear that they enjoy their jobs and are taking it seriously...to me those are the most important core values\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "This was a constructive but challenging experience; feedback focused on process and system gaps rather than individual performance.",
    "Communication breakdowns and scheduling errors. Several coordination lapses affected confidence. One candidate withdrew 15 minutes before an interview, but the client and her team were not informed by Korn Ferry, leaving three executives waiting on a call.",
    "In another instance, two finalists were mistakenly invited to the same meeting - an error Leslie and her team noticed. \"[on one of the interviews to a candidate] three of us come on to the call and nobody shows up...and it turns out the guy pulled out from the interview 15 minutes before the Zoom call and no one told us. So three executives sitting on this call, we're panicking for this other guy. We're thinking he's trying to sign in. He can't get a hold of anybody. What's going on...and it turns out that the scheduler didn't tell us, but also one of the principals whose client it was said 'oh, well, I went into another meeting and I didn't see it for like an hour.'\" \"we're down to interviewing two of our finalist candidates and my staff pulls up the zoom and goes, 'Why is one of the other candidates invited to this call with this candidate?' - my most important candidate got invited to a zoom interview with the other leading candidate and my staff figured this out\"",
    "Missed opportunity for client recovery. Leslie felt responses to these issues were defensive rather than empathetic, missing the chance to demonstrate ownership and care. \"we're scrambling because we feel bad for the candidate who pulled out 15 minutes before this interview, [whilst] you are off having your good day, and we're freaking out...it was just always like 'Oh, we're so sorry that happened, but I was in the meeting.' - I get it, I understand, I run a business but I'm your client. I don't need to hear any of that.",
    "None of that should be coming out of your mouth, what you should be saying is 'We're so embarrassed. We're so sorry. This will never happen again. We've already fixed the problem, what else can we do to make this better for you?' Those were the words that should have come out\"",
    "Unexpected candidate withdrawal. The initial finalist accepted another position after signing an offer, which Leslie discovered via voicemail while on vacation. While Leslie recognised that this may have been outside Korn Ferry's control, she was surprised the team was unaware, and slightly disappointed by the lack of acknowledgment. \"We went through this entire process and literally made him an offer. He signed the offer, and we were starting his onboarding and getting ready to send him his computer, and I got a voicemail message from one of my search consultants, essentially saying he's taken another job. And I was thinking we had this nailed...Now I don't put that on Korn Ferry per se, but how could you not know? [They said they were] completely surprised too and I'm like 'how could you be this surprised? Either this guy is just awful...[or] we dodged a bullet.' But it wasn't like 'we're so sorry' even though some things you just can't have control over\"",
    "Gap between expectations and delivery. Having chosen Korn Ferry for their expertise and professionalism, Leslie was underwhelmed by early deliverables. \"I will say [I was a] little disappointed [with] what they put together as the package compared to what I had seen in the past. You're the experts [and] I could tell they had leveraged AI a lot too...I already did that part, I need you to actually be the human who knows what they're doing. Sure, we all use AI but I don't need you to repurpose [what I started] they didn't say they did but I could tell...[I wanted them to] bring [their] expertise to this. I ended up redoing it\"",
    "Erosion of trust and confidence. Cumulative process errors and limited recovery left Leslie questioning overall quality assurance. \"Then it makes you start to question everything else. Are they going to get the contract right? Did they actually ask the clients these questions? If this guy took a job without them even knowing he was interviewing, were they not asking the right questions? And so, everything came into play...more and more questions emerged about what do I not know that's not being done right?\" \"I need complete trust...You're doing the background checks, not me.",
    "They're the one doing the references, not me. If they're giving me things that look like their AI does...am I losing the level of quality that I pay for in this company?\" Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "Expected level of professionalism, quality and expertise: Delivery and communication did not always reflect the high standards Leslie associated with previous experience and Korn Ferry's reputation.",
    "System and process discipline: Scheduling, coordination, and quality- control processes require greater consistency and internal oversight.",
    "Client recovery capability: Consultants would benefit from clearer guidance on handling service issues, including timely acknowledgement, empathy, and proactive reassurance when challenges occur. Key Themes"
  ],
  "keyThemes": [
    "Good people, weak systems. Leslie saw dedication and intent but believed process and system gaps undermined delivery.",
    "Client experience and recovery. Limited ownership and reassurance during challenges left Leslie feeling unsupported at key moments.",
    "Evolving expectations of quality. Having experienced Korn Ferry's excellence before, and knowing its reputation, Leslie expected consistent, high-level delivery; small lapses therefore had a disproportionate impact.",
    "Openness to improvement. Leslie appreciated Korn Ferry's willingness to listen and respond constructively to feedback. Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Strengthen client-recovery capability. Provide practical training for consultants on empathetic responses, ownership, and reassurance when addressing service challenges.",
    "Reinforce process discipline and oversight. Review internal systems for scheduling, communication, and QA to prevent client-facing errors.",
    "Elevate quality standards. Revisit expectations around consultant input and deliverable refinement to ensure Korn Ferry's trademark expertise is consistently evident.",
    "Engage senior leadership in relationship recovery. Maintain dialogue at a senior level to acknowledge feedback, demonstrate accountability, and rebuild confidence in the partnership. Additional Insight"
  ],
  "additionalInsight": "Leslie viewed this as a systemic issue rather than the fault of individual\nconsultants, stressing that all were capable and well-intentioned. “I think\nthese are good people who work hard, who are well intended, who were\ntrying to do the right thing for us. It's not like I had a bad apple…it feels like\nit's a systems thing…I do think they were trying to do, in some respects, a\ngood job in the context of a system that failed them…It was all systems that\nwere problems”\nLeslie welcomed the opportunity to share feedback, seeing it as evidence of\nKorn Ferry’s openness and commitment to improve. “I’m impressed that they\nhave somebody [reaching out]…[that there’s] interest and openness to\nhearing [feedback] and I will respect and respond to that…I recognise, if\nthese things were happening in my company and no one was telling me\nabout them, I'd be upset. So I try and offer that same benefit to others.\nBecause running a company is really hard.”"
}