{
  "id": "t-022",
  "client": "Daryl Teitler",
  "interviewDate": "2025-10-16",
  "project": "Professional Search",
  "score": 8,
  "overview": "Daryl described a positive experience working with Korn Ferry across two\nsenior-level searches - one for a Chief Medical Officer, which involved a\nstrong pool of candidates and concluded successfully, and one for a Vice\nPresident of Finance and Accounting, which was ongoing at the time of the\ninterview with final interviews planned. Prior experience with Korn Ferry in a\nprevious organisation influenced the decision to initially engage them.\nCommunication throughout was described as good and Daryl also praised\nthe teams’ availability and market experience. He raised a couple of\n“hiccups” including timing of candidate communication, a conversation\nthrough which an employee appeared to determine the selected candidate\n\n\nwhich Korn Ferry fully owned and apologised for, and a need to maintain\nmomentum through the later stages of a search.\nOverall leaders were described as “very happy” with the engagement and\nBrian was noted for doing “a very nice job.” Daryl expressed appreciation for\nKorn Ferry’s work and said the firm would remain under consideration for\nfuture searches.\nWhat Went Well",
  "whatWentWell": [
    "Positive overall experience and partnership. Daryl expressed overall satisfaction with Korn Ferry's partnership and delivery, noting strong team engagement and continued confidence in the relationship.",
    "Strong communication and availability. Weekly updates, flexibility in scheduling, and availability ensured transparency and alignment throughout. \"[communication] was good through the whole project, they set up weekly meetings [for] updates in regards to the recruiting...[it was] great to get on the phone when it wasn't a planned call, so that we could kind of talk through different components of the recruiting process. So overall, it was excellent.\"",
    "Comprehensive partnership. Korn Ferry supported job definition, documentation, and offer management. \"We already had much of it put together [but] they helped prepare the position paper... crafted something more targeted which was very helpful.\"",
    "High candidate quality and industry expertise. The Chief Medical Officer search delivered strong candidates and a successful appointment. \"There were a lot of quality candidates to choose from... overall, I was real pleased with the Chief Medical Officer, both on the quantity and the quality. We had a lot of people to talk to, and a lot of people to choose from.\"",
    "Effective assessment and data use. Assessment tools were viewed as valuable and professionally delivered, supporting leadership decision- making. \"[Assessment tools] were different [to competitors] and helpful. I really can't say that one was better than the other, because the other firm that we use was also a national firm, but it created good discussion. The expert that came on the line to walk it through with us did a great job sharing their observations of the assessment, and we only used it as one of many data points.\" \"we're really trying to focus on data to make decisions...and being able to present to the CEO, the assessment data and any other data that helps give him confidence...gives us more credibility as an HR function. I think Korn ferry represented us well...I was confident when we brought the candidates to him...he loves the data\"",
    "Industry knowledge and credibility. Brian's sector expertise and market understanding instilled confidence in hiring leaders. \"one thing I really liked about Brian was, when we first talked with him, he was able to give comfort and confidence to the leaders that he understood the industry and the major players. [The leaders] also understood individuals in the market so they started talking about individuals that they both ran across and I thought that was very helpful for the leader.\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "Timing of candidate communication. A candidate learned of an outcome from Korn Ferry before internal communication occurred. \"The employee's first understanding that they didn't get the job came from Korn Ferry as opposed to the leader.\"",
    "Information sensitivity. An instance occurred where a senior employee appeared to infer the selected candidate's identity following a conversation with Brian before it had been communicated.",
    "Daryl acknowledged and appreciated Korn Ferry fully owning this and apologising. \"Brian had a conversation with another one of our employees and somehow during that conversation the employee was able to determine who we selected...we hadn't communicated [it] yet, even though we knew who it was going to be...I reached out to Brian [who] shared back in no means did he ever share who the final candidate was...[but] Brian absolutely owned it, he absolutely apologised.\"",
    "Maintaining cadence through quieter phases. Communication was described as strong overall, though Daryl suggested keeping regular meetings even when candidate activity was lower. \"Maybe being more proactive in setting up weekly or biweekly meetings even when they didn't have candidates or any additional [information].\"",
    "Consistency of momentum late in process. Daryl noted that search activity appeared to slow once final candidates were identified. \"The other thing that I've had to push them on a little bit is now we're down to two or three top candidates, but at the end of the day, I don't know if we'll go with any of the three and making sure that they continue to recruit until an offer is signed, sealed and delivered, it feels like it slows down considerably once two or three candidates are kind of at the top of the list.\" Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "• Process continuity and candidate communication • Recruitment momentum through final stages Key Themes"
  ],
  "keyThemes": [
    "Professional, collaborative partnership. The relationship was characterised by open communication, responsiveness, and mutual trust.",
    "Depth in industry sector. Korn Ferry's strong domain knowledge and credibility in the market enhanced client and stakeholder confidence.",
    "Effective use of data and assessment tools. Assessment outputs supported informed decision-making and executive confidence in the process.",
    "Commitment to continuous improvement. Daryl acknowledged Korn Ferry's ownership when minor issues occurred and described the overall experience as \"great\" and \"very pleased.\" Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Maintain partnership-led communication. Continue the structured, consistent communication that supported trust and visibility across both searches.",
    "Clarify process ownership and communication roles. Ensure clarity with client on who communicates specific candidate updates to avoid premature sharing or inference of outcomes.",
    "Reinforce confidentiality and information handling. Review internal communication protocols to avoid inadvertent sharing or inference of sensitive outcomes.",
    "Maintain search momentum through later stages. Continue proactive outreach and candidate engagement until an offer is finalised to sustain momentum and avoid slowing in later phases. Additional Insight"
  ],
  "additionalInsight": "Future consideration. Daryl confirmed that Korn Ferry would “definitely be\nin consideration” for future searches, depending on level and scope.\nSelection would be balanced against internal capability, expertise, and price,\nbut prior positive experiences and outcomes make Korn Ferry a strong\nongoing partner.\nRecommendation. Daryl stated he would recommend Korn Ferry to others.\nFuture talent challenges include sourcing specialists in areas such as\nmedical, actuarial, and finance functions, where market supply remains tight."
}