{
  "id": "t-023",
  "client": "Lew Little",
  "interviewDate": "2025-10-17",
  "project": "Professional Search",
  "score": 10,
  "overview": "Lew has a long-standing relationship with Korn Ferry, having been placed by\nthem and having used them across two organisations for approximately ten\nsearches - ~five in his previous company and another five in his current role\nover the past three and a half years. His ongoing relationship is primarily\nwith Noel supported by other members of the firm.\nHe described himself as a “frequent flyer,” reflecting loyalty and satisfaction\nwith the results achieved. Lew values the personal relationships,\nresponsiveness, and outcomes delivered, viewing Korn Ferry as a trusted,\nlong-term partner for securing senior talent. Engagements have consistently\nmet expectations, with candidates well aligned to company culture through a\ncollaboratively developed success profile.\nLew noted strong satisfaction overall, highlighting responsiveness and trust,\nwhile suggesting pricing could more closely reflect the long-term partnership\nand repeat business.\nWhat Went Well",
  "whatWentWell": [
    "Long-standing trusted relationship. Lew has relied on Korn Ferry repeatedly due to strong relationships and consistent delivery. \"In my previous role, I probably used Korn Ferry five times... in this role, this is the fifth time in three and a half years that we've used Korn Ferry\" \"They are great long-term partners in helping me secure talent\"",
    "Relationship-driven trust. The partnership is anchored in long-term personal connections and shared values. [In answer to why Korn Ferry are the preference] \"It's definitely a personal relationship with the people, I'm a relationship guy... I've had good results.\"",
    "Collaborative approach to defining success. Korn Ferry worked with the Lew to define what success looks like and align candidate profiles accordingly. \"one of the things we did initially with Andrea and David was build a profile of what success looks like in our company, and we [had] them do a profile of three or four people that we thought were a really great example...they've used that from a behavioural perspective to really try to line up the people they present to us in that in that fashion.\"",
    "Consistent candidate quality. Lew expressed complete satisfaction with both the quality and quantity of candidates presented. [In answer to 'have you been satisfied with both the quality and quantity of candidates that have come through in each of the different placements'] \"Yes, very much.\"",
    "Responsive communication. The team ensures regular updates and keeps senior stakeholders informed. \"Very, very responsive, very focused on keeping us in the loop and keeping us in the know.\"",
    "Value of expertise and network. \"the value they add is knowing us, but also bringing a network of people that are the best qualified\"",
    "Understanding of urgency and continuous improvement. Korn Ferry has adapted to Giving Home Health Care's pace and expectations with each engagement. \"In their fourth search, they picked up our sense of urgency... the grades have only gotten higher as we work together more.\"",
    "Use of assessments when relevant. Assessments are used selectively and viewed as a helpful complement to interviews. \"We have used their assessment... once or twice. They're fine... assessments can identify red flags.\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "While no significant challenges were identified, Lew shared a few minor reflections on how the partnership could evolve further.",
    "Pricing structure. While Lew sees strong value in the partnership, they suggested fees could better reflect the ongoing, repeat nature of the relationship. \"It's a pretty standard offering from a pricing perspective, we've negotiated a slight discount, but it is close to industry, and so we'll we just continue to move forward, although I think I deserve a lower fee.\"",
    "Follow-up visibility. Formal post-placement follow-up is not always visible to Lew, though ongoing contact through multiple searches provides indirect feedback. \"I'm not aware of them following back up with candidates, but because we have been in contact since either late 23 or early 24 in various [engagements]...they obviously always check on the people that they placed\" Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "• Fee structure could better reflect long-term loyalty and frequency of engagement • Limited visibility on structured follow-up with placed candidates • Broader awareness of Korn Ferry's non-search offerings (consulting, strategy) remains low Key Themes"
  ],
  "keyThemes": [
    "Enduring partnership and loyalty. The relationship spans roles and organisations, built on trust, responsiveness, and results.",
    "Korn Ferry is viewed as the first choice for executive hiring. Relationship-based collaboration. Strong personal connection and mutual understanding underpin the partnership, with clear cultural and behavioural alignment.",
    "Consistent delivery and adaptability. Korn Ferry has continued to refine responsiveness and urgency as the relationship matured.",
    "People as differentiator. Jane's relationships and network, not just brand reputation, are seen as the source of value and competitive edge. Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Maintain personalised, relationship-led model: preserve the trusted, relationship-driven dynamic as a core strength.",
    "Continue to nurture personal connections: sustain the informal, trusted rapport that underpins the partnership; small relational touches, such as invitations to Korn Ferry events, reinforce goodwill and client loyalty - Lew mentioned he was still waiting for an invite to go Pro AM on the Korn Ferry tour.",
    "Explore partnership-based pricing: consider recognising repeat client relationships with a preferred rate or loyalty structure.",
    "Clarify post-placement follow-up: make candidate follow-up activities more visible not only to demonstrate continuity but also to support long-term retention and growth of the relationship. Additional Insight"
  ],
  "additionalInsight": "While the Lew acknowledged Korn Ferry’s broader consulting and strategy\nservices, he associates them primarily search “In my mind they are great\nlong-term partners in helping me secure talent.”\nLew views Korn Ferry’s tools, technology, and pay benchmarking as\nexpected fundamentals of a leading search firm, rather than differentiators\nthat drive choice. [In answer to how much do you expect Korn Ferry as a\nleading consultancy and recruiter to have the tech, tools, benchmarks, and if\nit’s important to you] “It is [important] to me but that to me is table stakes –\nthey have to have that to be able to compete against other top-rated folks. I\nwould be much less interested in using them if I didn’t think those were\nthere”"
}