{
  "id": "t-027",
  "client": "Michael Citro",
  "interviewDate": "2025-10-29",
  "project": "Executive Search",
  "score": 9,
  "overview": "Michael, Vice President and Chief of Staff at University of Pennsylvania, has\npartnered with Korn Ferry on three executive searches over the past four\nyears. Korn Ferry first came onto Michael’s radar through recommendation\nand reputation, with Peter recognised for his expertise, agility and\nunderstanding of higher education. Peter remains Michael’s main point of\ncontact, maintaining regular check-ins between searches and acting as a\nconsistent link across engagements.\nEngagements have been described as positive with Korn Ferry\ndemonstrating strong understanding of the University of Pennsylvania and\nits context, notably in a complex government relations search that required\ndiplomacy and careful stakeholder management. The continuity of team\nmembers, including the addition of a consultant familiar with University of\nPennsylvania from a previous search, strengthened communication and\nensured a seamless process. Across searches, the team was described as\nadaptable, proactive, and highly responsive.\nMinor refinements were suggested around candidate-day logistics and the\nvalue of the KF4D assessment, but the overall experience was characterised\nby trust, open collaboration, and confidence in Korn Ferry’s partnership\napproach. Michael described Peter, Beth, and Sophie as consistently\nreliable partners, and noted that they would be the first people contacted for\nany future searches.\nWhat Went Well",
  "whatWentWell": [
    "Reputation and expertise. Korn Ferry was first engaged on the strength of Peter's reputation and deep understanding of higher education. His \"savvy and agility\" distinguished him from competitors and set the tone for future engagements. \"Reputationally, some folks said [I] should talk to Peter... right from the onset, it was clear he had some subject matter expertise, but also brought just a savvy and agility to understand higher education that was distinct.\"",
    "Continuity and adaptability. Korn Ferry readily accommodated Michael's request to retain a previous consultant. \"We were really impressed by Sophie...[we asked if] there [was] any way we could think about having her join the team [of the most recent search] because she knows the institution, she knows us...Korn Ferry said, 'Yeah, we'll make that work.' It served all of us really well - she could speak both Korn Ferry and Penn\"",
    "White-glove stakeholder management. Korn Ferry handled a sensitive government relations search with precision and care, providing timely updates and managing expectations effectively. \"It felt as though it was a level of white-glove service... within a few hours of me providing that referral, they were in touch, taking good care and managing expectations throughout. And we had some really challenging people, and as best I can tell, they did a phenomenal job with it, because 99% of the people are ultimately getting news that they don't want\"",
    "Collaborative calibration and partnership. Early-stage collaboration refined criteria and ensured alignment on candidate profiles, supported by healthy challenge and open dialogue. \"what I appreciated was that in the early stages, there was a lot of important calibration with the search team. [they presented] the first pool of candidates and teased out some questions to say 'candidate B didn't really seem to be of interest to you, was it X or Y? Are you looking more for Z on this' so we had to go through this process to calibrate what are we looking for.",
    "Once we got there, I think the quality was good [and] I think the quantity was appropriate. They did a nice job of managing that for us, and...I appreciated that they also pushed us 'is this what you really want' or 'because you're saying x and y, and we're giving you that, but it doesn't seem to be working.' It was healthy in that sense.\"",
    "Trusted, accessible relationship. Michael valued Korn Ferry's accessibility and open dialogue, citing frequent, informal interactions and genuine partnership. \"I was cooking dinner one night with my kids, on the phone with our search consultant really challenging a candidate and she was phenomenal in this most recent search. That level of relationship is key for these types of searches\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "While the overall engagement was highly positive, Michael noted two areas for refinement KF4D assessment tool. Michael described the assessment experience as neither negative nor positive but \"underwhelming\" in delivery. While it confirmed insights already observed in the process, it did not add significant value. \"I wasn't blown away, [and] I don't think our president was blown away by it. If given a choice, and if we were in cost containment mode, I would cut that [KF4D] and feel like we wouldn't lose anything.\"",
    "Candidate-day logistics. For all three recent searches, logistics for on- campus candidate visits were described as \"a bit clunky.\"",
    "Michael attributed this partly to internal processes but also to unclear coordination with the search team. \"I just think it could have been a little bit more seamless, I'm not exactly sure how we would have gotten there, but I think there's probably an opportunity in the search process to just sync with them a little bit better to say, 'what's the division of labour? Who's going to do what? How are we going to do this', rather than a lot of like back and forth [of] emails.\" Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "• Clarify ownership and coordination for candidate-day logistics to avoid duplication and streamline planning • Reassess the use and delivery of KF4D assessments to ensure they contribute clear, demonstrable value aligned to the client Key Themes"
  ],
  "keyThemes": [
    "Reputation-led trust and expertise. Korn Ferry's initial engagement was driven by professional recommendation and sustained through proven subject-matter understanding and credibility.",
    "Consistent collaboration across teams. Continuity in consultants and cross-team familiarity enhanced efficiency and strengthened partnership.",
    "Proactive stakeholder management. The team demonstrated calm, coordinated handling of complex external relationships, supporting the University of Pennsylvania's reputation and internal processes.",
    "Collaborative calibration and constructive challenge. Korn Ferry's willingness to question assumptions and refine criteria in partnership with Michael was viewed as a key strength.",
    "Relationship-based partnership. Responsiveness, accessibility, and openness, built trust and reinforced Korn Ferry's position as a reliable, long- term partner. Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Sustain proactive partnership. Continue engagement between searches to reinforce the trusted relationship and ensure readiness for future needs.",
    "Preserve consultant familiarity. Retain, where possible and appropriate, team members who have worked with the University of Pennsylvania before to maintain institutional understanding, partnership and efficiency across searches.",
    "Clarify coordination and ownership. Confirm roles and responsibilities early in the process to streamline candidate-day logistics and ensure smooth on-site experiences.",
    "Revisit assessment approach. Consider how KF4D and similar tools could add clearer value in future searches. For example, by tailoring delivery or focusing insights where they complement existing evaluation methods. Additional Insight"
  ],
  "additionalInsight": "Michael noted that the two most important qualities in a search partner are\nnetwork strength and true partnership - the ability to act as a trusted adviser\nwho can both challenge and support. Accessibility, open communication, and\nunderstanding of context were seen as essential to success."
}