{
  "id": "t-029",
  "client": "Michael De Lucca",
  "interviewDate": "2025-10-30",
  "project": "Executive Search",
  "score": 10,
  "overview": "Michael, Chair of OneBlood, approached Jena directly to lead their CEO\nsearch following a highly positive experience seven years earlier when she\nled a previous search for the organisation. That earlier search produced\nthree outstanding finalists, each fully capable of leading OneBlood.\nFor the latest engagement, Michael described the experience as “fantastic,”\npraising Jena’s healthcare expertise, transparent communication and\nstructured, efficient process. The search concluded successfully with the\nappointment of a new CEO starting mid-November, with Michael summing it\nup as “a great team, a great process, and a great outcome,” adding that\n“they figured out their magic” and confirming they would “pick [Jena] again in\na second.”\nWhat Went Well",
  "whatWentWell": [
    "Exceptional overall experience. Michael described the search as smooth, well-paced, and perfectly aligned to their working style, noting that \"everything moved\" and the process \"worked out perfectly for us.\"",
    "High-quality shortlists across both searches. In the previous search, Jena delivered \"three leaders, and any one of the three could have run the organisation.\" In the current CEO search, the team shortlisted four finalists, completing the process successfully with the selected candidate starting in November.",
    "Sector expertise and transparent leadership. Michael highlighted Jena's deep understanding of healthcare sector: \"She understands the healthcare business extremely well and she's really buttoned up on this.\"",
    "Comprehensive process and collaboration. The search was described as structured and efficient: \"We set up a timeline... we were on a schedule, we did Zoom calls, everything moved.\"",
    "Jena's communication and leadership style closely matched Michael's own: \"I'm a real A-type personality, so she fit in perfectly with my style.\"",
    "Active involvement in compensation and negotiation. Korn Ferry and Jena supported the board through compensation discussions and planning. \"She was very good at being involved in all those conversations [comp negotiations], including how much we're going to pay for housing and health insurance benefits etc\"",
    "Inclusive approach using tools for feedback. Korn Ferry's tools were valued for enabling full board participation. \"The value is you're getting input from an entire board. It's a great way to get feedback...I didn't want to pick the person myself; I wanted everybody to pick. We just wanted to line it up and the tools help understand the skill set, credentials, understanding of the business...It's a good way to get everybody to offer feedback and input into the process.\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "This was a wholly positive engagement. Michael stated there was nothing they would change: \"I don't think anything I would want different... they figured out their magic.\" Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "No explicit gaps were mentioned; overall satisfaction was exceptionally high. Key Themes"
  ],
  "keyThemes": [
    "Consistent excellence and repeat trust. Strong historic performance and continuity built lasting confidence in both Jena and Korn Ferry.",
    "Deep healthcare and market expertise. Understanding of healthcare dynamics and business challenges was seen as a major differentiator.",
    "Collaborative, transparent process. Clear communication, board alignment, and a well-managed timeline created a seamless experience.",
    "Inclusive stakeholder engagement. Tools and structure ensured board- wide input, contributing to a shared and confident decision. Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Maintain trusted client partnership. Continue nurturing the relationship with OneBlood through Jena's leadership, ensuring consistent service, responsiveness, and outcomes that reinforce trust.",
    "Capture and replicate best-practice process. Use this assignment as a model for future healthcare leadership searches - particularly the transparent communication, structured timeline, and strong negotiation support that Michael praised. Additional Insight"
  ],
  "additionalInsight": "Michael compared Korn Ferry favourably with other recruiters, describing\nthem as operating at a “higher level” and using “tools with a higher skill set.”\nJena was viewed as central to the relationship: “She was the linchpin…\nwhen something works for you, you stick with it. I’ve recommended her to\nother people that I know.”\nMichael confirmed this is the only service they currently use Korn Ferry for\nand confirmed he would immediately re-engage Jena for any future CEO\nsearch."
}