{
  "id": "t-025",
  "client": "Matthew Hussein",
  "interviewDate": "2025-10-27",
  "project": "Consulting",
  "score": 10,
  "overview": "Matthew, part of the People Experience team at Ferrero and responsible for\ntheir global engagement survey, engaged Korn Ferry 18 months ago through\na tender to transition from a previous engagement model to a new strategy\nfor measuring employee sentiment using the Trix platform.\nKorn Ferry was selected for its flexibility, pragmatic proposal, and ability to\nunderstand the organisation’s challenges, as well as its global scope -\ncritical for the worldwide rollout. The decision also built on prior positive\nexperience: Korn Ferry had already supported Ferrero on 360 feedback and\npay grading, and Matthew had previously worked with the firm in an earlier\nrole.\nThe collaboration was described as “exceeding expectations from the start.”\nMatthew praised the team’s expertise, reassurance, and proactivity,\nhighlighting Ben’s leadership and Neil’s “brilliant” contribution. He also\nremarked that it was “probably the best experience I’ve had with\nconsultants.”\nMinor feedback related to the communication style of a project manager,\nwhose approach felt more risk-focused compared with a colleague’s\nsupportive tone and positive outlook. Overall, the project was delivered\nseamlessly, and Korn Ferry continues to partner with Ferrero on the next\nphase of employee lifecycle measurement, reflecting a strong and ongoing\nrelationship.\nWhat Went Well",
  "whatWentWell": [
    "Flexibility and partnership approach. Korn Ferry's adaptable, pragmatic style allowed the project to evolve smoothly and reflected a genuine long- term partnership mindset. \"it really felt like they wanted to create a really strong partnership with us for the long term, rather than just engaging them on this finite piece of work where they deliver and that's it, [they] go off\" \"Their proposal was very pragmatic and cost effective unlike some of the other [companies]. They were much more flexible they understood that it was a piece of work that wasn't necessarily able to map out A to B to C to D. It was a discussion about where we want to get to. They built in an element of flexibility that allowed us to say 'if we don't go down this path, maybe we could reallocate some of the time that we have on to this other part.' So, this was one of the key reasons that we selected them as well as their global scope.\"",
    "Established trust and familiarity. The engagement was built on proven experience, both internally and from the Matthew's previous organisation. \"They've supported our business in other elements, we've used them for 360 and they work with us on pay grading. It was an internal recommendation. When we were looking for candidates who may be useful for us, we were put in contact with Ben, who's the contract lead, and then the discussions followed. There we went through a formal tender process, so we they were included with, I think, three or four other candidates, but they were selected as the best fit for.\" \"in previous companies we'd worked with Korn Ferry in terms of engagement surveys, so [have] always [had] them in the background, in my mind\"",
    "Exceeded expectations and proactive from the start. Matthew repeatedly noted that Korn Ferry exceeded expectations praising the team's responsiveness, willingness to invest time upfront, and proactive approach to collaboration. \"Even when we started initial conversations...they invested time with us to be a sounding board to discuss ideas - not necessarily selling to us, but just giving us some good basis to start to collect our thoughts in terms of what they delivered\" \"Ben and his team have been really, really, really proactive as well, something else that we appreciate...they've always been really proactive in suggesting 'maybe we need to do a meeting with your senior leaders. I'd really love to be involved in that. If I can get involved with the training, that would be great.' So Neil, our lead consultant, was brilliant.\" \"they tend to be more proactive in understanding or anticipating what we need and proposing and just getting on and doing it...they understand the bigger picture\"",
    "Expertise, reassurance, and value. The team's knowledge and professionalism created confidence throughout the project. Matthew described Neil as \"brilliant\" and highlighted the team's calm, composed manner. \"Everyone who's interacted with the guys at Korn Ferry have been really, really impressed with the value that they that they give us.\" \"the style of Ben and his team is very reassuring, sitting with them you know that they're the experts.",
    "There's no panic. There's no worry. They know everything that they need to do and we need to do so honestly, no complaints at all about the level of expertise and the service that they provided.\" \"they have added a lot of value for us.\" \"every person who has dealt with Korn Ferry, or the team that we've worked with in Korn Ferry has been massively impressed by their expertise and their knowledge and the support they've given us.\"",
    "Seamless delivery. The project ran seamlessly, meeting the target launch date with no setbacks. \"We had a date in mind that we wanted to launch. We hit that date... we didn't really experience any hiccups.\"",
    "Positive comparison to larger consultancies. Korn Ferry's hands-on, efficient model was seen as more valuable and effective than that of larger consulting firms. \"probably the best experience I've had with consultants...with Accenture, we've got a team of eight people on a call, seven of whom are silent, and one of them is talking, and we're spending a lot of money not really discussing or achieving very much. But with Korn Ferry, every interaction is... reassuring...you know they're the experts.\" \"[Korn Ferry are] very hands on, very, very practical, good balance of both the strategic side and supporting us technically and what we needed to do...with some of the other consultants...we need to prescribe to them exactly what we want before they will deliver a piece of work. [It's] the opposite with Korn Ferry they tend to be more proactive in understanding or anticipating what we need and proposing and just getting on and doing it\"",
    "Strong stakeholder confidence and positive experience. Every stakeholder who interacted with Korn Ferry shared positive feedback. \"everyone's impression was these guys understand us. They know what they're talking about. They're offering some expertise.\" \"we couldn't have done it without them. Their expertise and their support was invaluable throughout the whole process\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "The experience was overwhelmingly positive, with only one minor area of feedback. Tone and communication style. One project manager's focus on risks and potential issues sometimes came across as overly negative, creating unnecessary concern within the team. When another project manager provided cover during leave, Matthew noted a more balanced, reassuring tone that felt more constructive and confidence-building. \"Her style in engaging with us as a team was one that would focus on the risks and the negatives of 'if you don't do this, then you're not going to meet the deadline.' And her delivery to some of the people in our team struck a lot of fear, whereas experience with another project manager when she was off leave was very much one of supporting, reassuring – 'you've done most of the things you need to focus on this.' So, it was just the style...as I said, her contribution to the project was perfect, she knows her stuff, she's an expert. It was just in a particular meeting with my manager, it kind of struck fear about how this was all going to go wrong, rather than focusing on how we were going to succeed and how it was going to go right.\" Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "Variation in communication tone. Differences in delivery style affected how feedback was received; a more positive, reassuring tone was better received by the team. Key Themes"
  ],
  "keyThemes": [
    "Exceptional value and delivery excellence: the project delivered visible value from start to finish, balancing strategic input with flawless execution and clear stakeholder confidence.",
    "Expertise and reassurance: Ben's leadership and Neil's hands-on expertise created calm assurance and trust at every stage.",
    "Flexible and proactive partnership: Korn Ferry adapted quickly to evolving needs, anticipating challenges and offering ideas beyond scope while maintaining a clear, collaborative focus on long-term partnership.",
    "Positive contrast with larger consultancies: Korn Ferry's lean, focused approach was viewed as more effective and efficient than other large firms. Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Maintain partnership momentum: continue collaboration into the next phase of employee lifecycle measurement, reinforcing Korn Ferry's trusted partnership role.",
    "Encourage positive framing in communication: ensure project managers maintain a balanced, solution-oriented outlook that reinforces confidence.",
    "Strengthen partnership around evolving people priorities: build on the strong relationship by aligning future engagement and measurement work to Ferrero's changing culture and people needs, keeping Korn Ferry relevant and valued as those priorities develop. Additional Insight"
  ],
  "additionalInsight": "Beyond this project, Ferrero faces a cultural integration challenge as it grows\nthrough acquisition. The engagement survey is seen as instrumental in\nhelping the business understand and unify employee sentiment across\ndifferent legacies. “we've doubled the number of employees within the last\n10 years. 50% of our employees didn't start their journey in Ferrero, they\nwere acquired by Ferrero…we can't necessarily rely on people's love for the\ncompany and their loyalty, because the general population of employees is a\nbig mix of people that have come from lots of different backgrounds.”"
}