{
  "id": "t-021",
  "client": "Fiona Motley",
  "interviewDate": "Executive Search",
  "project": "15.10.25",
  "score": 9,
  "overview": "Fiona, a member of the Executive Search team at NatWest, has worked with\nKorn Ferry on multiple searches since joining 17 months ago. Fiona\npreviously worked at Korn Ferry, which is a long-standing supplier to\nNatWest, with the relationship spanning several years.\nKorn Ferry sits on a preferred suppliers list of 26 executive search partners,\nseven of which are used by NatWest regularly. Korn Ferry is often appointed\ndirectly or recommended by hiring managers based on previous success,\nthough competitive pitches have become more frequent to support balanced\nsupplier selection and reduce internal risk. Despite this, Korn Ferry\nmaintains a strong track record and trusted reputation within NatWest.\nThe relationship is described as a true partnership - responsive,\ncollaborative, and consistent. Communication was repeatedly praised as\nstand-out, with the team ensuring Fiona is always in the loop. The end-to-\nend process was viewed as thorough and well-managed, with consultants\nrecognised for being proactive, informed, and committed to successful\noutcomes.\nWhat Went Well",
  "whatWentWell": [
    "Established and trusted partnership. The relationship was described as collaborative, responsive, and based on mutual understanding. \"it really has felt [like] a true partnership.",
    "It's always very apparent how important a client we are to Korn Ferry. They've always proven to be incredibly thorough, really knowing the market... They're always available, and they're agile enough to sort of pivot to whatever we need.\"",
    "Consistent and proactive communication. Regular check-ins and clear updates ensured full visibility across all projects. \"communication is always absolutely stand out...we are in regular communication with Hilary and the team on the project, so we never feel blindsided. We always feel that even if they're having discussions and meetings with key stakeholders that we're not privy to, that they will always update us and keep us in the loop.\" \"They check things with us before they move forward...it's a constant flow of communication. And always dialog going on.\"",
    "Comprehensive end-to-end delivery. \"They partner very well with us... not all search firms are as adept and thorough in doing all of those aspects [building out the job description, identifying the skills and person needed, compensation and negotiation at the end]\"",
    "Strong team performance and continuity. Multiple consultants were recognised for high standards and reliability. \"it hasn't just been one or two individuals, it has been a number of people, number of partners and consultants from Korn Ferry that I've partnered with, and it really has felt a true partnership.\" \"[I] felt that Hilary and Samira got what we were looking for...we gained a better service when [they] were involved\" \"other individuals to call out would be Toby...who I've partnered with on a couple of projects. And again...very, very impressive.\" \"Anthony...did a very high-profile finance role...and again, he was brilliant to partner with\"",
    "Assessment and insight quality. \"all of our successful, and sometimes the final two candidates, are assessed by Korn Ferry...that's always utilised very well...we get a great richness of data from that...not necessarily to determine whether or not the person will be offered the role, but quite often [we use it as] a development tool for when they land.\"",
    "Value-added insights and responsiveness. \"sometimes we might be asked to find insights on something specific...and they will always go out and come back with information for us...[for previous asks they have pulled a] whole array of information together for me, which was incredibly helpful...went above and beyond...came back to us with that really quickly.\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "Single communication lapse. One isolated instance was noted where an update was missed, though it was immediately resolved. \"I've just had one occasion where I was blindsided. But Hilary picked up the phone straight away and was so hugely apologetic that I almost don't feel I need to call it out, because it was truly a one off. And as I said earlier, they truly do keep [you in] the loop.\"",
    "Continuity across teams. In one HR search, Fiona felt delivery was stronger when long-standing consultants familiar with NatWest remained involved alongside functional leads. \"we've recently been doing some work within the HR function...the head of the HR practice was involved in the project. There was nothing negative about their engagement and interaction, but we just felt that Hilary and Samira got what we were looking for...they ended up being more involved and taking the lead...we felt that we gained a better service when [they] were involved.\" Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "Continuity and consistency across engagements. The value of maintaining involvement of consultants with established relationships to preserve cultural understanding and delivery consistency. Key Themes"
  ],
  "keyThemes": [
    "Established and trusted partnership. A long-standing relationship built on responsiveness, reliability, and understanding.",
    "Fiona described a genuine partnership where Korn Ferry consistently delivers and adapts to needs. Consistent communication and transparency. Regular updates, clear reporting, and proactive check-ins ensure stakeholders are always informed and confident in progress.",
    "Comprehensive and collaborative delivery. The team manages the full process end-to-end, from defining briefs to securing offers, with a depth of involvement that distinguishes them from other firms.",
    "Continuity of key consultants. Strong relationships with long-standing consultants are seen as central to maintaining cultural understanding and consistent quality across searches.",
    "Value-added partnership. Beyond active engagements, Korn Ferry provides benchmarking, market data, and assessment insights that are valued as practical and timely support. Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Maintain partnership-led delivery. Continue the collaborative, responsive and \"above and beyond\" approach that reinforces trust and ensures consistent outcomes.",
    "Ensure consistent approach across business areas. Embed shared behaviours, ways of working and shared client knowledge so delivery remains seamless, even when consultants are less familiar the client.",
    "Sustain communication availability and consistency. Maintain regular updates and proactive stakeholder engagement to preserve the \"never blindsided\" client experience."
  ],
  "additionalInsight": ""
}