{
  "id": "t-024",
  "client": "Jen Anderson",
  "interviewDate": "2025-10-27",
  "project": "Executive Search",
  "score": 9,
  "overview": "Jen leads Strategy, M&A and ESG at Generac. Whilst never placed by, Jen\nhad previously been approached by Korn Ferry about roles. She chose to re-\nengage the firm directly – contacting a recruiter she knew best to support\ntwo hires: a Senior Director of Corporate Development and a Director of\nSustainability.\nShe opted not to approach other firms, selecting Korn Ferry based on\ntrusted relationships and prior positive experience. The two searches were\nmanaged by different teams and delivered distinct experiences: the M&A\nsearch met expectations fully, producing strong candidates and a structured,\nprofessional process; the ESG search was active and engaged but\nultimately did not result in a hire due to misalignment between\ncompensation, market conditions, and role seniority.\nOverall, Jen described Korn Ferry as a valued, relationship-led partner. She\npraised the consultants’ professionalism, responsiveness, and ability to\nmake complex searches straightforward, while highlighting opportunities for\ncloser alignment and consistency across practices.\nWhat Went Well",
  "whatWentWell": [
    "Relationship-led engagement. The decision to engage Korn Ferry stemmed from positive past interactions and trusted recruiter relationships. \"because of that historic relationship [with Korn Ferry] where I got to know some of the recruiters and enjoyed the experience, I called one of their recruiters who I knew best in order to engage the firm to help me with two specific roles that I needed to place people\"",
    "Structured, high-quality & successful M&A process. The M&A team delivered a formal, well-organised process and successful delivery. \"The corporate development experience was exactly as I would have expected and very, very good...we did place somebody and they're working out great, it's been a great experience\" \"The M&A team had a PowerPoint that was given each week that had profiles of every candidate that were included and a tracker so you could reference it later with all the details in there.\"",
    "Strong candidate quality and preparation. The M&A team delivered a high-calibre slate and provided clear groundwork for smooth internal decision-making. \"They were able to find a number of qualified candidates... they did a really good job.\" \"they provided background, and a lot of the level setting and positioning that made it an easy process for our team to come in...they laid all the groundwork.\"",
    "Active ESG engagement. Although the ESG search did not conclude successfully, the client acknowledged that the Korn Ferry team were diligent and highly engaged. \"I thought [they were a] very skilled team and were actively searching and brining candidates.\"",
    "Consistent communication. \"We [met] weekly for both projects, weekly meetings in order to update myself as well as other constituents that were helping with the process. There were email updates...and then if we were bringing somebody in, there were prep packages.\"",
    "Relationship manager support. Jen valued the additional continuity provided by a finance recruiter who acted informally as a client relationship manager across both projects. \"She kind of shepherded the processes to make sure things were going well... if I needed an outside person...that was a very helpful resource to be able to use outside of the actual search...that was really beneficial for me in that moment...she's been a great resource to me\"",
    "Broader value beyond search. Korn Ferry has delivered additional value through organisational and people-focused projects, building credibility beyond recruitment. \"We used them last year for our spans and layers exercise, our culture assessment... I think we've used them for a few other HR related projects.\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "The primary challenge related to the ESG search, which was paused after it became clear that expectations and market realities were misaligned. The client acknowledged that internal constraints contributed but also noted that Korn Ferry could have highlighted the issue more strongly at the outset.",
    "Despite this, the client emphasised that the team were very capable and committed throughout. Expectation-setting and compensation alignment. [in answer to why the ESG role didn't move forward] \"not being able to find the right candidate but partly because of our compensation levels with regards to the role – a mismatch upfront with expectation versus compensation level, and where we thought the market was for the ability to get somebody at that level relative to the compensation we had available.\"",
    "Early challenge not fully surfaced. \"They [Korn Ferry] probably didn't flag it [compensation misalignment] as much as we realistically needed... it was a mismatch upfront with expectation versus compensation.\"",
    "Candidate level and cultural fit. \"We ended up getting quite junior people for a director-level role... [that wasn't] going to work for our organisation\" Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "• Variation in experience and delivery style between teams • Limited early flagging of misalignment to manage expectations • Opportunity to strengthen continuity through proactive communication and follow-up when roles remain open or paused Key Themes"
  ],
  "keyThemes": [
    "Trusted, relationship-driven engagement. Collaboration was built on familiarity, trust, and confidence in Korn Ferry's people, which continues to underpin the relationship.",
    "Structured excellence in M&A. The M&A team set a benchmark for process discipline and quality of delivery.",
    "Consistency across practices. Differences in approach between functional teams highlight an opportunity to ensure a unified client experience.",
    "Clarity and managing expectations upfront. Early discussion of compensation, level and feasibility is critical.",
    "People-centred expertise. Jen values Korn Ferry's broader strength in people-related engagements, having engaged them for culture and organisational projects beyond executive search. Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Maintain and build on partnership value: nurture the trusted, relationship- led dynamic that the client clearly appreciates, ensuring ongoing visibility and collaboration.",
    "Stay proactively connected post-search: share potential candidates for paused or future roles to reinforce partnership and continuity.",
    "Re-engage on upcoming opportunity: Generac plans to open a second Senior Director role next year; maintain visibility to support that hire.",
    "Preserve relationship model: continue leveraging the trusted recruiter as a relationship anchor for future work.",
    "Discuss expectations early: align on compensation, role level and market availability from the start of each engagement.",
    "Standardise experience across teams: share best practices across functions for a cohesive client experience. Additional Insight"
  ],
  "additionalInsight": "While aware of Korn Ferry’s assessment and benchmarking tools, she\nconsidered them optional for these specific roles. “I was aware there were\ntools that could have been used, but it wasn’t something we spent a lot of\ntime [talking] about…if I were hiring more people, I would have probably\nengaged in [it, but] for an individual role my team is so small it probably\nwasn't as an effective of a thing to do”\nJen also reflected on how AI and automation are changing her team’s\nstructure. “We're using some more intelligent solutions to cover some of the\nbase work, and so we can upskill the team levels. And same for the ESG\nwork, we're driving automation and some machine learning to do a lot of the\nwork we had initially thought we would do with people…[it’s] driving [a need\nfor] higher level people to be able to analyse, actually ensure that it's being\ndone right, and then [ensuring] we're driving the correct conclusions out of\nall the data, because you can grab a lot of data, but what do you do with it?”"
}