{
  "id": "t-033",
  "client": "Paul Lester",
  "interviewDate": "2025-11-13",
  "project": "ES",
  "score": 9,
  "overview": "Paul is an experienced Chair, who has worked with Korn Ferry for many\nyears - both as a client and as a candidate. His relationship spans public\ncompanies, private equity, and multiple sectors. He engaged Korn Ferry\nmost recently for CEO and CFO searches at Hudson Advisors, where he\nbecame Chair after Korn Ferry placed him.\nHe typically selects Korn Ferry based on longstanding relationships and the\ntrust and familiarity he has with individual consultants like Giles, Simon, Neil,\nor Eleanor. He reports predominantly positive experiences across scoping,\ncommunication, and candidate quality, with one consistent operational\nchallenge around the timing of materials ahead of meetings.\nWhat Went Well",
  "whatWentWell": [
    "Strong long-term relationship and trust. Paul emphasised familiarity and rapport as a primary reason for choosing Korn Ferry: \"I tend to go to Korn Ferry because I actually like the people... they know me, I haven't got to be on my best behaviour when I talk.\"",
    "Positive experience as both candidate and client. Paul's history includes being placed into multiple Chair/CEO roles: \"They've placed me at least two, if not three times... and Korn Ferry probably three or four times.\" This dual- sided experience reinforces his confidence and comfort in working with them. Effective role scoping and understanding of business context.",
    "Paul described a collaborative approach: \"You tell them I want a new CEO... you explain what the business needs... they do 75% of it and ask you enough questions to build that up.\" He noted they connect the dots well and create useful role profiles. Responsive communication and accessibility.",
    "Particularly highlighted Alan: \"Alan in particular is very good to send little updates... they were definitely accessible.\"",
    "Candidate quality and ability to search niche markets. Despite a challenging assignment: \"They did think outside the box... we ended up with a house builder and a good one, I hope.\"",
    "Appreciated their sector knowledge and specialist consultants. Perceived strength in team-based delivery.",
    "Compared positively vs. other firms: \"I always feel with Korn Ferry there's more people on the job... three or four people involved.\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "Late delivery of candidate packs ahead of meetings. This was the only concrete operational criticism and mentioned several times: \"They would always send the book out usually in the morning, two hours before the meeting.\", \"You just haven't got time to look at it.\", \"Even ten minutes before... it labours out the meeting.\"",
    "Paul felt this reduced meeting efficiency and limited his ability to pre-read and prepare. Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "Need for earlier distribution of materials. Paul explicitly stated this would materially improve the process: \"It would be really good to get that the night before... it would speed up the meeting.\"",
    "Limited awareness of assessment capability. Paul was unaware Korn Ferry had assessment offerings: \"I didn't know they had an assessment.\"",
    "Desire for more proactive promotion of non-search offerings. Particularly around organisation consulting: \"They wouldn't register in my head because they've never pushed it...Their practices need a bit more joined up thinking.\" Key Themes"
  ],
  "keyThemes": [
    "1. Relationship and familiarity drive selection Long-term trust, comfort, and personal rapport with individual consultants were central. \"I like the people... I get on with them.\" 2. Value derived from both personal network and research capability Paul appreciated their knowledge of sectors he knows well - and their ability to surface candidates he doesn't know in broader markets. 3.",
    "Clear operational friction around meeting preparation Late document delivery was the only repeated issue. 4. Limited exposure to wider Korn Ferry services Paul only associates Korn Ferry with search and does not naturally consider them for consulting. 5.",
    "Positive view of team-based model Paul sees multi-consultant involvement as a differentiator versus competitors. Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Enhance timeliness of information sharing Ensure candidate materials are provided with enough lead time for client review, supporting more efficient and productive discussions. Increase awareness of assessment offerings Ensure clients understand when and how assessment tools can support senior hiring. Strengthen visibility of broader solutions Proactively explain non-search services (organisation consulting, leadership advisory) to Chairs and Boards who may not recognise Korn Ferry's full offering. Enhance internal coordination across practices Present a more unified cross-practice approach to avoid being seen as siloed.",
    "Continue emphasising team-based delivery The multi-consultant model is perceived positively and should be maintained. Additional Insight"
  ],
  "additionalInsight": "Sector dynamics: limited mobility in housebuilding\nPaul noted a niche candidate pool, low churn, and difficulty attracting senior\ntalent: “It’s a very specific market… people don’t change jobs that often.”\nClient’s approach to chair/CEO roles\nPaul relies heavily on search partners for both black-book intelligence and\nobjective external referencing.\nViews on market pricing\nPaul perceives all major search firms as priced similarly: “You could throw a\nsmall blanket over Russell Reynolds, EgonZander and Hodges… they’ve all\ngot the same formula.”\nEngagement appetite for networking events\nPaul attends Korn Ferry peer events and sees value in selective, occasional\nparticipation."
}