{
  "id": "t-030",
  "client": "Matthias Hug",
  "interviewDate": "2025-10-30",
  "project": "Professional Search",
  "score": 10,
  "overview": "Matthias, Managing Partner at Format, engaged Korn Ferry for the first time\nto appoint a suitable professional to build its business in central Switzerland.\nKorn Ferry and Sasha were recommended by a board member who knew\nSasha personally prior to joining Korn Ferry. The decision was based more\non the individual’s reputation than on the organisation, though Korn Ferry is\nrecognised for its strong standing in Switzerland.\nThe assignment was considered challenging due to its specialist nature and\nlocation. Two other firms declined the brief, but Sasha accepted and\nsuccessfully identified a strong shortlist. Matthias described the process as\ntransparent, pragmatic, and efficient, with clear communication and good\ncollaboration throughout – he highlighted they were “very happy” with the\noutcome, noting that Sasha and “the team did a very good job.” Korn Ferry\nhas already been re-engaged for a subsequent mandate, reflecting trust and\nsatisfaction with the experience.\nWhat Went Well",
  "whatWentWell": [
    "Commitment to a challenging brief. Korn Ferry was the only firm to accept the assignment, taking on a difficult search with determination and realism. \"we did ask three search firms whether they would be interested, and the two others declined. They said 'it's a tough mandate, we don't have sufficient contacts in the in the area.' Sasha was willing to go for the challenge, it proved not easy, but he came up with good candidates, some of them very good candidates...[one of which] signed with us\"",
    "Clear, efficient communication. Regular bi-weekly updates suited Format's style and workload. [in answer to 'did Korn Ferry meet expectations in terms of keeping you in the loop of progress made'] \"yes, absolutely...we didn't want to have too frequent updates...I think [we had] bi-weekly calls with updates and obviously in-between, interactions with candidates, phone calls, interviews etc, so that was perfectly fine\"",
    "Transparency and honesty. Sasha was open about candidate quality and potential limitations. \"He even said, 'This is not the strongest, but I want to show you the candidate and you decide.'\"",
    "Balanced and realistic approach. Sasha managed a complex brief pragmatically, balancing progress with realism and maintaining alignment with Matthias' preference for quality and fit over pace. \"we've said from the beginning, our focus is on the quality. We want the right person rather a bit later than a less suitable person faster. And [Sasha] acted accordingly\"",
    "Responsiveness and accessibility. Matthias highlighted strong availability and quick responses especially during the final stages. \"the interaction was fast whenever [there was] news or, when we were in the final phase, fighting for the candidate, [they] returned calls immediately [and were] accessible.\"",
    "Effective positioning of compensation model. Sasha helped Format present its performance-based pay model persuasively. \"He had to clearly sell ourselves in an appropriate way... I have no indication that he didn't do that in a very appropriate manner\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "No specific challenges were identified. Sasha acknowledged the search was inherently demanding due to a limited candidate pool, but viewed Korn Ferry's handling of these constraints as pragmatic and transparent. Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "No gaps were raised. Key Themes"
  ],
  "keyThemes": [
    "Reputation and trust. Korn Ferry's strong market reputation and Sasha's personal credibility underpinned the engagement.",
    "Transparency and integrity. Open communication and candid feedback built confidence throughout.",
    "Quality-focused partnership. The process balanced realism with persistence to achieve a strong result.",
    "Commitment and responsiveness. Taking on a difficult search and remaining highly accessible reinforced trust. Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Maintain transparent communication: continue the open dialogue that Matthias valued, including frank discussion of candidate strengths and risks.",
    "Sustain accessibility and responsiveness: preserve the quick communication and follow-through that defined this engagement.",
    "Extend awareness of broader expertise: where appropriate, proactively link Korn Ferry's relevant wider capabilities to Format's ongoing people and organisational priorities to drive future opportunities. Additional Insight"
  ],
  "additionalInsight": "Format operates a distinctive compensation model - lower fixed base with\nhigher performance-linked bonuses, which Sasha helped to position\neffectively during negotiations.\nWhile Korn Ferry offered additional assessment options, Matthias chose not\nto use them, noting that the differences between candidates was already\nclear and further testing would not have altered the outcome.\nMatthias reiterated that honesty, openness, and realism are the most\nimportant qualities in a search partner, alongside delivering a credible\nshortlist within a reasonable timeframe."
}