{
  "id": "t-035",
  "client": "Felix Roth",
  "interviewDate": "2025-11-25",
  "project": "Consulting",
  "score": 7,
  "overview": "Felix is the Compensation & Benefits Director at Metro, responsible for\nglobal compensation frameworks, expat policies, executive rewards, and\nsetting group-wide compensation guidelines. They engaged Korn Ferry for\nits job evaluation methodology and market data, having selected them over\nother large firms based on colleague familiarity with the system and its\nglobal use.\nOverall, the methodology itself is viewed as workable, and the relationship\nwith the Korn Ferry team has been positive - with strong responsiveness and\na good working rapport. However, aspects of the engagement were made\ndifficult by internal project changes, which Felix acknowledged were driven\nby Metro’s own shifting plans rather than by Korn Ferry.\nSome limitations were noted with the market data outputs, particularly\nrelating to how bonus-paying versus non-bonus-paying companies are\nshown in benchmarking. Felix also expressed a desire for more modern or\ninteractive training and tools. They would consider using Korn Ferry again\ndepending on context.\nWhat Went Well",
  "whatWentWell": [
    "Positive working relationship and responsiveness. Felix described strong rapport and trust with the Korn Ferry team. \"With the colleagues of the team... I get very well... they are very responsive, and I don't have feelings that... you cannot trust them.\"",
    "Methodology broadly acceptable and workable. The job evaluation approach itself is considered functional for most use cases. \"Grading methodology is fine for me, so it's okay. You can deal with it.\"",
    "Team met expectations despite changing internal requirements. Korn Ferry continued to support the project even as Metro substantially altered scope and responsibilities. \"We changed the project goals many times... it was very, very complicated to Korn Ferry... I cannot say something bad... it was more our chaotic project style.\"",
    "Contact praised for service quality. One individual was singled out for highly responsive and up-to-date delivery. \"My contact... I [find] extremely responsive and very up to date on the point.\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "Benchmarking outputs lacked specific filters Felix needed. Felix found limitations in how market data could differentiate companies that pay bonuses from those that don't. \"I miss... very specific aspects... I cannot say I don't want to see only companies who pay a bonus... sometimes I'm not happy with this kind of data submission.\"",
    "Difficulty benchmarking roles with functional vs hierarchical leadership. Certain organisational structures were harder to reflect within the methodology. \"Many people have functional leadership roles in comparison with hierarchical... can be difficult.\"",
    "No suitable or affordable grading tool provided. Felix created their own tool due to dissatisfaction with available options. \"I've also created a grading tool by ourselves, because they don't provide one which is very useful or not too expensive.\"",
    "Desire for more modern or interactive training. Felix felt the learning materials could be more contemporary or engaging. \"I would wish to have something like more interactive... a nice movie and e-learning would also be helpful... could be a bit more modern.\" Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "Ability to filter market data by bonus-paying vs non-bonus-paying companies, described as a significant gap for accurate benchmarking.",
    "More modern and accessible training formats, e-learning or multimedia preferred. Availability of a practical, cost-effective grading tool, currently missing.",
    "Methodological limitations for project organisations and mixed reporting structures. Key Themes"
  ],
  "keyThemes": [
    "Methodology is acceptable, but improvements would increase usability. The system works but has clear limitations for specific organisational contexts.",
    "Data flexibility is a key need. The ability to customise benchmarking groups, especially regarding bonus practices, is important and currently insufficient.",
    "Service experience was positive despite internal complexity. Responsiveness and trust were strong, even when Felix's own shifting project requirements made delivery more difficult.",
    "Training and tools feel outdated. There is appetite for more modern, user- friendly learning and tooling.",
    "Brand reputation was not a decisive factor. Selection was driven more by familiarity and global usage than by brand perception. Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Enhance market data configurability. Introduce clearer filters for bonus- paying vs non-bonus-paying companies.",
    "Develop more modern training formats. Consider e-learning, short videos, or interactive modules to improve accessibility.",
    "Explore offering a practical, affordable grading tool. Address the gap that led Felix to build their own internal version.",
    "Provide guidance addressing functional vs hierarchical leadership complexities. Offer examples or advisory notes on how to handle such roles within the methodology.",
    "Continue strong responsiveness and relationship-building. This was a highly valued aspect of the experience and should remain consistent."
  ],
  "additionalInsight": ""
}