{
  "id": "t-036",
  "client": "Duffield Ashmead IV",
  "interviewDate": "2025-11-28",
  "project": "PS",
  "score": 10,
  "overview": "The interviewee chairs the board of an art museum and co-chaired the\nsearch committee responsible for appointing a new CEO. They engaged\nKorn Ferry for the search after previously using the firm for salary surveys,\nmarket analyses, and support in developing the CEO job description. Korn\nFerry was selected over other firms because it demonstrated stronger\nunderstanding of the museum’s specific needs and tailored its approach,\nwhereas other firms attempted to redirect the brief toward a traditional\nmuseum director profile.\nOverall, the experience was described as brilliant, smooth, and highly\nsatisfactory. The candidate pool was considered strong and appropriately\nfiltered, communication cadence became well structured, and the committee\nfelt supported with professional guidance while still retaining autonomy in\ndecision-making. The only issue raised was minor early confusion due to\noutreach from multiple Korn Ferry contacts. The interviewee noted that\nonboarding support has been promised but not yet commenced.\nWhat Went Well",
  "whatWentWell": [
    "Deep understanding of the brief and willingness to tailor the search. Korn Ferry aligned fully with the committee's intention to hire a CEO, not a museum director, unlike competing firms. \"They had a better understanding of what we were looking for... they kept sort of pushing us towards... a museum director... [Korn Ferry] tailored the search to what we really wanted.\"",
    "Strong, well-filtered candidate pool. The pool was broad and well selected, requiring no additional volume to achieve a robust shortlist. \"They looked over about 100 applications... brought about 30 to us... condensed that to 11... then 7... then 4. And that, frankly, was plenty.\"",
    "Positive previous experience and strong institutional knowledge. Korn Ferry's familiarity with the museum strengthened the partnership. \"They had helped us with salary surveys... market analyses... job description... we'd been working with them on and off for two or three years.\"",
    "Effective use of assessment tools. The KF4D tool was used not only for candidates but also for the museum director to ensure complementary leadership profiles. \"We asked them to administer that... because we wanted to be sure their skill sets... were complementary.\"",
    "Clear cadence and smooth communication once established. Regular meetings and information-sharing supported progress. \"We had a regular check-in... a Zoom call every other week... once we hit our stride, it was very smooth and a predictable cadence.\"",
    "Professional guidance without imposing decisions. The committee felt supported but not overridden. \"We were getting very good professional advice... but we were also given free latitude to make our own decisions.\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "Early confusion due to multiple points of contact. The search committee received communications from several Korn Ferry staff initially, making information difficult to track. \"Early on, it was a little confusing... several different people... reaching out... we couldn't search for [emails] easily.\"",
    "Onboarding support not yet observable. While Korn Ferry has promised to support the onboarding of the new CEO, this phase has not yet begun. \"They have promised us that they will be there... but it hasn't really begun yet.\"",
    "No other challenges were identified. Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "Single contact point for communications was needed at the start to avoid confusion. No current feedback on onboarding support since it has not yet started. Key Themes"
  ],
  "keyThemes": [
    "Tailoring over templating. The interviewee valued that Korn Ferry listened and tailored its approach, contrasting with other firms that attempted to redefine the brief.",
    "Strong partnership dynamic. Smooth communication, professional support, and respect for decision-making created a positive, collaborative experience.",
    "Quality candidate selection. The search committee appreciated the breadth, filtering, and alignment of the candidate pool.",
    "Organizational familiarity added value. Korn Ferry's multi-year engagement with the museum contributed to strong understanding of needs and context. Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Ensure a single, consistent communication point from project start to avoid early confusion. Maintain tailored briefing discipline, ensuring the firm continues to listen and follow Duffield's direction rather than offering pre-set role definitions.",
    "Continue structured cadence (biweekly calls, predictable email updates) as this was highly valued. Follow through on promised onboarding support to ensure continuity into the transition phase."
  ],
  "additionalInsight": ""
}