{
  "id": "t-038",
  "client": "Greg Aarssen",
  "interviewDate": "2025-12-01",
  "project": "ES",
  "score": 10,
  "overview": "Greg Aarssen is a board director at TriSummit Utilities, a Canadian-based\nutility holding company, and chairs the Compensation and Governance\nCommittees. He has been involved since the inception of the current\nbusiness and previously served as president of the company.\nThis was their first direct experience working with Korn Ferry, though he was\naware of Korn Ferry through prior searches in related organisations. Korn\nFerry was selected to support the replacement of the CEO following a\nresignation, with responsibility for assessing an identified internal successor\nand conducting an external market scan.\nThe overall experience was very positive. Greg highlighted Korn Ferry’s\nunderstanding of the business and culture, their ability to move quickly, the\nquality and breadth of the external market scan, the depth of assessment on\nthe internal candidate, and strong communication and rapport with the lead\nconsultants. He struggled to identify any issues with the work itself,\nsuggesting only that Korn Ferry could potentially strengthen its visibility.\nWhat Went Well",
  "whatWentWell": [
    "Strong prior familiarity with the business and culture. Korn Ferry's history with the predecessor organisation and its people was a key factor in selection and contributed to confidence in the process. \"They knew our business, they knew the nuts and bolts of our business, and they also understood the culture that we had.\"",
    "Ability to move quickly and deliver ahead of typical timelines. Speed and nimbleness were important criteria, and Korn Ferry exceeded the initial time expectations. \"Many of the others had told us it was going to be a four or five month replacement process... Korn Ferry said that would be four months at the beginning, perhaps three months. And... we got it done in two.\"",
    "Helpful combination of internal assessment and external market scan. Greg valued the dual track of testing the internal candidate and scanning the external market. \"We had a candidate inside... that would be the logical person... and so it was testing that person... and in a parallel path we... asked Korn Ferry to go out to the market... and they did that... ably.\" The external work was seen as broad and thoughtful: \"They did a very good job of expanding and including some interesting people... that would have had similar skills to what we were looking for in our CEO.\"",
    "Extensive use of assessment tools built confidence in the internal candidate. Korn Ferry's psychometric and testing work on the internal candidate was described as significant and decisive. \"They ran some significant, a significant battery of tests for our internal candidate... when the report came back... we felt very confident that we had the right person.\"",
    "High availability and willingness to accommodate. The consultants adjusted to busy schedules and different time zones to keep momentum. \"Both men very busy. Both men certainly made their schedules available... later in the day... early evening... very early in the morning... looking for ways to get it done.\"",
    "Clear, honest, and tailored communication style. Greg appreciated the direct, undressed style of communication, which suited their preferences.\"It was good to get the facts in a sincere manner without a whole lot of dressing on them... our communication back and forth was open, honest, to the point... that is... a rarity.\" He also noted a strong personal rapport with the lead consultant: \"Within the first 15 minutes of my conversation with [Brad Jardine], I felt like he and I had worked together for a very long time, relaxed, open, honest, to the point.\" Strong intent to reuse Korn Ferry and explore broader services Greg expressed clear willingness to work with Korn Ferry again and to expand into succession-related services. \"Would I ever use these people again? I can't imagine not using them again.\" He also see potential to involve Korn Ferry in improving succession planning and reducing blind spots. \"I don't have any confidence in our matrix anymore. I think we need to have someone that is doing some of these... evaluations and analysis to make sure that we don't have blind spots.\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "Need for independent compensation benchmarking from another provider. Due to perceived conflict of interest, Korn Ferry did not provide compensation benchmarking for the CEO role.",
    "Another firm was engaged instead. \"While... Korn Ferry does some of that, they were now a bit of a conflicted party. So we ended up having to go to a business called Meridian... [who] identify that we were 11% below market, and that's why our CEO left.\" This is described more as context and constraint than as a criticism of Korn Ferry's performance. No operational issues or delivery-related complaints were raised. Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "No gaps were identified Key Themes"
  ],
  "keyThemes": [
    "Deep understanding of business and culture as a differentiator Korn Ferry's historic relationship with the predecessor organisation and familiarity with its people and culture were central reasons for selection and a key success factor. Speed and nimbleness are highly valued The ability to compress an originally four-five month process into two months, without Greg feeling rushed or under-informed, was strongly appreciated. Assessment adds credibility with shareholders Robust psychometric assessment from Korn Ferry, coupled with external pay benchmarking, helped validate the internal candidate and address shareholder concerns about leadership and pay. Communication style and personal chemistry matter Direct, honest, succinct communication and quick rapport with the lead consultants were highlighted as standout aspects of the experience. Opportunity for broader succession and board-related work Greg sees clear scope for more rigorous succession assessment and board- level support, and is already exploring this with Korn Ferry. Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Maintain and replicate the dual-track approach (internal assessment + external market scan) This combination was particularly valuable in validating an internal successor while still testing the market. Continue to offer flexible, high-availability support Early mornings, evenings, and responsiveness to emails were explicitly appreciated and contributed to the accelerated timeline. Explore further work on succession planning and board coaching Greg is already discussing potential support in succession planning and sees a need for third-party help in identifying blind spots and strengthening board-level understanding."
  ],
  "additionalInsight": ""
}