{
  "id": "t-034",
  "client": "Joanne DeSantis",
  "interviewDate": "2025-12-08",
  "project": "Consulting",
  "score": 10,
  "overview": "Joanne leads four groups responsible for global volunteer engagement,\ntraining, governance, and recognition across ~18,000 volunteers. Joanne\nhas worked with Korn Ferry for six to seven years, originally engaging them\nto support the Board of Directors election process and has since expanded\nthe partnership into multiple programs.\nHer relationship with Korn Ferry is longstanding, highly positive, and centred\non an ongoing advisory partnership led primarily by Miriam Michaels.\nKorn Ferry supports the nominating committee, board assessment\nprocesses, the PMI Fellows Program redesign, and provides candidate\nassessments for approximately 18-25 board-level candidates each cycle.\nWhat Went Well",
  "whatWentWell": [
    "Strong, trusted partnership with Miriam. Joanne repeatedly emphasised the depth and consistency of the working relationship: \"It's very, very professional. It's very easy, it's very responsive...She and her team... completely hit the ball out of the ballpark...It is all Miriam.\"",
    "Expertise that elevates PMI's processes. Joanne values Korn Ferry's strategic challenge and subject-matter insight: \"Broaden our view here, challenge what we're doing and how we're thinking...She's able to bring trends and data points in this space that I better be paying attention to.\"",
    "Korn Ferry's input has improved board recruitment, criteria setting, assessment practice, questioning, and transparency. High-impact outcomes across multiple programs.",
    "Korn Ferry's work contributed to: A revamped Board of Directors election process, a redesigned and \"very, very successful\" Fellows Program; And improved questioning and evaluation methods for the Volunteer Advisory Committee.",
    "Positive candidate experience with assessments. Feedback from candidates going through Korn Ferry assessments has been \"very positive.\" Board members using the assessment also \"appreciated it.\"",
    "Responsiveness and willingness to go beyond contracted scope. Miriam provided quick, informal support on interview questions \"out of the goodness of her heart.\" She proactively involved internal specialists when needed, e.g., disability accommodations.",
    "Smooth operational experience: \"Invoicing is easy...Working through the contract is easy.\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "One-off scheduling difficulty The interviewee referenced a single instance over several years where a candidate struggled to connect with a Korn Ferry representative, influenced by time zone challenges: \"They had a candidate who couldn't seem to connect... it was like phone tag and email tag... Over five, six years, that was the only escalation I ever had [with Korn Ferry].\"",
    "Limited visibility beyond her remit. The interviewee noted that her awareness of broader Korn Ferry services is shaped by the specificity of her role: \"I probably... wouldn't know where else to point them to.\" Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "Awareness of wider Korn Ferry services. Joanne expressed interest in understanding the breadth of solutions Korn Ferry provides, not for direct selling but to better field internal referrals: \"Better understanding the breadth of what they offer... would be helpful.\"",
    "Access to broader peer insight. Joanne welcomes peer-to-peer networking and knowledge exchange beyond Korn Ferry's direct guidance: \"I would welcome that...I'm not learning from others that are facilitating a nominating process... peer-to-peer networking would always be [helpful].\" Key Themes"
  ],
  "keyThemes": [
    "Deep partnership and high trust The relationship is anchored in long-term collaboration, consistent delivery, and understanding of PMI's culture and governance environment. Expertise as the primary value driver Strategic challenge, sector insight, and process rigour are seen as differentiators. Korn Ferry as an extension of the internal team Joanne described Korn Ferry as integrated into their annual cycles, relied upon for both execution and advisory work. Candidate assessment process is a critical component Assessment quality, delivery, and candidate engagement are instrumental to the partnership's perceived success. Desire for broader connection beyond project delivery Interest in newsletters, peer networks, and cross-sector learning indicates appetite for more structured knowledge-sharing. Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Enhance visibility of broader capabilities Consider increasing awareness of adjacent Korn Ferry offerings, helping Joanne respond more confidently to internal enquiries without feeling \"sold to.\" Support peer learning and networking Explore options to facilitate occasional peer-to-peer exchanges or curated insights for leaders involved in governance, nominations, and volunteer-led assessment processes. Reinforce consistency in candidate coordination Maintain strong communication practices within the assessment workflow to minimise delays caused by time zones or scheduling challenges. Continue proactive guidance on emerging trends Sustain the value Joanne highlighted, bringing external developments (e.g., AI in recruitment) into PMI's context with practical interpretation. Additional Insight"
  ],
  "additionalInsight": "Volunteer-driven governance adds complexity\nJoanne works with global volunteers, board committees, and large\nnomination cycles involving ~200 candidates annually. The environment\nvalues transparency, fairness, and cultural sensitivity.\nAI in recruitment is an emerging concern\nJoanne noted the need for guidance on pitfalls and candidate impacts\nrelated to AI tools in application processes.\nHigh interest in industry insights but limited time to seek them\nindependently\nJoanne relies on Korn Ferry to synthesize trends and translate them for\nPMI’s context."
}