{
  "id": "t-039",
  "client": "Francis Kint",
  "interviewDate": "2025-12-02",
  "project": "ES",
  "score": 10,
  "overview": "Francis Kint is the CEO of Green Yard Foods NV, a fruit and vegetable\nbusiness (fresh, frozen and canned) that has recently been delisted from\nEuronext Brussels and taken private by a founding family and an investment\nfund (Solemn Partners). The latter will be the majority shareholder.\nKorn Ferry was engaged to recruit two senior roles: a CHRO (vacant for\naround a year, temporarily covered by the CEO) and a Chief Transformation\nOfficer, requested by Solemn Partners to drive and follow up on\ntransformation work arising from a Bain-led review, given current profitability\nchallenges.\nThe CEO had not previously worked with Korn Ferry in this company, but\nknew the Belgian managing partner and Danny from his time at another firm.\nKorn Ferry was selected without a competitive pitch, based on trust in\nspecific individuals and confirmation that Solemn Partners also use them\nextensively. Overall, the experience was very positive. Both roles have now\nbeen filled, and the CEO expressed strong satisfaction with the collaboration\nand with the appointees.\nWhat Went Well",
  "whatWentWell": [
    "Trust in key individuals and continuity of relationship The CEO chose Korn Ferry because of existing relationships and confidence in specific people. \"I knew the boss, I knew the consultant that I wanted to work with, because I have a deep trust in [Danny]'s... human touch.\" He also noted that Solemn Partners already worked frequently with Korn Ferry. \"When I talked to them about possibly using Korn Ferry, they immediately reacted by saying, Oh, we work a lot, this is the main firm we also work with.\" Clear role definitions and constructive discussion on profiles The CEO came with well-formed ideas on both roles and refined them with the consultant. \"I'd written a job description, I knew relatively well what I wanted... and of course, I discussed it with [Danny]... you always adapt a little bit... but the role was fairly clear in my head.\" He was specific about the CHRO needing to work at corporate level and also coordinate HR in certain divisions. For the Chief Transformation Officer, the purpose and time-bound nature of the role were clear. \"We all know that this is not there to last for five years... if we're still transforming after two years, then we're not doing a good job.\" Quality and quantity of candidates met expectations The CEO was satisfied with both the volume and standard of candidates presented. \"In terms of the number of... the quality and the quantity of candidates, did they meet your expectations? – Yes, absolutely.\" He mentioned lists of around 10 candidates for each role and found the interviewing phase efficient. Speed of candidate identification and process management Candidate sourcing and interview set-up were described as fast and well organised. \"Everything went very fast, the finding of the candidates in both role. I also was impressed that it was fast... we had a list, I think, for both of 10... the interviewing phase... was quite efficient.\" He did not feel out of the loop. \"No, I never felt like, Hey, I don't know what's going on.\" Negotiation support and role in compensation discussions Korn Ferry acted as an intermediary in negotiations, while still allowing direct openness between CEO and candidates. \"They were always slightly in between... in principle, they have been negotiating the package on the basis, of course, of what we told them.\" The CEO noted that the CHRO hire took longer largely due to salary and notice discussions, but did not attribute this to Korn Ferry underperformance. \"What has lasted long is the... negotiation... also the fact that he couldn't leave his current company as quickly as I wished... that took some time.\"",
    "Admin support and organisation of interviews The CEO appreciated the practical support from the broader team. \"The person that works with him is a lady called Sarah, and I also think that she did a good job in terms of always making sure everything was taken care of. The reports were sent to me, everything was well organized.\" This enabled him to interview efficiently across multiple visits. Positive overall outcome Both searches concluded successfully, with candidates the CEO is pleased with. \"The two people that are now on board... CHRO took a little bit longer, but the CTO is now on board also. So one is on board since the first of November, the second one since the 23rd of November.\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "Assessment reports felt long and highly nuanced The CEO read the assessment documents but found them less sharp than he might have liked. \"The documents are long and very nuanced, and you might sometimes maybe have wished them to be a little bit more black and white... the documents are a little bit yeah, yeah.\" He suggested he could have asked for a clearer summary or more concrete statements on specific behavioural aspects, such as ability to handle conflict and restructuring situations.",
    "Minor practical issue with office parking The CEO mentioned a practical irritation with visiting Korn Ferry's office. \"I'd wish they had parking spaces in their own office, because you always have to go to another building... it's a bit annoying.\" He framed this lightly and did not connect it to the quality of the work. Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "Clarity and sharpness of assessment output The CEO indicated he would have valued more concise, more \"black and white\" summaries in the assessment reports, especially on concrete behaviours such as handling conflict and driving restructuring. \"You might sometimes maybe have wished them to be a little bit more black and white... on the very concrete things, how things will work.\" No further substantive gaps were raised regarding Korn Ferry's performance The extended timeline on the CHRO hire was described as driven by candidate negotiation and notice, rather than by Korn Ferry not doing its work. Key Themes"
  ],
  "keyThemes": [
    "Brand and individual credibility both matter The CEO emphasised that brand is a primary criterion at senior level. \"My first criterion is the brand... if you get a call from Korn Ferry or Egon Zender, you take notice.\" Within the \"top five\" firms, the quality of local leadership and consultants then shapes choice. 2. Trust in the lead consultant was decisive Previous positive experience with Danny, and trust in his \"human touch\" and depth, strongly influenced selection. 3. Speed and efficiency are highly valued Fast candidate generation, an efficient interview phase, and the sense of continuous communication were all highlighted positively. 4. Assessments are valued, but format could be sharper The CEO values assessment work and would use it again, but noted that in future he might ask for more concise, clearly framed conclusions. 5. Transformation context and people capability The transformation agenda, profitability challenges, and the need for people who can handle restructuring and conflict were central to how roles were defined and candidates evaluated. Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "• Offer sharper executive summaries in assessment outputs Provide a short, clearly framed summary alongside detailed reports, highlighting key behavioural flags (e.g. tolerance for conflict, ability to drive restructuring) in more \"black and white\" terms. • Continue to leverage strong individual relationships and local leadership Maintain high-touch, trusted relationships with key CEOs, investors and local leaders, as this was central to selection and satisfaction. • Maintain pace and transparency throughout the process Preserve the fast sourcing, efficient interview set-up and ongoing communication that were called out as strengths. • Ensure practical experience matches premium brand positioning Small logistical details (e.g. ease of access for client meetings) can contribute to the overall experience; where possible, make the in- person experience as smooth as the advisory work."
  ],
  "additionalInsight": ""
}