{
  "id": "t-037",
  "client": "Jeanette Rooms",
  "interviewDate": "2025-12-01",
  "project": "ES",
  "score": 6,
  "overview": "Jeanette is the Chief People Officer at their organisation, working closely\nwith the CEO on senior hiring. They engaged Korn Ferry for two searches -\nChief Digital Officer (CDO) and Group Capability Centres Head - through an\nexisting relationship initiated by the CEO. Jeanette has longstanding\nexperience with Korn Ferry over their career, primarily for executive search,\nand was involved in contracting and oversight of this engagement.\nThe overall experience was mixed and ultimately unsatisfactory. Jeanette\ncited concerns around gender diversity on the slate, lack of pace and\nassertiveness, inconsistent project management, difficulty obtaining\ncompensation information, and delays that contributed to losing a preferred\ncandidate. Although two strong candidates were eventually appointed, the\nprocess took significantly longer than expected and created substantial\nfrustration.\nWhat Went Well",
  "whatWentWell": [
    "Two strong appointments made in the end. Despite challenges, the search concluded with two high-quality hires. \"We did actually find two very, very good candidates in the end.\"",
    "Consultants described as personable Jeanette noted positive interpersonal interactions with the team. \"The guys are all really personable and lovely guys.\" Negotiation support provided Korn Ferry did negotiate with candidates on Jeanette's behalf, although Jeanette ultimately intervened directly. \"Yes, they did... and then... Chantelle just said, I'm going to ring him directly.\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "Lack of gender diversity in shortlists Repeated reminders were required to present female candidates, which created frustration. \"We had to remind the guys a number of times that we want to see women as well as men.\" \"It was quite difficult to get them to bring women to the short list.\"",
    "All-male consulting team impacted perception Jeanette felt this contributed to weaker gender-balanced sourcing. \"All the consultants from Korn Ferry were all men... it didn't really sit very well.\" Significant issues obtaining compensation details Difficulty extracting accurate compensation information delayed offer decisions and contributed to losing a preferred candidate. \"Trying to get out of them what current comp was, was impossible.\" \"They kept having to go back and forth... it took forever to put an offer together.\" \"We nearly lost one of the candidates because of it... in the end we didn't actually end up bagging the candidate that we wanted.\" Lack of timely or substantive benchmarking insight Jeanette did not feel they received useful compensation benchmarks or depth. \"We didn't get any support... we got a very blanket 'the expectation is around about half a million'... which is fine, but it's very... yeah, yeah.\"",
    "Reports arriving too late to review Materials were often shared shortly before calls, limiting preparation. \"The reports would often land an hour or two before the call... you have no hope in hell of getting to it.\" Lack of assertiveness and leadership in discussions Jeanette felt the consultants did not guide the process, make recommendations, or lead decision-making effectively. \"We ended up running the calls.\" \"It always felt very hesitant.\" \"It just wasn't assertive enough.\"",
    "Slow pace and extended timeline The process took far longer than Jeanette's stated timeline. \"It just took way, way longer than we thought... the best part of five months, six months.\" The brief remained misaligned for a significant portion of the process Jeanette felt profile alignment issues persisted without proactive correction. \"They just weren't hitting the right brief.\" \"They didn't seem to instinctively pick up that it wasn't quite right... they just kept pushing forward.\" The search did not reflect the positive experiences the client had previously had with Korn Ferry Jeanette's past experiences with Korn Ferry were more positive. \"Not as good.\"",
    "Frustration increased over time Issues escalated, culminating in doubt about using Korn Ferry again. \"I'm not sure we'll go back there again, because that was really hard work at the end.\" Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "Diverse sourcing expectations not met. Repeated requests were required.",
    "Inadequate compensation discovery process. Insufficient detail, slow responses, unclear structure.",
    "Lack of assertive, insight-led leadership from consultants. Jeanette had to drive the process.",
    "Timing and pace of delivery did not meet expectations. Reports late, slow progress, offer delays.",
    "Insufficient proactive brief refinement. Consultants did not surface misalignment early. Key Themes"
  ],
  "keyThemes": [
    "Pace, urgency and ownership fell short. Delays, late reports, and slow compensation follow-up were recurring frustrations.",
    "Diversity expectations were not met. The search did not reflect Jeanette's requirement for mixed slates, requiring repeated pushback.",
    "Lack of assertiveness and leadership. Jeanette expected clearer recommendations, stronger guidance and more confident facilitation.",
    "Inadequate compensation insight and process. This materially impacted negotiation, timing, and the outcome of a preferred candidate.",
    "Experience inconsistent with previous positive impressions of Korn Ferry. Jeanette came in with high trust but left disappointed. Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Strengthen gender-diverse sourcing • Implement transparent, proactive processes to ensure balanced slates. • Review team composition on projects to avoid unintentionally limiting diverse sourcing perspectives. Improve compensation discovery discipline • Gather full, detailed compensation information early in the process, including structure, guarantees, equity and performance elements. • Reduce back-and-forth with candidates and prevent delays at offer stage. Increase assertiveness and leadership in client interactions • Proactively highlight recommended candidates rather than waiting for clients to initiate direction. • Lead discussions confidently, guide decision-making and take ownership of meeting facilitation. Enhance pace and preparation • Share reports and candidate materials with sufficient lead time for stakeholders to review. • Maintain momentum from the outset, particularly where timelines are tight. Surface brief misalignment earlier • Raise any concerns about candidate fit, search direction or brief interpretation proactively, rather than allowing misalignment to persist. Additional Insight"
  ],
  "additionalInsight": "o What Jeanettes value most (explicitly stated)\n• Pace, urgency, and efficiency\n• Assertiveness and clarity\n• Deep compensation knowledge\n• Diversity of candidates\n• Leadership and structure in calls\n• Minimal back-and-forth at critical offer stages"
}