{
  "id": "t-047",
  "client": "Lesley Dwyer",
  "interviewDate": "2026-01-05",
  "project": "Consulting",
  "score": 9,
  "overview": "Lesley Dwyer is the Group Chief Executive of the client organisation and\nhas worked with Korn Ferry across two related but distinct engagements:\none supporting The Norfolk and Norwich University Hospital business\nspecifically, and a second focused on designing a group-level HR operating\nmodel. This was Lesley’s first experience working with Korn Ferry. The\nengagement was initiated primarily due to an existing trusted relationship\nwith James, who had previously worked with Lesley within the NHS.\nOverall, Lesley described the experience as positive and value-adding,\nparticularly in terms of practical understanding of implementation within a\ncomplex public-sector environment, while also noting areas where earlier\nescalation and stronger ownership alignment could have been beneficial.\nWhat Went Well",
  "whatWentWell": [
    "Trusted advisory relationship and credibility. A central strength of the engagement was the trusted relationship with James, which strongly influenced the decision to work with Korn Ferry. Lesley emphasised the importance of receiving advice from someone who understood both the NHS context and the realities of implementation: \"I wanted the important advice, particularly of an individual who I happen to trust... somebody that understands the NHS and the barriers that may be put forward as being a reason not to do things, but somebody who actually understands what it is that I want to achieve.\" This trust enabled open, honest dialogue and confidence in the recommendations being provided. Practical focus on implementation, not just recommendations. Lesley valued Korn Ferry's emphasis on what implementation would realistically look like, rather than producing theoretical outputs: \"Having people who understand, not just the NHS... but actually understanding what implementation looks like in our real world.\" They noted this as a differentiator compared with other consultancy experiences. Willingness to challenge and escalate appropriately. Korn Ferry was recognised for escalating issues when internal stakeholders were not engaging or when resistance emerged, allowing Lesley to intervene in real time: \"Having somebody trusted that was able to escalate when... people aren't making themselves available meant that I could manage that in real time.\" This was seen as particularly important in an environment where progress can otherwise stall without visibility. Strong contextual understanding within the team. The team supporting James was described as small but appropriate, with relevant background and experience: \"They had the backgrounds that meant that they would understand our context.\"",
    "Lesley felt the team setup supported effective delivery without unnecessary complexity. Added value beyond the immediate project. Through the engagement, Lesley developed a broader appreciation of Korn Ferry's capabilities beyond the initial HR model work: \"I've now got a greater appreciation of the breadth that Korn Ferry can bring to us... particularly the much more commercial aspects of it.\" This increased openness to considering Korn Ferry for future work. Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "Slower recognition of delivery constraints. Lesley felt that it may have been helpful to understand earlier when the team was becoming constrained or \"stymied\" in progressing the work: \"I think I may have wanted to know a little bit earlier that they were getting stymied, you know, just held up a little bit.\"",
    "Earlier escalation may have enabled faster scope adjustment and clearer authority. Risk of consultants adapting too closely to internal resistance. While largely positive, Lesley noted moments where consultants appeared to soften or adapt their model in response to internal resistance: \"I always said, you know, don't change your model, because, in actual fact, that's why we employed you.\" This was not attributed specifically to James, but was raised as a general risk in complex client environments. Ownership of implementation within the organisation. Lesley highlighted that while recommendations were sound, internal ownership of implementation did not always align as strongly as intended: \"I needed the people I would look to to implement, to actually own it. And I'm not too sure that that happened in the way that I wanted.\" They were clear this was not solely a Korn Ferry issue, but one that consultants should actively surface. Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "Earlier escalation of internal misalignment. Lesley would have welcomed more proactive escalation when alignment or momentum began to slip: \"Escalate the minute you feel that... there's not enough alignment internally.\" They suggested this as a general expectation of consulting partners rather than a criticism of intent. Clearer framing of consultant role in implementation phase.",
    "There was a desire for consultants to remain engaged through implementation to ensure intent was preserved: \"I do think it's really important that consultants see that their role is to ensure successful implementation, rather than just recommendation.\" Key Themes"
  ],
  "keyThemes": [
    "Strong trust and credibility rooted in sector understanding High value placed on implementation realism over theoretical advice Consultant challenge welcomed, particularly in resistant environments Earlier escalation and stronger implementation ownership would enhance impact Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Encourage earlier signalling when progress becomes constrained. Where delivery begins to slow or resistance emerges, raising this promptly may allow for earlier recalibration of scope, authority, or stakeholder engagement.",
    "Maintain clarity around implementation expectations. Reinforcing the distinction between adapting communication style and diluting core recommendations may help preserve intent in complex environments.",
    "Support visible ownership alignment during delivery. Helping client- side leaders clearly own and champion implementation could strengthen follow-through and reduce reliance on informal escalation. Explore structured \"critical friend\" models where appropriate. Where implementation risk is high, clearly defined advisory roles post- recommendation may support sustained impact without overextension. Additional Insight"
  ],
  "additionalInsight": "Implementation capability is the dominant challenge, not diagnosis.\nLesley repeatedly emphasised that insight alone is insufficient without the\ncapability to execute: “I need expertise to show people what different looks\nlike, and then to lead them through, helping change that and building\ncapability as you go.”\nStrategic partnership matters more than breadth of services. Lesley\nwas clear that long-term value lies in fewer, deeper partnerships: “I do look\nfor what I’ll call strategic partners… because organisations cannot manage\nmultiple relationships.”\nDespite operating in a consultant-heavy environment, Korn Ferry was\nviewed as a credible potential long-term partner where trust and\nimplementation focus are sustained."
}