{
  "id": "t-041",
  "client": "Gary Knell",
  "interviewDate": "2025-12-12",
  "project": "Executive Search",
  "score": 7,
  "overview": "Gary is the Chair of the Board Search Committee and Secretary to the\nCorporation at San Diego Zoo Wildlife Alliance, with responsibility for leading\nthe nomination and governance committee. This was the organisation’s first\nengagement with Korn Ferry during Gary’s tenure and focused on the\nsearch for a new Chief Executive Officer.\nGary brought deep prior experience of executive search and selection,\nhaving worked closely with several major firms in previous roles. Overall, the\nexperience was described as strong in its early stages, with high\nresponsiveness, structured process management, and inclusive stakeholder\nengagement. However, Gary expressed disappointment with candidate\ngeneration, late-stage execution, and perceived gaps in candidate\ncommitment and continuity toward the end of the search.\nWhat Went Well",
  "whatWentWell": [
    "Strong early engagement and responsiveness. Gary consistently noted that Korn Ferry were highly responsive and proactive, particularly at the outset of the engagement: \"They were incredibly responsive.\"",
    "Thorough discovery and stakeholder engagement. Korn Ferry were recognised for the depth of their upfront work and understanding of the organisational context: \"They did their homework and really leaned into it.\" This included extensive engagement with internal and external stakeholders: \"They did good communications with staff, interviews with the board... they met with the mayor... they talked to some big donors.\"",
    "Strong process management and communication. From a process standpoint, Korn Ferry were viewed as organised and consistent throughout much of the assignment: \"I had a weekly meeting with them... there was good communication.\" Gary also noted that the firm managed the overall timeline and mechanics of the search effectively, particularly given that some members of the search committee were less experienced with executive search processes.",
    "Effective assessment tools and infrastructure. The firm's broader infrastructure and assessment capability were viewed positively: \"They even brought in one of... a psychologist on their staff, and that was a useful session.\"",
    "Positive outcome despite challenges. While the path to appointment was difficult, the final outcome was ultimately successful: \"The guy's doing a great job.\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "Candidate generation felt more limited than anticipated. A central concern was that Korn Ferry did not generate the level or breadth of candidates Gary expected for a role of this profile: \"They didn't really generate the level of the candidates that we thought they should have.\" Gary noted that two of the three final candidates originated from their own network, rather than from the firm's search efforts: \"Two of the three finalists were my contacts, and the third one was the internal contact.\" This was particularly disappointing given the perceived stature of the role: \"This is the plum job to be the CEO... and we just didn't get people like that.\"",
    "Broader exploration beyond familiar talent pools was expected. Gary felt the search could have been broader and more imaginative, particularly when encouraged to look outside traditional sector boundaries: \"I had urged them to look broad... like college presidents... and they didn't really do that.\" There was a sense that the firm relied too heavily on familiar profiles rather than surfacing unexpected or standout candidates: \"There weren't really people who weren't on our radar that made you think, wow, that's amazing.\"",
    "Candidate commitment could have been tested earlier. A significant frustration arose when two external finalists withdrew late in the process due to relocation concerns: \"That should have been fleshed out beforehand. That was not okay.\"",
    "Despite explicit discussions around relocation readiness, both candidates withdrew at a critical stage: \"Korn Ferry should have vetted this ahead of time... before we went through this final testing.\" This was described as particularly disruptive given the investment of time and expectation from the board. Late-stage execution felt less assured than the initial phases. While early momentum was strong, Gary felt the search lost direction toward the end: \"It got off to such a good start... and then it sort of skidded off the runway.\" The firm's suggestion to reopen the search and explore alternative profiles late in the process was experienced as reactive rather than proactive: \"It was kind of like, oh my god... I pretended I didn't hear that.\"",
    "Continuity and visible ownership shifted during the engagement. Gary noted a change in engagement following the temporary absence of the lead partner: \"She was a little more plugged in... and once she was gone, it felt less prioritised.\" While acknowledging the legitimacy of the absence, the resulting gap contributed to a perception of reduced ownership and focus: \"It just felt a little bit... an ownership thing.\" Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "Depth and originality of candidate sourcing. Gary expected a search of this scale to surface candidates they could not have identified independently: \"This is a big enough job that we really should have had A- plus candidates.\"",
    "Stronger validation of candidate readiness and commitment. There was a clear expectation that practical considerations such as relocation would be resolved well before final stages: \"They should have known those candidates were not going to move.\"",
    "Greater continuity and consistency through the full lifecycle. Maintaining consistent leadership attention throughout the engagement was seen as important to sustaining momentum and confidence: \"It felt less prioritised at the firm.\" Key Themes"
  ],
  "keyThemes": [
    "Strong early engagement, with some challenges emerging toward the later stages of the process High levels of responsiveness and structured process management, alongside opportunities to broaden candidate sourcing Search infrastructure and assessment capability were valued, with some questions raised around sourcing depth and late-stage candidate readiness Gary places importance on visible ownership, continuity, and proactive judgement throughout the engagement Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Support broader consideration of senior leadership profiles. Where appropriate, continue to explore a wide range of potential backgrounds and experiences, particularly for high-profile roles where adjacent or transferable leadership capability may add value.",
    "Encourage early alignment on candidate readiness. At the outset of later-stage processes, consider placing additional emphasis on confirming practical considerations, such as relocation expectations, to help reduce uncertainty as the process progresses.",
    "Promote continuity across the full lifecycle of the engagement. Where team changes are anticipated, maintaining clear ownership and consistent client touchpoints may help preserve momentum and confidence through to completion.",
    "Maintain flexibility to recalibrate as the search evolves. When early signals suggest a narrowing of viable options, a timely review of approach may help ensure the search remains well-balanced and responsive to emerging insights. Additional Insight"
  ],
  "additionalInsight": "High expectations shaped by prior search experience. Gary’s extensive\nexperience with executive search firms influenced expectations around\ncandidate quality and value-add: “I’ve had a subsequent experience with\nanother firm… where they really did bring in amazing people.”\nDisappointment outweighed by constructive intent. Despite clear\nfrustration, Gary was careful to frame feedback as learning-oriented rather\nthan punitive: “I’m not one of these people who are never happy… but in this\ncase, it was just disappointing.”"
}