{
  "id": "t-048",
  "client": "Karina Molina",
  "interviewDate": "2026-01-05",
  "project": "PS",
  "score": 10,
  "overview": "Karina Molina has been with ExxonMobil for approximately 27 years and is\nbased within manufacturing, supporting hiring for senior technical roles\nacross a five-site US manufacturing circuit. They have worked with Korn\nFerry for approximately one to two years, with Korn Ferry described as the\nonly authorised third-party hiring partner for this part of the organisation.\nOverall feedback was strongly positive, with particular emphasis on the\nquality of relationship management, structured communication, and\nresponsiveness to feedback, alongside acknowledgement of broader\nmarket constraints affecting candidate availability in certain engineering\ndisciplines.\nWhat Went Well",
  "whatWentWell": [
    "Strong relationship management and clear team structure. Karina described a well-organised engagement model, with a clear relationship lead and specialist support aligned to disciplines. \"Greg (Tedesco) is the lead that we primarily work with... he has folks on his team that focus on specific engineering disciplines, and then Greg just manages the relationship kind of overall for us.\"",
    "Consistent communication and governance cadence. Regular updates and structured touchpoints were highlighted as a strength, helping stakeholders stay aligned and informed. \"Greg scheduled by monthly calls with the team... to give us updates, to share... additional context on the candidates... and help answer any questions.\"",
    "Responsive, feedback-led delivery. Karina emphasised that the team sought timely input and adjusted quickly when needed. \"Greg and his team were... always asking for kind of timely feedback, and so there was nothing that was lagging that wasn't immediately addressed.\" They also noted an active feedback loop on search parameters: \"We also provide the team feedback whenever we need to adjust our searches... to ensure that we're getting in the right candidate pipeline.\"",
    "Pragmatic alignment with market realities. Candidate flow was assessed as broadly consistent with both internal applicant volumes and wider market conditions, particularly for scarce skillsets. \"We're seeing a decline in availability in certain engineering disciplines like electrical engineering... and we see that across the board.\" They also noted seasonal effects on candidate movement: \"People are usually not looking to change... at the end of the year... we understand that... could impact the timing.\"",
    "Effective early screening of candidate interest. Karina valued Korn Ferry's efforts to confirm candidate motivation and fit before progressing. \"They were already... testing interest and availability up front,\" and highlighted the importance of confirming candidate openness to role location and the value proposition: \"Making sure that the candidates are interested in ExxonMobil... and... open to the geographic locations where we have open needs.\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "External candidate availability constraints in specific disciplines. The only meaningful constraint raised related to the market, rather than Korn Ferry's delivery. \"We're all kind of seeing a decline in availability in certain engineering disciplines like electrical engineering.\"",
    "Karina also noted time- of-year effects that can reduce candidate flow: \"Quarter last year, we were clean in the number of candidates that were coming through... people are usually not looking to change... at the end of the year.\" Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "No clear gaps in Korn Ferry's delivery were raised. When asked directly about improvements, Karina stated, \"Nothing I can think of.\" They framed their \"ideal partner\" expectations as areas to continue reinforcing, rather than shortcomings. Key Themes"
  ],
  "keyThemes": [
    "Strong relationship-led delivery, supported by a structured specialist team model Consistent communication cadence and high responsiveness to feedback Candidate availability shaped more by market conditions than process constraints Ongoing value in maintaining early validation of candidate interest and location fit Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Continue reinforcing early candidate interest and location alignment. Maintain the current practice of confirming motivation, readiness for change, and geographic openness before candidates enter the client review stage, helping protect stakeholder time and sustain process momentum.",
    "Sustain the structured communication rhythm with practical, role- specific updates. The regular touchpoints appear to support confidence and alignment across multiple sites and disciplines; keeping this cadence consistent, and evolving content based on stakeholder needs, may help preserve the strong experience described. Where market constraints persist, keep expectations and search levers visible. In disciplines where availability is tightening, it may help to keep an explicit dialogue open on potential adjustments (for example, timing, profile flexibility, or pipeline-building approaches), so stakeholders feel informed and supported as conditions shift. Additional Insight No additional insight"
  ],
  "additionalInsight": ""
}