{
  "id": "t-040",
  "client": "Dr. Jan Stefan Scheld",
  "interviewDate": "2025-12-05",
  "project": "ES",
  "score": 9,
  "overview": "Jan is the Country Managing Director for Japan at Boehringer Ingelheim, a\nlarge pharmaceutical company. They have been working with Korn Ferry for\nthe past two years across multiple individual search projects.\nThe relationship originated from an existing connection with a consultant Jan\nhad previously worked with at another firm. When she moved to Korn Ferry,\nthey continued the relationship. The consultant was the primary factor in\nselecting Korn Ferry.\nOverall, Jan’s experience has been consistently positive, describing the work\nas professional, efficient and high quality.\nWhat Went Well",
  "whatWentWell": [
    "Strong trust and continuity with lead consultant. The decision to choose Korn Ferry was based entirely on the existing relationship with one specific consultant: \"I actually knew the key consultant from a different company... it was the person herself.\" The experience of working with her at Korn Ferry was described as comparable in quality to the experience at her previous firm: \"Was there any difference? - No.\"",
    "High-quality work and professionalism. Jan described the delivery and overall engagement very positively: \"Very good, very professional...That's why we've been keeping working with them over the past two years.\"",
    "Quality and quantity of candidates met expectations. Candidate delivery consistently met expectations: \"In terms of delivering quality and quantity...Yes, absolutely.\"",
    "Strong speed of execution. Speed to hire was described as: \"Also very good.\"",
    "Clear communication and structured project management. Jan felt informed throughout each project: \"Did you feel up to date and informed? - Yes, yes.\"",
    "High likelihood to reuse. Jan confirmed they would work with Korn Ferry again: \"Would you use them again? - Yes.\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "Loss of value when dual-consultant model was removed. Earlier in the relationship, Jan experienced a model where two consultants (from different cultural backgrounds) attended meetings. This was perceived as a meaningful differentiator. Later, Korn Ferry informed the client that due to limited capacity, they would no longer work as a pair: \"We got the message... we have limited capacity, so now we are splitting up and working individually.\" While the work still met expectations, the experience was not as strong: \"It still worked, but it was not the same great experience as we had at the beginning.\"",
    "Reduced richness in consultation quality. Jan noted a difference when the second partner was no longer involved: \"We got different quality of the consultations because obviously the second person was adding a certain perspective and value.\"",
    "Assessment tools not needed or used. Jan received access to Korn Ferry's KF4D (or similar) assessments at no cost in some cases, but did not use them: \"We got that for free in some instances, but honestly, I didn't use it.\" The reason was simple: \"It didn't need that tool, and didn't really help me in my decision making.\" Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "• Dual-consultant support removed over time This affected perceived value and differentiation versus competitors. • Assessment tools provided but not useful in this context Jan did not need them and did not find value in using them. • Broader consulting services not automatically transferable Jan does not assume Korn Ferry's search capabilities translate to transformation or development work. \"No, because that's a different skill set... I would again pitch and see who's best.\"",
    "No other specific gaps were mentioned. Key Themes"
  ],
  "keyThemes": [
    "Dual-consultant model was a differentiator. Jan explicitly stated this created added value: \"That was the differentiating factor... two different individuals from two different cultures.\" 3.",
    "Strong delivery fundamentals. Across all projects, the experience was described as: • professional • high quality • timely • communicative 4.",
    "Additional solutions only matter if they fit the immediate hiring need. Assessments were available but unused, as they did not support Jan's decision-making for these hires. Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "1. Reconsider the value of dual-consultant coverage where possible • A paired model - particularly with complementary backgrounds - was explicitly cited as a unique differentiator. • Removing it reduced the perceived quality of consultation and richness of perspective. • Explore whether dual coverage can be maintained selectively in high-value markets or key accounts. 2. Clarify when and how assessment tools add value • Provide guidance on when assessments strongly support a search versus when they may be optional. • Offer clearer framing of how tools can meaningfully inform decisions. 3. Maintain consistently strong communication and project execution • Continue the reliable cadence, responsiveness and professionalism that the client praised. 4. Recognise that broader consulting services require separate positioning • Jan views search and organisational consulting as distinct capabilities requiring different people. • Ensure any broader offerings are introduced by the right experts, rather than assumed transferable. Additional Insight"
  ],
  "additionalInsight": "What clients in this context value most\n• Trusted individual consultants\n• Consistency in who leads the work\n• Diversity of perspective in the consultant team\n• Efficiency, speed and professionalism\n• Clear, ongoing communication throughout the process"
}