{
  "id": "t-045",
  "client": "Alexander Borjigin",
  "interviewDate": "2025-12-15",
  "project": "ES",
  "score": 10,
  "overview": "Alexander is a Senior Recruiting Partner responsible for managing external\nsearch engagements across investment management teams in the\nAmericas. The relationship with Korn Ferry spans approximately three\nyears and includes multiple executive search assignments across Canada\nand the US, primarily within investment risk, equity research, and portfolio\nmanagement.\nOverall, Alexander describes the experience as consistently positive,\nhighlighting subject matter expertise, flexibility, relationship quality, and\ndelivery effectiveness as key strengths.\nWhat Went Well",
  "whatWentWell": [
    "Strong subject matter expertise aligned to role requirements. Alexander consistently emphasised the importance of deep functional expertise in search partners and cited Tracy at Korn Ferry as performing strongly in this regard, particularly within specialist investment roles: \"She actually has an investment risk background. She understood the role, the needs, and was able to find someone with that type of background.\"",
    "Successful outcomes across completed searches. Korn Ferry was credited with delivering strong outcomes across multiple completed engagements, including challenging locations and specialist roles: \"They were very successful in finding the right candidate to meet our needs... They were very successful with that endeavor... received positive feedback from the hiring leader.\" Even where a role was ultimately closed due to business changes, Alexander noted that Korn Ferry delivered an appropriate candidate pool: \"They were able to provide the level of service and the suitable pool of candidates for the hiring manager to look at.\"",
    "Flexibility in commercial and engagement approach. Flexibility around terms and budgets was highlighted as particularly important given Franklin Templeton's decentralised structure, and Korn Ferry was seen as constructive and pragmatic in this area: \"Korn Ferry has been very good about working with us on those...It's that fine balance... and Korn Ferry has been very good about providing the flexibility that we need.\"",
    "Positive working relationships and communication. Across all engagements, Alexander described the working relationship with Korn Ferry as collaborative and easy: \"Everyone I worked with have been good partners to work with...The delivery has been good, the communications.\"",
    "Pay benchmarking and market insight valued. Korn Ferry's compensation insight was described as practically useful, particularly in supporting internal decision-making and budget alignment: \"We're asking Korn Ferry for market data on pay... in particular, total compensation...It's helpful for us... so that the hiring leader can go back to their senior leader and present that and make a case.\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "Alexander did not identify any negative experiences or concerns across the searches they were involved in. Gaps Identified (raised by interviewee)"
  ],
  "gapsIdentified": [
    "Limited awareness of Korn Ferry's broader offering. While open to using Korn Ferry beyond search, Alexander noted limited awareness of the firm's wider capabilities: \"I'm not aware of what other products or services they offer.\"",
    "Assessment tools not actively used in recent searches. Alexander confirmed that Korn Ferry's assessment tools had not been leveraged in recent engagements, largely due to hiring leader preference rather than dissatisfaction: \"They're not necessarily looking at any assessment tools...They like to just have a conversation with the particular candidate.\" Key Themes"
  ],
  "keyThemes": [
    "Consistently strong delivery across specialist executive searches Subject matter expertise and flexibility highly valued Positive, relationship-led engagement model Opportunity to increase awareness of broader capabilities Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Reinforce visibility of broader capabilities through light-touch awareness. Consider selectively increasing awareness of Korn Ferry's wider services with appropriate senior stakeholders, without positioning this as a sales-driven conversation.",
    "Continue role-specific expertise matching. Maintain the practice of aligning consultants with direct functional experience relevant to each search, as this was repeatedly cited as a differentiator.",
    "Sustain flexibility in commercial approach. Continue balancing contractual structures with the practical budget constraints of decentralised investment teams.",
    "Support human-led search alongside enabling technology. Continue combining tools such as AI for identification with relationship-led candidate conversations and clear consultant recommendations. Additional Insight"
  ],
  "additionalInsight": "Human judgement remains central despite openness to AI. While\nsupportive of AI as an enabling tool, Alexander was clear that human\ninteraction and judgement remain critical: “It’s one thing to use AI to identify\npotential candidates, but what I’m looking for is the search firm’s expertise\nin relationship.”\n\n\nPositive experiences reinforce likelihood of repeat use. Alexander\nexpressed clear intent to continue working with Korn Ferry where\nappropriate: “Everyone I’ve worked with has been an excellent partner, and\nI would continue to leverage their services whenever I can.”"
}