{
  "id": "t-042",
  "client": "Julie Tschida Brown",
  "interviewDate": "2025-12-10",
  "project": "ES",
  "score": 7,
  "overview": "Julie is the Chief People & Culture Officer and primary contact for Korn\nFerry across executive search and selected consultancy engagements. The\nrelationship spans approximately two to three years and includes executive\nsearch, leadership competency work, and use of assessment tools.\nOverall, Julie views Korn Ferry’s technical capability and market\nunderstanding as strong, but raised clear concerns about relationship\ndynamics, ways of working, and fee handling, particularly within\nexecutive search engagements.\nWhat Went Well",
  "whatWentWell": [
    "High quality of work and expertise. Julie consistently described the quality of Korn Ferry's work as strong across both search and consultancy: \"The quality of the work that we've received, both on the consultancy side and on the search side, is high.\"",
    "Strong understanding of the business and market. Korn Ferry was seen as knowledgeable about the client's industry and commercial context: \"They know the business, they know our industry, they know what they're doing.\"",
    "Responsiveness and pace. Despite fast-moving and sometimes chaotic internal conditions, Korn Ferry was described as highly responsive: \"They have been unbelievably responsive... they moved very quickly.\"",
    "Search execution and candidate quality. Early-stage delivery, particularly at kick off, was viewed positively: \"On the kick-off, it's very strong... they gave us a good list of people.\"",
    "Consultancy tools and assessments. Leadership competency models and psychometric assessments were viewed as effective and valuable: \"We use their psychometric tools for assessment, and they were very, very good.\" Challenges/ Pain Points"
  ],
  "challengesPainPoints": [
    "Perceived 'managing up' at the expense of the primary contact. Julie felt sidelined in favour of senior stakeholders: \"They're managing up... in a way that felt somewhat disrespectful to me and my role.\"",
    "Fee handling felt transactional rather than partnership-led. The additional fee charged following a CEO-sourced candidate caused frustration: \"It just seemed... penny smart, pound foolish...That behavior would make me not want to work with them again.\"",
    "Dismissive response when concerns were raised. When the issue was tested informally, the response felt closed rather than collaborative: \"They shut her down immediately.\"",
    "Operational burden placed on the client team. Julie felt Korn Ferry relied too heavily on internal resources for logistics: \"They rely on us very heavily for everything logistical...It feels like they kind of expect us to do their logistics.\"",
    "Template and process inefficiencies. Repeated requests for previously shared materials added friction: \"They were like, 'Oh, we don't have that template. Can you send it again?'\"",
    "Gaps Identified (raised by Julie) Insufficient recognition of the client-side partnership role. Julie felt their experience and authority were not consistently respected: \"It definitely feels like a diminishment of my role.\"",
    "Lack of partnership mindset in fee discussions. Fee rigidity conflicted with expectations of a long-term relationship: \"Being treated like that makes me not want to work with them again.\"",
    "Over-reliance on the client for coordination and logistics. Expectations around operational support were unclear: \"We are paying... for them to do it.\" Key Themes"
  ],
  "gapsIdentified": [],
  "keyThemes": [
    "• Strong technical capability alongside differing expectations of engagement style. Julie consistently recognised the quality of Korn Ferry's work, while noting areas where ways of working did not always align with their expectations. • High levels of responsiveness, with some variation in perceived partnership experience. Delivery pace and availability were viewed positively, though the overall partnership experience was not always consistent across all interactions. • Search expertise valued, with some friction in execution and coordination. Market knowledge and candidate quality were appreciated, while certain aspects of execution required additional client involvement. • Importance of collaborative working and role clarity.",
    "Julie placed value on clear recognition of roles, shared ownership, and collaborative engagement throughout the process. Actions & Recommendations"
  ],
  "actionsRecommendations": [
    "Reinforce partnership-led engagement behaviours Encourage consistent recognition of the primary client contact's role, particularly when multiple senior stakeholders are involved. Clarify shared ownership during hybrid candidate sourcing Establish early, transparent alignment on how internally sourced candidates are handled to reduce friction later in the process. Apply discretion in fee-related discussions Consider how commercial decisions may be experienced in the context of ongoing or repeat engagements. Rebalance operational responsibilities Align expectations around logistics, coordination, and reporting so internal teams are not carrying disproportionate effort. Strengthen continuity in process management Ensure materials, templates, and agreed formats are retained and reused to minimise duplication. Additional Insight"
  ],
  "additionalInsight": "Private equity pace shapes expectations. Julie noted the speed and\nintensity of PE environments as a contextual factor: “We’re a PE… we move\nfast.”\nBehaviour outweighs technical competence in relationship decisions.\nDespite acknowledging strong delivery, Julie was clear that working style\nwould influence future firm selection: “This behavior would make me choose\nsomeone else.”"
}