{
  "id": "t-006",
  "sourceFile": "T1_NPS6_EMEA_ES_HOUSE_SEP25.pdf",
  "client": "Greg Austin",
  "interviewDate": "2025-09-02",
  "project": "Search for new COO",
  "score": 6,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Interviewer 1:53",
      "text": "Okay, great. So I won't take up too much of your time. I think, as you know, this is in response to the NPS score that you sent over to Korn Ferry. So we just wanted to dig into a little bit more around that. If we could start off with you just giving us an overview, kind of context of your role within the business and responsibility."
    },
    {
      "speaker": "Speaker 1 2:16",
      "text": "Okay, so I'm the Chief People Officer for the Synlab Uki business. I joined in April this year, so relatively new in and interesting. I was brought in by Korn Ferry on the HR side of the business. So I've got experience as a candidate and then stepping in to this process for the Chief Operating Officer, which was already part way through when I joined. So, two different consultants, two different experiences. And you know, it's been quite interesting comparing the two into how it comes across. So if I, if I just digress a second, and take on board the experience as a candidate, the HR function, it was excellent as a candidate, couldn't, couldn't have done it any differently. I think the consultant I felt was working with me and on my behalf, and, you know, we had really detailed conversations around role, expectation, package, expectation, how that will get negotiated. And John, the consultant, was on the ball from day one, managing all of our side of things. All the contact was with him. And then he's only at the very end, when we finalized everything, did we then speak to similar direct contact with similar once. But we've worked over negotiations out with via by a John. He took an active role in our whole process. If I then compare and contrast that to what I walked into here, I think we'd set the role up towards the back end of last year with Korn Ferry. I think it was quite a unique role and quite a difficult one to articulate in terms of it. It was a new role, part of a matrix organization. I'm still not sure synap entirely knew what they were looking for, but the quality of candidates from Korn Ferry was really quite average. When you looked at it, they knew they were when you said that wanted a really big hit, yet some of the people on the shortlist had minimal experience. Were very average. And I met a couple of them, and after five minutes, you knew they just were nowhere near what you wanted. So my question would be, how did they get through Korn Ferry interviews to get to the point of being put on a short list for the organization that were clearly not where we needed, what we wanted. A successful candidate actually came from us as a referral. So it they weren't even found by Korn Ferry. We We gave them a name and that advice the person we ended up taking on board, and we've just paid 70 or grand in fees for someone that we gave them, which feels a bit of a stink, yeah, it doesn't sit come to with me that that's, that's where we got to with it. So I think there's a, there's a question mark about the quality of candidates that were coming through. I think Thomas become very consultant news, a difficult role, having you described as a unicorn type role, and it was almost an element of, this is really difficult, and I'm going to keep telling you it's difficult, rather than try to find me a solution to to fight. You know, what do we need to do differently? So it wasn't a proactive conversations -- 1 of 8 -- around, you know, do you tweet your search? Do you? Do you tweet what you're actually looking for to get to the right person? Now, maybe you'd already had those discussions where I came in and I got an element, I got a sense of he was frustrated with process and just wanted it dealt with, and wanted it closed off, and rather than trying to figure out how to, how to move it forward and get to the end result. I think, you know, they by the time I joined, he'd already seen the candidate, but we'd given him who and I think the view was, well, that's the candidate. Why do you want to see anybody else? Why do you just go, go with that? And I think Sinha wanted to see more options, and Thomas has a view where you've got the candidate, you know you like them, but pretty much a perfect fit. Why don't you just go ahead and push on that? So I'm sure we won't be easiest if candidate of companies to deal with, but at the same time, I think he always pick a little bit tunnel vision as well, around saying, if you've got one good candidate, why do you need anybody else. So again, something was that aspect to the to the search piece, and then simply, I've dragged his feet for probably six or eight weeks when I first joined as well around it, which, which probably didn't help. And you could see Thomas becoming more and more frustrated around around that. But then I think the bit that disappointed me around the key reason for score was when it came to us actually settling on that candidate, trying to get a sense of Thomas of what's the package. He said, Well, I don't know. What do you think? I said, Well, no, I'm expecting you to tell me what the candidates looking for. What are they on now? What do you recommend? What do we need? And it was very wishy washy from him to a point I've said, Well, if I put an offer of x, and it's Well, I think that might be all right, and you might want to put a bit of bonus on. Well, she asked for a bonus. No, has she asked for signing on bonus? No. Why would I do that then? So there was an element of it didn't feel like he really understood what the package should look like. So had he even talked to the candidate about it? And then, when it came to the negotiation bit, my view was that he should make me offer. And he didn't feel he should make me offer. He thought I should come from others. And I, you know, my view was that that initial offer and negotiation should come by the by the agency, and then we put it in writing once it's been agreed. But he felt that was our role, not his. So I think those are just a bit of a disconnect, I think, between what we expected from him and the proactive nature of that that that ending of the process wasn't quite right, what you should be and"
    },
    {
      "speaker": "Interviewer 8:23",
      "text": "very different to the experience that you had in with the opposite. Yeah, yeah, okay, that's really helpful. Going back to the original brief, so the the original job description, looking back on it. Now, would you? Would you retro, I suppose, respectively, change it like, is it right for the person that you've got in, and has it hit the objectives of is the person that you've got in either living up to that JD, or, as it has it changed a little"
    },
    {
      "speaker": "Speaker 1 8:56",
      "text": "bit? No, pretty much a person we've got will hit the JD. It isn't an exit. It's not something that someone is doing at the moment, because it's a matrix type role, which is very new to sydenhaps. It's the first of its kind. Within our organization, there's a there's a fairly detailed, 10 page candidate brief that got put together for the role, which was sort of agreed with Korn Ferry so that, in itself, was fairly detailed in terms of work that went into it. I think parole itself, bit of a matrix nature is what the challenge is. But we found the candidates, and I'm happy to work in our matrix -- 2 of 8 -- structure. I think I do think we probably didn't explain it to Korn Ferry as well as we should have done at the start. And I think they they struggled to understand what the matrix nature of the organization of the business was, what the role was. And I think that lack of understanding has probably led to the quality of candidates not being as what it should be, but also from taking the view that there isn't a natural candidate that fits into it's not like my role. It's like you're an HR director in business, moving to a chief people officer actually isn't that much different. You just it's a slightly different size and scale, but it's it's still fundamentally HR here. We're saying this is a slightly different role, because we want someone responsible for operating a number of contracts, but from a matrix point of view, you've got somebody else responsible for the profit and loss side of the business. So you've got managing directors sitting there looking at clients and profit and loss. You've got the CEO role is actually driving the performance, productivity of efficiencies, which is a very new concept in in the health world. And I think Thomas and Korn Ferry struggled to understand what that really was. I don't think we I don't think we articulated as well as we could have done. It certainly took me about a month to get ahead around what the role actually was, because I struggled with it as well as it was a new concept to me. I just feels like Thomas is more interesting in tagging us, how difficult it was to fill that role and how it wasn't, and it wasn't a natural role where you could go and find Joe Bloggs is doing that job today. He had, he would have to go and really find someone who had the skills and was interested in that matrix type operation, rather than it being a round hole, around, around, pegging around, whole sort of thing. So it did require, or would require, quite a bit of thought, to go and find some of the necessary skill sets that we want. It's not,"
    },
    {
      "speaker": "Interviewer 11:33",
      "text": "it's not a natural look at that more more laterally in the skills. Do you think then, if you, if you could do anything different, would you have changed that up front, kind of, I suppose, briefing to them, kind of agreeing what good looks like. Or I think"
    },
    {
      "speaker": "Speaker 1 11:49",
      "text": "so. I think we would have, we should have, I wasn't here when we launched. We roll back into last year, but it strikes me that the business was a bit confused. I think confetti were a bit confused, and we've sort of both bumbled off into the future trying to find something without necessarily understanding it. So I think in hindsight, it could have been done a bit better. Now, what I don't know is whether Thomas tried to define that at the time, or whether he's gone with the flow and said, Fine, we'll figure this out as we as we go along. Certainly, when I came in, we sat down to say, right, okay, you keep telling me, this is a difficult role. What's the problem with what's the difficulty? And how do we, how do we find the right person? And how do we, how do we define it in order for you to find the right candidate that's out there? And I'm not sure that happened, probably in as detailed ways it could have or should have done at the early stages."
    },
    {
      "speaker": "Interviewer 12:47",
      "text": "Okay, given you weren't there at the beginning, who was the main stakeholder in your place? It"
    },
    {
      "speaker": "Speaker 1 12:54",
      "text": "-- 3 of 8 -- would have been my my predecessor, right, was involved in setting it up alongside Mark dollars, the chief exec so that so those two both had discussions with Thomas and Korn Ferry around, around the role. Now, Mark view is he felt we had a number of discussions to set the scene. And he felt, again, Thomas pushed back a little bit about how it can be a difficult role to fill, but he thought they'd done enough to set the scene. Our predecessor, I don't know, because she she's gone and is no longer part of the picture. So it's I can't tell from her behalf. It strikes me for probably both parties, because there's a bit better up front. I Right? It just feels like the focus has been nice and difficult roles in new role. It's something that's a bit different. And you know, so I think Mark's view would be, it felt like we heard problems from Thomas, not solutions."
    },
    {
      "speaker": "Interviewer 14:01",
      "text": "Would you expect, or was it part and I don't know, because I haven't seen the original agreement for Korn Ferry to I mean, I'm thinking specifically about compensation planning. So would you expect them to lean into their own pay data and benchmarks to use that was that something that was an expectation?"
    },
    {
      "speaker": "Speaker 1 14:26",
      "text": "I would have thought so. I think we had a I think we gave them a ballpark number and said up to X amount. I think it was up to 250 ish. Was so that the number that was talked about at the start, but within all the detailed documents I've seen, there's nothing more than that. Apart from that, here's our sort of threshold as to where we are. So when he so, you know, when it came to saying, right, perhaps our candidate, let's negotiate. What does she expect? And the answer was, I don't know. So we're sure you've had those conversations about sign expectations and package expectations up front, and it was like, we're not waiting to get we're waiting till you got to that point. Okay, so what does she actually want? What's, what's going to make the move? Well, I think it might be around this sort of number. And I think, you know, my experience with John, when I came through a process was I said, here's what I'm on now, here's what I'm looking for, you know? And we were really clear in how we broke it down into salary, bonus car allowance, signing on, bonus travel expenses, etc. We John and I worked over now, so he went to Syd NAB and said, Right, okay, this is what's gonna this is what, what what it's going to take? And they said, Yes, yes, yes. And then we negotiated on one on two items around that with Thomas, it was like, Well, I think you might be getting curve if you go to around that number. Well, what is the number? Then, you know, I made this, or you could have a standing on bonus. Well, is that a requirement? No, has she asked for it? No. So why would I buy in then, if it's not, why would I spend the money if I don't have to? So I think what's a fair offer, you know, is it, how do we how do we build it? Is it based on salary? Is it really based around bonus? You know, how we offset the NHS pension scheme, which is going to be losing. So what? How much value does she put on that? And we were, I was asking those questions, and I would have expected all that to have been part and parcel of the conversation. Say, right, this is what she's looking for. This is how we're going to this is what it's going to take to get the offer. And then we, you know, agree or negotiate on that basis, but we had to start from scratch around that. And I never got a real sense from Thomas about what the he'd ever had those conversations with her to talk about the detail, yeah,"
    },
    {
      "speaker": "Interviewer 16:52",
      "text": "-- 4 of 8 -- did you bring up with Thomas at any point, like the fact that you weren't happily kind of with the current engagement, both in terms of his, I suppose you know, his maybe challenges instead of solutions, but also around the expectation, around bringing more to the table,"
    },
    {
      "speaker": "Speaker 1 17:09",
      "text": "not around the diesel because, you know, by the point we've come in, we identified, but we had that candidate, I was trying to manage internal stakeholders about getting To that point. And I think, to be honest, nobody actually wanted to use Korn Ferry. It was pushed on them by the group. Okay? So the sort of point was, it wasn't a choice we had. So the view was, we know we've got a decent candidate. Have a look at some of us are out there. If they're no good, fine. Let's just focus on getting this one over the line and deal with it, and we're just, we just needed to make some decisions and move and move it on. Yeah, and I think with regard to the offer, I pushed back, and Tom said, Well, I do think you should make him the offer. He was clear. He didn't think he should be making the offer. And to us, by that point, I almost forgot, I said, I just want to get a process done and move on, and we'll reconsider whether we ever use them again on the back of that. But I just wanted to get it closed off at that point,"
    },
    {
      "speaker": "Interviewer 18:09",
      "text": "going back to your point on nobody wanted to use them in the first place. Why was that, if you had a good experience, what? What's the negativity that already exists?"
    },
    {
      "speaker": "Speaker 1 18:21",
      "text": "I don't know, to be honest, I think it's more a fact that our group had an agreement with them. It was a case of who we want you to use. You've got no choice. I don't think it was anything particular that said we don't want to use them. I think that. I think we are more expensive than other search organizations, but so I think, was the element of that was in the judgment, but it was more a sense of, we were told we had to use them so you don't have a choice around it. And nobody likes being given an ultimatum, right? Not given the choice, do they? Yeah, but I think, you know, those are really detailed candidate brief got put together. So I think, I don't think anyone tried to sabotage it or anything like that. I think was a genuine as I said, we need this role. We need to find one. We know it's a tough gig to find that person, but certainly, I mean, we went into it with trying to find the right person and move it forward."
    },
    {
      "speaker": "Interviewer 19:21",
      "text": "Yeah, okay, is there anything in the whole process that did meet your expectations, that you know that that worked well or worked?"
    },
    {
      "speaker": "Speaker 1 19:32",
      "text": "I mean, I mean the there was a, there was a decent candidate shortlist of information we got about people was, was good. They just, they just felt short generally for quality, the psychometric testing piece was very detailed and very good reporting came out about so that really helped with a couple of candidates as well. When we could see that level of detail into A into some personality type and the psychiatric psychometric types of questioning we wanted to follow up on so that was really valuable and a valuable activity, but, but we did both fairly regular contact, although it -- 5 of 8 -- was frequently based on when Thomas was available, maybe not when we were available. But I think by the time I came in with all I think a lot of the hard work had already been done. I was just trying to close it off because we had this very small, short list of our point and it was trying to move forward to conclusion. And yeah, so the reporting we had was good. For psychometric testing was good. The summary reports came out about were good,"
    },
    {
      "speaker": "Speaker 1 20:47",
      "text": "yeah, I think that's probably extended it from my point of view. Do you,"
    },
    {
      "speaker": "Interviewer 20:51",
      "text": "I mean, given your your two sides of the coin, experience of them, would you use them again if you had, if you had the autonomy to make the decision,"
    },
    {
      "speaker": "Speaker 1 21:02",
      "text": "no, and to be honest, we have a senior role now, but I've gone somewhere else, okay for because I think I spoke to have a couple of Headhunters, and got a Much different sort of feeling of being a client, actually wanting to work with us, and stuff from talking to other club headhunters around it, so very you know they actually made you feel welcome. And you know they wanted your business. And you know you got the value added stuff up front around it, it felt to a degree that Korn Ferry because they have the group relationship, almost took us for granted a little bit. So I just maybe you have to decision to go somewhere else and and see what it see what it feels like, something with another organization that's interesting."
    },
    {
      "speaker": "Interviewer 21:54",
      "text": "What I mean, obviously, there's the relationship element that's important to you. What what other value add? Kind of are you looking for from a recruiter at a senior level?"
    },
    {
      "speaker": "Speaker 1 22:05",
      "text": "So I'm looking for knowledge of a market, so for example, so we've gone with Hunter healthcare for this vacancy, yeah, a very specific healthcare now, Thomas and the cooperative team were had a certain that was part of their healthcare type remit, but helms healthcare very specific in the healthcare space. As soon as we talked about the brief, they came back with suggestions about the role. They came back with people they knew organizations that were going to target, the fields were going to target. They told us which ones they weren't going to target and why. So immediately, there was a sense of they understood the marketplace and the environment. Immediately, then we got the brief from them around what we'd do, how we'd go about it was a really, a very detailed search brief in terms of how they'd go about things. Those had some value. Add stuff around. We're going to make some introductions, and there's some seminars and invites that they've opened up to us to in the health space and at a UK level, which would benefit some of my colleagues on the medical side and operational side in the business. So it needed some value add activity there in the wider health space, where they're making connections, which I think is really valuable as well in the wider sense. But I think fundamentally it was that market understanding that they soon, as we said to him, as Chief Medical Officer role. They knew people in that space. They knew the organizations they couldn't talk to, and they could articulate the what, the how, the -- 6 of 8 -- why. And the lead consultant has been on the phone every week, without fail. Never had to chase them, and they're proactively engaging with us as we go through this. So you feel like they're listening and they, you know, an inconvenience to them, because they're actively going out, you know, they've got 90 odd people on the shortlist, yeah. And that's a huge, shortest long list. It's a huge, is a huge long list. But you can see they've done the research, yeah, and then they've come back and said, right, here's the 90 odd people, here's the ones we think we should focus on. Are you okay with that? Does that meet your expectations? Let's just fine tune a few questions we've got along the way around. Is it pathology? Is it clinical? And they've come back and asked some research and specific questions to help them narrow their focus to get down to the right list at the end of it. So it's been a much more proactive experience so far,"
    },
    {
      "speaker": "Interviewer 24:48",
      "text": "great in terms of, I suppose, beyond search, going back to Korn Ferry first, and then kind of taking it broader. Have you used Korn Ferry or engaged them in any other kind of organization, consultancy, program or project."
    },
    {
      "speaker": "Speaker 1 25:07",
      "text": "I haven't no obviously, I know of them, but I can't remember. I don't think I've ever used someone else in my previous organization. I certainly haven't been through them as a candidate anywhere else. So, yeah, I haven't got any preconceived or previous experiences to work on on that basis,"
    },
    {
      "speaker": "Interviewer 25:28",
      "text": "okay? And then in terms of, I suppose, looking at, do you use other consultancies beyond a search consultancy or agency to support with things like, you know, people, talent management strategy,"
    },
    {
      "speaker": "Speaker 1 25:44",
      "text": "no, not no, because it's a it's a very small group set up and very decentralized. So I think the viewers is, I want to use someone in the UK, that it's down to me to go and to use somebody, but there's nobody set up as a wider, similar group contact. I think at a group level, they have some data from Watson wired that they use, but it's not particularly up to date or specific. I think the view is that, you know, we need to think about using our own, our own options and solutions. But to us, I've not had to do anything like that yet. I'm still, still a few months in, I think we've got, I've got a good sense of where market rates are, so I don't think there's, yeah, if we need to go out, we will do but there's no formal arrangements in place at this point in time. And"
    },
    {
      "speaker": "Interviewer 26:44",
      "text": "last question in terms of, I suppose, you know your role and the use of data, so your own internal data, so you know whether it fits, it's in Workday or or something similar. Are you have, you got different skills in your team to start to kind of leverage that data to be able to create that forward thinking people strategy. What is that a current need?"
    },
    {
      "speaker": "Speaker 1 27:12",
      "text": "Yeah, I've got someone who's got a background in reward and who's to be hitting the organization so, but now I know who that is. We'll put that person out. I mean, 90% -- 7 of 8 -- of our roles are paid against the agenda for change framework, so it's only for 10% of the rules that aren't on the agenda for change. But we need to look at it's not like I need a whole organizational structure set up, because we've aligned ourselves to that framework so that make, that makes for reliance and reward really aimed at senior leaders and a relatively small group of senior leaders, because we've even got a chunk of our leadership teams are still in agenda for change rates of a very high end division for change piece because of a pathology background that they've got. So yeah, with a few head office type roles and senior roles, it's probably no more than about 40 or 50 people that sit outside the agenda for change. So it's a very small need, I think, for that level of additional data analysis. But I do have someone who can do who now do that for me to pull it out, because it's, it's a mess. It's all over the place in terms of what we're paying people and the different standards that we've got. Yeah,"
    },
    {
      "speaker": "Interviewer 28:25",
      "text": "okay, great. We've got two minutes. So anything else that you know you think is important for to share, and obviously, what I'll be doing is collating this back in in a way that you know, you know that you don't want to use them moving forward, but obviously to make sure that they don't have other people don't have the same experiences. Should you come back? You know that make sure that it doesn't happen again? Yeah,"
    },
    {
      "speaker": "Speaker 1 28:48",
      "text": "but no, I think we've captured the main points. I'm sure similar wasn't perfect in elements beside and we probably, I think it was a difficult surge, but I don't think Korn Ferry helped matters either. I think it's offset by the CANS experience was so good on the other side. And I think was it for me, was a marked difference in terms of what, what I felt the two approaches were,"
    },
    {
      "speaker": "Interviewer 29:15",
      "text": "yeah, we had a like for like to compare and contrast. Yeah. Okay, brilliant. Well, Greg, thanks again for your time. Really appreciate you taking kind of, you know, an extra half an hour. I know you did the NPS already, so really do appreciate it. And, yeah, really nice to meet you."
    },
    {
      "speaker": "Speaker 1 29:31",
      "text": "Okay, no problem. Interviewer, thank you for that good day. See you later. Bye. -- 8 of 8 --"
    }
  ],
  "rawText": "Interviewer 1:53: Okay, great. So I won't take up too much of your time. I think, as you know, this is in response to the NPS score that you sent over to Korn Ferry. So we just wanted to dig into a little bit more around that. If we could start off with you just giving us an overview, kind of context of your role within the business and responsibility.\n\nSpeaker 1 2:16: Okay, so I'm the Chief People Officer for the Synlab Uki business. I joined in April this year, so relatively new in and interesting. I was brought in by Korn Ferry on the HR side of the business. So I've got experience as a candidate and then stepping in to this process for the Chief Operating Officer, which was already part way through when I joined. So, two different consultants, two different experiences. And you know, it's been quite interesting comparing the two into how it comes across. So if I, if I just digress a second, and take on board the experience as a candidate, the HR function, it was excellent as a candidate, couldn't, couldn't have done it any differently. I think the consultant I felt was working with me and on my behalf, and, you know, we had really detailed conversations around role, expectation, package, expectation, how that will get negotiated. And John, the consultant, was on the ball from day one, managing all of our side of things. All the contact was with him. And then he's only at the very end, when we finalized everything, did we then speak to similar direct contact with similar once. But we've worked over negotiations out with via by a John. He took an active role in our whole process. If I then compare and contrast that to what I walked into here, I think we'd set the role up towards the back end of last year with Korn Ferry. I think it was quite a unique role and quite a difficult one to articulate in terms of it. It was a new role, part of a matrix organization. I'm still not sure synap entirely knew what they were looking for, but the quality of candidates from Korn Ferry was really quite average. When you looked at it, they knew they were when you said that wanted a really big hit, yet some of the people on the shortlist had minimal experience. Were very average. And I met a couple of them, and after five minutes, you knew they just were nowhere near what you wanted. So my question would be, how did they get through Korn Ferry interviews to get to the point of being put on a short list for the organization that were clearly not where we needed, what we wanted. A successful candidate actually came from us as a referral. So it they weren't even found by Korn Ferry. We We gave them a name and that advice the person we ended up taking on board, and we've just paid 70 or grand in fees for someone that we gave them, which feels a bit of a stink, yeah, it doesn't sit come to with me that that's, that's where we got to with it. So I think there's a, there's a question mark about the quality of candidates that were coming through. I think Thomas become very consultant news, a difficult role, having you described as a unicorn type role, and it was almost an element of, this is really difficult, and I'm going to keep telling you it's difficult, rather than try to find me a solution to to fight. You know, what do we need to do differently? So it wasn't a proactive conversations -- 1 of 8 -- around, you know, do you tweet your search? Do you? Do you tweet what you're actually looking for to get to the right person? Now, maybe you'd already had those discussions where I came in and I got an element, I got a sense of he was frustrated with process and just wanted it dealt with, and wanted it closed off, and rather than trying to figure out how to, how to move it forward and get to the end result. I think, you know, they by the time I joined, he'd already seen the candidate, but we'd given him who and I think the view was, well, that's the candidate. Why do you want to see anybody else? Why do you just go, go with that? And I think Sinha wanted to see more options, and Thomas has a view where you've got the candidate, you know you like them, but pretty much a perfect fit. Why don't you just go ahead and push on that? So I'm sure we won't be easiest if candidate of companies to deal with, but at the same time, I think he always pick a little bit tunnel vision as well, around saying, if you've got one good candidate, why do you need anybody else. So again, something was that aspect to the to the search piece, and then simply, I've dragged his feet for probably six or eight weeks when I first joined as well around it, which, which probably didn't help. And you could see Thomas becoming more and more frustrated around around that. But then I think the bit that disappointed me around the key reason for score was when it came to us actually settling on that candidate, trying to get a sense of Thomas of what's the package. He said, Well, I don't know. What do you think? I said, Well, no, I'm expecting you to tell me what the candidates looking for. What are they on now? What do you recommend? What do we need? And it was very wishy washy from him to a point I've said, Well, if I put an offer of x, and it's Well, I think that might be all right, and you might want to put a bit of bonus on. Well, she asked for a bonus. No, has she asked for signing on bonus? No. Why would I do that then? So there was an element of it didn't feel like he really understood what the package should look like. So had he even talked to the candidate about it? And then, when it came to the negotiation bit, my view was that he should make me offer. And he didn't feel he should make me offer. He thought I should come from others. And I, you know, my view was that that initial offer and negotiation should come by the by the agency, and then we put it in writing once it's been agreed. But he felt that was our role, not his. So I think those are just a bit of a disconnect, I think, between what we expected from him and the proactive nature of that that that ending of the process wasn't quite right, what you should be and\n\nInterviewer 8:23: very different to the experience that you had in with the opposite. Yeah, yeah, okay, that's really helpful. Going back to the original brief, so the the original job description, looking back on it. Now, would you? Would you retro, I suppose, respectively, change it like, is it right for the person that you've got in, and has it hit the objectives of is the person that you've got in either living up to that JD, or, as it has it changed a little\n\nSpeaker 1 8:56: bit? No, pretty much a person we've got will hit the JD. It isn't an exit. It's not something that someone is doing at the moment, because it's a matrix type role, which is very new to sydenhaps. It's the first of its kind. Within our organization, there's a there's a fairly detailed, 10 page candidate brief that got put together for the role, which was sort of agreed with Korn Ferry so that, in itself, was fairly detailed in terms of work that went into it. I think parole itself, bit of a matrix nature is what the challenge is. But we found the candidates, and I'm happy to work in our matrix -- 2 of 8 -- structure. I think I do think we probably didn't explain it to Korn Ferry as well as we should have done at the start. And I think they they struggled to understand what the matrix nature of the organization of the business was, what the role was. And I think that lack of understanding has probably led to the quality of candidates not being as what it should be, but also from taking the view that there isn't a natural candidate that fits into it's not like my role. It's like you're an HR director in business, moving to a chief people officer actually isn't that much different. You just it's a slightly different size and scale, but it's it's still fundamentally HR here. We're saying this is a slightly different role, because we want someone responsible for operating a number of contracts, but from a matrix point of view, you've got somebody else responsible for the profit and loss side of the business. So you've got managing directors sitting there looking at clients and profit and loss. You've got the CEO role is actually driving the performance, productivity of efficiencies, which is a very new concept in in the health world. And I think Thomas and Korn Ferry struggled to understand what that really was. I don't think we I don't think we articulated as well as we could have done. It certainly took me about a month to get ahead around what the role actually was, because I struggled with it as well as it was a new concept to me. I just feels like Thomas is more interesting in tagging us, how difficult it was to fill that role and how it wasn't, and it wasn't a natural role where you could go and find Joe Bloggs is doing that job today. He had, he would have to go and really find someone who had the skills and was interested in that matrix type operation, rather than it being a round hole, around, around, pegging around, whole sort of thing. So it did require, or would require, quite a bit of thought, to go and find some of the necessary skill sets that we want. It's not,\n\nInterviewer 11:33: it's not a natural look at that more more laterally in the skills. Do you think then, if you, if you could do anything different, would you have changed that up front, kind of, I suppose, briefing to them, kind of agreeing what good looks like. Or I think\n\nSpeaker 1 11:49: so. I think we would have, we should have, I wasn't here when we launched. We roll back into last year, but it strikes me that the business was a bit confused. I think confetti were a bit confused, and we've sort of both bumbled off into the future trying to find something without necessarily understanding it. So I think in hindsight, it could have been done a bit better. Now, what I don't know is whether Thomas tried to define that at the time, or whether he's gone with the flow and said, Fine, we'll figure this out as we as we go along. Certainly, when I came in, we sat down to say, right, okay, you keep telling me, this is a difficult role. What's the problem with what's the difficulty? And how do we, how do we find the right person? And how do we, how do we define it in order for you to find the right candidate that's out there? And I'm not sure that happened, probably in as detailed ways it could have or should have done at the early stages.\n\nInterviewer 12:47: Okay, given you weren't there at the beginning, who was the main stakeholder in your place? It\n\nSpeaker 1 12:54: -- 3 of 8 -- would have been my my predecessor, right, was involved in setting it up alongside Mark dollars, the chief exec so that so those two both had discussions with Thomas and Korn Ferry around, around the role. Now, Mark view is he felt we had a number of discussions to set the scene. And he felt, again, Thomas pushed back a little bit about how it can be a difficult role to fill, but he thought they'd done enough to set the scene. Our predecessor, I don't know, because she she's gone and is no longer part of the picture. So it's I can't tell from her behalf. It strikes me for probably both parties, because there's a bit better up front. I Right? It just feels like the focus has been nice and difficult roles in new role. It's something that's a bit different. And you know, so I think Mark's view would be, it felt like we heard problems from Thomas, not solutions.\n\nInterviewer 14:01: Would you expect, or was it part and I don't know, because I haven't seen the original agreement for Korn Ferry to I mean, I'm thinking specifically about compensation planning. So would you expect them to lean into their own pay data and benchmarks to use that was that something that was an expectation?\n\nSpeaker 1 14:26: I would have thought so. I think we had a I think we gave them a ballpark number and said up to X amount. I think it was up to 250 ish. Was so that the number that was talked about at the start, but within all the detailed documents I've seen, there's nothing more than that. Apart from that, here's our sort of threshold as to where we are. So when he so, you know, when it came to saying, right, perhaps our candidate, let's negotiate. What does she expect? And the answer was, I don't know. So we're sure you've had those conversations about sign expectations and package expectations up front, and it was like, we're not waiting to get we're waiting till you got to that point. Okay, so what does she actually want? What's, what's going to make the move? Well, I think it might be around this sort of number. And I think, you know, my experience with John, when I came through a process was I said, here's what I'm on now, here's what I'm looking for, you know? And we were really clear in how we broke it down into salary, bonus car allowance, signing on, bonus travel expenses, etc. We John and I worked over now, so he went to Syd NAB and said, Right, okay, this is what's gonna this is what, what what it's going to take? And they said, Yes, yes, yes. And then we negotiated on one on two items around that with Thomas, it was like, Well, I think you might be getting curve if you go to around that number. Well, what is the number? Then, you know, I made this, or you could have a standing on bonus. Well, is that a requirement? No, has she asked for it? No. So why would I buy in then, if it's not, why would I spend the money if I don't have to? So I think what's a fair offer, you know, is it, how do we how do we build it? Is it based on salary? Is it really based around bonus? You know, how we offset the NHS pension scheme, which is going to be losing. So what? How much value does she put on that? And we were, I was asking those questions, and I would have expected all that to have been part and parcel of the conversation. Say, right, this is what she's looking for. This is how we're going to this is what it's going to take to get the offer. And then we, you know, agree or negotiate on that basis, but we had to start from scratch around that. And I never got a real sense from Thomas about what the he'd ever had those conversations with her to talk about the detail, yeah,\n\nInterviewer 16:52: -- 4 of 8 -- did you bring up with Thomas at any point, like the fact that you weren't happily kind of with the current engagement, both in terms of his, I suppose you know, his maybe challenges instead of solutions, but also around the expectation, around bringing more to the table,\n\nSpeaker 1 17:09: not around the diesel because, you know, by the point we've come in, we identified, but we had that candidate, I was trying to manage internal stakeholders about getting To that point. And I think, to be honest, nobody actually wanted to use Korn Ferry. It was pushed on them by the group. Okay? So the sort of point was, it wasn't a choice we had. So the view was, we know we've got a decent candidate. Have a look at some of us are out there. If they're no good, fine. Let's just focus on getting this one over the line and deal with it, and we're just, we just needed to make some decisions and move and move it on. Yeah, and I think with regard to the offer, I pushed back, and Tom said, Well, I do think you should make him the offer. He was clear. He didn't think he should be making the offer. And to us, by that point, I almost forgot, I said, I just want to get a process done and move on, and we'll reconsider whether we ever use them again on the back of that. But I just wanted to get it closed off at that point,\n\nInterviewer 18:09: going back to your point on nobody wanted to use them in the first place. Why was that, if you had a good experience, what? What's the negativity that already exists?\n\nSpeaker 1 18:21: I don't know, to be honest, I think it's more a fact that our group had an agreement with them. It was a case of who we want you to use. You've got no choice. I don't think it was anything particular that said we don't want to use them. I think that. I think we are more expensive than other search organizations, but so I think, was the element of that was in the judgment, but it was more a sense of, we were told we had to use them so you don't have a choice around it. And nobody likes being given an ultimatum, right? Not given the choice, do they? Yeah, but I think, you know, those are really detailed candidate brief got put together. So I think, I don't think anyone tried to sabotage it or anything like that. I think was a genuine as I said, we need this role. We need to find one. We know it's a tough gig to find that person, but certainly, I mean, we went into it with trying to find the right person and move it forward.\n\nInterviewer 19:21: Yeah, okay, is there anything in the whole process that did meet your expectations, that you know that that worked well or worked?\n\nSpeaker 1 19:32: I mean, I mean the there was a, there was a decent candidate shortlist of information we got about people was, was good. They just, they just felt short generally for quality, the psychometric testing piece was very detailed and very good reporting came out about so that really helped with a couple of candidates as well. When we could see that level of detail into A into some personality type and the psychiatric psychometric types of questioning we wanted to follow up on so that was really valuable and a valuable activity, but, but we did both fairly regular contact, although it -- 5 of 8 -- was frequently based on when Thomas was available, maybe not when we were available. But I think by the time I came in with all I think a lot of the hard work had already been done. I was just trying to close it off because we had this very small, short list of our point and it was trying to move forward to conclusion. And yeah, so the reporting we had was good. For psychometric testing was good. The summary reports came out about were good,\n\nSpeaker 1 20:47: yeah, I think that's probably extended it from my point of view. Do you,\n\nInterviewer 20:51: I mean, given your your two sides of the coin, experience of them, would you use them again if you had, if you had the autonomy to make the decision,\n\nSpeaker 1 21:02: no, and to be honest, we have a senior role now, but I've gone somewhere else, okay for because I think I spoke to have a couple of Headhunters, and got a Much different sort of feeling of being a client, actually wanting to work with us, and stuff from talking to other club headhunters around it, so very you know they actually made you feel welcome. And you know they wanted your business. And you know you got the value added stuff up front around it, it felt to a degree that Korn Ferry because they have the group relationship, almost took us for granted a little bit. So I just maybe you have to decision to go somewhere else and and see what it see what it feels like, something with another organization that's interesting.\n\nInterviewer 21:54: What I mean, obviously, there's the relationship element that's important to you. What what other value add? Kind of are you looking for from a recruiter at a senior level?\n\nSpeaker 1 22:05: So I'm looking for knowledge of a market, so for example, so we've gone with Hunter healthcare for this vacancy, yeah, a very specific healthcare now, Thomas and the cooperative team were had a certain that was part of their healthcare type remit, but helms healthcare very specific in the healthcare space. As soon as we talked about the brief, they came back with suggestions about the role. They came back with people they knew organizations that were going to target, the fields were going to target. They told us which ones they weren't going to target and why. So immediately, there was a sense of they understood the marketplace and the environment. Immediately, then we got the brief from them around what we'd do, how we'd go about it was a really, a very detailed search brief in terms of how they'd go about things. Those had some value. Add stuff around. We're going to make some introductions, and there's some seminars and invites that they've opened up to us to in the health space and at a UK level, which would benefit some of my colleagues on the medical side and operational side in the business. So it needed some value add activity there in the wider health space, where they're making connections, which I think is really valuable as well in the wider sense. But I think fundamentally it was that market understanding that they soon, as we said to him, as Chief Medical Officer role. They knew people in that space. They knew the organizations they couldn't talk to, and they could articulate the what, the how, the -- 6 of 8 -- why. And the lead consultant has been on the phone every week, without fail. Never had to chase them, and they're proactively engaging with us as we go through this. So you feel like they're listening and they, you know, an inconvenience to them, because they're actively going out, you know, they've got 90 odd people on the shortlist, yeah. And that's a huge, shortest long list. It's a huge, is a huge long list. But you can see they've done the research, yeah, and then they've come back and said, right, here's the 90 odd people, here's the ones we think we should focus on. Are you okay with that? Does that meet your expectations? Let's just fine tune a few questions we've got along the way around. Is it pathology? Is it clinical? And they've come back and asked some research and specific questions to help them narrow their focus to get down to the right list at the end of it. So it's been a much more proactive experience so far,\n\nInterviewer 24:48: great in terms of, I suppose, beyond search, going back to Korn Ferry first, and then kind of taking it broader. Have you used Korn Ferry or engaged them in any other kind of organization, consultancy, program or project.\n\nSpeaker 1 25:07: I haven't no obviously, I know of them, but I can't remember. I don't think I've ever used someone else in my previous organization. I certainly haven't been through them as a candidate anywhere else. So, yeah, I haven't got any preconceived or previous experiences to work on on that basis,\n\nInterviewer 25:28: okay? And then in terms of, I suppose, looking at, do you use other consultancies beyond a search consultancy or agency to support with things like, you know, people, talent management strategy,\n\nSpeaker 1 25:44: no, not no, because it's a it's a very small group set up and very decentralized. So I think the viewers is, I want to use someone in the UK, that it's down to me to go and to use somebody, but there's nobody set up as a wider, similar group contact. I think at a group level, they have some data from Watson wired that they use, but it's not particularly up to date or specific. I think the view is that, you know, we need to think about using our own, our own options and solutions. But to us, I've not had to do anything like that yet. I'm still, still a few months in, I think we've got, I've got a good sense of where market rates are, so I don't think there's, yeah, if we need to go out, we will do but there's no formal arrangements in place at this point in time. And\n\nInterviewer 26:44: last question in terms of, I suppose, you know your role and the use of data, so your own internal data, so you know whether it fits, it's in Workday or or something similar. Are you have, you got different skills in your team to start to kind of leverage that data to be able to create that forward thinking people strategy. What is that a current need?\n\nSpeaker 1 27:12: Yeah, I've got someone who's got a background in reward and who's to be hitting the organization so, but now I know who that is. We'll put that person out. I mean, 90% -- 7 of 8 -- of our roles are paid against the agenda for change framework, so it's only for 10% of the rules that aren't on the agenda for change. But we need to look at it's not like I need a whole organizational structure set up, because we've aligned ourselves to that framework so that make, that makes for reliance and reward really aimed at senior leaders and a relatively small group of senior leaders, because we've even got a chunk of our leadership teams are still in agenda for change rates of a very high end division for change piece because of a pathology background that they've got. So yeah, with a few head office type roles and senior roles, it's probably no more than about 40 or 50 people that sit outside the agenda for change. So it's a very small need, I think, for that level of additional data analysis. But I do have someone who can do who now do that for me to pull it out, because it's, it's a mess. It's all over the place in terms of what we're paying people and the different standards that we've got. Yeah,\n\nInterviewer 28:25: okay, great. We've got two minutes. So anything else that you know you think is important for to share, and obviously, what I'll be doing is collating this back in in a way that you know, you know that you don't want to use them moving forward, but obviously to make sure that they don't have other people don't have the same experiences. Should you come back? You know that make sure that it doesn't happen again? Yeah,\n\nSpeaker 1 28:48: but no, I think we've captured the main points. I'm sure similar wasn't perfect in elements beside and we probably, I think it was a difficult surge, but I don't think Korn Ferry helped matters either. I think it's offset by the CANS experience was so good on the other side. And I think was it for me, was a marked difference in terms of what, what I felt the two approaches were,\n\nInterviewer 29:15: yeah, we had a like for like to compare and contrast. Yeah. Okay, brilliant. Well, Greg, thanks again for your time. Really appreciate you taking kind of, you know, an extra half an hour. I know you did the NPS already, so really do appreciate it. And, yeah, really nice to meet you.\n\nSpeaker 1 29:31: Okay, no problem. Interviewer, thank you for that good day. See you later. Bye. -- 8 of 8 --"
}