{
  "id": "t-009",
  "sourceFile": "T4_NPS7_NA_PS_HOUSE_SEP25.pdf",
  "client": "Andre Buckles",
  "interviewDate": "2025-09-18",
  "project": "Professional Search",
  "score": 7,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Interviewer 0:00",
      "text": "Team problems. Okay, okay, great. So yeah, well, that's the admin out the way of if you're all right for me recording. Now I've lost you on my screen, so I'm just trying to find you."
    },
    {
      "speaker": "Speaker 1 0:17",
      "text": "Apologies. Yeah, I give consent to be recorded."
    },
    {
      "speaker": "Interviewer 0:21",
      "text": "Absolutely great. Thank you. So I will try and keep this as brief as possible. I appreciate your busy essentially, thank you for first filling in the NPS and agreeing to have a further interview. As part of core is commitment to always improving customer experience. We'd just like to dig into a bit more the experience. And work out, you know, where they where they can make improvements. I am an external consultant, so I've been working with one fro for the last five years, and know their business really well. By asking me to do this, they're hoping, or we're all hoping, that, you know, you'll have been more transparent and more honest and be able to speak freely. So, as I said, the note taker is taken for my team, so they can kind of write this up, and we can then feed it back collectively to the team. Are you comfortable with this, feeding it back? Unknown Speaker 1:17 Not. Okay. Yeah, absolutely."
    },
    {
      "speaker": "Interviewer 1:20",
      "text": "So if we can first just kick off by if you can just explain your job role within the organization and the engagement that you had have had with Korn Ferry to date, absolutely."
    },
    {
      "speaker": "Speaker 1 1:36",
      "text": "So I lead talent acquisition for the company, which includes all levels of hiring. It includes about 10 other responsibilities, which I won't bore you with, but they're related to onboarding and compliance and those sorts of things. The OCC is engaged with Korn Ferry actually predates this particular search, and we've worked with them as a partner, primarily in our assessment and organizational development functions. They've been partners to us in developing our list of leadership behaviors. We use them for pre hire assessments at some levels, and we also have partnered with them to deliver 360 feedback and other sort of ongoing development opportunities. So they're, they're well established partner to The OCC, and in the course of identifying the need to hire, initially very confidentially, a new controller for The OCC core and Korn Ferry was one of three firms that I invited to pitch for the business, and the initial point of Contact is someone local here in Chicago named Martha watt, who we've known for a long time, and she, in turn, introduced me to Ann wicks, who was the primary consultant on the engagement, and Anne and Martha and a couple of other people started the initial pitch proposition, providing us insight into their capabilities and recent placements at the control controller level. Given that that a dedicated focus of her team that really allowed us to make the decision to the business to Korn Ferry, I would say that the initial start to the search was a little less smooth than we would have liked. And the reason that that it was sort of less smooth is there were some initial we operate very rapidly, and we are a time sensitive organization. And given and geolocation on the west coast, the United States, and she had Priya too, who was on the East Coast. You know, we didn't have that sort of sending inquiries, and we're hearing back within two three hours. Sometimes it would be overnight, sometimes it would be a little bit longer. And on occasion, instead of just replying to an email, there was a request to have a conversation, set up a call, and so forth. And in my view, I understand why sometimes discussing and having dialog is impactful, but I always don't have the luxury of being able to carve out those times to do so, and I'd rather just operate, you know, 24/7, if I can correspond the email or or other messages of that type. -- 1 of 5 -- So once we sorted the communication piece out, once we got to a little bit better cadence of how we appreciated discussion, our regular, ongoing update, meetings, much more productive. And we essentially went from confidential, keep it quiet to Okay, now it can be public, and that's sort of when things really started to speak. To speed up. So I'll stop there, because I just threw a lot at,"
    },
    {
      "speaker": "Interviewer 4:46",
      "text": "you know, that will make sense. And so, so essentially, kind of rocky start came down to preferred ways of working and having clarity on that from the outset, in terms of the task itself. And, you know, actually co creating, or maybe you didn't co create the JD, is that something that you felt was, or is that part of the backwards and forwards that we felt a bit messy?"
    },
    {
      "speaker": "Speaker 1 5:15",
      "text": "No, it actually was very insightful from them. And I'm pulling my pulling my records here on this. So give me one second. So I think one of the things that they really helped us identify was the title and sort of what it did to the prospect engagement pool. And as Anne's a CPA, and she knows the business well, I think that she was really, really very additive in terms of being able to tell us, hey, you're calling this x. This is how it looks in the market. This is what people are seeing, right? And as we start to recategorize it as more than a controller and somebody who was going to be, you know, possible CFO successor, and have a bit more remit down the road that opened up the pool of talent to us. And ironically, the person that we we ended up choosing, and who started last week, has an FP and a background, versus a pure accounting background, and the second person who was presented to us is more of that standard accounting background, who who's been a controller for some time, and it boiled down to longevity and additional growth opportunities. Because, in our view, somebody who can learn and build their skill set is going to have a longer runway versus, yeah, do the job, there's nothing else to do. And I think Ann helped us identify that fairly clearly to say, if you know, if you think you want just an operator to work nothing else, this is what you're going to get. But if you strive for that successor material, or somebody else who has a longer runway, this is what you need to start focusing on. And I don't think we realized initially that that was important. But the more we interview people, because I'm looking and we interviewed a ton of people. I mean, I can't even count right now, we began to sort of understand the landscape, especially in the Chicago market, and the limited talent pool who were capable. They helped sort of drive us to that decision."
    },
    {
      "speaker": "Interviewer 7:22",
      "text": "So it said that you, you've interviewed a lot of people, so were you pleased with the number of candidates put on up?"
    },
    {
      "speaker": "Speaker 1 7:32",
      "text": "There are never enough candidates. That doesn't matter who it is, right? We always want to see more. We always want to make sure we're doing a thorough assessment of the market. I think what did start to happen as it became clear that we had two finalists is they had offered to expand geo beyond Chicago, but I don't know that they actually ever did that, because we didn't. We didn't ask them for additional people to interview, right? So we did in our in our final sort of update calls, have a discussion around who else is out there. What's our plan B, if neither of these people work out? But we thankfully never had to get to that point, because we ended up being able to get the person on boarded and make everything else happen. We know that the reservation I had in the back of my mind and I, I stated this to Anne, because I actually met her and Martha in person earlier this week. They were here in Chicago, and I basically said to them, you know, it was great, but we potentially dodged a bullet, because if things had not ended up working out with our candidate choice, I said I was not quite comfortable that we had a ready backup pool of people we'd be able to immediately bring in and continue the process, right? So the thing that was a little concerning to me was, yeah, we're placing all of our outcomes on one person, and people have circumstances that are beyond their control, and they have decisions to make, and oftentimes, not oftentimes, but sometimes you make an offer, you think everything's well and good, and then all of a sudden, something falls apart, right? So I think that in the course of the end product, I feel like the speed and the execution and the dialog was not as rapid as it could have been, if it sort of kept the pipeline moving, kept the interviews going, that sort of thing."
    },
    {
      "speaker": "Interviewer 9:32",
      "text": "So is there a potential kind of you know, could meeting expectations on not only the number of candidates, but also the quality. So, I mean, how did you how did they fare? -- 2 of 5 --"
    },
    {
      "speaker": "Speaker 1 9:47",
      "text": "I think the quality was there, right? We didn't interview anyone where we said, Geez, they just don't meet the qualifications at all. I think for us to sort of, let's keep things moving until it's ready to stop. So for example, if I engage other search firms, what we'll have happen is that they will essentially keep sharing candidates, and we keep interviews going until an offer is accepted in the background checks been cleared, right? And then it's upon them. If we do end up interviewing additional people, and the person does confirm their start date, you know, they then manage the, you know, compensation around it was great to meet you Andre selected another person, and so on and so forth. So I think that the piece for us that was probably missing was okay, not doing any more interviews, but why not? Right? And I didn't push them too much that because I was fairly confident that this individual was going to end up starting. But I also sort of in the back of my mind, had to manage the CFO to say, trust this is going to work out. Yeah, instead of Okay, why don't we have other people to talk to?"
    },
    {
      "speaker": "Interviewer 11:05",
      "text": "Yeah, makes sense. And in terms of closing them, did they support through kind of compensation negotiation and contract, or was that something that you you led on,"
    },
    {
      "speaker": "Speaker 1 11:16",
      "text": "I took a primary lead. So I've been doing this for many, many years, and I used to be a retained search consultant myself. But what I did, I've got a process that I follow internally. We're a very structured company, and we have very specific ways we do things, and I essentially drove all of that. I did ask him for the help around the expectations. There were some considerations around earned and unpaid compensation that we needed to address, and so they helped with the data collection pieces on those but as it came down to the final negotiations, I sort of took the lead in terms of communicating directly with the candidate, kept them posted after the fact, and that's how we wanted. It wasn't because they weren't capable. It didn't do their job. We just choose to take a more hands on approach in those cases."
    },
    {
      "speaker": "Interviewer 12:12",
      "text": "Okay? And in terms of, you know, you said you've used them for leadership development and assessment in the past. Did you use them as did you use their assess tool as part of this recruit kind of select"
    },
    {
      "speaker": "Speaker 1 12:26",
      "text": "piece we did in what happened was the rollout of the tool. There were a couple of challenges we ran into with the assessment process itself. And some of them were on us. Some of them were just a communication breakdown with that team, but essentially we when we put the assessment program together, we had asked for specific three specific types. We weren't doing the whole customized piece that generally would happen. And when came to actually getting the results, there hadn't been a communication from the team beyond sending it to a dedicated mailbox that we had set up, right? So the first couple came through. I missed them because I failed to look for the mailbox, but there also wasn't any communication from the team that said, heads up, they're going to start going out to you now, right? It was only when I followed up and said, Hey, I'm not seeing any of these. And they said, Oh, they're in your dedicated mailbox. And then I found them right? But oftentimes, when we've got a million things going on at once, we're not always thinking back to looking in those places. And yes, that was on me, and I should have followed up and looked where I said, but that sort of proactive nudge that says, Hey, forget. This is where things are standing. That was missing, and that led to a little bit of a delay in terms of being able to actually have it. But I will say that the initial so we had a more formal assessment. What's the word I'm looking for we had a formal assessment review with the team and with Anne on the call this will that was incredibly powerful, because if you just look at it in a vacuum, without context and without an organizational psychologist explaining it to you, it's easy to misinterpret things, and in the course of that discussion, that's where we've sort of had the aha moment that said, Oh, this is the person we need to make an offer to, right? So at the end of the day, that was very, very impactful for us, and I think it gave us insights that we missed in the course of our interview, because we had some actual data to back up are, at that time, incorrect assumptions."
    },
    {
      "speaker": "Interviewer 14:44",
      "text": "How on that theme, how important is, I suppose, data informed decision making when it comes to things like not just search, but their broader consultancy offer, -- 3 of 5 --"
    },
    {
      "speaker": "Speaker 1 14:58",
      "text": "I would say that that's probably critically important, right? We have to, we have to use objective measures, and we have to use sort of a common thread of tools in terms of not only assessment, but also development and engagement and performance management. And I believe that this sets a strong foundation when used properly. So one of the outcomes, for example, when the individual had accepted the offer, is I re shared the interview guide, the assessment results and the actual candidate guide with the CFO and said, Hey, these are tools you may want to use when you're setting your first 90 day objectives, your longer term objectives, and some of your development opportunities. And I think that that, that closing of the loop is really powerful, because it solves the question, geez, what do I really need to focus on for this person beyond day to day task work?"
    },
    {
      "speaker": "Interviewer 15:55",
      "text": "Yeah, absolutely. You say that you, you know, you use a different search firms for different roles. How do they compare? So in terms of just, you know, overall kind of price, experience, partnership, what you're looking for, what's what's great, and what isn't,"
    },
    {
      "speaker": "Speaker 1 16:16",
      "text": "yeah, price, I'd say, is less of a driver for us. I think relationship, engagement and understanding of our business are really, really top considerations we use, we use some of the large international firms for support. We also use some local specialty firms that there's a firm out of New York that I've had a partnership for with for probably 10 years, and they are usually who we use for very specific technical roles that are just needle in the haystack. Maybe five or six people in country do it. But then for broader ones, where we know we need Mark visibility. So the litmus test for us is, if a retained search partner contacts a prospective candidate, are they going to pick up the phone and respond to the message because of name recognition? Right? Versus if it's a boutique firm and there's a small pool of people who do the work that we need to have done, then name recognition is less important than the strength and power of their network, right? So you get any big firm like Korn Ferry and you've got your team of researchers, and you've got your associates, and everyone else is doing the work behind the scenes. That's a volume play with some relationship play at stake. And I think what's set and apart is this is what she does, period. It's not, yes, there are six lines of businesses, and this is a particular focus that she has at the moment, right? That's her bread and butter. I mean, she's on the way to the CPA conference, and sort of that's who she is and who she engages with, and how she networks. And that was really the power for us, because the two other firms that were in consideration, one was a national firm. A third had actually placed the previous controller, who had been in the midst of departing the company. And I gave an opportunity to the previous firm to pitch and see what their thought process was, knowing that we were going to be moving on from that individual, and they were a boutique firm, not the name recognition we needed, not even based in Chicago and that sort of, you know, the location for Anne, besides what I stated earlier about being on the opposite coast, other than that, the fact that she was a CPA, knew this business, understood, sort of how the market sees controllership versus CFO versus FP and a people. So you know that that's where it really boiled down to. And I initially had reservations because of my previous experience with this project that I mentioned. But when she came to the table and we're sort of like, oh, wow, this is her world. It became a pretty clear decision, who we needed to hire."
    },
    {
      "speaker": "Interviewer 19:05",
      "text": "Can we talk a bit of a lot of the assessment project? It sounded like that didn't go as well. Are you comfortable talking about it?"
    },
    {
      "speaker": "Speaker 1 19:14",
      "text": "I am. But that's not that was less of a Korn Ferry issue than an The OCC issue, right? I think that they did absolutely what we asked them to do. We had some challenges when it came to the signing of the contracts and those other things that were of our own making, those had nothing to do with the team. I think we did have a few more times where we had to re explain and reconfirm things. But once we got all of that done, we have been fined. We did have one little communication gap in terms of our levels and how we were asking things to be categorized versus how Korn Ferry would categorize in a traditional manner. And when I talk about that, we have different assessments for different levels of professional, yeah, we've got sort of senior executive, mid tier manager, and then individual contributor. And there was some labeling mistakes made with the first couple of assessment reports that came out, but those are solved for everyone's on the same page now. -- 4 of 5 --"
    },
    {
      "speaker": "Interviewer 20:17",
      "text": "So it feels like there's a consistent pattern of, you know, kind of not a rocky start, because that's maybe too strong, but there's a need for kind of clearer rules of engagement and communication styles and needs and wants laid out from the start to avoid any of those bumps in the road."
    },
    {
      "speaker": "Speaker 1 20:38",
      "text": "Yes, yes. I think that one of the things we'll always ask at the outset of a search, if we're not engaging a firm, is, you know, what's the frequency of update calls we're going to have? We're going to recommend, usually two weeks out, and then weekly we're going to recommend cadence of and the process for interviews, who's involved for second rounds, if they're required. And then we'll also have a communication locus. Do you prefer messaging? Do you prefer me to come to your office? Do you prefer a structure, structured standing meeting? And that's done to ensure that we don't have communication misalignment, especially if there's a period of time where somebody doesn't hear from us, right? I think that setting that up, we did a good job in terms of setting up the frequency of communication, but the sort of what next and what's going on, type of piece that's where there were some bumps in the road, specifically related to the assessment process itself."
    },
    {
      "speaker": "Interviewer 21:34",
      "text": "Okay, thank you. That's really helpful in just the final few minutes. Is there anything else that you would like to kind of bring up that any any areas where you think that the you'd like to see improvement, or just you know more of what makes what's going to make them become more of a partner in your eyes,"
    },
    {
      "speaker": "Speaker 1 21:56",
      "text": "I would say that in general, it was a positive experience, right? If we had search to do over again, I would rehire them, as long as we did some early setting of communication preferences, timeliness of responses, that sort of thing. And you know, if we put a mutual SLA to say, okay, inquiries responded to within 24 hours, you know, feet within blank number of hours. That sort of thing may have helped us, but overall, I think that it was a well executed process. And even there were a couple of times when when Anne was unavailable for various reasons, and Priya stepped up and responded and communicated. So I never felt like, geez, I can't reach anyone. And had I felt like that happening, I would have gone, gone to my point of contact here in Chicago. But I never felt the need to say, I'm just confused and anxious, right? So you know, the piece around let's just be purposeful. Let's think about matching the communication style of the client. So if the client is not one for long, drawn out conversations about sort of not important topic, let's read the room and be quick about it. And then if we're also in a position where we're emailing, we want fast action. It's less effective for you to email and say, oh, let's set up a call, right? And once, once that was sort of clearly communicated as not a effective way of communicating. I think things got fixed. But initially I was sort of like, okay, I'll have a call. But why are we doing this? Let's just get the stuff done."
    },
    {
      "speaker": "Interviewer 23:43",
      "text": "Yeah, okay, that's great. I think that's it. Then, from our side, that's really helpful. Thank you for your honesty and agreeing to give us his time. Anything else, otherwise, my questions are done."
    },
    {
      "speaker": "Speaker 1 24:00",
      "text": "Okay, fantastic. Well, appreciate it, and appreciate your flexibility on the Zoom piece. We're a very, very secure organization, and we're not allowed access to teams or anything else besides the Zoom platform. So that's why I saw the meeting coming up yesterday. I was like, Oh, shoot."
    },
    {
      "speaker": "Interviewer 24:14",
      "text": "Now, Google, meet whatever anybody wants to do, then you know, I can make it happen. All right, lovely to meet you and All right, thanks for your time."
    },
    {
      "speaker": "Speaker 1 24:25",
      "text": "Likewise. Have a nice afternoon. Thank you. You too. Bye, thanks. Bye, bye. You. Transcribed by https://otter.ai -- 5 of 5 --"
    }
  ],
  "rawText": "Interviewer 0:00: Team problems. Okay, okay, great. So yeah, well, that's the admin out the way of if you're all right for me recording. Now I've lost you on my screen, so I'm just trying to find you.\n\nSpeaker 1 0:17: Apologies. Yeah, I give consent to be recorded.\n\nInterviewer 0:21: Absolutely great. Thank you. So I will try and keep this as brief as possible. I appreciate your busy essentially, thank you for first filling in the NPS and agreeing to have a further interview. As part of core is commitment to always improving customer experience. We'd just like to dig into a bit more the experience. And work out, you know, where they where they can make improvements. I am an external consultant, so I've been working with one fro for the last five years, and know their business really well. By asking me to do this, they're hoping, or we're all hoping, that, you know, you'll have been more transparent and more honest and be able to speak freely. So, as I said, the note taker is taken for my team, so they can kind of write this up, and we can then feed it back collectively to the team. Are you comfortable with this, feeding it back? Unknown Speaker 1:17 Not. Okay. Yeah, absolutely.\n\nInterviewer 1:20: So if we can first just kick off by if you can just explain your job role within the organization and the engagement that you had have had with Korn Ferry to date, absolutely.\n\nSpeaker 1 1:36: So I lead talent acquisition for the company, which includes all levels of hiring. It includes about 10 other responsibilities, which I won't bore you with, but they're related to onboarding and compliance and those sorts of things. The OCC is engaged with Korn Ferry actually predates this particular search, and we've worked with them as a partner, primarily in our assessment and organizational development functions. They've been partners to us in developing our list of leadership behaviors. We use them for pre hire assessments at some levels, and we also have partnered with them to deliver 360 feedback and other sort of ongoing development opportunities. So they're, they're well established partner to The OCC, and in the course of identifying the need to hire, initially very confidentially, a new controller for The OCC core and Korn Ferry was one of three firms that I invited to pitch for the business, and the initial point of Contact is someone local here in Chicago named Martha watt, who we've known for a long time, and she, in turn, introduced me to Ann wicks, who was the primary consultant on the engagement, and Anne and Martha and a couple of other people started the initial pitch proposition, providing us insight into their capabilities and recent placements at the control controller level. Given that that a dedicated focus of her team that really allowed us to make the decision to the business to Korn Ferry, I would say that the initial start to the search was a little less smooth than we would have liked. And the reason that that it was sort of less smooth is there were some initial we operate very rapidly, and we are a time sensitive organization. And given and geolocation on the west coast, the United States, and she had Priya too, who was on the East Coast. You know, we didn't have that sort of sending inquiries, and we're hearing back within two three hours. Sometimes it would be overnight, sometimes it would be a little bit longer. And on occasion, instead of just replying to an email, there was a request to have a conversation, set up a call, and so forth. And in my view, I understand why sometimes discussing and having dialog is impactful, but I always don't have the luxury of being able to carve out those times to do so, and I'd rather just operate, you know, 24/7, if I can correspond the email or or other messages of that type. -- 1 of 5 -- So once we sorted the communication piece out, once we got to a little bit better cadence of how we appreciated discussion, our regular, ongoing update, meetings, much more productive. And we essentially went from confidential, keep it quiet to Okay, now it can be public, and that's sort of when things really started to speak. To speed up. So I'll stop there, because I just threw a lot at,\n\nInterviewer 4:46: you know, that will make sense. And so, so essentially, kind of rocky start came down to preferred ways of working and having clarity on that from the outset, in terms of the task itself. And, you know, actually co creating, or maybe you didn't co create the JD, is that something that you felt was, or is that part of the backwards and forwards that we felt a bit messy?\n\nSpeaker 1 5:15: No, it actually was very insightful from them. And I'm pulling my pulling my records here on this. So give me one second. So I think one of the things that they really helped us identify was the title and sort of what it did to the prospect engagement pool. And as Anne's a CPA, and she knows the business well, I think that she was really, really very additive in terms of being able to tell us, hey, you're calling this x. This is how it looks in the market. This is what people are seeing, right? And as we start to recategorize it as more than a controller and somebody who was going to be, you know, possible CFO successor, and have a bit more remit down the road that opened up the pool of talent to us. And ironically, the person that we we ended up choosing, and who started last week, has an FP and a background, versus a pure accounting background, and the second person who was presented to us is more of that standard accounting background, who who's been a controller for some time, and it boiled down to longevity and additional growth opportunities. Because, in our view, somebody who can learn and build their skill set is going to have a longer runway versus, yeah, do the job, there's nothing else to do. And I think Ann helped us identify that fairly clearly to say, if you know, if you think you want just an operator to work nothing else, this is what you're going to get. But if you strive for that successor material, or somebody else who has a longer runway, this is what you need to start focusing on. And I don't think we realized initially that that was important. But the more we interview people, because I'm looking and we interviewed a ton of people. I mean, I can't even count right now, we began to sort of understand the landscape, especially in the Chicago market, and the limited talent pool who were capable. They helped sort of drive us to that decision.\n\nInterviewer 7:22: So it said that you, you've interviewed a lot of people, so were you pleased with the number of candidates put on up?\n\nSpeaker 1 7:32: There are never enough candidates. That doesn't matter who it is, right? We always want to see more. We always want to make sure we're doing a thorough assessment of the market. I think what did start to happen as it became clear that we had two finalists is they had offered to expand geo beyond Chicago, but I don't know that they actually ever did that, because we didn't. We didn't ask them for additional people to interview, right? So we did in our in our final sort of update calls, have a discussion around who else is out there. What's our plan B, if neither of these people work out? But we thankfully never had to get to that point, because we ended up being able to get the person on boarded and make everything else happen. We know that the reservation I had in the back of my mind and I, I stated this to Anne, because I actually met her and Martha in person earlier this week. They were here in Chicago, and I basically said to them, you know, it was great, but we potentially dodged a bullet, because if things had not ended up working out with our candidate choice, I said I was not quite comfortable that we had a ready backup pool of people we'd be able to immediately bring in and continue the process, right? So the thing that was a little concerning to me was, yeah, we're placing all of our outcomes on one person, and people have circumstances that are beyond their control, and they have decisions to make, and oftentimes, not oftentimes, but sometimes you make an offer, you think everything's well and good, and then all of a sudden, something falls apart, right? So I think that in the course of the end product, I feel like the speed and the execution and the dialog was not as rapid as it could have been, if it sort of kept the pipeline moving, kept the interviews going, that sort of thing.\n\nInterviewer 9:32: So is there a potential kind of you know, could meeting expectations on not only the number of candidates, but also the quality. So, I mean, how did you how did they fare? -- 2 of 5 --\n\nSpeaker 1 9:47: I think the quality was there, right? We didn't interview anyone where we said, Geez, they just don't meet the qualifications at all. I think for us to sort of, let's keep things moving until it's ready to stop. So for example, if I engage other search firms, what we'll have happen is that they will essentially keep sharing candidates, and we keep interviews going until an offer is accepted in the background checks been cleared, right? And then it's upon them. If we do end up interviewing additional people, and the person does confirm their start date, you know, they then manage the, you know, compensation around it was great to meet you Andre selected another person, and so on and so forth. So I think that the piece for us that was probably missing was okay, not doing any more interviews, but why not? Right? And I didn't push them too much that because I was fairly confident that this individual was going to end up starting. But I also sort of in the back of my mind, had to manage the CFO to say, trust this is going to work out. Yeah, instead of Okay, why don't we have other people to talk to?\n\nInterviewer 11:05: Yeah, makes sense. And in terms of closing them, did they support through kind of compensation negotiation and contract, or was that something that you you led on,\n\nSpeaker 1 11:16: I took a primary lead. So I've been doing this for many, many years, and I used to be a retained search consultant myself. But what I did, I've got a process that I follow internally. We're a very structured company, and we have very specific ways we do things, and I essentially drove all of that. I did ask him for the help around the expectations. There were some considerations around earned and unpaid compensation that we needed to address, and so they helped with the data collection pieces on those but as it came down to the final negotiations, I sort of took the lead in terms of communicating directly with the candidate, kept them posted after the fact, and that's how we wanted. It wasn't because they weren't capable. It didn't do their job. We just choose to take a more hands on approach in those cases.\n\nInterviewer 12:12: Okay? And in terms of, you know, you said you've used them for leadership development and assessment in the past. Did you use them as did you use their assess tool as part of this recruit kind of select\n\nSpeaker 1 12:26: piece we did in what happened was the rollout of the tool. There were a couple of challenges we ran into with the assessment process itself. And some of them were on us. Some of them were just a communication breakdown with that team, but essentially we when we put the assessment program together, we had asked for specific three specific types. We weren't doing the whole customized piece that generally would happen. And when came to actually getting the results, there hadn't been a communication from the team beyond sending it to a dedicated mailbox that we had set up, right? So the first couple came through. I missed them because I failed to look for the mailbox, but there also wasn't any communication from the team that said, heads up, they're going to start going out to you now, right? It was only when I followed up and said, Hey, I'm not seeing any of these. And they said, Oh, they're in your dedicated mailbox. And then I found them right? But oftentimes, when we've got a million things going on at once, we're not always thinking back to looking in those places. And yes, that was on me, and I should have followed up and looked where I said, but that sort of proactive nudge that says, Hey, forget. This is where things are standing. That was missing, and that led to a little bit of a delay in terms of being able to actually have it. But I will say that the initial so we had a more formal assessment. What's the word I'm looking for we had a formal assessment review with the team and with Anne on the call this will that was incredibly powerful, because if you just look at it in a vacuum, without context and without an organizational psychologist explaining it to you, it's easy to misinterpret things, and in the course of that discussion, that's where we've sort of had the aha moment that said, Oh, this is the person we need to make an offer to, right? So at the end of the day, that was very, very impactful for us, and I think it gave us insights that we missed in the course of our interview, because we had some actual data to back up are, at that time, incorrect assumptions.\n\nInterviewer 14:44: How on that theme, how important is, I suppose, data informed decision making when it comes to things like not just search, but their broader consultancy offer, -- 3 of 5 --\n\nSpeaker 1 14:58: I would say that that's probably critically important, right? We have to, we have to use objective measures, and we have to use sort of a common thread of tools in terms of not only assessment, but also development and engagement and performance management. And I believe that this sets a strong foundation when used properly. So one of the outcomes, for example, when the individual had accepted the offer, is I re shared the interview guide, the assessment results and the actual candidate guide with the CFO and said, Hey, these are tools you may want to use when you're setting your first 90 day objectives, your longer term objectives, and some of your development opportunities. And I think that that, that closing of the loop is really powerful, because it solves the question, geez, what do I really need to focus on for this person beyond day to day task work?\n\nInterviewer 15:55: Yeah, absolutely. You say that you, you know, you use a different search firms for different roles. How do they compare? So in terms of just, you know, overall kind of price, experience, partnership, what you're looking for, what's what's great, and what isn't,\n\nSpeaker 1 16:16: yeah, price, I'd say, is less of a driver for us. I think relationship, engagement and understanding of our business are really, really top considerations we use, we use some of the large international firms for support. We also use some local specialty firms that there's a firm out of New York that I've had a partnership for with for probably 10 years, and they are usually who we use for very specific technical roles that are just needle in the haystack. Maybe five or six people in country do it. But then for broader ones, where we know we need Mark visibility. So the litmus test for us is, if a retained search partner contacts a prospective candidate, are they going to pick up the phone and respond to the message because of name recognition? Right? Versus if it's a boutique firm and there's a small pool of people who do the work that we need to have done, then name recognition is less important than the strength and power of their network, right? So you get any big firm like Korn Ferry and you've got your team of researchers, and you've got your associates, and everyone else is doing the work behind the scenes. That's a volume play with some relationship play at stake. And I think what's set and apart is this is what she does, period. It's not, yes, there are six lines of businesses, and this is a particular focus that she has at the moment, right? That's her bread and butter. I mean, she's on the way to the CPA conference, and sort of that's who she is and who she engages with, and how she networks. And that was really the power for us, because the two other firms that were in consideration, one was a national firm. A third had actually placed the previous controller, who had been in the midst of departing the company. And I gave an opportunity to the previous firm to pitch and see what their thought process was, knowing that we were going to be moving on from that individual, and they were a boutique firm, not the name recognition we needed, not even based in Chicago and that sort of, you know, the location for Anne, besides what I stated earlier about being on the opposite coast, other than that, the fact that she was a CPA, knew this business, understood, sort of how the market sees controllership versus CFO versus FP and a people. So you know that that's where it really boiled down to. And I initially had reservations because of my previous experience with this project that I mentioned. But when she came to the table and we're sort of like, oh, wow, this is her world. It became a pretty clear decision, who we needed to hire.\n\nInterviewer 19:05: Can we talk a bit of a lot of the assessment project? It sounded like that didn't go as well. Are you comfortable talking about it?\n\nSpeaker 1 19:14: I am. But that's not that was less of a Korn Ferry issue than an The OCC issue, right? I think that they did absolutely what we asked them to do. We had some challenges when it came to the signing of the contracts and those other things that were of our own making, those had nothing to do with the team. I think we did have a few more times where we had to re explain and reconfirm things. But once we got all of that done, we have been fined. We did have one little communication gap in terms of our levels and how we were asking things to be categorized versus how Korn Ferry would categorize in a traditional manner. And when I talk about that, we have different assessments for different levels of professional, yeah, we've got sort of senior executive, mid tier manager, and then individual contributor. And there was some labeling mistakes made with the first couple of assessment reports that came out, but those are solved for everyone's on the same page now. -- 4 of 5 --\n\nInterviewer 20:17: So it feels like there's a consistent pattern of, you know, kind of not a rocky start, because that's maybe too strong, but there's a need for kind of clearer rules of engagement and communication styles and needs and wants laid out from the start to avoid any of those bumps in the road.\n\nSpeaker 1 20:38: Yes, yes. I think that one of the things we'll always ask at the outset of a search, if we're not engaging a firm, is, you know, what's the frequency of update calls we're going to have? We're going to recommend, usually two weeks out, and then weekly we're going to recommend cadence of and the process for interviews, who's involved for second rounds, if they're required. And then we'll also have a communication locus. Do you prefer messaging? Do you prefer me to come to your office? Do you prefer a structure, structured standing meeting? And that's done to ensure that we don't have communication misalignment, especially if there's a period of time where somebody doesn't hear from us, right? I think that setting that up, we did a good job in terms of setting up the frequency of communication, but the sort of what next and what's going on, type of piece that's where there were some bumps in the road, specifically related to the assessment process itself.\n\nInterviewer 21:34: Okay, thank you. That's really helpful in just the final few minutes. Is there anything else that you would like to kind of bring up that any any areas where you think that the you'd like to see improvement, or just you know more of what makes what's going to make them become more of a partner in your eyes,\n\nSpeaker 1 21:56: I would say that in general, it was a positive experience, right? If we had search to do over again, I would rehire them, as long as we did some early setting of communication preferences, timeliness of responses, that sort of thing. And you know, if we put a mutual SLA to say, okay, inquiries responded to within 24 hours, you know, feet within blank number of hours. That sort of thing may have helped us, but overall, I think that it was a well executed process. And even there were a couple of times when when Anne was unavailable for various reasons, and Priya stepped up and responded and communicated. So I never felt like, geez, I can't reach anyone. And had I felt like that happening, I would have gone, gone to my point of contact here in Chicago. But I never felt the need to say, I'm just confused and anxious, right? So you know, the piece around let's just be purposeful. Let's think about matching the communication style of the client. So if the client is not one for long, drawn out conversations about sort of not important topic, let's read the room and be quick about it. And then if we're also in a position where we're emailing, we want fast action. It's less effective for you to email and say, oh, let's set up a call, right? And once, once that was sort of clearly communicated as not a effective way of communicating. I think things got fixed. But initially I was sort of like, okay, I'll have a call. But why are we doing this? Let's just get the stuff done.\n\nInterviewer 23:43: Yeah, okay, that's great. I think that's it. Then, from our side, that's really helpful. Thank you for your honesty and agreeing to give us his time. Anything else, otherwise, my questions are done.\n\nSpeaker 1 24:00: Okay, fantastic. Well, appreciate it, and appreciate your flexibility on the Zoom piece. We're a very, very secure organization, and we're not allowed access to teams or anything else besides the Zoom platform. So that's why I saw the meeting coming up yesterday. I was like, Oh, shoot.\n\nInterviewer 24:14: Now, Google, meet whatever anybody wants to do, then you know, I can make it happen. All right, lovely to meet you and All right, thanks for your time.\n\nSpeaker 1 24:25: Likewise. Have a nice afternoon. Thank you. You too. Bye, thanks. Bye, bye. You. Transcribed by https://otter.ai -- 5 of 5 --"
}