{
  "id": "t-005",
  "sourceFile": "NPS Interview Transcript_011225_Duff, Wadsworth Atheneum Museum of Art.docx",
  "overview": "TRANSCRIPT OVERVIEW\n\nTeresa Allan from Magnus Consulting interviewed a board chair from an art museum in Connecticut about their experience with Korn Ferry. The museum engaged Korn Ferry 1.5 years ago to search for a new CEO, having previously worked with them on salary surveys and job descriptions. Korn Ferry's understanding of the unique CEO role, rather than a typical museum director, was appreciated. The search process involved reviewing over 100 applications, narrowing to 30, then 11 for interviews, and finally a shortlist of four. Korn Ferry's KF4 assessment tool was used for both candidates and the museum director. Communication was regular, and the experience was smooth. The new CEO's onboarding is just starting. The board chair is open to using Korn Ferry for broader consultancy roles.",
  "sections": [
    {
      "title": "Introduction and Meeting Setup",
      "points": [
        "Teresa Allan greets Duffield and apologizes for the delay, explaining the issue with Teams on her cell phone."
      ]
    },
    {
      "title": "Teresa mentions she is in Mecklenburg Square and asks Duffield about his location, which is London.",
      "points": [
        "Teresa explains the purpose of the call, which is to conduct an interview for a report, and asks for permission to record the conversation.",
        "Teresa introduces herself as the managing partner at Magnus Consulting, a company that has been working with Korn Ferry for five years."
      ]
    },
    {
      "title": "Duffield's Role and Engagement with Korn Ferry",
      "points": [
        "Duffield explains his role as the chair of the board of an art museum in Connecticut and his involvement in the search for a new CEO.",
        "Duffield was the co-chair of the search committee and interfaced with Korn Ferry during the search process.",
        "Duffield chose Korn Ferry over other search firms because of their prior familiarity with the institution and their understanding of the unique CEO role required.",
        "Other firms suggested looking for a museum director, but Korn Ferry tailored the search to find a CEO."
      ]
    },
    {
      "title": "Experience and Quality of Candidates",
      "points": [
        "Duffield describes the search process as smooth, collegial, and productive, noting that Korn Ferry had a better understanding of the museum's needs."
      ]
    },
    {
      "title": "The pool of applicants was more robust and better filtered compared to previous searches.",
      "points": [
        "Duffield mentions that Korn Ferry reviewed about 100 applications, narrowed it down to 30, and eventually presented a shortlist of four candidates.",
        "The process was time-consuming but effective, resulting in a suitable candidate for the CEO position."
      ]
    },
    {
      "title": "Use of Assessment Tools and Communication",
      "points": [
        "Duffield explains that Korn Ferry's KF4 assessment tool was used for both candidates and the museum director to ensure complementary skill sets.",
        "Communication with Korn Ferry was regular, with Zoom calls every other week and regular emails and data sharing.",
        "Initially, there was some confusion with multiple contacts from Korn Ferry, but this was resolved by consolidating communications to one email address.",
        "Candidate information was shared via email for basic details and a portal for confidential information."
      ]
    },
    {
      "title": "Overall Satisfaction and Future Collaboration",
      "points": [
        "Duffield expresses overall satisfaction with the search process, noting that Korn Ferry met or exceeded expectations.",
        "The onboarding process for the new CEO is just starting, and Korn Ferry has promised to support both the museum and the new CEO.",
        "Duffield is open to using Korn Ferry for broader consultancy roles, such as organizational structure and design, due to their professionalism and deep understanding of the museum.",
        "The brand's reputation was less important than the established relationship and experience with Korn Ferry."
      ]
    },
    {
      "title": "Challenges and Future Needs",
      "points": [
        "Duffield discusses the challenges of finding the right people for a small organization, where each employee must be versatile and efficient.",
        "The museum's size necessitates that employees wear multiple hats and be able to cover different roles.",
        "Duffield is less interested in using technology for candidate filtering and more focused on Korn Ferry's network and ability to find candidates who are not actively seeking new opportunities.",
        "The candidate chosen for the CEO position was not initially planning to leave their current post, highlighting Korn Ferry's ability to identify suitable candidates."
      ]
    },
    {
      "title": "Final Reflections and Conclusion",
      "points": [
        "Duffield reiterates his satisfaction with the search process, noting that Korn Ferry provided professional advice and allowed the museum to make its own decisions."
      ]
    },
    {
      "title": "Teresa thanks Duffield for his time and participation, and they conclude the call.",
      "points": []
    }
  ],
  "fullTranscript": [
    {
      "speaker": "Unknown",
      "text": "Teresa Allan  1:39\nGood morning. Hi Duffield.\nSpeaker 1  6:06\nGood morning. How you doing? I'm sorry. I'm sorry. I'm late. I all good. Had forgotten I don't have teams on my cell phone, and so I had to\nTeresa Allan  6:17\ndownload it. You look like you're somewhere fairly cold.\nUnknown Speaker  6:24\nI'm in London. Oh, okay,\nTeresa Allan  6:26\nwell, cold ish.\nUnknown Speaker  6:36\nWhereabouts are you\nUnknown Speaker  6:39\non your Mecklenburg square.\nTeresa Allan  6:42\nOh, I don't know that. Okay, yeah, yeah, it's beautiful around there. It is great. Well, I won't keep you sitting out in the cold, so I'll try to move it along. But Lovely to meet you and thank you for agreeing to to do this. Call just a couple of things before we jump in. Are you okay if I record it so my team could help me write up a report? Great. Thank you. Great. And then just to introduce myself, so I'm Teresa. I'm the managing partner at a company called Magnus consulting. So we've been working with Korn Ferry for the last five years, and they asked us to conduct these interviews so so hopefully you can speak more freely instead of them doing it. So that's it. That's all the admin. If we kick straight off, if you could just explain your role and the engagement that you had with Korn Ferry.\nSpeaker 1  7:44\nSo I chair the board of an art museum in Connecticut, and we engaged Korn Ferry about a year and a half ago to help us search for a new CEO. And so my role was as co chair of the search committee interfacing with with Korn Ferry in the search process. Great.\nTeresa Allan  8:08\nAnd what made you choose Korn Ferry over anyone else?\nSpeaker 1  8:13\nWe interviewed a number of search firms. Korn Ferry was already very familiar with our institution, because they had helped us with salary surveys and market analyzes, and they'd helped us actually develop the job description, because the post of CEO was relatively new for the for the museum, and so we'd been working with them on and off for two or three years In setting all of that up, but we still interviewed a number of other search firms for that particular project, and ultimately came back to Korn Ferry because I think they had a better understanding of what we were looking for, which in our case was a little different than the usual museum director a number of the firms that we interviewed said, Yeah, we hear what you're saying, but what you really want us to look for is a museum director. And we said, No, that's not what we want you to look for. We want you to look for a CEO. And here's the job description. It's not that of a museum director. And yet, they kept sort of pushing us towards it felt like they were trying to push our square peg in their round hole, rather than tailor the search to what we really wanted. So that's why we chose Korn Ferry, great.\nTeresa Allan  9:37\nAnd in terms of having that, you know, understanding of the role how, how did it play out for you? How was the experience of working with them?\nSpeaker 1  9:50\nI think it was brilliant. We've used the firm twice before over the past 15 years. I was only engaged in one of those search processes, but this was was smoother, more collegial, more productive. And I'm not sure if it was the specific team that we were working at at Korn Ferry that that were that compatible with, with our search committee, or whether it was the timing of things the last two times that the museum did a search with Korn Ferry, the museum was not in a great position. So the pool of applicants was a little disappointing, and this time around, it was a much more robust pool of applicants. They seemed better chosen, better filtered, if you will, or selected from a broader pool by Korn Ferry to meet what we thought we needed.\nTeresa Allan  10:49\nGot it and in terms of the quality and quantity of candidates, did that? Did that meet your expectations?\nSpeaker 1  10:58\nYes, it did. I think any if, if there had been any more candidates, the process would have taken vastly longer, and I'm not sure that it would have gotten us any further than we then we got with the pool that that Korn Ferry started with, but my sense was that they looked over about 100 applications, and they brought about 30 to us to look over, and we filtered the or condensed that to a pool of 11 for interviews, and then a short list of seven, and then a short, short list of four. And that, frankly, that was plenty.\nTeresa Allan  11:44\nYeah, it's quite time consuming. And did they use, did they use things like their assessment tool to help you, give you more, a greater context to those candidates? Did is that something that you used?\nSpeaker 1  11:59\nWe did use the what is it? Kf, four day, yeah, and not just for the candidates, but because of the leadership structure at the museum, we asked them to administer that to the museum director, who works side by side with the CEO, because we wanted to be sure that their skill sets and their traits were complementary and unlikely to clash\nTeresa Allan  12:32\nright and exercise and In terms of the experience that you had, so it's been kept up to date of the project, kind of itself and where they were going. Did you find that communication was good? Did it meet your expectations? Was it regular? Did you have a regular check in?\nSpeaker 1  12:59\nWe had a regular check in. We had a zoom call every other week, and regular emails and and data sharing that way, I will say that that once we hit our stride, it was, it was very smooth and a predictable cadence and and so forth. Early on, it was a little confusing, because there were several different people at Korn Ferry reaching out to the search committee, and so we'd all have a recollection of having gotten an email from someone, but we couldn't search for it easily, and ultimately having having shared that, that minor point of frustration, they made sure that all the communications came from the same the same email address, so it was easy for us to sort them and and find them days later or weeks later.\nTeresa Allan  13:58\nAnd did you receive the candidate information was that via email? Was it on a portal? How did it come to you?\nSpeaker 1  14:10\nI have to be honest at this point, I can't recall whether it was through a portal or by email. I think basic information by email, but then the more confidential stuff through a portal, right?\nTeresa Allan  14:24\nOkay. Is there anything they could have done differently, better to improve your experience?\nUnknown Speaker  14:35\nHang on for a sec.\nSpeaker 1  14:41\nSorry about that. Is there anything they could have done better? Frankly, I don't, I don't think so. Other than that, that initial confusion about who was reaching out and who our contact person was, I don't see how this could have gone more smoothly or more satisfactorily in terms of the outcome we were we were really pleased.\nTeresa Allan  15:06\nFantastic. We'll\nSpeaker 1  15:09\nhave the proof is in the pudding. We'll have to see how this new CEO works out.\nTeresa Allan  15:14\nWell, that was my next question is, have they? Have they helped supported them in their onboarding?\nSpeaker 1  15:20\nSo the onboarding is is just now starting. She's not expected to be on site consistently until early January. So I they have promised us that they will be there to help support us and to help support her and in that onboarding process, but it hasn't really begun yet.\nTeresa Allan  15:43\nOkay, great. I mean, thinking about, you know, you've obviously had experience of using other aspects of Korn Ferry, would you? Would you use them for, I suppose, a broader consultancy role beyond search, so more around org structure, org design and that type of thing,\nSpeaker 1  16:03\nI think quite conceivably, in part because I found them easy to work with, in part because I think they're tremendously professional about all of this, and I have deep experience, and perhaps most importantly, because They know the organization very well at this point, and they know where our challenges lie, and they know where our strengths are. It's as if they've done a K, 4d k, f, 4d on the organization,\nTeresa Allan  16:34\nand going, going turn is taking a step out how important to you is, is the brand itself. So it was that a reason to select them, you know, their reputation in the market, how well they're known,\nSpeaker 1  16:51\nI would say that was substantially less important to us than our own experience with them. And some of the firms that we looked at were much smaller, much narrower focus on museums, much narrower reach than Korn Ferry. So I think the size of the organization was a plus for us, but it was really established relationship that I think\nTeresa Allan  17:18\nhelped make the choice, Yeah, makes sense in terms of, I suppose, moving forward, if you're doing a search again, or even in this experience, how did you at any point prioritize or think that they should be leading more into the use of Tech? So whether it's to kind of filter out candidates, is that important to you, or is it more about the individual view and network?\nSpeaker 1  17:52\nI would say the latter less, less interested in tech, their network, their ability to find candidates who aren't actually in the market, who don't volunteer themselves, but that they reach out and say, This is a job that we think you might want to consider. And in fact, the candidate we ultimately chose was not in a not planning to leave her current post. So Right. Okay.\nTeresa Allan  18:23\nAnd then again, going back to your your role as sitting on the board where, if you're happy to share how much of the challenges that you face as a, as a, as a business at the moment are around people, whether it's people skills or inability to kind of find the right people, or AI versus people, is that something that comes up a lot,\nSpeaker 1  18:51\nit comes up fairly often, I think, find particularly for an organization our size, which is relatively small, each of the the players in the organization has to be very good at what they do, very efficient. And sometimes they have to wear multiple hats. They have to be able to to fill in for colleagues, because most of them are single points of failure. So if, if you're the head of communications, you're also crafting much of the marketing, and you're also, I don't know, I guess, I guess. What I'm trying to say is finding the right people who have the skill sets and the bandwidth to be able to cover lots of different roles is hard\nTeresa Allan  19:41\nand the mindset to lean in, yeah, yeah. I think that that's probably everything that's been really helpful. Is there anything that you'd like to share with us a reflection of your experience with them?\nSpeaker 1  19:59\nI would just go just reiterate that I found this experience wonderfully smooth, very satisfying, and I felt like we were getting very good professional advice along the way, but that we were also given free latitude to make our own decisions, as opposed to some of the the early tenor of our interactions with some of the other firms had been thus them telling us what we should be looking for instead of listening to us.\nTeresa Allan  20:33\nYeah. So it felt like a real partnership where you were heard and they were supporting your needs. Fantastic, great. Well, I'll let you get back into the warmth, because I know it's not that that warm outside. Money down the road. It was really lovely to meet you, and thanks for taking the time out to have this call.\nSpeaker 1  20:53\nMy pleasure, and I'm sorry it took such a while to get this sorted. No worries.\nTeresa Allan  21:00\nYeah, have a good Have a good weekend. Thank you. You too. Bye, bye."
    }
  ],
  "rawText": "NPS Interview Transcript\n\nInterview Date: 28.11.25\n\nClient: Duffield Ashmead IV, Wadsworth Atheneum Museum of Art\n\nProject: PS\n\nScore: 10\n\nTRANSCRIPT OVERVIEW\n\nhttps://otter.ai/u/V7xv-0A7NW3mZPVaxFZW0Ef4KB0?view=summary\n\nTeresa Allan from Magnus Consulting interviewed a board chair from an art museum in Connecticut about their experience with Korn Ferry. The museum engaged Korn Ferry 1.5 years ago to search for a new CEO, having previously worked with them on salary surveys and job descriptions. Korn Ferry's understanding of the unique CEO role, rather than a typical museum director, was appreciated. The search process involved reviewing over 100 applications, narrowing to 30, then 11 for interviews, and finally a shortlist of four. Korn Ferry's KF4 assessment tool was used for both candidates and the museum director. Communication was regular, and the experience was smooth. The new CEO's onboarding is just starting. The board chair is open to using Korn Ferry for broader consultancy roles.\n\nIntroduction and Meeting Setup\n\nTeresa Allan greets Duffield and apologizes for the delay, explaining the issue with Teams on her cell phone.\n\nTeresa mentions she is in Mecklenburg Square and asks Duffield about his location, which is London.\n\nTeresa explains the purpose of the call, which is to conduct an interview for a report, and asks for permission to record the conversation.\n\nTeresa introduces herself as the managing partner at Magnus Consulting, a company that has been working with Korn Ferry for five years.\n\nDuffield's Role and Engagement with Korn Ferry\n\nDuffield explains his role as the chair of the board of an art museum in Connecticut and his involvement in the search for a new CEO.\n\nDuffield was the co-chair of the search committee and interfaced with Korn Ferry during the search process.\n\nDuffield chose Korn Ferry over other search firms because of their prior familiarity with the institution and their understanding of the unique CEO role required.\n\nOther firms suggested looking for a museum director, but Korn Ferry tailored the search to find a CEO.\n\nExperience and Quality of Candidates\n\nDuffield describes the search process as smooth, collegial, and productive, noting that Korn Ferry had a better understanding of the museum's needs.\n\nThe pool of applicants was more robust and better filtered compared to previous searches.\n\nDuffield mentions that Korn Ferry reviewed about 100 applications, narrowed it down to 30, and eventually presented a shortlist of four candidates.\n\nThe process was time-consuming but effective, resulting in a suitable candidate for the CEO position.\n\nUse of Assessment Tools and Communication\n\nDuffield explains that Korn Ferry's KF4 assessment tool was used for both candidates and the museum director to ensure complementary skill sets.\n\nCommunication with Korn Ferry was regular, with Zoom calls every other week and regular emails and data sharing.\n\nInitially, there was some confusion with multiple contacts from Korn Ferry, but this was resolved by consolidating communications to one email address.\n\nCandidate information was shared via email for basic details and a portal for confidential information.\n\nOverall Satisfaction and Future Collaboration\n\nDuffield expresses overall satisfaction with the search process, noting that Korn Ferry met or exceeded expectations.\n\nThe onboarding process for the new CEO is just starting, and Korn Ferry has promised to support both the museum and the new CEO.\n\nDuffield is open to using Korn Ferry for broader consultancy roles, such as organizational structure and design, due to their professionalism and deep understanding of the museum.\n\nThe brand's reputation was less important than the established relationship and experience with Korn Ferry.\n\nChallenges and Future Needs\n\nDuffield discusses the challenges of finding the right people for a small organization, where each employee must be versatile and efficient.\n\nThe museum's size necessitates that employees wear multiple hats and be able to cover different roles.\n\nDuffield is less interested in using technology for candidate filtering and more focused on Korn Ferry's network and ability to find candidates who are not actively seeking new opportunities.\n\nThe candidate chosen for the CEO position was not initially planning to leave their current post, highlighting Korn Ferry's ability to identify suitable candidates.\n\nFinal Reflections and Conclusion\n\nDuffield reiterates his satisfaction with the search process, noting that Korn Ferry provided professional advice and allowed the museum to make its own decisions.\n\nTeresa thanks Duffield for his time and participation, and they conclude the call.\n\nDuffield apologizes for the delay in scheduling the call, and Teresa wishes him a good weekend.\n\nFULL TRANSCRIPT\n\nTeresa Allan  1:39  \n\nGood morning. Hi Duffield.\n\nSpeaker 1  6:06  \n\nGood morning. How you doing? I'm sorry. I'm sorry. I'm late. I all good. Had forgotten I don't have teams on my cell phone, and so I had to\n\nTeresa Allan  6:17  \n\ndownload it. You look like you're somewhere fairly cold.\n\nUnknown Speaker  6:24  \n\nI'm in London. Oh, okay,\n\nTeresa Allan  6:26  \n\nwell, cold ish.\n\nUnknown Speaker  6:36  \n\nWhereabouts are you\n\nUnknown Speaker  6:39  \n\non your Mecklenburg square.\n\nTeresa Allan  6:42  \n\nOh, I don't know that. Okay, yeah, yeah, it's beautiful around there. It is great. Well, I won't keep you sitting out in the cold, so I'll try to move it along. But Lovely to meet you and thank you for agreeing to to do this. Call just a couple of things before we jump in. Are you okay if I record it so my team could help me write up a report? Great. Thank you. Great. And then just to introduce myself, so I'm Teresa. I'm the managing partner at a company called Magnus consulting. So we've been working with Korn Ferry for the last five years, and they asked us to conduct these interviews so so hopefully you can speak more freely instead of them doing it. So that's it. That's all the admin. If we kick straight off, if you could just explain your role and the engagement that you had with Korn Ferry.\n\nSpeaker 1  7:44  \n\nSo I chair the board of an art museum in Connecticut, and we engaged Korn Ferry about a year and a half ago to help us search for a new CEO. And so my role was as co chair of the search committee interfacing with with Korn Ferry in the search process. Great.\n\nTeresa Allan  8:08  \n\nAnd what made you choose Korn Ferry over anyone else?\n\nSpeaker 1  8:13  \n\nWe interviewed a number of search firms. Korn Ferry was already very familiar with our institution, because they had helped us with salary surveys and market analyzes, and they'd helped us actually develop the job description, because the post of CEO was relatively new for the for the museum, and so we'd been working with them on and off for two or three years In setting all of that up, but we still interviewed a number of other search firms for that particular project, and ultimately came back to Korn Ferry because I think they had a better understanding of what we were looking for, which in our case was a little different than the usual museum director a number of the firms that we interviewed said, Yeah, we hear what you're saying, but what you really want us to look for is a museum director. And we said, No, that's not what we want you to look for. We want you to look for a CEO. And here's the job description. It's not that of a museum director. And yet, they kept sort of pushing us towards it felt like they were trying to push our square peg in their round hole, rather than tailor the search to what we really wanted. So that's why we chose Korn Ferry, great.\n\nTeresa Allan  9:37  \n\nAnd in terms of having that, you know, understanding of the role how, how did it play out for you? How was the experience of working with them?\n\nSpeaker 1  9:50  \n\nI think it was brilliant. We've used the firm twice before over the past 15 years. I was only engaged in one of those search processes, but this was was smoother, more collegial, more productive. And I'm not sure if it was the specific team that we were working at at Korn Ferry that that were that compatible with, with our search committee, or whether it was the timing of things the last two times that the museum did a search with Korn Ferry, the museum was not in a great position. So the pool of applicants was a little disappointing, and this time around, it was a much more robust pool of applicants. They seemed better chosen, better filtered, if you will, or selected from a broader pool by Korn Ferry to meet what we thought we needed.\n\nTeresa Allan  10:49  \n\nGot it and in terms of the quality and quantity of candidates, did that? Did that meet your expectations?\n\nSpeaker 1  10:58  \n\nYes, it did. I think any if, if there had been any more candidates, the process would have taken vastly longer, and I'm not sure that it would have gotten us any further than we then we got with the pool that that Korn Ferry started with, but my sense was that they looked over about 100 applications, and they brought about 30 to us to look over, and we filtered the or condensed that to a pool of 11 for interviews, and then a short list of seven, and then a short, short list of four. And that, frankly, that was plenty.\n\nTeresa Allan  11:44  \n\nYeah, it's quite time consuming. And did they use, did they use things like their assessment tool to help you, give you more, a greater context to those candidates? Did is that something that you used?\n\nSpeaker 1  11:59  \n\nWe did use the what is it? Kf, four day, yeah, and not just for the candidates, but because of the leadership structure at the museum, we asked them to administer that to the museum director, who works side by side with the CEO, because we wanted to be sure that their skill sets and their traits were complementary and unlikely to clash\n\nTeresa Allan  12:32  \n\nright and exercise and In terms of the experience that you had, so it's been kept up to date of the project, kind of itself and where they were going. Did you find that communication was good? Did it meet your expectations? Was it regular? Did you have a regular check in?\n\nSpeaker 1  12:59  \n\nWe had a regular check in. We had a zoom call every other week, and regular emails and and data sharing that way, I will say that that once we hit our stride, it was, it was very smooth and a predictable cadence and and so forth. Early on, it was a little confusing, because there were several different people at Korn Ferry reaching out to the search committee, and so we'd all have a recollection of having gotten an email from someone, but we couldn't search for it easily, and ultimately having having shared that, that minor point of frustration, they made sure that all the communications came from the same the same email address, so it was easy for us to sort them and and find them days later or weeks later.\n\nTeresa Allan  13:58  \n\nAnd did you receive the candidate information was that via email? Was it on a portal? How did it come to you?\n\nSpeaker 1  14:10  \n\nI have to be honest at this point, I can't recall whether it was through a portal or by email. I think basic information by email, but then the more confidential stuff through a portal, right?\n\nTeresa Allan  14:24  \n\nOkay. Is there anything they could have done differently, better to improve your experience?\n\nUnknown Speaker  14:35  \n\nHang on for a sec.\n\nSpeaker 1  14:41  \n\nSorry about that. Is there anything they could have done better? Frankly, I don't, I don't think so. Other than that, that initial confusion about who was reaching out and who our contact person was, I don't see how this could have gone more smoothly or more satisfactorily in terms of the outcome we were we were really pleased.\n\nTeresa Allan  15:06  \n\nFantastic. We'll\n\nSpeaker 1  15:09  \n\nhave the proof is in the pudding. We'll have to see how this new CEO works out.\n\nTeresa Allan  15:14  \n\nWell, that was my next question is, have they? Have they helped supported them in their onboarding?\n\nSpeaker 1  15:20  \n\nSo the onboarding is is just now starting. She's not expected to be on site consistently until early January. So I they have promised us that they will be there to help support us and to help support her and in that onboarding process, but it hasn't really begun yet.\n\nTeresa Allan  15:43  \n\nOkay, great. I mean, thinking about, you know, you've obviously had experience of using other aspects of Korn Ferry, would you? Would you use them for, I suppose, a broader consultancy role beyond search, so more around org structure, org design and that type of thing,\n\nSpeaker 1  16:03  \n\nI think quite conceivably, in part because I found them easy to work with, in part because I think they're tremendously professional about all of this, and I have deep experience, and perhaps most importantly, because They know the organization very well at this point, and they know where our challenges lie, and they know where our strengths are. It's as if they've done a K, 4d k, f, 4d on the organization,\n\nTeresa Allan  16:34  \n\nand going, going turn is taking a step out how important to you is, is the brand itself. So it was that a reason to select them, you know, their reputation in the market, how well they're known,\n\nSpeaker 1  16:51  \n\nI would say that was substantially less important to us than our own experience with them. And some of the firms that we looked at were much smaller, much narrower focus on museums, much narrower reach than Korn Ferry. So I think the size of the organization was a plus for us, but it was really established relationship that I think\n\nTeresa Allan  17:18  \n\nhelped make the choice, Yeah, makes sense in terms of, I suppose, moving forward, if you're doing a search again, or even in this experience, how did you at any point prioritize or think that they should be leading more into the use of Tech? So whether it's to kind of filter out candidates, is that important to you, or is it more about the individual view and network?\n\nSpeaker 1  17:52  \n\nI would say the latter less, less interested in tech, their network, their ability to find candidates who aren't actually in the market, who don't volunteer themselves, but that they reach out and say, This is a job that we think you might want to consider. And in fact, the candidate we ultimately chose was not in a not planning to leave her current post. So Right. Okay.\n\nTeresa Allan  18:23  \n\nAnd then again, going back to your your role as sitting on the board where, if you're happy to share how much of the challenges that you face as a, as a, as a business at the moment are around people, whether it's people skills or inability to kind of find the right people, or AI versus people, is that something that comes up a lot,\n\nSpeaker 1  18:51  \n\nit comes up fairly often, I think, find particularly for an organization our size, which is relatively small, each of the the players in the organization has to be very good at what they do, very efficient. And sometimes they have to wear multiple hats. They have to be able to to fill in for colleagues, because most of them are single points of failure. So if, if you're the head of communications, you're also crafting much of the marketing, and you're also, I don't know, I guess, I guess. What I'm trying to say is finding the right people who have the skill sets and the bandwidth to be able to cover lots of different roles is hard\n\nTeresa Allan  19:41  \n\nand the mindset to lean in, yeah, yeah. I think that that's probably everything that's been really helpful. Is there anything that you'd like to share with us a reflection of your experience with them?\n\nSpeaker 1  19:59  \n\nI would just go just reiterate that I found this experience wonderfully smooth, very satisfying, and I felt like we were getting very good professional advice along the way, but that we were also given free latitude to make our own decisions, as opposed to some of the the early tenor of our interactions with some of the other firms had been thus them telling us what we should be looking for instead of listening to us.\n\nTeresa Allan  20:33  \n\nYeah. So it felt like a real partnership where you were heard and they were supporting your needs. Fantastic, great. Well, I'll let you get back into the warmth, because I know it's not that that warm outside. Money down the road. It was really lovely to meet you, and thanks for taking the time out to have this call.\n\nSpeaker 1  20:53  \n\nMy pleasure, and I'm sorry it took such a while to get this sorted. No worries.\n\nTeresa Allan  21:00  \n\nYeah, have a good Have a good weekend. Thank you. You too. Bye, bye."
}