{
  "id": "t-007",
  "sourceFile": "T2_NPS9_NA_ES_HOUSE_SEP25.pdf",
  "client": "Harry Boot",
  "interviewDate": "2025-09-11",
  "project": "Search (2 x board members)",
  "score": 9,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Interviewer 1:51",
      "text": "Yeah, I'm good. Thanks. How are you doing? You back"
    },
    {
      "speaker": "Speaker 1 1:55",
      "text": "busy, but you know you got to say that, right? Make sure that at least you know, if someone's listening that that you're actually being paid for a reason,"
    },
    {
      "speaker": "Interviewer 2:04",
      "text": "wouldn't it be refreshing if someone said, I'm not that busy? Unknown Speaker 2:07 Actually, exactly, exactly, absolutely."
    },
    {
      "speaker": "Interviewer 2:13",
      "text": "Well, I mean, in the spirit of you being busy and time is precious, I will, I will keep this brief. So thank you for agreeing to do this. Really appreciate it. Just a couple of admin things before I get started. Are you all right if I record it, just purely, let me just do that."
    },
    {
      "speaker": "Interviewer 2:40",
      "text": "Okay? Yeah. So it's just a follow up to the NPS survey that you filled in for Korn Ferry. So they have asked us to dig into it a little bit further, see if we can bring to life some of the some of the scores. They've got a really big drive on customer centricity. How do they make things better? And obviously, by doing that, it's getting closer to their clients and customers. And they've asked us to do it to kind of hopefully get a what's an all view the good, bad and the ugly. So as happy as you are to be transparent and truthful, that would be great, because it just helps us feedback to them and then improve what their service to you. So if we can just start off by if you could just explain to me, Harry, your role within the business and the typical engagements that you have with Korn Ferry,"
    },
    {
      "speaker": "Speaker 1 3:37",
      "text": "yeah, no. So, I mean, one is it, the relationship goes back a long way, right? I mean, I've been dealing with, think, Korn Ferry literally. I mean, they've now placed me, I think, in two to two jobs, you know, as my career sort of progressed. So I've known them for probably two, close to two decades, right? Maybe even three decades. So it's a long time. And there's some people, yeah, literally, like Frederica, you know, that I've known for probably, like, 15 years, right? So it just goes back a long time. You know, I'm ultimately the CEO, and I'm also a board member of Mara, and when -- 1 of 5 -- the need ultimately arised, yeah, you're going to go to people that you know and that you trust and believe that also, the end of the day, can deliver right That, to me, is super important, and that's the reason why, very quickly, Even though there was, you know, a bunch of people from our investor base that were recommended. I wanted to make sure that that, you know, you know, commercially, were they? Were they attractive? But also, can they? Could they deliver the goods? Right? And hence, why we've, we've, we selected Korn Ferry to to move, ahead with us."
    },
    {
      "speaker": "Interviewer 5:01",
      "text": "So, right? And just digging a little bit more into the the project in terms of the brief kind of you know, from the very beginning when you selected them, how did you, how did you engage them, and did you co create the briefing together, or is it something that you had a very clear view in mind? No, so,"
    },
    {
      "speaker": "Speaker 1 5:26",
      "text": "I mean, one is, you know, definitely had a decent view of what we were looking for. But also listen to, you know, their their perspective, right? Frederica, or James, you know, Alicia, especially Fredrik, has just got a lot of experience in this, in this area, right? So also listening to them, You know what? What the constraints could be, right? Because the end of the day, of course, as a customer, you want everything right, yeah, you know, I mean, I wanted, we were clear that we wanted two board members, but very different sort of profiles, right? Ideally, of course, you want all those profiles in one, right? And you're not going to find that right. So I think also just pushing back on some realism of what we're looking for, I think was super helpful, right? And then you eventually come to a brief that you feel comfortable with. And as a result, you see the amount of caliber of people that were interested in, you know, in the roles and whom they they contacted. You know, it was just super it was just really, really good. It's really high caliber people. I mean, one of the individuals is now with us, you know, for four days, doing a strategic review in a lot of detail, right? So willing to roll up their sleeves, not sitting at 30,000 foot, right, but really wanting to get into the details and seeing how they can help us, right? So I was not, I was looking at a very particular profile of people that know, not only you know, sit in the cock tip and you know through the speakers, tell us what to do, or what they agree with and what they don't know. I really wanted someone who could help us hands on with the business, interact with the leadership team, or even further down into the organization, to try and help us move, move where we want to, where we're where we are now, to where we want to want to want to be. So it's, it was a But to answer your question, it was, it was really jointly, they came up with a great proposal. We came back. I had a list ready of what the things that I was looking for, and they, they put some more realism and into it. And that developed as as we sort of went along as well. And that's what I appreciated, as well, the flexibility, right? Because the the worst thing is, you know, and we spent a lot of time, let's say, articulating what that thing looked like. But, you know, things do change, right? Or you have a particular profile, and you saying, Okay, this is not quite it. This is x, y and z. What we need to change in the in the next candidate, right? Because, and that flexibility was also, was, was also great, right?"
    },
    {
      "speaker": "Interviewer 8:15",
      "text": "In terms of, you know, them helping shape that, and also, you know, defining what good looks like. How much did you expect, or do you expect them to lean into their -- 2 of 5 -- own benchmarks and data, and how much do they did they or did? Or is it more about personal expertise and and relationship?"
    },
    {
      "speaker": "Speaker 1 8:36",
      "text": "No, no, not at all. It's, it's certainly, you know, they've, I mean, the ones that the little spider, you know, clearly articulating, you know, in the key aspects of so, you know, there's also a model what, what you're sort of looking for, and then ranking them right, using your database, or the database of Korn Ferry, to rank these people in the key competencies that we're looking for, right? So it's not just a, you know, I listen a nice person, or, you know, a good relationship, or whatever it is. No, it's also factual, right? Which is, which is important, right? You can sometimes be, you know, objective and not only subjective, right? You want the data also to speak for itself, absolutely"
    },
    {
      "speaker": "Interviewer 9:17",
      "text": "and in terms of communication. So throughout the project, do you feel like you were connected? You were made aware of progress, whether weekly check ins or a cadence suited you?"
    },
    {
      "speaker": "Speaker 1 9:28",
      "text": "Yeah. I mean again, because I do an incredibly stupid amount of travel, if you will. So, you know, whether it was, I was in Saudi, you know, you know, they found, time, right? So very much trying to accommodate, you know, my stupid, crazy schedule. So now they were super flexible, and that cadence, they kept that up. And if there was pre conversations that needed to take place, make sure that those took place right, stuff that it was only for me versus the rest of the team. I mean, I think, you know, and that's the way it needs to operate, right? There has to be a level of transparency, but you got to keep the process moving. So no, I honestly, I couldn't, I couldn't, literally, I couldn't have asked for more, right, in"
    },
    {
      "speaker": "Interviewer 10:14",
      "text": "terms of the space the end to end process, so, you know, for defining the brief and obviously finding suitable number and quality of candidates right through to kind of, then closing, you know, somebody in and negotiating through compensation and packages. Is that something that they also did? Did? Did they do the end to end? Or did you pick it up?"
    },
    {
      "speaker": "Speaker 1 10:38",
      "text": "No, so, so, I mean, we clearly identified right in the beginning of what the packages needed to look like, right? I didn't want to get to a candidate and and, you know, have those upfront conversations with the with with the candidates, saying, Hey, listen, you know, this is what the packages look like. We're a small company, right? And these are the expectations. And some, some candidates, you know, basically just say, Listen, well, that's not for me, because this is X, Y and Z is what I was, and that's fine, right? But having that sort of dialog upfront, so, so I think those initial conversations are super important, right? Because, you know, you don't want to go down a bunny hole and all of a sudden identify a whole bunch of candidates, and then at the end of the day, you can't close because, you know, and you've just literally wasted everybody's time, but you've wasted a candidate's time. You wasted my time, you wasted, you know, the the either the chair or, you know, the head of the -- 3 of 5 -- the the selection committee, or the HR committee, right? So these are all people that are all busy schedules. So, so, no, I think the way that that, the way that they did it was, again, that level of clear expectation, right? And also just having that Frank dialog. I mean, if it's, you know, I'll throw a number out there. If it's 50, you know, these guys with this sort of background are expecting 100, right? Is it even worthwhile having that conversation? Right? So it's just being very transparent. Listen, everybody's time is super critical. Let's just be do the work upfront, and then it just saves so much time at the end. And, you know, all the candidates that we we went through, you know, there was no conversations about budgets or about, you know, compensation pieces, or, you know, what was expected of them, or the amount of travel that they needed, you know. And some of them were a little bit more tricky, because they were in transition phases, but again, you got to work through that as well, right? You everything, yeah. So one candidate, for example, was just about to change jobs. We had to sort of factor that in. Means we needed to keep some other people on the line before we ultimately close out. So even the flexibility around that was, was was done"
    },
    {
      "speaker": "Interviewer 12:50",
      "text": "really, really well, great. Is there anything that you would have changed about the experience? Or, I suppose moving forward, you would like to see more of from them,"
    },
    {
      "speaker": "Speaker 1 13:02",
      "text": "very difficult for me to, I mean, I think I would have liked to see someone with a lot more Asian experience, right, because that's still where I think there's a lot of there's a tremendous amount of potential. But you know that the people that we did talk to, you know, they ultimately, you know, missed a lot of the other qualities that were looking for. So, you know, I would have liked to seen a little bit more of Asian folks with with that sort of but, you know, I also have to be, be fair to Korn Ferry, not necessarily, a lot of those people exist, right? Because it's a very young market, right? So I think the people that we did know we did try, trying out in the end of the day, they didn't make the cut, or the people that we eventually did, they have lived in that region. They understand that region. They understand the regulatory piece, and certainly were better, well rounded board members, but I'd say that's the only area, I mean, the US market, the European market, the level of technical expertise, you know, I honestly, I couldn't I, you know, and even the speed at which everything was done, and the level of of interest. Like I said, we had to work through a list of 30 people, right for a small, little company of our size, to get that many candidates. It's just as that, you know, that's that's a combination of of them doing a good sales job as well, making sure that the customers, that the people are interested. So there's not other No, I was super, as you could tell from my feedback, super, super. And again, if it would happen again, I would choose exactly the same team, right? I wouldn't change that. So, right?"
    },
    {
      "speaker": "Interviewer 14:52",
      "text": "And in terms of, I suppose, future engagements, obviously, you know they've sounds like they've really impressed you, and you've been through the experience on the other side, in search. Have you used them for anything else in organization, consultancy, or would you consider that?"
    },
    {
      "speaker": "Speaker 1 15:09",
      "text": "-- 4 of 5 -- No, I mean, so I know that they've got a lot of experience in that that front. Would I do that possibly? You know, at the moment, I don't have the need for it yet, right? So, I mean, I've got, now, for example, this, you know, he's, he's now an advisor. Again, it was through them, how we, we got all and he's helping me through all those, those, you know, whether it's organization or it's value or, you know, the environment that needs to change. So He's helping me through that, but certainly I wouldn't, I wouldn't discount it, right? But again, I'm a small company, so and they are, of course, costly, right? I mean, these guys are not cheap, right? So you got to, you know, there's, I can only spend $1 once, and, and I don't have that many dollars, right? So I gotta be very frugal. I gotta, I gotta be very frugal and make sure that I spend it wisely. So, you know, would that, would they come to me top of the list for an organizational development? No, I don't think I would. I would. I would put them on top of the list, but something like, you know, recruitment in that sort of level, absolutely, you know, that's where I think the dollars are very well spent,"
    },
    {
      "speaker": "Interviewer 16:30",
      "text": "right? I think that's it. I mean, it's so clear, yeah,"
    },
    {
      "speaker": "Speaker 1 16:33",
      "text": "I'm sorry. I don't have anything. Don't be sorry."
    },
    {
      "speaker": "Interviewer 16:36",
      "text": "Frank, yeah, no, it's absolutely spot on and really helpful. So I won't, I won't take any more of your time, but really appreciate you jumping on and having this call."
    },
    {
      "speaker": "Speaker 1 16:48",
      "text": "No worries all. Good. Bye. Bye. Transcribed by https://otter.ai -- 5 of 5 --"
    }
  ],
  "rawText": "Interviewer 1:51: Yeah, I'm good. Thanks. How are you doing? You back\n\nSpeaker 1 1:55: busy, but you know you got to say that, right? Make sure that at least you know, if someone's listening that that you're actually being paid for a reason,\n\nInterviewer 2:04: wouldn't it be refreshing if someone said, I'm not that busy? Unknown Speaker 2:07 Actually, exactly, exactly, absolutely.\n\nInterviewer 2:13: Well, I mean, in the spirit of you being busy and time is precious, I will, I will keep this brief. So thank you for agreeing to do this. Really appreciate it. Just a couple of admin things before I get started. Are you all right if I record it, just purely, let me just do that.\n\nInterviewer 2:40: Okay? Yeah. So it's just a follow up to the NPS survey that you filled in for Korn Ferry. So they have asked us to dig into it a little bit further, see if we can bring to life some of the some of the scores. They've got a really big drive on customer centricity. How do they make things better? And obviously, by doing that, it's getting closer to their clients and customers. And they've asked us to do it to kind of hopefully get a what's an all view the good, bad and the ugly. So as happy as you are to be transparent and truthful, that would be great, because it just helps us feedback to them and then improve what their service to you. So if we can just start off by if you could just explain to me, Harry, your role within the business and the typical engagements that you have with Korn Ferry,\n\nSpeaker 1 3:37: yeah, no. So, I mean, one is it, the relationship goes back a long way, right? I mean, I've been dealing with, think, Korn Ferry literally. I mean, they've now placed me, I think, in two to two jobs, you know, as my career sort of progressed. So I've known them for probably two, close to two decades, right? Maybe even three decades. So it's a long time. And there's some people, yeah, literally, like Frederica, you know, that I've known for probably, like, 15 years, right? So it just goes back a long time. You know, I'm ultimately the CEO, and I'm also a board member of Mara, and when -- 1 of 5 -- the need ultimately arised, yeah, you're going to go to people that you know and that you trust and believe that also, the end of the day, can deliver right That, to me, is super important, and that's the reason why, very quickly, Even though there was, you know, a bunch of people from our investor base that were recommended. I wanted to make sure that that, you know, you know, commercially, were they? Were they attractive? But also, can they? Could they deliver the goods? Right? And hence, why we've, we've, we selected Korn Ferry to to move, ahead with us.\n\nInterviewer 5:01: So, right? And just digging a little bit more into the the project in terms of the brief kind of you know, from the very beginning when you selected them, how did you, how did you engage them, and did you co create the briefing together, or is it something that you had a very clear view in mind? No, so,\n\nSpeaker 1 5:26: I mean, one is, you know, definitely had a decent view of what we were looking for. But also listen to, you know, their their perspective, right? Frederica, or James, you know, Alicia, especially Fredrik, has just got a lot of experience in this, in this area, right? So also listening to them, You know what? What the constraints could be, right? Because the end of the day, of course, as a customer, you want everything right, yeah, you know, I mean, I wanted, we were clear that we wanted two board members, but very different sort of profiles, right? Ideally, of course, you want all those profiles in one, right? And you're not going to find that right. So I think also just pushing back on some realism of what we're looking for, I think was super helpful, right? And then you eventually come to a brief that you feel comfortable with. And as a result, you see the amount of caliber of people that were interested in, you know, in the roles and whom they they contacted. You know, it was just super it was just really, really good. It's really high caliber people. I mean, one of the individuals is now with us, you know, for four days, doing a strategic review in a lot of detail, right? So willing to roll up their sleeves, not sitting at 30,000 foot, right, but really wanting to get into the details and seeing how they can help us, right? So I was not, I was looking at a very particular profile of people that know, not only you know, sit in the cock tip and you know through the speakers, tell us what to do, or what they agree with and what they don't know. I really wanted someone who could help us hands on with the business, interact with the leadership team, or even further down into the organization, to try and help us move, move where we want to, where we're where we are now, to where we want to want to want to be. So it's, it was a But to answer your question, it was, it was really jointly, they came up with a great proposal. We came back. I had a list ready of what the things that I was looking for, and they, they put some more realism and into it. And that developed as as we sort of went along as well. And that's what I appreciated, as well, the flexibility, right? Because the the worst thing is, you know, and we spent a lot of time, let's say, articulating what that thing looked like. But, you know, things do change, right? Or you have a particular profile, and you saying, Okay, this is not quite it. This is x, y and z. What we need to change in the in the next candidate, right? Because, and that flexibility was also, was, was also great, right?\n\nInterviewer 8:15: In terms of, you know, them helping shape that, and also, you know, defining what good looks like. How much did you expect, or do you expect them to lean into their -- 2 of 5 -- own benchmarks and data, and how much do they did they or did? Or is it more about personal expertise and and relationship?\n\nSpeaker 1 8:36: No, no, not at all. It's, it's certainly, you know, they've, I mean, the ones that the little spider, you know, clearly articulating, you know, in the key aspects of so, you know, there's also a model what, what you're sort of looking for, and then ranking them right, using your database, or the database of Korn Ferry, to rank these people in the key competencies that we're looking for, right? So it's not just a, you know, I listen a nice person, or, you know, a good relationship, or whatever it is. No, it's also factual, right? Which is, which is important, right? You can sometimes be, you know, objective and not only subjective, right? You want the data also to speak for itself, absolutely\n\nInterviewer 9:17: and in terms of communication. So throughout the project, do you feel like you were connected? You were made aware of progress, whether weekly check ins or a cadence suited you?\n\nSpeaker 1 9:28: Yeah. I mean again, because I do an incredibly stupid amount of travel, if you will. So, you know, whether it was, I was in Saudi, you know, you know, they found, time, right? So very much trying to accommodate, you know, my stupid, crazy schedule. So now they were super flexible, and that cadence, they kept that up. And if there was pre conversations that needed to take place, make sure that those took place right, stuff that it was only for me versus the rest of the team. I mean, I think, you know, and that's the way it needs to operate, right? There has to be a level of transparency, but you got to keep the process moving. So no, I honestly, I couldn't, I couldn't, literally, I couldn't have asked for more, right, in\n\nInterviewer 10:14: terms of the space the end to end process, so, you know, for defining the brief and obviously finding suitable number and quality of candidates right through to kind of, then closing, you know, somebody in and negotiating through compensation and packages. Is that something that they also did? Did? Did they do the end to end? Or did you pick it up?\n\nSpeaker 1 10:38: No, so, so, I mean, we clearly identified right in the beginning of what the packages needed to look like, right? I didn't want to get to a candidate and and, you know, have those upfront conversations with the with with the candidates, saying, Hey, listen, you know, this is what the packages look like. We're a small company, right? And these are the expectations. And some, some candidates, you know, basically just say, Listen, well, that's not for me, because this is X, Y and Z is what I was, and that's fine, right? But having that sort of dialog upfront, so, so I think those initial conversations are super important, right? Because, you know, you don't want to go down a bunny hole and all of a sudden identify a whole bunch of candidates, and then at the end of the day, you can't close because, you know, and you've just literally wasted everybody's time, but you've wasted a candidate's time. You wasted my time, you wasted, you know, the the either the chair or, you know, the head of the -- 3 of 5 -- the the selection committee, or the HR committee, right? So these are all people that are all busy schedules. So, so, no, I think the way that that, the way that they did it was, again, that level of clear expectation, right? And also just having that Frank dialog. I mean, if it's, you know, I'll throw a number out there. If it's 50, you know, these guys with this sort of background are expecting 100, right? Is it even worthwhile having that conversation? Right? So it's just being very transparent. Listen, everybody's time is super critical. Let's just be do the work upfront, and then it just saves so much time at the end. And, you know, all the candidates that we we went through, you know, there was no conversations about budgets or about, you know, compensation pieces, or, you know, what was expected of them, or the amount of travel that they needed, you know. And some of them were a little bit more tricky, because they were in transition phases, but again, you got to work through that as well, right? You everything, yeah. So one candidate, for example, was just about to change jobs. We had to sort of factor that in. Means we needed to keep some other people on the line before we ultimately close out. So even the flexibility around that was, was was done\n\nInterviewer 12:50: really, really well, great. Is there anything that you would have changed about the experience? Or, I suppose moving forward, you would like to see more of from them,\n\nSpeaker 1 13:02: very difficult for me to, I mean, I think I would have liked to see someone with a lot more Asian experience, right, because that's still where I think there's a lot of there's a tremendous amount of potential. But you know that the people that we did talk to, you know, they ultimately, you know, missed a lot of the other qualities that were looking for. So, you know, I would have liked to seen a little bit more of Asian folks with with that sort of but, you know, I also have to be, be fair to Korn Ferry, not necessarily, a lot of those people exist, right? Because it's a very young market, right? So I think the people that we did know we did try, trying out in the end of the day, they didn't make the cut, or the people that we eventually did, they have lived in that region. They understand that region. They understand the regulatory piece, and certainly were better, well rounded board members, but I'd say that's the only area, I mean, the US market, the European market, the level of technical expertise, you know, I honestly, I couldn't I, you know, and even the speed at which everything was done, and the level of of interest. Like I said, we had to work through a list of 30 people, right for a small, little company of our size, to get that many candidates. It's just as that, you know, that's that's a combination of of them doing a good sales job as well, making sure that the customers, that the people are interested. So there's not other No, I was super, as you could tell from my feedback, super, super. And again, if it would happen again, I would choose exactly the same team, right? I wouldn't change that. So, right?\n\nInterviewer 14:52: And in terms of, I suppose, future engagements, obviously, you know they've sounds like they've really impressed you, and you've been through the experience on the other side, in search. Have you used them for anything else in organization, consultancy, or would you consider that?\n\nSpeaker 1 15:09: -- 4 of 5 -- No, I mean, so I know that they've got a lot of experience in that that front. Would I do that possibly? You know, at the moment, I don't have the need for it yet, right? So, I mean, I've got, now, for example, this, you know, he's, he's now an advisor. Again, it was through them, how we, we got all and he's helping me through all those, those, you know, whether it's organization or it's value or, you know, the environment that needs to change. So He's helping me through that, but certainly I wouldn't, I wouldn't discount it, right? But again, I'm a small company, so and they are, of course, costly, right? I mean, these guys are not cheap, right? So you got to, you know, there's, I can only spend $1 once, and, and I don't have that many dollars, right? So I gotta be very frugal. I gotta, I gotta be very frugal and make sure that I spend it wisely. So, you know, would that, would they come to me top of the list for an organizational development? No, I don't think I would. I would. I would put them on top of the list, but something like, you know, recruitment in that sort of level, absolutely, you know, that's where I think the dollars are very well spent,\n\nInterviewer 16:30: right? I think that's it. I mean, it's so clear, yeah,\n\nSpeaker 1 16:33: I'm sorry. I don't have anything. Don't be sorry.\n\nInterviewer 16:36: Frank, yeah, no, it's absolutely spot on and really helpful. So I won't, I won't take any more of your time, but really appreciate you jumping on and having this call.\n\nSpeaker 1 16:48: No worries all. Good. Bye. Bye. Transcribed by https://otter.ai -- 5 of 5 --"
}