{
  "id": "t-003",
  "sourceFile": "NPS Interview Transcript_011225_Greg, TriSummit Utilities Inc.docx",
  "overview": "Greg Aarssen, director and chair of compensation and governance committees at TriSummit Utilities (a Canadian utility holding company), had his first direct experience with CompanyA for a CEO search. The company needed to replace their CEO who resigned, and CompanyA was chosen over three other firms based on their deep understanding of the business, culture, and existing relationships with Alta Gas (the parent company). The process was completed in two months instead of the expected 4-5 months. CompanyA conducted both an internal candidate assessment and external market survey. The internal candidate was ultimately selected after extensive psychometric testing. Greg praised the responsiveness, proactive communication, and personalized approach of ConsultantA and Craig King.",
  "sections": [
    {
      "title": "Role and Background of Speaker 1",
      "points": []
    },
    {
      "title": "Interviewer asks Speaker 1 to describe their role and relationship with CompanyA.",
      "points": [
        "Speaker 1 is a director and chairs the compensation and governance committees at Clientcompany Utilities, a Canadian utility holding company.",
        "Speaker 1 was previously the president of the company and involved in acquiring or building many of the assets."
      ]
    },
    {
      "title": "The company spun out of Alta Gas Canada, where Speaker 1 was an original board member.",
      "points": []
    },
    {
      "title": "First Experience with CompanyA",
      "points": []
    },
    {
      "title": "Interviewer inquires about recent projects with CompanyA.",
      "points": [
        "Speaker 1 mentions this was their first exposure to CompanyA, having heard of them through past employees.",
        "CompanyA was chosen to find a project manager for a large project in Western Canada, who later became the CEO.",
        "The decision to retain CompanyA was based on their understanding of the business, culture, and previous relationships with Alta Gas."
      ]
    },
    {
      "title": "Selection Criteria and Process",
      "points": []
    },
    {
      "title": "Interviewer asks about the selection criteria for CompanyA.",
      "points": [
        "Speaker 1 emphasizes the importance of understanding the business, cultural fit, and market availability.",
        "CompanyA's ability to move quickly was a significant factor, completing the process in two months instead of the expected four to five.",
        "The internal candidate was tested extensively using CompanyA's assessment tools, confirming their suitability for the role."
      ]
    },
    {
      "title": "Market Survey and Candidate Evaluation",
      "points": [
        "Speaker 1 explains the dual path approach: testing the internal candidate and conducting a market survey.",
        "CompanyA's market survey helped focus on the internal candidate and identified suitable external candidates.",
        "The process involved psychometric testing by Craig King and evaluation by ConsultantA, both of whom were flexible with their schedules.",
        "The internal candidate was ultimately chosen, and the report was not shared with management but with CompanyA."
      ]
    },
    {
      "title": "Compensation and Market Position",
      "points": [
        "Speaker 1 discusses the compensation review conducted by Meridian Consulting, revealing the company was 11% below market."
      ]
    },
    {
      "title": "CompanyA's benchmarking frameworks were not used due to potential conflicts of interest.",
      "points": [
        "The internal candidate's assessment tools were used exclusively, providing confidence in their selection.",
        "The company faced challenges in justifying executive compensation to shareholders, requiring third-party validation."
      ]
    },
    {
      "title": "Communication and Stakeholder Management",
      "points": []
    },
    {
      "title": "Interviewer inquires about the CompanyA team's responsiveness and stakeholder management.",
      "points": []
    },
    {
      "title": "Speaker 1 praises CompanyA's proactive communication and ability to keep them informed.",
      "points": [
        "The team's understanding of Speaker 1's communication style and open, honest approach was appreciated.",
        "Speaker 1 would recommend CompanyA again and is considering additional services for succession planning."
      ]
    },
    {
      "title": "Feedback and Suggestions for Improvement",
      "points": []
    },
    {
      "title": "Interviewer asks for any areas for improvement in CompanyA's services.",
      "points": []
    },
    {
      "title": "Speaker 1 suggests CompanyA could improve their marketing and communication strategies.",
      "points": []
    },
    {
      "title": "The idea of using CompanyA for board-level coaching and development is considered.",
      "points": []
    },
    {
      "title": "Speaker 1 acknowledges the high cost of CompanyA but values their expertise and service quality.",
      "points": []
    },
    {
      "title": "Board-Level Discussions on People and Skills",
      "points": []
    },
    {
      "title": "Interviewer asks about the importance of people and skills at the board level.",
      "points": [
        "Speaker 1 explains that people discussions are a significant part of board meetings, including strategic planning, compensation, and succession planning."
      ]
    },
    {
      "title": "The chair of the business emphasizes the importance of people in achieving business success.",
      "points": []
    },
    {
      "title": "There is an opportunity for third-party assistance in board-level coaching and development.",
      "points": []
    },
    {
      "title": "Final Thoughts and Future Plans",
      "points": [
        "Speaker 1 expresses interest in exploring additional services from CompanyA, particularly for succession planning.",
        "The company faces challenges with frugal shareholders, who sometimes cut corners on important investments."
      ]
    },
    {
      "title": "Interviewer suggests CompanyA's board services as a potential solution.",
      "points": []
    }
  ],
  "fullTranscript": [
    {
      "speaker": "Unknown",
      "text": "Interviewer  0:01\nYes, just to encourage a more open and honest conversation. So hopefully that's okay with you. So if we jump straight in, it would be great just to understand your role and the relationship that you've had with CompanyA to date, certainly.\nSpeaker 1  0:18\nSo I am a member a director with clientcompany utilities, which is a Canadian based utility holding company, and I also chair our compensation and governance committees. And this is a business that spun out of Alta gas Canada, or Alta gas, I should say it was then it became Alta gas Canada, and I was one of the original board members there. So I've been with this since its inception. Okay, fantastic. And prior to that, I was actually, I was the president of the company. So I actually a number of these assets. I was involved in acquiring or building\nInterviewer  0:57\nbrilliant and then in terms of your relationship with CompanyA. What's, what's been the recent projects that you've worked with them on?\nSpeaker 1  1:04\nSo this is it. This was my first exposure to CompanyA. I had, I had familiarity with a CompanyA just because some of the people that had reported to me in the past had used CompanyA for various searches. And I know that when, when we were getting ready to build a fairly large project in Western Canada, we use CompanyA to find a project manager for us at that time, who then became our president, CEO, in fact. So that's my exposure. It's just been very recent, within the last four or five months,\nInterviewer  1:43\nwhat was it that made you choose them on this project then?\nSpeaker 1  1:46\nSo we needed our CEO resigned, took a new job, was moving out of the province of the business and CompanyA had a history with a number of people in our business. So I mentioned that we came we're a subset of assets that came out of Alta gas. There is, there's a long standing relationship between CompanyA and Alta gas. So our chair is the former founder of Alta gas. I'm an Alta gas person. A number of our senior managers and vice presidents are all the guest people. So they knew our business, they knew the nuts and bolts of our business, and they also understood the culture that we had. So those were important things. So when we sat and looked at it, said, Gosh, who can we get to help us to embark on a search and to also evaluate a couple of internal people. There were three firms that we considered very quickly, I made the pitch that we simply stay with CompanyA or retain CompanyA, and our committee agreed to that. So we've been moving forward since,\nInterviewer  3:04\nwhat was it that was important to you in that selection out of those three, what were the things that you were looking at\nSpeaker 1  3:11\nso understanding of our business, specifically the cultural element of our business, and understanding of what it takes for people to be successful within that environment, and understanding of the breadth of who was out there in the marketplace, available or potentially available to us, and then someone that was able to move very nimbly and quickly, we had a short fuse On this many of the others had told us it was going to be a four or five month replacement process. CompanyA said that would be four months at the beginning, perhaps three months. And with some encouragement and some assistance, we got it done in two. Oh, wow.\nInterviewer  3:57\nOkay, fantastic. Yeah, yeah. And in that too, did you find that you had, did they meet your expectations in terms of providing you quality and quantity of candidates?\nSpeaker 1  4:10\nSo it was a little different in that we had a candidate inside of the organization that we had identified through our succession planning that would be the logical person for an internal candidate. And so it was testing that person to ensure that there were no blind spots that there were there was nothing in his background that we did not understand fully, and that, in fact, he had the skills and the ability to do the job. So that was one path that we were going down in a parallel path we were we asked CompanyA to go out to the market to see who was available to us in what we'll we'll call a desktop or a market survey process. And they did that. I. Um, and I would say that they did it ably. It's it's a different, difficult time right now in our industry that there's been some consolidation. So there's not a lot of people that are in roles where they've been there for a while, that are unhappy or looking for another opportunity. They did a great a really good job of going out and ferrying some interesting people, not only within our industry, but if you consider concentric circles, going out and broadening it. So ours is the utility business that maybe look at the natural gas and oil business, and then maybe look at energy and then look at the broader did a very good job of expanding and including some interesting people that would have had similar skills to what we were looking for in our CEO. And so that was helpful. It was helpful in a couple of ways. Interviewer in one of the things it did was it helped us to continue to focus back in on our lead candidate, to say we're holding this person up as the, as the as the most likely candidate we're testing against that person's skills and abilities. So it was very well done. The other that I should let you ask the questions, no, no. Carry on. Carry on. I was just gonna say. The other thing that really impressed me was CompanyA's willingness to get the job done. And what I mean by that is everybody has busy schedules. And we were dealing with two individuals, one in Calgary, ConsultantA and one in Minnesota, Craig King. Craig was doing the psychometric and the testing on our lead candidate internally, ConsultantA was looking at the external search, but also assisting on evaluating this person in Calgary. And both men very busy. Both men certainly made their schedules available, and we were always able to find time. Some of that was later in the day, some of it was early evening, some of it was very early in the morning. I was grateful for that approach to simply looking for ways to get it done. Great.\nInterviewer  7:15\nWas it the internal candidate that got the role in the end, or was it an external one?\nSpeaker 1  7:20\nNo, it was the internal candidate, Interviewer, who, at the end of the day, everyone thought that that's who would be. Who gets a copy of this report.\nInterviewer  7:32\nThe team do, but we, if there's something you don't want to say, just let me know and we'll take it out.\nSpeaker 1  7:37\nNo, it's fine. So it does not go back to the it wouldn't go back to our management,\nInterviewer  7:44\nyeah, just to CompanyA.\nSpeaker 1  7:46\nSo when we spun the assets out of all the gas, it was public company, and then we, our major shareholder didn't want to own it anymore, so put the company up, and it was sold. It was taken private to pension funds. To pension funds. One 80% one 20% the 80% pension fund has a problem in recognizing significant pay for executives, especially when that exceeds their own and so they there was always a bit of a tug of war with regard to, gosh, is this person really worth this? Even though the majority of the salary and compensation for that person is recoverable in our rate base through through our utility operations. But there was a psychological thing there. And one of the things I learned a few years ago with them is I can talk until I'm blue in the face and tell them the black is black and white is white. But if you as a as an expert, or as an outside, paid third party comes in and says, black is black and white is white, it's gospel. And so I learned early on that we needed to bring somebody in to be able to identify some of these things. So along with CompanyA, and this is an ancillary operation, that we had to go to a third party again for, we needed to get justification on the compensation level for this person, and while that is, as the CompanyA does, some of that, they were now a bit of a conflicted party. So we ended up having to go to a business called Meridian consulting. You may be familiar with them, and meridian was able to undertake a compensation review and actually identify that we were 11% below market, and that's why our CEO left.\nInterviewer  9:46\nSo you weren't able to use the Korn, CompanyA benchmarking, pay benchmarking frameworks. We didn't. Did you use their assessment tools, especially to compare the. Internal candidate with external ones\nSpeaker 1  10:02\n100% so their their assessment tools were used exclusively with the internal candidate, and exclusively and extensively they ran some significant, a significant battery of tests for our internal candidate. When the report came back Interviewer, we felt very confident that we had the right person, so we did not need to go out and do that testing with these external candidates.\nInterviewer  10:35\nGreat in terms of your experience with the team, the CompanyA team, in terms of just, I mean, you said they were responsive out of hours. How did they manage all the different stakeholders? Did you find it easy to deal with them? Did you feel up to date with the progress?\nSpeaker 1  10:55\nSo it was, I never felt in the dark. I had that they were very responsive to email questions. They were very proactive in letting me know where things were when, and this is even me as a pivot person when they were out dealing with external people or with their potential next candidate. They did a very good job of keeping me abreast, one of the other things that is is interesting is I'm an old dog, Interviewer, almost 70 years old here, and my communication style is probably different from most young people today, and both gentlemen that I dealt with from CompanyA and their assistance, and I'll include them, because there were some very able admin people and and so support people. They were all very good in understanding that, for me, it was good to get the facts in a sincere manner without a whole lot of dressing on them, and our communication back and forth was open, honest to the point, and that is to My experience in the last 15 years, that's a rarity. ConsultantA, especially, I had never spoken with him prior to this. I had heard about ConsultantA just through things that others in the organization had, other experiences they had had with him, and I can tell you that within the first 15 minutes of my conversation with ConsultantA, I felt like he and I had worked together for a very long time, relaxed, open, honest to the point Craig King is the very same. So would I ever use these people again? I can't imagine not using them again. It would have to be a decision by somebody that if it was my decision, that's where we would be. If it was somebody else that did not require my, my input on it, then perhaps they would use someone. I would try to influence that. But I've had such a wonderful experience that that I would do that again. I think that there's probably a suite of services that that CompanyA may use, and I'm going to meet with going to meet with ConsultantA next week in Calgary to talk a little bit about this. But there's some services that, some things on the succession planning front that we do not do well as an organization right now. We Interviewer. We had a beautiful matrix put together, and we had names in all the boxes, but we had no idea if those people had the ability to do those jobs. Do you know what I mean? Do you understand what I'm saying? So yeah, we had so in our, for instance, in our CEO succession box, we had the person who is our new CEO now identified. He's been identified for five or six years. He was the two I see in this organization from day one. The two of them came out, we pulled them out of Alta gas, gave them the charge to go and do this. But behind that, we had five people with various degrees of expected preparedness, from needing two more years to needing five to seven years and having gone through this process, especially the cranking psychometric pro tip process, I would say I don't have any confidence in our matrix anymore. I think we need to have someone that is doing some of this search, some of these evaluations and analysis to make sure that we don't have blind spots.\nInterviewer  14:57\nInteresting would you also look at then, if there were blind spots? What would you use them for, things like development, planning and coaching? Yeah, correct. Great. Okay, is there anything that they could have done better? Anything that they could make improvements\nSpeaker 1  15:19\non Oid? That's a really good question. And I was asked this question when the original survey came out to me and and I struggled with it. Then, I don't think so, other than I didn't know enough about them, and so if I didn't have some prior influence within the organization. I don't and if I wasn't a golf fan, would never heard of CompanyA. So I don't know how they go about doing it. There's a business in Canada called huge set consulting, and they they're everywhere as far as their marketing reach goes. Rob CompanyA would be considered the Mercedes Benz within that business. Hugesson would be considered a jaguar. So big on image, some able people, I don't want to say that they don't do a good job, but they they seem to be everywhere when you go to do some some coursework on directorships. So we have an institute of corporate develop corporate directors in Canada. Houston has the has the contract, and I think it's a loose contract where they do it for free, but they go in and they teach the session on on corporate governance and succession planning and compensation evaluation and those sorts of things. So Could, could, could CompanyA do things better, maybe with some additional education has to be balanced, though I'm an old fart. So how do people like to get information today? I can tell you I don't like to read a 12 page paper on something, but give me the Cole's Notes version on give me the one pager version on it, or give me the opportunity to be invited into a conversation. I've got my full attention. Yeah. So on the marketing side, perhaps, perhaps CompanyA could do a better job in the marketing side, that's my only as far as their work goes, I have no complaints on their work. I'm looking at this now through a lens of managing their business. And I'm thinking, if they're managing their business, their their comms and their marketing, perhaps could be expanded. But that said, Only so many people, right? You don't want you don't want all the work. You want the best work. Yeah. And so I think files like ours are interesting for them. CompanyA is not inexpensive, so you need to have clients that are able to to pay for what they're getting. And so perhaps that's part of the high grading that they've done, I don't know,\nInterviewer  18:16\ntouching on the kind of thing you said about, you know, you've only heard of them through obviously got, I mean, it's something that I speak to them quite a bit about it. Do you find that that relationship, that sponsorship, now you know them, does it make sense to you, and before you'd encountered them, did you wonder who CompanyA were? If that wasn't clear,\nSpeaker 1  18:40\nso I knew who CompanyA was because we had used them in others had used them in past businesses, the CompanyA golf sponsorship. I don't understand that one, but who am I? It's probably likely looked at it and thought the people that we attract at the senior level to retain us, to go out and find successes within their business, are men who play golf, and where do they talk about their succession planning? Maybe on the golf course. I don't know. That's me guessing.\nInterviewer  19:20\nI think, I mean, it's right, right? You know, as you said, You're the, you're the demographic thereafter, and you play golf, and therefore you're aware of them. But I think there's also, you know, there's also a story alignment around, kind of realizing your potential. So given where the CompanyA tour is, that kind of one away from the PGA, it's around if you have the talent, but also the capability and the support you can get there. But I think we could probably do more with that story.\nSpeaker 1  19:51\nSee, it makes sense when you explain it to me sitting in front of the television on a Sunday afternoon, I would never have thought about that.\nInterviewer  19:59\nIt doesn't come. Well, it doesn't come through, right? I think that's the key thing, right, right? Fabulous. Well, I mean, you second guessed my last question, which was about the brand, so I think that's probably it, unless there's anything else. I mean, it'd be good just, I suppose, to take a broader view, from your point of view of your role, how, how much of your time at that kind of board level discussion is around people and skill sets.\nSpeaker 1  20:30\nSo it is an element four times a year we have six board meetings, one strategic planning, one budget and four quarterly reviews. The strategic planning session, it is discussed there. It is discussed at for sure, two other quarterly meetings, update meetings, and it's talked about at budget time. So one of those quarterly meetings, we have a specific requirement in there for the compensation and Governance Committee to ensure that our succession plan has been freshened. So that's one element of it. There's another one of those where we look at compensation, and then the budget brings some of those things together at that point in time. And on our strategic planning side, we're looking at that point in time and having a discussion about people to lead projects and to lead the plan forward. So we do it four times. Within that four times, I'm going to say that the board spends 30 to 45 minutes each one of those sessions on this matter, in in the actual meeting, my committee would spend another two hours per meeting outside of that having discussions or communications about it, and then in my role, I probably spend another three or four days each time in thinking about it. So there's a fair bit of consideration. And we're fortunate in that the chair of our business is a very dear friend of mine. He was the founder of Alta gas. He bought my business, actually in 2004 so we became pretty good friends, and then that's when I became his president. He is a person that when we chat about things, it's, it's people first, and that's, it's one of the things I love about David is that we recognize, we both recognize that our business is only going to be as successful as the people that can take us to where we want to go. We can plan everything we want, but if we can't execute on it, then it's going to fail. So we spend time. There's likely an opportunity for coaching at the board level. And I don't know how you do that, Interviewer, but there's you get a group of nine people together. Some of them think they know it all. Some do know it all, but most of us could use some additional guidance and direction. And with our shareholders, as I mentioned earlier on. They're the they're the third party. Show me type people. So I think there's an opportunity there for us to be looking at, and we're going to do that in 2026 looking at ways that we can engage third parties to assist us in bridging some of those potential gaps that we have, identifying them anyway, and then giving us some guidance and making sure that we're doing this in a more fulsome and in holistic approach,\nInterviewer  23:52\ndefinitely something that you should speak to CompanyA about. They have, I mean, obviously I'm agnostic, but they have a whole board services, part of their business who do exactly that. So I'm sure the team can tell you\nSpeaker 1  24:04\nmore about it. Yeah, we'll have to pick and choose, because I'll go back to commenting that our shareholders are cheap. There's a difference between being frugal and being cheap. I think we're cheap. We we tend to cut some corners when we shouldn't.\nInterviewer  24:22\nWell, that's the chat. That's the challenge of the shareholders that you have. We come across those all the time with our own clients too. Well. I mean, look, I won't hold you anymore. That's been a really, really helpful discussion. So thanks for your openness and honesty. And it was a real pleasure to meet you.\nSpeaker 1  24:40\nGood to meet you too, Interviewer, where are you located? I'm just\nInterviewer  24:44\njust actually in the South Downs, just south of London. I'm just heading up to London shortly so, but we're about an hour away.\nSpeaker 1  24:51\nI lived in London for 14 months, working way back early in my career. It was the time of my life. I left. Did not 1991 I was there 90 and 91 and I left in 91 and had I not, had they not sent all the expats home, and I was stayed there probably for another year or two, I think I would still be there a lovely part of the world. Have you been back since? I've been back a couple of times? It's changed. But I think that if I look at it, I don't recognize London today, for instance, to what it was back 30 years ago. But no, no place is recognizable to what it was 30 years ago. And I think that my evolution would have gone with the evolution of the city, but there was so many culturally wonderful things about London as a person who enjoys history, there's a time in my life,\nInterviewer  26:09\nThank you. Client, lovely to see you. Bye."
    }
  ],
  "rawText": "NPS Interview Transcript\n\nInterview Date: 01.12.25\n\nClient: Greg Aarssen, TriSummit Utilities Inc.\n\nProject: ES\n\nScore: 10\n\nTRANSCRIPT OVERVIEW\n\nhttps://otter.ai/u/jshYjjs94mgT5iqMRlaQQj2lADs?view=summary\n\nGreg Aarssen, a director at Clientcompany Utilities, discussed his first experience with CompanyA, which led to hiring a new CEO. CompanyA's deep understanding of the company's culture and business needs, coupled with their quick turnaround time, made them the preferred choice over three other firms. The internal candidate was extensively tested using CompanyA's assessment tools, confirming their suitability. Aarssen praised CompanyA's responsiveness, proactive communication, and the personalized approach of ConsultantA and Craig King. He also highlighted the need for better marketing and suggested potential board-level coaching services.\n\nRole and Background of Speaker 1\n\nInterviewer asks Speaker 1 to describe their role and relationship with CompanyA.\n\nSpeaker 1 is a director and chairs the compensation and governance committees at Clientcompany Utilities, a Canadian utility holding company.\n\nSpeaker 1 was previously the president of the company and involved in acquiring or building many of the assets.\n\nThe company spun out of Alta Gas Canada, where Speaker 1 was an original board member.\n\nFirst Experience with CompanyA\n\nInterviewer inquires about recent projects with CompanyA.\n\nSpeaker 1 mentions this was their first exposure to CompanyA, having heard of them through past employees.\n\nCompanyA was chosen to find a project manager for a large project in Western Canada, who later became the CEO.\n\nThe decision to retain CompanyA was based on their understanding of the business, culture, and previous relationships with Alta Gas.\n\nSelection Criteria and Process\n\nInterviewer asks about the selection criteria for CompanyA.\n\nSpeaker 1 emphasizes the importance of understanding the business, cultural fit, and market availability.\n\nCompanyA's ability to move quickly was a significant factor, completing the process in two months instead of the expected four to five.\n\nThe internal candidate was tested extensively using CompanyA's assessment tools, confirming their suitability for the role.\n\nMarket Survey and Candidate Evaluation\n\nSpeaker 1 explains the dual path approach: testing the internal candidate and conducting a market survey.\n\nCompanyA's market survey helped focus on the internal candidate and identified suitable external candidates.\n\nThe process involved psychometric testing by Craig King and evaluation by ConsultantA, both of whom were flexible with their schedules.\n\nThe internal candidate was ultimately chosen, and the report was not shared with management but with CompanyA.\n\nCompensation and Market Position\n\nSpeaker 1 discusses the compensation review conducted by Meridian Consulting, revealing the company was 11% below market.\n\nCompanyA's benchmarking frameworks were not used due to potential conflicts of interest.\n\nThe internal candidate's assessment tools were used exclusively, providing confidence in their selection.\n\nThe company faced challenges in justifying executive compensation to shareholders, requiring third-party validation.\n\nCommunication and Stakeholder Management\n\nInterviewer inquires about the CompanyA team's responsiveness and stakeholder management.\n\nSpeaker 1 praises CompanyA's proactive communication and ability to keep them informed.\n\nThe team's understanding of Speaker 1's communication style and open, honest approach was appreciated.\n\nSpeaker 1 would recommend CompanyA again and is considering additional services for succession planning.\n\nFeedback and Suggestions for Improvement\n\nInterviewer asks for any areas for improvement in CompanyA's services.\n\nSpeaker 1 suggests CompanyA could improve their marketing and communication strategies.\n\nThe idea of using CompanyA for board-level coaching and development is considered.\n\nSpeaker 1 acknowledges the high cost of CompanyA but values their expertise and service quality.\n\nBoard-Level Discussions on People and Skills\n\nInterviewer asks about the importance of people and skills at the board level.\n\nSpeaker 1 explains that people discussions are a significant part of board meetings, including strategic planning, compensation, and succession planning.\n\nThe chair of the business emphasizes the importance of people in achieving business success.\n\nThere is an opportunity for third-party assistance in board-level coaching and development.\n\nFinal Thoughts and Future Plans\n\nSpeaker 1 expresses interest in exploring additional services from CompanyA, particularly for succession planning.\n\nThe company faces challenges with frugal shareholders, who sometimes cut corners on important investments.\n\nInterviewer suggests CompanyA's board services as a potential solution.\n\nThe conversation concludes with mutual appreciation and plans for future discussions.\n\nFULL TRANSCRIPT\n\nInterviewer  0:01  \n\nYes, just to encourage a more open and honest conversation. So hopefully that's okay with you. So if we jump straight in, it would be great just to understand your role and the relationship that you've had with CompanyA to date, certainly.\n\nSpeaker 1  0:18  \n\nSo I am a member a director with clientcompany utilities, which is a Canadian based utility holding company, and I also chair our compensation and governance committees. And this is a business that spun out of Alta gas Canada, or Alta gas, I should say it was then it became Alta gas Canada, and I was one of the original board members there. So I've been with this since its inception. Okay, fantastic. And prior to that, I was actually, I was the president of the company. So I actually a number of these assets. I was involved in acquiring or building\n\nInterviewer  0:57  \n\nbrilliant and then in terms of your relationship with CompanyA. What's, what's been the recent projects that you've worked with them on?\n\nSpeaker 1  1:04  \n\nSo this is it. This was my first exposure to CompanyA. I had, I had familiarity with a CompanyA just because some of the people that had reported to me in the past had used CompanyA for various searches. And I know that when, when we were getting ready to build a fairly large project in Western Canada, we use CompanyA to find a project manager for us at that time, who then became our president, CEO, in fact. So that's my exposure. It's just been very recent, within the last four or five months,\n\nInterviewer  1:43  \n\nwhat was it that made you choose them on this project then?\n\nSpeaker 1  1:46  \n\nSo we needed our CEO resigned, took a new job, was moving out of the province of the business and CompanyA had a history with a number of people in our business. So I mentioned that we came we're a subset of assets that came out of Alta gas. There is, there's a long standing relationship between CompanyA and Alta gas. So our chair is the former founder of Alta gas. I'm an Alta gas person. A number of our senior managers and vice presidents are all the guest people. So they knew our business, they knew the nuts and bolts of our business, and they also understood the culture that we had. So those were important things. So when we sat and looked at it, said, Gosh, who can we get to help us to embark on a search and to also evaluate a couple of internal people. There were three firms that we considered very quickly, I made the pitch that we simply stay with CompanyA or retain CompanyA, and our committee agreed to that. So we've been moving forward since,\n\nInterviewer  3:04  \n\nwhat was it that was important to you in that selection out of those three, what were the things that you were looking at\n\nSpeaker 1  3:11  \n\nso understanding of our business, specifically the cultural element of our business, and understanding of what it takes for people to be successful within that environment, and understanding of the breadth of who was out there in the marketplace, available or potentially available to us, and then someone that was able to move very nimbly and quickly, we had a short fuse On this many of the others had told us it was going to be a four or five month replacement process. CompanyA said that would be four months at the beginning, perhaps three months. And with some encouragement and some assistance, we got it done in two. Oh, wow.\n\nInterviewer  3:57  \n\nOkay, fantastic. Yeah, yeah. And in that too, did you find that you had, did they meet your expectations in terms of providing you quality and quantity of candidates?\n\nSpeaker 1  4:10  \n\nSo it was a little different in that we had a candidate inside of the organization that we had identified through our succession planning that would be the logical person for an internal candidate. And so it was testing that person to ensure that there were no blind spots that there were there was nothing in his background that we did not understand fully, and that, in fact, he had the skills and the ability to do the job. So that was one path that we were going down in a parallel path we were we asked CompanyA to go out to the market to see who was available to us in what we'll we'll call a desktop or a market survey process. And they did that. I. Um, and I would say that they did it ably. It's it's a different, difficult time right now in our industry that there's been some consolidation. So there's not a lot of people that are in roles where they've been there for a while, that are unhappy or looking for another opportunity. They did a great a really good job of going out and ferrying some interesting people, not only within our industry, but if you consider concentric circles, going out and broadening it. So ours is the utility business that maybe look at the natural gas and oil business, and then maybe look at energy and then look at the broader did a very good job of expanding and including some interesting people that would have had similar skills to what we were looking for in our CEO. And so that was helpful. It was helpful in a couple of ways. Interviewer in one of the things it did was it helped us to continue to focus back in on our lead candidate, to say we're holding this person up as the, as the as the most likely candidate we're testing against that person's skills and abilities. So it was very well done. The other that I should let you ask the questions, no, no. Carry on. Carry on. I was just gonna say. The other thing that really impressed me was CompanyA's willingness to get the job done. And what I mean by that is everybody has busy schedules. And we were dealing with two individuals, one in Calgary, ConsultantA and one in Minnesota, Craig King. Craig was doing the psychometric and the testing on our lead candidate internally, ConsultantA was looking at the external search, but also assisting on evaluating this person in Calgary. And both men very busy. Both men certainly made their schedules available, and we were always able to find time. Some of that was later in the day, some of it was early evening, some of it was very early in the morning. I was grateful for that approach to simply looking for ways to get it done. Great.\n\nInterviewer  7:15  \n\nWas it the internal candidate that got the role in the end, or was it an external one?\n\nSpeaker 1  7:20  \n\nNo, it was the internal candidate, Interviewer, who, at the end of the day, everyone thought that that's who would be. Who gets a copy of this report.\n\nInterviewer  7:32  \n\nThe team do, but we, if there's something you don't want to say, just let me know and we'll take it out.\n\nSpeaker 1  7:37  \n\nNo, it's fine. So it does not go back to the it wouldn't go back to our management,\n\nInterviewer  7:44  \n\nyeah, just to CompanyA.\n\nSpeaker 1  7:46  \n\nSo when we spun the assets out of all the gas, it was public company, and then we, our major shareholder didn't want to own it anymore, so put the company up, and it was sold. It was taken private to pension funds. To pension funds. One 80% one 20% the 80% pension fund has a problem in recognizing significant pay for executives, especially when that exceeds their own and so they there was always a bit of a tug of war with regard to, gosh, is this person really worth this? Even though the majority of the salary and compensation for that person is recoverable in our rate base through through our utility operations. But there was a psychological thing there. And one of the things I learned a few years ago with them is I can talk until I'm blue in the face and tell them the black is black and white is white. But if you as a as an expert, or as an outside, paid third party comes in and says, black is black and white is white, it's gospel. And so I learned early on that we needed to bring somebody in to be able to identify some of these things. So along with CompanyA, and this is an ancillary operation, that we had to go to a third party again for, we needed to get justification on the compensation level for this person, and while that is, as the CompanyA does, some of that, they were now a bit of a conflicted party. So we ended up having to go to a business called Meridian consulting. You may be familiar with them, and meridian was able to undertake a compensation review and actually identify that we were 11% below market, and that's why our CEO left.\n\nInterviewer  9:46  \n\nSo you weren't able to use the Korn, CompanyA benchmarking, pay benchmarking frameworks. We didn't. Did you use their assessment tools, especially to compare the. Internal candidate with external ones\n\nSpeaker 1  10:02  \n\n100% so their their assessment tools were used exclusively with the internal candidate, and exclusively and extensively they ran some significant, a significant battery of tests for our internal candidate. When the report came back Interviewer, we felt very confident that we had the right person, so we did not need to go out and do that testing with these external candidates.\n\nInterviewer  10:35  \n\nGreat in terms of your experience with the team, the CompanyA team, in terms of just, I mean, you said they were responsive out of hours. How did they manage all the different stakeholders? Did you find it easy to deal with them? Did you feel up to date with the progress?\n\nSpeaker 1  10:55  \n\nSo it was, I never felt in the dark. I had that they were very responsive to email questions. They were very proactive in letting me know where things were when, and this is even me as a pivot person when they were out dealing with external people or with their potential next candidate. They did a very good job of keeping me abreast, one of the other things that is is interesting is I'm an old dog, Interviewer, almost 70 years old here, and my communication style is probably different from most young people today, and both gentlemen that I dealt with from CompanyA and their assistance, and I'll include them, because there were some very able admin people and and so support people. They were all very good in understanding that, for me, it was good to get the facts in a sincere manner without a whole lot of dressing on them, and our communication back and forth was open, honest to the point, and that is to My experience in the last 15 years, that's a rarity. ConsultantA, especially, I had never spoken with him prior to this. I had heard about ConsultantA just through things that others in the organization had, other experiences they had had with him, and I can tell you that within the first 15 minutes of my conversation with ConsultantA, I felt like he and I had worked together for a very long time, relaxed, open, honest to the point Craig King is the very same. So would I ever use these people again? I can't imagine not using them again. It would have to be a decision by somebody that if it was my decision, that's where we would be. If it was somebody else that did not require my, my input on it, then perhaps they would use someone. I would try to influence that. But I've had such a wonderful experience that that I would do that again. I think that there's probably a suite of services that that CompanyA may use, and I'm going to meet with going to meet with ConsultantA next week in Calgary to talk a little bit about this. But there's some services that, some things on the succession planning front that we do not do well as an organization right now. We Interviewer. We had a beautiful matrix put together, and we had names in all the boxes, but we had no idea if those people had the ability to do those jobs. Do you know what I mean? Do you understand what I'm saying? So yeah, we had so in our, for instance, in our CEO succession box, we had the person who is our new CEO now identified. He's been identified for five or six years. He was the two I see in this organization from day one. The two of them came out, we pulled them out of Alta gas, gave them the charge to go and do this. But behind that, we had five people with various degrees of expected preparedness, from needing two more years to needing five to seven years and having gone through this process, especially the cranking psychometric pro tip process, I would say I don't have any confidence in our matrix anymore. I think we need to have someone that is doing some of this search, some of these evaluations and analysis to make sure that we don't have blind spots.\n\nInterviewer  14:57  \n\nInteresting would you also look at then, if there were blind spots? What would you use them for, things like development, planning and coaching? Yeah, correct. Great. Okay, is there anything that they could have done better? Anything that they could make improvements\n\nSpeaker 1  15:19  \n\non Oid? That's a really good question. And I was asked this question when the original survey came out to me and and I struggled with it. Then, I don't think so, other than I didn't know enough about them, and so if I didn't have some prior influence within the organization. I don't and if I wasn't a golf fan, would never heard of CompanyA. So I don't know how they go about doing it. There's a business in Canada called huge set consulting, and they they're everywhere as far as their marketing reach goes. Rob CompanyA would be considered the Mercedes Benz within that business. Hugesson would be considered a jaguar. So big on image, some able people, I don't want to say that they don't do a good job, but they they seem to be everywhere when you go to do some some coursework on directorships. So we have an institute of corporate develop corporate directors in Canada. Houston has the has the contract, and I think it's a loose contract where they do it for free, but they go in and they teach the session on on corporate governance and succession planning and compensation evaluation and those sorts of things. So Could, could, could CompanyA do things better, maybe with some additional education has to be balanced, though I'm an old fart. So how do people like to get information today? I can tell you I don't like to read a 12 page paper on something, but give me the Cole's Notes version on give me the one pager version on it, or give me the opportunity to be invited into a conversation. I've got my full attention. Yeah. So on the marketing side, perhaps, perhaps CompanyA could do a better job in the marketing side, that's my only as far as their work goes, I have no complaints on their work. I'm looking at this now through a lens of managing their business. And I'm thinking, if they're managing their business, their their comms and their marketing, perhaps could be expanded. But that said, Only so many people, right? You don't want you don't want all the work. You want the best work. Yeah. And so I think files like ours are interesting for them. CompanyA is not inexpensive, so you need to have clients that are able to to pay for what they're getting. And so perhaps that's part of the high grading that they've done, I don't know,\n\nInterviewer  18:16  \n\ntouching on the kind of thing you said about, you know, you've only heard of them through obviously got, I mean, it's something that I speak to them quite a bit about it. Do you find that that relationship, that sponsorship, now you know them, does it make sense to you, and before you'd encountered them, did you wonder who CompanyA were? If that wasn't clear,\n\nSpeaker 1  18:40  \n\nso I knew who CompanyA was because we had used them in others had used them in past businesses, the CompanyA golf sponsorship. I don't understand that one, but who am I? It's probably likely looked at it and thought the people that we attract at the senior level to retain us, to go out and find successes within their business, are men who play golf, and where do they talk about their succession planning? Maybe on the golf course. I don't know. That's me guessing.\n\nInterviewer  19:20  \n\nI think, I mean, it's right, right? You know, as you said, You're the, you're the demographic thereafter, and you play golf, and therefore you're aware of them. But I think there's also, you know, there's also a story alignment around, kind of realizing your potential. So given where the CompanyA tour is, that kind of one away from the PGA, it's around if you have the talent, but also the capability and the support you can get there. But I think we could probably do more with that story.\n\nSpeaker 1  19:51  \n\nSee, it makes sense when you explain it to me sitting in front of the television on a Sunday afternoon, I would never have thought about that.\n\nInterviewer  19:59  \n\nIt doesn't come. Well, it doesn't come through, right? I think that's the key thing, right, right? Fabulous. Well, I mean, you second guessed my last question, which was about the brand, so I think that's probably it, unless there's anything else. I mean, it'd be good just, I suppose, to take a broader view, from your point of view of your role, how, how much of your time at that kind of board level discussion is around people and skill sets.\n\nSpeaker 1  20:30  \n\nSo it is an element four times a year we have six board meetings, one strategic planning, one budget and four quarterly reviews. The strategic planning session, it is discussed there. It is discussed at for sure, two other quarterly meetings, update meetings, and it's talked about at budget time. So one of those quarterly meetings, we have a specific requirement in there for the compensation and Governance Committee to ensure that our succession plan has been freshened. So that's one element of it. There's another one of those where we look at compensation, and then the budget brings some of those things together at that point in time. And on our strategic planning side, we're looking at that point in time and having a discussion about people to lead projects and to lead the plan forward. So we do it four times. Within that four times, I'm going to say that the board spends 30 to 45 minutes each one of those sessions on this matter, in in the actual meeting, my committee would spend another two hours per meeting outside of that having discussions or communications about it, and then in my role, I probably spend another three or four days each time in thinking about it. So there's a fair bit of consideration. And we're fortunate in that the chair of our business is a very dear friend of mine. He was the founder of Alta gas. He bought my business, actually in 2004 so we became pretty good friends, and then that's when I became his president. He is a person that when we chat about things, it's, it's people first, and that's, it's one of the things I love about David is that we recognize, we both recognize that our business is only going to be as successful as the people that can take us to where we want to go. We can plan everything we want, but if we can't execute on it, then it's going to fail. So we spend time. There's likely an opportunity for coaching at the board level. And I don't know how you do that, Interviewer, but there's you get a group of nine people together. Some of them think they know it all. Some do know it all, but most of us could use some additional guidance and direction. And with our shareholders, as I mentioned earlier on. They're the they're the third party. Show me type people. So I think there's an opportunity there for us to be looking at, and we're going to do that in 2026 looking at ways that we can engage third parties to assist us in bridging some of those potential gaps that we have, identifying them anyway, and then giving us some guidance and making sure that we're doing this in a more fulsome and in holistic approach,\n\nInterviewer  23:52  \n\ndefinitely something that you should speak to CompanyA about. They have, I mean, obviously I'm agnostic, but they have a whole board services, part of their business who do exactly that. So I'm sure the team can tell you\n\nSpeaker 1  24:04  \n\nmore about it. Yeah, we'll have to pick and choose, because I'll go back to commenting that our shareholders are cheap. There's a difference between being frugal and being cheap. I think we're cheap. We we tend to cut some corners when we shouldn't.\n\nInterviewer  24:22  \n\nWell, that's the chat. That's the challenge of the shareholders that you have. We come across those all the time with our own clients too. Well. I mean, look, I won't hold you anymore. That's been a really, really helpful discussion. So thanks for your openness and honesty. And it was a real pleasure to meet you.\n\nSpeaker 1  24:40  \n\nGood to meet you too, Interviewer, where are you located? I'm just\n\nInterviewer  24:44  \n\njust actually in the South Downs, just south of London. I'm just heading up to London shortly so, but we're about an hour away.\n\nSpeaker 1  24:51  \n\nI lived in London for 14 months, working way back early in my career. It was the time of my life. I left. Did not 1991 I was there 90 and 91 and I left in 91 and had I not, had they not sent all the expats home, and I was stayed there probably for another year or two, I think I would still be there a lovely part of the world. Have you been back since? I've been back a couple of times? It's changed. But I think that if I look at it, I don't recognize London today, for instance, to what it was back 30 years ago. But no, no place is recognizable to what it was 30 years ago. And I think that my evolution would have gone with the evolution of the city, but there was so many culturally wonderful things about London as a person who enjoys history, there's a time in my life,\n\nInterviewer  26:09  \n\nThank you. Client, lovely to see you. Bye."
}