{
  "id": "t-001",
  "sourceFile": "NPS Interview Transcript_02.10.25_Lisa, PartnerRe.docx",
  "overview": "Lisa Bolger, Chief People Officer at PartnerRe (1,350 employees, ELT of 15), has had a very positive relationship with CompanyA over the last 18 months. CompanyA has won the majority of tenders against Spencer Stuart and Heidrick & Struggles. The relationship started with consultant K in Zurich, then transitioned to AC who has been the main contact. Lisa praised CompanyA's tailored approach, thoughtful questions, alignment with PartnerRe's needs, and flexibility in negotiations. AC's communication style matches well with the CEO. There have been some challenges with ongoing US searches involving multiple stakeholders, but overall the experience has been excellent. Lisa is planning to transition out of her role by early next year.",
  "sections": [
    {
      "title": "Issues & Risks",
      "points": []
    },
    {
      "title": "For the ongoing claims role search in the US:",
      "points": []
    },
    {
      "title": "Challenges with coordinating meetings and interviews with different stakeholders.",
      "points": []
    },
    {
      "title": "Difficulty in scheduling last-minute interviews with the CFF.",
      "points": []
    },
    {
      "title": "For a previous unsuccessful search with another agency:",
      "points": []
    },
    {
      "title": "Concern about CompanyA potentially overselling candidates.",
      "points": []
    },
    {
      "title": "Need for more listening and focus on client needs, especially from the US team.",
      "points": []
    },
    {
      "title": "General concern:",
      "points": []
    },
    {
      "title": "Balancing execution focus with strategic thinking in ClientCompany's culture.",
      "points": []
    },
    {
      "title": "Questions discussed",
      "points": [
        "\"Did he meet your communication needs in terms of, you know, regular updates, keeping you in the loop, kind of even just communicating on the channels that suit you, and being available?\"",
        "\"Do you find in terms of stakeholder management, you know, they respect the lines and authority and kind of, you know, the group in terms of the structure?\""
      ]
    },
    {
      "title": "\"Are they tapping into the other resources that CompanyA has?\"",
      "points": []
    },
    {
      "title": "\"What do you really look for that or as or, or would like to see more of, even as in value add?\"",
      "points": [
        "\"Have you always been satisfied with the quality and quantity of candidates that have come through to you?\""
      ]
    },
    {
      "title": "Outline",
      "points": []
    },
    {
      "title": "Introduction and Meeting Purpose",
      "points": []
    },
    {
      "title": "Unknown Speaker and Interviewer greet each other and discuss the rescheduling of the meeting.",
      "points": [
        "Interviewer explains her role as an external consultant working with CompanyA for the last five or six years.",
        "The purpose of the meeting is to gather feedback on the relationship with CompanyA, focusing on customer centricity and continuous improvement."
      ]
    },
    {
      "title": "Interviewer requests permission to record the meeting for documentation purposes.",
      "points": []
    },
    {
      "title": "ClientCompany's Executive Leadership Team and Role of CompanyA",
      "points": [
        "Speaker 1 introduces themselves as the Chief People Officer for ClientCompany, a company with 13,150 employees and an executive leadership team (ELT) of 15.",
        "The company uses CompanyA and other executive search firms for strategic roles and succession planning.",
        "CompanyA has won the majority of tenders in the last two years, with significant activity in the last year to 18 months.",
        "The relationship with CompanyA has been positive, with a focus on thoughtful questions and understanding ClientCompany's needs."
      ]
    },
    {
      "title": "CompanyA's Approach and Communication",
      "points": [
        "Speaker 1 appreciates CompanyA's tailored approach, focusing on what ClientCompany needs rather than what CompanyA offers.",
        "The early stages of the partnership involve thorough preparation and thoughtful questions to understand ClientCompany's requirements."
      ]
    },
    {
      "title": "CompanyA's flexibility in negotiations and fee structures has been appreciated.",
      "points": [
        "AC, the main contact from CompanyA, has been praised for his open, honest, and insightful communication style."
      ]
    },
    {
      "title": "Challenges and Areas for Improvement",
      "points": [
        "Speaker 1 mentions a few challenges, such as coordinating interviews and meetings with different stakeholders."
      ]
    },
    {
      "title": "There have been some delays, but overall, communication has been effective.",
      "points": [
        "The claims role search in the US has been particularly challenging due to different stakeholders and coordination issues.",
        "Speaker 1 emphasizes the importance of open communication and flexibility in managing these challenges."
      ]
    },
    {
      "title": "Stakeholder Management and Job Specification",
      "points": [
        "Interviewer inquires about stakeholder management and the role of CompanyA in defining job specifications.",
        "Speaker 1 explains that CompanyA has been involved in creating leader profiles and benchmarking for most searches.",
        "There has been a sharing of resources and data, with a focus on understanding ClientCompany's needs.",
        "Speaker 1 notes that there is sometimes a need for more listening, especially with the US team, to ensure alignment with ClientCompany's requirements."
      ]
    },
    {
      "title": "Expectations from a Search Partner",
      "points": []
    },
    {
      "title": "Speaker 1 values tailored services, thoughtful questions, and alignment with ClientCompany's needs.",
      "points": [
        "The focus should be on understanding ClientCompany's requirements and providing authentic and challenging feedback."
      ]
    },
    {
      "title": "There should be a balance between selling candidates and ensuring a good fit for ClientCompany.",
      "points": []
    },
    {
      "title": "Speaker 1 appreciates the personal touch and relationship-focused approach of CompanyA.",
      "points": []
    },
    {
      "title": "Use of CompanyA's Broader Offerings",
      "points": [
        "Speaker 1 mentions that ClientCompany has used CompanyA for learning and development modules in the past."
      ]
    },
    {
      "title": "The company prefers a hands-on approach and does not heavily rely on consultants.",
      "points": [
        "CompanyA's broader offerings, such as consultancy and benchmarking, are not extensively used by ClientCompany."
      ]
    },
    {
      "title": "The focus is on getting things done efficiently rather than extensive consulting.",
      "points": []
    },
    {
      "title": "Satisfaction with Candidates and Ongoing Searches",
      "points": [
        "Speaker 1 discusses the satisfaction with the quality and quantity of candidates provided by CompanyA."
      ]
    },
    {
      "title": "There have been some challenging searches, but overall, the process has been successful.",
      "points": [
        "The ongoing searches are a bit tricky, but there is ongoing communication and support from CompanyA."
      ]
    },
    {
      "title": "Speaker 1 appreciates the personal touch and hands-on cooperation during the onboarding process.",
      "points": []
    },
    {
      "title": "Future Plans and Final Thoughts",
      "points": [
        "Speaker 1 plans to finish their role at ClientCompany by March, April, or May next year to pursue coaching and consulting."
      ]
    },
    {
      "title": "They have been with the company for 20 years and have taken on the role to support the new CEO.",
      "points": [
        "Speaker 1 emphasizes the importance of reactive approaches and effective stakeholder management in the search process.",
        "Interviewer thanks Speaker 1 for their insights and wishes them good luck in their future endeavors."
      ]
    }
  ],
  "fullTranscript": [
    {
      "speaker": "Unknown",
      "text": "Interviewer  2:51\nSo yeah, I mean, if we can start by if you can just explain your role in the conversation,\nSpeaker 1  2:56\nyeah, exactly, yeah, yeah. So thank you. I appreciate that. Yeah, so I'm the Chief People Officer for ClientCompany. I've been in this role now for just over three years. I've been with ClientCompany a very very long time this stage, I said in this role for three years. And we had a change of CEO last year. So the beginning of 2024 that you know, obviously, then it was an internal succession. So it moved and opened some positions underneath. And then we also had some retirements both planned and otherwise that year. So we have a relatively large executive leadership team for a company our size. So we're 1350 employees with a ELT of 15. So it is, it is a large executive team, and we would use, you know, CompanyA and the executive search companies for, you know, replacing our ELT, if we weren't able to do it with succession, or one or two really key strategic roles. You know, obviously that's, that's the type of roles that we're focusing on when we partner with someone like CompanyA. So I had been in HR for quite some time, but we had a lot of stability. So I would say it was really kind of the start of 2024, after been in the role for a year and a half that, you know, I was even thinking about who are executive search partners. I think we had, at that stage a number of roles open, or possibly becoming open. So we, I think we look to kind of three. We have three partners that we lean on, Spencer Stuart, CompanyA, and hydric and struggles. If I look at who's won the vast majority of the tenders in the last two years, it's been heavily weighted towards CompanyA. I think we've done one with Spencer Stewart and the rest up, and CompanyA, obviously, with the team. I always mentioned that, you know, this is never going to be a, you know, not a unique group, you know, what's the wording? Sorry, when we just have one partner. So it's not exclusive. It's not exclusive. There you go. You think that would be the easy word to think\nInterviewer  5:26\nabout? Yeah,\nSpeaker 1  5:28\nyes, exactly. So. But you know, we because we have to challenge ourselves and not get too boy biased with, you know, the partners that get to know us pretty well as well. So, so, so we did. We've we started with K, who was in Zurich, and she subsequently left, and she introduced us, then middle of last year, to AC. So AC's been our main, main contact on the account. So by step back again, I suppose you know, we've had much more activity in the last year to 18 months than the previous three, four years. And really have appreciated, you know, I think we got, we got to know the CompanyA team quick. Well, it's been, it's worked very well. If I start with, you know, the whole tender process, negotiating presentations. I think the the approach that CompanyA take, you know, there's and that's always my role as well, to make sure that they get a sense of us before they pitch to the CEO who's been making a decision on most of these things. So, you know, I've really enjoyed that kind of partnership, and that it felt very natural like the right questions, you know, appropriately commercial, but not too commercial, appropriately big picture, but also focusing in on, you know, what really makes partner re Tid so very much. You know, what I appreciate by CompanyA is like there's no such thing as one size fits all, and I you mentioned customer centric at the start, you know, I certainly experienced that and felt that and would recommend them highly based on, based on that. I think that's what we really like about the engagements we've done. So, you know, I think that that that part of the process, that early stages, in terms of, like the pitch, the you know, kind of the initial assessment of the needs, the conversations, what we value very much is thoughtful questions. And so, you know, there's been a lot of preparation in advance. But what's really kind of swung the the success of the CompanyA pitches, which, as I said, are the most of them have really been that, like taking the time to ask thoughtful questions, really quiz our executives, mainly our CEO, on his actual needs, his preferences, how he likes things. So you know that that dialog has been, has worked very, very well. And I think has really been a USP in, you know, sometimes other firms can really focus on this is what you're getting, rather than what do you want? Yes, what do you want? What do you need? And and asking really great, great questions to tease that out and not been afraid to challenge which I, you know, which, which I love. So that works very well for us. We're, you know, we're a bit of a hands on culture. We say that, you know, very execution focused. So more about actions versus principles, more about outcomes versus concepts. You know, you know, there's a time and a place for everything. Sometimes I say here, you know, obviously these, while this has been recorded, I know the notes will be confidential, but sometimes the challenge I have back to the team is, you know, when your strengths become your weaknesses, and I think sometimes we've become so execution focused, it's become nearly a bit of a oh, maybe we've over tipped. So, you know, we find that balance exactly so. So I think, you know, from that perspective, the the approach of CompanyA works well. AC's been a great partner. AC has been an excellent partner for us. And you know, from all aspects in terms of helping us through the negotiations, our guys know how to negotiate hard, you know? I suppose you know most CEOs and most presidents are in the business of the front facing anyway, so I have underwriters around me. I was like, You're the negotiators. They negotiate hard. Their expectations are high, but that's always felt very respectful. You know, really about the relationship and not and, you know, obviously, you know, the CompanyA have terms and conditions they absolutely have to meet, but it's been, I've really appreciated the flexibility, whether it's, you know, different aspects of the retainer versus the overall fee, or how we structure the overall fee. You know, there's always some nuance and some complication with everyone, and that flexibility and that ability to really think about how we can meet the partnering needs us has very much been appreciated. So I wanted to mention that because we, you know, obviously, when we've had volume as well, we're expecting, you know, better terms every time, but that's worked well. AC's, you know, our main, our main contact, as I said, you know, has been AC, and has been the lead his his approach, again, works very well with us, very open, very honest, brings a lot of value to the table, and is not afraid to, you know, very thoughtful in his questions, insightful, takes this time to think about it, which matches the CEO. They're quite of similar styles in their communications. So it's funny to sit back and watch them, you know. But they complement each other very well, just very thoughtful, very but not afraid to put the hard stuff on the table, you know, you're going to have to flex on this. You're not going to get that. That's going to be a challenge. This is what I'm hearing, and that's what we expect. You know, we're, we're the type of company that appreciate the difficult but the straightforward conversation. So, you know, it's not always just about saying yes to the CEO. It's like, hold on. You know, these are the things you're really gonna this is what I'm worried about for you. Yeah, yeah. So I've seen, you know,\nInterviewer  11:25\nlike, communication, I suppose, from day one, you know, did, did he in terms of asking questions? Was it, did he meet your communication needs in terms of, you know, regular updates, keeping you in the loop, kind of even just communicating on the channels that suit you, and being available\nSpeaker 1  11:45\nthe vast majority of things, absolutely, I think we've won ongoing at the moment in relation to our claims role that's open in the US. So it's more it's kind of US Europe and coordination, and we have very different stakeholders on that one. So I think that one's probably in a small bit of a challenge. But in general, I would say that works. That works well, like I haven't had an issue with the ones I'm leading. I'm not leading the claims one, but I know there's been some, you know, trying to get meetings in the diary with CFF, or interviews with the diary, in the diary with the CFF last minute, which is never going to work for her, you know. So there's just, you know, there's one or two kind of things like that after popping up, but nothing that's insurmountable. We have a small delay, and I don't know if it's your side or my side, but hopefully I'm coming through.\nInterviewer  12:39\nOkay, I can hear you clearly. So apologies. Is my side.\nSpeaker 1  12:43\nNow, you never know. We had a bridge burned down recently near the office, and this seems to have affected the internet as well. So, yeah, so I think Jen, like, I see, I see myself having a role in that as well. Like, if it's, if I'm not the actual hiring manager, you know, I'm very open in what I expect, you know, very transparent, and what I think will meet Phillips needs as CEO, what meets John's needs as president? So I do my best to equip the team on that. And if there's any delay or we need something, it's like, you know, so we have a very open, easy. You know, the channel is easy to get the partners. You know, I think AC and I will communicate quite a lot, whether it was text or, let's just jump on a call, a teams call, you know, there's, there's an open communication from both sides there.\nInterviewer  13:34\nSo nice. And do you find in terms of stakeholder management, you know, they respect the lines and authority and kind of, you know, the group in terms of the structure. So if you're the main point of contact, is that always the case?\nSpeaker 1  13:50\nYeah, and I think we would agree that up front, you know, for so right now, we actually have a search ongoing that's to replace, just completely confidential. So obviously, you know, that one, I'm not the main point of contact for because we we agreed up front. Doesn't make sense. You know, I sat down with Philip and was like, how involved do you want me to be in this? You know, obviously I can come in and support later, but, you know, probably shouldn't drive it. You should drive it. Maybe some conversations. I shouldn't be there because, you know, you might really want to be really explicit about this is what's getting met right now. This is what I'd like from a future candidate. And I said, like, I don't want you to feel like there's any barriers to that conversation, like, this is, this is my decision, but I also know that there's things that Philip and I don't align on so and I think, you know that's a different conversation, but it's also making sure that you know, the person that we're working with challenges that as well, and doesn't just lean into a bias of any any executive that they're hiring for. So I think, I think that's that's been quite good in terms of, you know, well, I filled these three positions for Philip now, and, you know, I'd be concerned about this, or it's clear he's looking for this. And, you know, we would raise those things up respectfully as well, you know, so we, I think,\nInterviewer  15:09\nyeah, in terms of things like, I suppose, define, you know, you said that they seem really good at the beginning of asking questions, and does that then translate into kind of, really helping define the job spec, and are they then using things like their assessments or pay benchmarks to really bring that to life? Are they, you know, is it? Are they tapping into the other resources that CompanyA has?\nSpeaker 1  15:38\nYes, we've done a number of the leader profiles. And, you know, certainly, obviously, when you're getting closer to the end and doing it where we felt was necessary, we haven't done it across the board for but we've done it maybe for most, I would say maybe 75% versus 100% of the candidates. And certainly having conversations around benchmark. I've, I've and, to be fair, I've used their data for other things as well. So there's a very, you know, I would say there's a real partnership there. I'm like, I actually need something in this area. Have you got something that would help so, so, yeah, like, while it's not every day, certainly there's been a huge there's been, there's been a sharing of all the resources that are available to us, I think one of the, one of the, I think when I look at the various searches, I think, you know,\nSpeaker 1  16:41\nand I don't know whether it's and I'm probably not in the room enough, and I don't know whether it's a culture thing or I would say, you know, there's probably a little bit more listening needed on the US side than the European side. Okay, you know, I think they're, they're all very, very responsive, but, you know, I would say we just need to keep an eye on making sure that it's not that the that you know, it's really about what do you need, what do you want? I think there's sometimes a tendency at one role in particular, in mind, it's one we're working on at the moment, and it wasn't a successful search for us with another agent. So we brought this to CompanyA, so it's our second time going at it. So I think there's also some sensitivity on the CompanyA side. It's like, well, why doesn't it go well with the other agency, and we want to do a really great job, and sometimes to prove that you want to really do great job, you can over talk. I think there's just that opportunity to really, really just listen and use what's worked well in the others to focus in on that, because I think the danger sometimes, of you know, talking about good candidates is that there can be a perception of selling your guys, you know, or your your your your candidates. And obviously there's that's part of the process, but it's getting that balance right, you know. So I would say, I would say it's probably something for us to keep an eye on when we're, you know, thinking about the more the cultural approach, and because while we're, we're a real global company, sometimes I think it's that if I think about how we sell ourselves, we undersell and over deliver. Most of the time, it's always been our DNA. I don't think it always serves us well, but that's just the DNA for us, obviously, you know, a company that's on the other side of that, I think then if we feel that somebody's overselling, it's nearly like, doesn't feel compromised too hard, yeah, yeah, yeah. So we just need to, you know, that's just about making sure we get the right fit. And it's worked really well on the vast majority of the searches. And just need to keep an eye when we're working more closely with the US team, yeah.\nInterviewer  18:49\nAnd in terms of what you expect from a search partner, you know, you say you work with kind of the space all of the top three like, what do you really look for that or as or, or would like to see more of, even as in value add,\nSpeaker 1  19:07\nI think the focus on our needs, you know, I think it's really about like the tailorized services. I think that's why CompanyA has won the tenders over over the others. It's the, you know, the thoughtful questions, the alignment, you know, really spending time on the alignment. So I think that, you know, that's, that's really like questions, you're just the route to get there. So I would say, you know, appreciation. Want would, and would want to see more of, or continued, you know, focus on alignment. You know, intentional alignment. Partner, partnering, challenging, you know, making sure that, you know, but just put a bit authentic in the room. I think the team do that really well, but been like, if they hear something in the moment that sounds like, okay, you know, there's an opportunity to sense, check this, or Korn, ferry or challenge that, you know, maybe a bias and assumption that we that that's been done. So, you know, there should always be a certain amount of tension in this relationship, in certain stages, and it's making sure that we, you know, focus in and then hold that tension. What about? Yeah, just that transparency, you know,\nInterviewer  20:24\ndo you, do you expect, I mean, moving forward, you know, if you look at the kind of rate of change with kind of technology in this space, do you expect them to come with, like, be tech enabled in terms of their approach? Is that some is it more of a\nSpeaker 1  20:39\npeople to people so more of a people like, you know, I we're relatively small ourselves, like 1300 people. Is not a big company. Are, you know, if I even think about how the CEO operates, he operates on it. He's very in touch with people. He expects us to be very in touch with me. Now, when I say very in touch with people like that, I think we still have a challenge with same challenge of engagement that everybody got every company has, and the same challenge of not every company has, but the challenge of, then, you know, the multi generations in the workforce and making sure that we get, you know, the, you know, even when we think about things like AI, like, we're never going To be the market maker, the trendsetter there. You know, sometimes what I say about partnering is that we start late and we finish strong. So you know, we're not going to be a Swiss Re or a Munich Re in this market or his work. So we'll embrace the tools, like, for example, the Leadership Profiles. But you know, you won't razzle dazzle our guys with that kind of stuff. It's more, you know, and these pro it's more like, forget about profiles. Like, I even see that challenge with scope. I I have, you know, it's, it's all about, like, programs and ecosystems and all that straight over their heads, you know, like, it's all about the tangible, the personal, the so we're in a real rate, we're still in a relationship business. And it's, it's a relational approach to how we do business here as well. So I think, from that perspective, you know, that's going to always trump the, the kind of analytics and the data and all of that, you know, yeah, nice.\nInterviewer  22:18\nIn terms of, I suppose, CompanyA's broader offer. You know, around consultancy, do you use them for anything other than search?\nSpeaker 1  22:26\nWe we have done in the past, so we've on our L and D side, and there's, I can't even remember what the name of the module is, but we do, we do use something on the learning and development side. That's all we we have other providers for benchmarking and things like that. That's not CompanyA. And we don't use a lot of consultants. Okay, I consult like, you know, that's that. That's what I mean when I in terms of, like, Ferry, hard here to get, like, you know, it's all about just getting it done, rather than, you know, exactly, exactly so, so for somebody like me, I'm caught in that tension, but it's just, it's just a, you know, it's, I think there's a time and a space for that, but this is The reality of where we are right now.\nInterviewer  23:22\nYeah, yeah, makes sense. And then in terms of, sorry, skipping around, going back to search, have you always been satisfied with the quality and quantity of candidates that have come through to you?\nSpeaker 1  23:36\nLook, I think we've had some challenging searches. I think you know, we got there in the end with one, but we've had people like, we've had two that have well done. We've had one that's pulled out, you know, which is always a bit of a challenge that we make an offer. And then, and I know, you know, AC was really frustrated with with the guy, I think, as was, you know, Philip. It was a real niche role. So, you know, I think we got there, we were happy. And the person that we finding, her just started yesterday. So I think, you know, in the end, it worked out well. So I would say, yes, I would say, right now, the one that's ongoing is a bit tricky. So we'll see. We have a meeting today.\nSpeaker 1  24:29\nThere's always a bit of noise during the process, like, if I, if I, if I, think about where, how we start, then in the middle, the bit of frustration. And then we, you know, again, finish? Well, I couldn't say there's 100% satisfaction at all stages, but we get there. Okay, you have to take some ownership on our side that you know, very hard to make my CEO happy.\nInterviewer  24:55\nSo is there? I mean, if the one or two things that they could do better, what would it be?\nSpeaker 1  25:01\nI would say, Listen, like, if I look at where I'm hearing a little bit of noise, it is where the US are more involved. And rather than challenge them, I would say, Listen again. And rather than challenge back on, why? Like, it's that appropriate level of challenge. This is why it's the right slate. This is why it's the and for whatever reason there's there's probably just an opportunity to work on communication when there's multiple teams around the table. Maybe I could frame it that way.\nInterviewer  25:36\nYeah, that makes sense. And last question in terms of, once they've placed a candidate, how much support or continued engagement do they have with that candidate, then to make sure that they're succeeding in their role. And is this something that you would expect?\nSpeaker 1  25:56\nSo, as I said, the person that's come the, you know, the first one that's actually come in, I think, is the person who started yesterday. If I think about, you know, yeah, I said, so we've, we've personally started yesterday. We have a person who starts to start next month. We have my one ongoing. We have the two in the US ongoing. So that's five, but we actually, nobody's in long enough to really assess that, you know, I think the personal touch has been there even in the the, you know, the kind of the pre onboarding phase and the onboarding phase. So I'll keep an eye on that and see if it continues. But I know there's been great support and good support in the handover. You know, in terms of, okay, offer is signed, or even offer is made, what do you need to do? What they do? Will you take this on me by hat? You know, there's been, there's been good kind of hands on cooperation there. So I've nothing like, there's nothing really, from my side that has gone that I think could be done better in the actual logistical side of things, you know, okay, and then big fans of AC, as you can probably get like and he, he matches well with Philip as our CEO. And I told him that myself. So, you know, even for, like, say, the search that they're doing for my replacement, I'd like, you know, make sure you're the leading that one, like that. You're really hands on, like, the one in the US, he can't do out and about. He's not, you know, it's a US specific role, whereas a global one that I think, you know, his his approach fits our culture.\nInterviewer  27:37\nWell, yeah, great. Okay, I think that's it. I mean, anything else that you think would be useful to share back as a specific or more broadly?\nSpeaker 1  27:49\nNo, I just think with all of these things continue to, you know, kind of be reactive to the needs as they surface. And I think again, the communication like that, kind of stakeholder engagement, stakeholder management, including, you know, tricky when you have multiple, like, we've had, you know, as I said, we've had, like, some tricky ones where the person leading the engagement is not going to be the hiring manager in the end, and then the hiring, you know. So, you know, some of them have been, but I really do think about just managing the logistics is, you know, is always key in this. Great.\nInterviewer  28:21\nOkay, thank you. Where are you? Where are you off to\nSpeaker 1  28:25\nI'm I'm not going anywhere. Actually, I had, I suppose, when I came, when I accepted to do this role, I had always kind of said it would be a three and a half, four year gig, because I'd come back. So you know, while I said to you, I've been here 20 years. I left once in 2021 and agreed to come back because we had a CEO, a new CEO, and he was in the later stage of his career. So I came back. He said, come back and work for me for a few years. I'm like, okay, because we just got on really well. Like I had, I was on the way out, but I had the longest Notetaker in history. And then I was like, okay, yeah, like, because I was thinking about what I wanted to kind of go into the consulting directorships path. I'm a trained coach, and I just miss coaching. And so when he asked me to come back, I was like, gives me exposure to group boards that will help all of this. Of course. Then when my predecessor, and she used to be my boss. When she resigned, they offered me the role, and I was like, I can't say no now, you know, but I know, like being operationally and strategically responsible for HR is not my passion. Yeah, yeah. I'm happy to do it, and I've done it for four years, and I want to set Philip up for success with a future candidate. But I turned 50 last year, and I'm just big believer in following your like, I'm at the privileged position of, I can, I can take some risk. So I'm going to take, I'm hoping to finish up, well, depends when you get somebody, but I'm hoping to finish up kind of March, April, May, next year, and just take some time to really, like, kind of go, Okay, let's go back to the coaching. Let's go back to, you know, what you really, really wanted to do four years ago, and see then, give myself some time to think about it. But you know, as I said to Philip, I said, I don't expect to walk down the road and be in another CFF position and another reinsurer. So it's not, I'm not looking for that.\nInterviewer  30:18\nYeah. Oh, well, well, good luck.\nSpeaker 1  30:20\nThank you. Thanks very much"
    }
  ],
  "rawText": "NPS Interview Transcript\n\nInterview Date: 02.10.25\n\nClient: Lisa, PartnerRe\n\nProject: Executive Search\n\nScore: 9\n\nTRANSCRIPT OVERVIEW\n\nhttps://otter.ai/u/Uzq4AWkiEtJ_nlnymc_I-yTKm9Y?view=summary\n\nLisa Bolger, Chief People Officer at ClientCompany, discussed her company's relationship with CompanyA. ClientCompany, with 13,150 employees and an ELT of 15, has used CompanyA for key executive roles, with CompanyA winning the majority of tenders in the last two years. Bolger praised CompanyA's tailored services, thoughtful questions, and alignment with ClientCompany's needs. She highlighted the importance of communication, flexibility, and the personal touch in the search process. Bolger also mentioned ongoing searches and her plans to transition out of her role by early next year to pursue coaching.\n\nIssues & Risks\n\n\t\tFor the ongoing claims role search in the US:\n\n\t\tChallenges with coordinating meetings and interviews with different stakeholders.\n\n\t\tDifficulty in scheduling last-minute interviews with the CFF.\n\n\t\tFor a previous unsuccessful search with another agency:\n\n\t\tConcern about CompanyA potentially overselling candidates.\n\n\t\tNeed for more listening and focus on client needs, especially from the US team.\n\n\t\tGeneral concern:\n\n\t\tBalancing execution focus with strategic thinking in ClientCompany's culture.\n\nQuestions discussed\n\n\t\t\"Did he meet your communication needs in terms of, you know, regular updates, keeping you in the loop, kind of even just communicating on the channels that suit you, and being available?\"\n\n\t\t\"Do you find in terms of stakeholder management, you know, they respect the lines and authority and kind of, you know, the group in terms of the structure?\"\n\n\t\t\"Are they tapping into the other resources that CompanyA has?\"\n\n\t\t\"What do you really look for that or as or, or would like to see more of, even as in value add?\"\n\n\t\t\"Have you always been satisfied with the quality and quantity of candidates that have come through to you?\"\n\nOutline\n\nIntroduction and Meeting Purpose\n\n\t\tUnknown Speaker and Interviewer greet each other and discuss the rescheduling of the meeting.\n\n\t\tInterviewer explains her role as an external consultant working with CompanyA for the last five or six years.\n\n\t\tThe purpose of the meeting is to gather feedback on the relationship with CompanyA, focusing on customer centricity and continuous improvement.\n\n\t\tInterviewer requests permission to record the meeting for documentation purposes.\n\nClientCompany's Executive Leadership Team and Role of CompanyA\n\n\t\tSpeaker 1 introduces themselves as the Chief People Officer for ClientCompany, a company with 13,150 employees and an executive leadership team (ELT) of 15.\n\n\t\tThe company uses CompanyA and other executive search firms for strategic roles and succession planning.\n\n\t\tCompanyA has won the majority of tenders in the last two years, with significant activity in the last year to 18 months.\n\n\t\tThe relationship with CompanyA has been positive, with a focus on thoughtful questions and understanding ClientCompany's needs.\n\nCompanyA's Approach and Communication\n\n\t\tSpeaker 1 appreciates CompanyA's tailored approach, focusing on what ClientCompany needs rather than what CompanyA offers.\n\n\t\tThe early stages of the partnership involve thorough preparation and thoughtful questions to understand ClientCompany's requirements.\n\n\t\tCompanyA's flexibility in negotiations and fee structures has been appreciated.\n\n\t\tAC, the main contact from CompanyA, has been praised for his open, honest, and insightful communication style.\n\nChallenges and Areas for Improvement\n\n\t\tSpeaker 1 mentions a few challenges, such as coordinating interviews and meetings with different stakeholders.\n\n\t\tThere have been some delays, but overall, communication has been effective.\n\n\t\tThe claims role search in the US has been particularly challenging due to different stakeholders and coordination issues.\n\n\t\tSpeaker 1 emphasizes the importance of open communication and flexibility in managing these challenges.\n\nStakeholder Management and Job Specification\n\n\t\tInterviewer inquires about stakeholder management and the role of CompanyA in defining job specifications.\n\n\t\tSpeaker 1 explains that CompanyA has been involved in creating leader profiles and benchmarking for most searches.\n\n\t\tThere has been a sharing of resources and data, with a focus on understanding ClientCompany's needs.\n\n\t\tSpeaker 1 notes that there is sometimes a need for more listening, especially with the US team, to ensure alignment with ClientCompany's requirements.\n\nExpectations from a Search Partner\n\n\t\tSpeaker 1 values tailored services, thoughtful questions, and alignment with ClientCompany's needs.\n\n\t\tThe focus should be on understanding ClientCompany's requirements and providing authentic and challenging feedback.\n\n\t\tThere should be a balance between selling candidates and ensuring a good fit for ClientCompany.\n\n\t\tSpeaker 1 appreciates the personal touch and relationship-focused approach of CompanyA.\n\nUse of CompanyA's Broader Offerings\n\n\t\tSpeaker 1 mentions that ClientCompany has used CompanyA for learning and development modules in the past.\n\n\t\tThe company prefers a hands-on approach and does not heavily rely on consultants.\n\n\t\tCompanyA's broader offerings, such as consultancy and benchmarking, are not extensively used by ClientCompany.\n\n\t\tThe focus is on getting things done efficiently rather than extensive consulting.\n\nSatisfaction with Candidates and Ongoing Searches\n\n\t\tSpeaker 1 discusses the satisfaction with the quality and quantity of candidates provided by CompanyA.\n\n\t\tThere have been some challenging searches, but overall, the process has been successful.\n\n\t\tThe ongoing searches are a bit tricky, but there is ongoing communication and support from CompanyA.\n\n\t\tSpeaker 1 appreciates the personal touch and hands-on cooperation during the onboarding process.\n\nFuture Plans and Final Thoughts\n\n\t\tSpeaker 1 plans to finish their role at ClientCompany by March, April, or May next year to pursue coaching and consulting.\n\n\t\tThey have been with the company for 20 years and have taken on the role to support the new CEO.\n\n\t\tSpeaker 1 emphasizes the importance of reactive approaches and effective stakeholder management in the search process.\n\n\t\tInterviewer thanks Speaker 1 for their insights and wishes them good luck in their future endeavors.\n\nFULL TRANSCRIPT\n\nInterviewer  2:51  \n\nSo yeah, I mean, if we can start by if you can just explain your role in the conversation,\n\nSpeaker 1  2:56  \n\nyeah, exactly, yeah, yeah. So thank you. I appreciate that. Yeah, so I'm the Chief People Officer for ClientCompany. I've been in this role now for just over three years. I've been with ClientCompany a very very long time this stage, I said in this role for three years. And we had a change of CEO last year. So the beginning of 2024 that you know, obviously, then it was an internal succession. So it moved and opened some positions underneath. And then we also had some retirements both planned and otherwise that year. So we have a relatively large executive leadership team for a company our size. So we're 1350 employees with a ELT of 15. So it is, it is a large executive team, and we would use, you know, CompanyA and the executive search companies for, you know, replacing our ELT, if we weren't able to do it with succession, or one or two really key strategic roles. You know, obviously that's, that's the type of roles that we're focusing on when we partner with someone like CompanyA. So I had been in HR for quite some time, but we had a lot of stability. So I would say it was really kind of the start of 2024, after been in the role for a year and a half that, you know, I was even thinking about who are executive search partners. I think we had, at that stage a number of roles open, or possibly becoming open. So we, I think we look to kind of three. We have three partners that we lean on, Spencer Stuart, CompanyA, and hydric and struggles. If I look at who's won the vast majority of the tenders in the last two years, it's been heavily weighted towards CompanyA. I think we've done one with Spencer Stewart and the rest up, and CompanyA, obviously, with the team. I always mentioned that, you know, this is never going to be a, you know, not a unique group, you know, what's the wording? Sorry, when we just have one partner. So it's not exclusive. It's not exclusive. There you go. You think that would be the easy word to think\n\nInterviewer  5:26  \n\nabout? Yeah,\n\nSpeaker 1  5:28  \n\nyes, exactly. So. But you know, we because we have to challenge ourselves and not get too boy biased with, you know, the partners that get to know us pretty well as well. So, so, so we did. We've we started with K, who was in Zurich, and she subsequently left, and she introduced us, then middle of last year, to AC. So AC's been our main, main contact on the account. So by step back again, I suppose you know, we've had much more activity in the last year to 18 months than the previous three, four years. And really have appreciated, you know, I think we got, we got to know the CompanyA team quick. Well, it's been, it's worked very well. If I start with, you know, the whole tender process, negotiating presentations. I think the the approach that CompanyA take, you know, there's and that's always my role as well, to make sure that they get a sense of us before they pitch to the CEO who's been making a decision on most of these things. So, you know, I've really enjoyed that kind of partnership, and that it felt very natural like the right questions, you know, appropriately commercial, but not too commercial, appropriately big picture, but also focusing in on, you know, what really makes partner re Tid so very much. You know, what I appreciate by CompanyA is like there's no such thing as one size fits all, and I you mentioned customer centric at the start, you know, I certainly experienced that and felt that and would recommend them highly based on, based on that. I think that's what we really like about the engagements we've done. So, you know, I think that that that part of the process, that early stages, in terms of, like the pitch, the you know, kind of the initial assessment of the needs, the conversations, what we value very much is thoughtful questions. And so, you know, there's been a lot of preparation in advance. But what's really kind of swung the the success of the CompanyA pitches, which, as I said, are the most of them have really been that, like taking the time to ask thoughtful questions, really quiz our executives, mainly our CEO, on his actual needs, his preferences, how he likes things. So you know that that dialog has been, has worked very, very well. And I think has really been a USP in, you know, sometimes other firms can really focus on this is what you're getting, rather than what do you want? Yes, what do you want? What do you need? And and asking really great, great questions to tease that out and not been afraid to challenge which I, you know, which, which I love. So that works very well for us. We're, you know, we're a bit of a hands on culture. We say that, you know, very execution focused. So more about actions versus principles, more about outcomes versus concepts. You know, you know, there's a time and a place for everything. Sometimes I say here, you know, obviously these, while this has been recorded, I know the notes will be confidential, but sometimes the challenge I have back to the team is, you know, when your strengths become your weaknesses, and I think sometimes we've become so execution focused, it's become nearly a bit of a oh, maybe we've over tipped. So, you know, we find that balance exactly so. So I think, you know, from that perspective, the the approach of CompanyA works well. AC's been a great partner. AC has been an excellent partner for us. And you know, from all aspects in terms of helping us through the negotiations, our guys know how to negotiate hard, you know? I suppose you know most CEOs and most presidents are in the business of the front facing anyway, so I have underwriters around me. I was like, You're the negotiators. They negotiate hard. Their expectations are high, but that's always felt very respectful. You know, really about the relationship and not and, you know, obviously, you know, the CompanyA have terms and conditions they absolutely have to meet, but it's been, I've really appreciated the flexibility, whether it's, you know, different aspects of the retainer versus the overall fee, or how we structure the overall fee. You know, there's always some nuance and some complication with everyone, and that flexibility and that ability to really think about how we can meet the partnering needs us has very much been appreciated. So I wanted to mention that because we, you know, obviously, when we've had volume as well, we're expecting, you know, better terms every time, but that's worked well. AC's, you know, our main, our main contact, as I said, you know, has been AC, and has been the lead his his approach, again, works very well with us, very open, very honest, brings a lot of value to the table, and is not afraid to, you know, very thoughtful in his questions, insightful, takes this time to think about it, which matches the CEO. They're quite of similar styles in their communications. So it's funny to sit back and watch them, you know. But they complement each other very well, just very thoughtful, very but not afraid to put the hard stuff on the table, you know, you're going to have to flex on this. You're not going to get that. That's going to be a challenge. This is what I'm hearing, and that's what we expect. You know, we're, we're the type of company that appreciate the difficult but the straightforward conversation. So, you know, it's not always just about saying yes to the CEO. It's like, hold on. You know, these are the things you're really gonna this is what I'm worried about for you. Yeah, yeah. So I've seen, you know,\n\nInterviewer  11:25  \n\nlike, communication, I suppose, from day one, you know, did, did he in terms of asking questions? Was it, did he meet your communication needs in terms of, you know, regular updates, keeping you in the loop, kind of even just communicating on the channels that suit you, and being available\n\nSpeaker 1  11:45  \n\nthe vast majority of things, absolutely, I think we've won ongoing at the moment in relation to our claims role that's open in the US. So it's more it's kind of US Europe and coordination, and we have very different stakeholders on that one. So I think that one's probably in a small bit of a challenge. But in general, I would say that works. That works well, like I haven't had an issue with the ones I'm leading. I'm not leading the claims one, but I know there's been some, you know, trying to get meetings in the diary with CFF, or interviews with the diary, in the diary with the CFF last minute, which is never going to work for her, you know. So there's just, you know, there's one or two kind of things like that after popping up, but nothing that's insurmountable. We have a small delay, and I don't know if it's your side or my side, but hopefully I'm coming through.\n\nInterviewer  12:39  \n\nOkay, I can hear you clearly. So apologies. Is my side.\n\nSpeaker 1  12:43  \n\nNow, you never know. We had a bridge burned down recently near the office, and this seems to have affected the internet as well. So, yeah, so I think Jen, like, I see, I see myself having a role in that as well. Like, if it's, if I'm not the actual hiring manager, you know, I'm very open in what I expect, you know, very transparent, and what I think will meet Phillips needs as CEO, what meets John's needs as president? So I do my best to equip the team on that. And if there's any delay or we need something, it's like, you know, so we have a very open, easy. You know, the channel is easy to get the partners. You know, I think AC and I will communicate quite a lot, whether it was text or, let's just jump on a call, a teams call, you know, there's, there's an open communication from both sides there.\n\nInterviewer  13:34  \n\nSo nice. And do you find in terms of stakeholder management, you know, they respect the lines and authority and kind of, you know, the group in terms of the structure. So if you're the main point of contact, is that always the case?\n\nSpeaker 1  13:50  \n\nYeah, and I think we would agree that up front, you know, for so right now, we actually have a search ongoing that's to replace, just completely confidential. So obviously, you know, that one, I'm not the main point of contact for because we we agreed up front. Doesn't make sense. You know, I sat down with Philip and was like, how involved do you want me to be in this? You know, obviously I can come in and support later, but, you know, probably shouldn't drive it. You should drive it. Maybe some conversations. I shouldn't be there because, you know, you might really want to be really explicit about this is what's getting met right now. This is what I'd like from a future candidate. And I said, like, I don't want you to feel like there's any barriers to that conversation, like, this is, this is my decision, but I also know that there's things that Philip and I don't align on so and I think, you know that's a different conversation, but it's also making sure that you know, the person that we're working with challenges that as well, and doesn't just lean into a bias of any any executive that they're hiring for. So I think, I think that's that's been quite good in terms of, you know, well, I filled these three positions for Philip now, and, you know, I'd be concerned about this, or it's clear he's looking for this. And, you know, we would raise those things up respectfully as well, you know, so we, I think,\n\nInterviewer  15:09  \n\nyeah, in terms of things like, I suppose, define, you know, you said that they seem really good at the beginning of asking questions, and does that then translate into kind of, really helping define the job spec, and are they then using things like their assessments or pay benchmarks to really bring that to life? Are they, you know, is it? Are they tapping into the other resources that CompanyA has?\n\nSpeaker 1  15:38  \n\nYes, we've done a number of the leader profiles. And, you know, certainly, obviously, when you're getting closer to the end and doing it where we felt was necessary, we haven't done it across the board for but we've done it maybe for most, I would say maybe 75% versus 100% of the candidates. And certainly having conversations around benchmark. I've, I've and, to be fair, I've used their data for other things as well. So there's a very, you know, I would say there's a real partnership there. I'm like, I actually need something in this area. Have you got something that would help so, so, yeah, like, while it's not every day, certainly there's been a huge there's been, there's been a sharing of all the resources that are available to us, I think one of the, one of the, I think when I look at the various searches, I think, you know,\n\nSpeaker 1  16:41  \n\nand I don't know whether it's and I'm probably not in the room enough, and I don't know whether it's a culture thing or I would say, you know, there's probably a little bit more listening needed on the US side than the European side. Okay, you know, I think they're, they're all very, very responsive, but, you know, I would say we just need to keep an eye on making sure that it's not that the that you know, it's really about what do you need, what do you want? I think there's sometimes a tendency at one role in particular, in mind, it's one we're working on at the moment, and it wasn't a successful search for us with another agent. So we brought this to CompanyA, so it's our second time going at it. So I think there's also some sensitivity on the CompanyA side. It's like, well, why doesn't it go well with the other agency, and we want to do a really great job, and sometimes to prove that you want to really do great job, you can over talk. I think there's just that opportunity to really, really just listen and use what's worked well in the others to focus in on that, because I think the danger sometimes, of you know, talking about good candidates is that there can be a perception of selling your guys, you know, or your your your your candidates. And obviously there's that's part of the process, but it's getting that balance right, you know. So I would say, I would say it's probably something for us to keep an eye on when we're, you know, thinking about the more the cultural approach, and because while we're, we're a real global company, sometimes I think it's that if I think about how we sell ourselves, we undersell and over deliver. Most of the time, it's always been our DNA. I don't think it always serves us well, but that's just the DNA for us, obviously, you know, a company that's on the other side of that, I think then if we feel that somebody's overselling, it's nearly like, doesn't feel compromised too hard, yeah, yeah, yeah. So we just need to, you know, that's just about making sure we get the right fit. And it's worked really well on the vast majority of the searches. And just need to keep an eye when we're working more closely with the US team, yeah.\n\nInterviewer  18:49  \n\nAnd in terms of what you expect from a search partner, you know, you say you work with kind of the space all of the top three like, what do you really look for that or as or, or would like to see more of, even as in value add,\n\nSpeaker 1  19:07  \n\nI think the focus on our needs, you know, I think it's really about like the tailorized services. I think that's why CompanyA has won the tenders over over the others. It's the, you know, the thoughtful questions, the alignment, you know, really spending time on the alignment. So I think that, you know, that's, that's really like questions, you're just the route to get there. So I would say, you know, appreciation. Want would, and would want to see more of, or continued, you know, focus on alignment. You know, intentional alignment. Partner, partnering, challenging, you know, making sure that, you know, but just put a bit authentic in the room. I think the team do that really well, but been like, if they hear something in the moment that sounds like, okay, you know, there's an opportunity to sense, check this, or Korn, ferry or challenge that, you know, maybe a bias and assumption that we that that's been done. So, you know, there should always be a certain amount of tension in this relationship, in certain stages, and it's making sure that we, you know, focus in and then hold that tension. What about? Yeah, just that transparency, you know,\n\nInterviewer  20:24  \n\ndo you, do you expect, I mean, moving forward, you know, if you look at the kind of rate of change with kind of technology in this space, do you expect them to come with, like, be tech enabled in terms of their approach? Is that some is it more of a\n\nSpeaker 1  20:39  \n\npeople to people so more of a people like, you know, I we're relatively small ourselves, like 1300 people. Is not a big company. Are, you know, if I even think about how the CEO operates, he operates on it. He's very in touch with people. He expects us to be very in touch with me. Now, when I say very in touch with people like that, I think we still have a challenge with same challenge of engagement that everybody got every company has, and the same challenge of not every company has, but the challenge of, then, you know, the multi generations in the workforce and making sure that we get, you know, the, you know, even when we think about things like AI, like, we're never going To be the market maker, the trendsetter there. You know, sometimes what I say about partnering is that we start late and we finish strong. So you know, we're not going to be a Swiss Re or a Munich Re in this market or his work. So we'll embrace the tools, like, for example, the Leadership Profiles. But you know, you won't razzle dazzle our guys with that kind of stuff. It's more, you know, and these pro it's more like, forget about profiles. Like, I even see that challenge with scope. I I have, you know, it's, it's all about, like, programs and ecosystems and all that straight over their heads, you know, like, it's all about the tangible, the personal, the so we're in a real rate, we're still in a relationship business. And it's, it's a relational approach to how we do business here as well. So I think, from that perspective, you know, that's going to always trump the, the kind of analytics and the data and all of that, you know, yeah, nice.\n\nInterviewer  22:18  \n\nIn terms of, I suppose, CompanyA's broader offer. You know, around consultancy, do you use them for anything other than search?\n\nSpeaker 1  22:26  \n\nWe we have done in the past, so we've on our L and D side, and there's, I can't even remember what the name of the module is, but we do, we do use something on the learning and development side. That's all we we have other providers for benchmarking and things like that. That's not CompanyA. And we don't use a lot of consultants. Okay, I consult like, you know, that's that. That's what I mean when I in terms of, like, Ferry, hard here to get, like, you know, it's all about just getting it done, rather than, you know, exactly, exactly so, so for somebody like me, I'm caught in that tension, but it's just, it's just a, you know, it's, I think there's a time and a space for that, but this is The reality of where we are right now.\n\nInterviewer  23:22  \n\nYeah, yeah, makes sense. And then in terms of, sorry, skipping around, going back to search, have you always been satisfied with the quality and quantity of candidates that have come through to you?\n\nSpeaker 1  23:36  \n\nLook, I think we've had some challenging searches. I think you know, we got there in the end with one, but we've had people like, we've had two that have well done. We've had one that's pulled out, you know, which is always a bit of a challenge that we make an offer. And then, and I know, you know, AC was really frustrated with with the guy, I think, as was, you know, Philip. It was a real niche role. So, you know, I think we got there, we were happy. And the person that we finding, her just started yesterday. So I think, you know, in the end, it worked out well. So I would say, yes, I would say, right now, the one that's ongoing is a bit tricky. So we'll see. We have a meeting today.\n\nSpeaker 1  24:29  \n\nThere's always a bit of noise during the process, like, if I, if I, if I, think about where, how we start, then in the middle, the bit of frustration. And then we, you know, again, finish? Well, I couldn't say there's 100% satisfaction at all stages, but we get there. Okay, you have to take some ownership on our side that you know, very hard to make my CEO happy.\n\nInterviewer  24:55  \n\nSo is there? I mean, if the one or two things that they could do better, what would it be?\n\nSpeaker 1  25:01  \n\nI would say, Listen, like, if I look at where I'm hearing a little bit of noise, it is where the US are more involved. And rather than challenge them, I would say, Listen again. And rather than challenge back on, why? Like, it's that appropriate level of challenge. This is why it's the right slate. This is why it's the and for whatever reason there's there's probably just an opportunity to work on communication when there's multiple teams around the table. Maybe I could frame it that way.\n\nInterviewer  25:36  \n\nYeah, that makes sense. And last question in terms of, once they've placed a candidate, how much support or continued engagement do they have with that candidate, then to make sure that they're succeeding in their role. And is this something that you would expect?\n\nSpeaker 1  25:56  \n\nSo, as I said, the person that's come the, you know, the first one that's actually come in, I think, is the person who started yesterday. If I think about, you know, yeah, I said, so we've, we've personally started yesterday. We have a person who starts to start next month. We have my one ongoing. We have the two in the US ongoing. So that's five, but we actually, nobody's in long enough to really assess that, you know, I think the personal touch has been there even in the the, you know, the kind of the pre onboarding phase and the onboarding phase. So I'll keep an eye on that and see if it continues. But I know there's been great support and good support in the handover. You know, in terms of, okay, offer is signed, or even offer is made, what do you need to do? What they do? Will you take this on me by hat? You know, there's been, there's been good kind of hands on cooperation there. So I've nothing like, there's nothing really, from my side that has gone that I think could be done better in the actual logistical side of things, you know, okay, and then big fans of AC, as you can probably get like and he, he matches well with Philip as our CEO. And I told him that myself. So, you know, even for, like, say, the search that they're doing for my replacement, I'd like, you know, make sure you're the leading that one, like that. You're really hands on, like, the one in the US, he can't do out and about. He's not, you know, it's a US specific role, whereas a global one that I think, you know, his his approach fits our culture.\n\nInterviewer  27:37  \n\nWell, yeah, great. Okay, I think that's it. I mean, anything else that you think would be useful to share back as a specific or more broadly?\n\nSpeaker 1  27:49  \n\nNo, I just think with all of these things continue to, you know, kind of be reactive to the needs as they surface. And I think again, the communication like that, kind of stakeholder engagement, stakeholder management, including, you know, tricky when you have multiple, like, we've had, you know, as I said, we've had, like, some tricky ones where the person leading the engagement is not going to be the hiring manager in the end, and then the hiring, you know. So, you know, some of them have been, but I really do think about just managing the logistics is, you know, is always key in this. Great.\n\nInterviewer  28:21  \n\nOkay, thank you. Where are you? Where are you off to\n\nSpeaker 1  28:25  \n\nI'm I'm not going anywhere. Actually, I had, I suppose, when I came, when I accepted to do this role, I had always kind of said it would be a three and a half, four year gig, because I'd come back. So you know, while I said to you, I've been here 20 years. I left once in 2021 and agreed to come back because we had a CEO, a new CEO, and he was in the later stage of his career. So I came back. He said, come back and work for me for a few years. I'm like, okay, because we just got on really well. Like I had, I was on the way out, but I had the longest Notetaker in history. And then I was like, okay, yeah, like, because I was thinking about what I wanted to kind of go into the consulting directorships path. I'm a trained coach, and I just miss coaching. And so when he asked me to come back, I was like, gives me exposure to group boards that will help all of this. Of course. Then when my predecessor, and she used to be my boss. When she resigned, they offered me the role, and I was like, I can't say no now, you know, but I know, like being operationally and strategically responsible for HR is not my passion. Yeah, yeah. I'm happy to do it, and I've done it for four years, and I want to set Philip up for success with a future candidate. But I turned 50 last year, and I'm just big believer in following your like, I'm at the privileged position of, I can, I can take some risk. So I'm going to take, I'm hoping to finish up, well, depends when you get somebody, but I'm hoping to finish up kind of March, April, May, next year, and just take some time to really, like, kind of go, Okay, let's go back to the coaching. Let's go back to, you know, what you really, really wanted to do four years ago, and see then, give myself some time to think about it. But you know, as I said to Philip, I said, I don't expect to walk down the road and be in another CFF position and another reinsurer. So it's not, I'm not looking for that.\n\nInterviewer  30:18  \n\nYeah. Oh, well, well, good luck.\n\nSpeaker 1  30:20  \n\nThank you. Thanks very much"
}