{
  "id": "t-008",
  "sourceFile": "T3_NPS10_NA_ES_HOUSE_SEP25.pdf",
  "client": "Tony Seupaul",
  "interviewDate": "2025-09-18",
  "project": "Exec Search",
  "score": 10,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Interviewer 0:00",
      "text": "I am an external consultant. I've been working with Korn Ferry for the last five or six years. So so know them very well. So they've asked us to kind of lead these as a an agnostic, someone who can sit in the middle and just make sure that, hopefully, you can be as truthful with us as possible. Their commitment is to kind of continuously improve on their service with their clients. So the more honest you can be, the better we can kind of go back and make some adjustments where needed a couple of bits of admin before I start. Are you comfortable with me recording this? It's purely for my own note taking, and then I delete it afterwards."
    },
    {
      "speaker": "Speaker 1 0:50",
      "text": "Yeah, no, I'm fine with that. Okay, thank you. Just do that."
    },
    {
      "speaker": "Interviewer 1:00",
      "text": "Okay, so it shouldn't. It shouldn't take the whole half an hour, but it would be great if we could just start by giving some context to the engagement and the relationship that you've got with Korn Ferry. So if you could start Tony by just explaining to me your job role within the company that you work for and the project that you answered your NPS score on? Yeah."
    },
    {
      "speaker": "Speaker 1 1:31",
      "text": "So I'm an executive vice president and the chief physician executive for Carilion Clinic. This is a system level role, and I report directly to the CEO as part of the executive leadership team for the health system. And I'm not sure which engagement I responded to, because we I've been engaged with Korn Ferry now for five executive searches in this year, and we're about to launch a sixth search for those. Five of the six are for department chairs, and the sixth, which we are close to closing, is for Cardiovascular Institute Director position."
    },
    {
      "speaker": "Interviewer 2:12",
      "text": "Okay, so, I mean, it doesn't need to be specific. Then, Tony, let's, let's look at a kind of your experience as a whole. And so, yeah, I suppose the first thing is, is, how did you come to work with Korn Ferry in the first place? How did you select to work with them? And why?"
    },
    {
      "speaker": "Speaker 1 2:29",
      "text": "Yeah, so I couple a couple of ways. When I was at my prior organization, Korn Ferry led a search for a position at Yale that I was a finalist for I developed a relationship with John Denson, and, you know, we became kind of professionally connected as friends. He thought that there was, there'd be some place for me outside of where I was. And interestingly enough, when I applied for the position at Carilion Clinic, it happened to be Korn Ferry. John was not the executive working on that search, but they already had a lot of information on me, obviously from some other searches, and so that was helpful. And then so so I've had a couple of different touch points, and I would say a longer term relationship with John, with who's been with Korn Ferry for a very long time."
    },
    {
      "speaker": "Interviewer 3:33",
      "text": "Okay, great. So, and you've, obviously, you said you've used them several times across the year. So in terms of your overall experience, how, how are you finding the partnership?"
    },
    {
      "speaker": "Speaker 1 3:44",
      "text": "Oh, it's been excellent. And I wouldn't, I wouldn't stick with Korn Ferry and this team if we did not have success. And we've had consistent success, even in some pretty difficult searches, including our chair family community medicine and this current search for the Cardiovascular Institute Director, but, but we've done exceptionally well. -- 1 of 5 --"
    },
    {
      "speaker": "Interviewer 4:06",
      "text": "And what makes it exceptional? What, what the kind of key factors that you really value, that you know that that makes"
    },
    {
      "speaker": "Speaker 1 4:16",
      "text": "So the bottom line is that they've been able to source candidates, and that, I believe, is predicated on a couple of things, you know, their attention to detail, their presence in the market. I think Korn Ferry does have a very strong reputation as one of the elite search firms, and so that provides some gravity. But then perhaps as importantly, or more importantly, they know me, and they know curling clinic exceptionally well, and so when they go to market, their filter is is such that it it provides a level of refinement and focus for the candidates that they present to me in our search committees to review to advance. So that creates efficiency, alignment, and so far, a lot of success."
    },
    {
      "speaker": "Interviewer 5:09",
      "text": "And do they do? They help shape the brief with you in terms of, you know, the type of person that you're after, are you or is that something that you do before you engage them?"
    },
    {
      "speaker": "Speaker 1 5:18",
      "text": "They do. We have it's been a little bit of a spectrum in terms of how much they have supported the prospectus that we've used, and that's because for some of our searches, we already had a prospectus that needed to be updated, and so that was easy for us to dust off, make some changes. We have a really strong marketing communication team. Give to Korn Ferry. They review it, provide suggestions, etc, and then together, we refine and finalize that document that is shared with with candidates."
    },
    {
      "speaker": "Interviewer 5:58",
      "text": "And so digging into, I suppose, the end to end process so it feels like you're on, you know, you're aligned at the from the very beginning on the brief, in terms of, suppose, regular communications, you know, and updates, is that something that you've, you've always felt, has worked well, or you'd like to see more of,"
    },
    {
      "speaker": "Speaker 1 6:16",
      "text": "no, I think, I think, I think it's, it works really well. And part of it is that we know, like I you know, Jenna, Abby, John. I mean, we know each other really well and and anytime, like, they will text me if there's a change or something I need to know. We'll communicate at any time, any day. And when I reach out to them, they're very responsive. In fact, I emailed John Denson and the team this morning and got a response back shortly thereafter for some feedback on a finalist interview that we completed this Tuesday evening. And yeah, they're quick. And as an example, what I asked for was an analysis on feedback from this visit and hoping that we could get it together and to me and the team by this Friday. And they thought that they could, and likely, I fully expect they will, so that we'll have, you know, a rapid cycle on an assessment of this candidate, which for me, is critical, because timing in these searches is very important for me, for the candidate, I insist on very efficient searches, so that there's very little downtime for candidates and for our teams, and Korn Ferry's been able to deliver on"
    },
    {
      "speaker": "Interviewer 7:37",
      "text": "that right and The quality of candidates, and the number of candidates has always met your expectations."
    },
    {
      "speaker": "Speaker 1 7:45",
      "text": "Yes, it's been superb, and I think it you know, that has resulted in us hiring tremendous talent to the organization. In my opinion, we've upgraded our talent pool with these searches, which is what my expectation was,"
    },
    {
      "speaker": "Interviewer 8:00",
      "text": "amazing. And then in terms of, suppose, again, going back to that end to end, when you've come to do candidate selection, have you taken the lead on things like contracts and compensation, or is that something that you've used them to do?"
    },
    {
      "speaker": "Speaker 1 8:15",
      "text": "-- 2 of 5 -- So what I've used them for is to help us understand where the candidates are from a compensation standpoint and what their expectations are. And then my team gets to work on the contract and the analysis for fair market value. We use Sullivan Cotter and my finance team along with my HR leaders and legal team, they make pretty quick work of that. And because at the end of the day, for these for this level of compensation, for the leaders that we have, is reviewed by our board and our compensation committee. And so while Korn Ferry can help us, but when it comes to the refinement of those numbers, that's something that we need. We have to manage here ourselves. Yeah, and do you,"
    },
    {
      "speaker": "Interviewer 9:09",
      "text": "does the Korn Ferry team bring in their own benchmarks, you know, their pay data to this? Or is that something that it's just kind of expected, or do they approach it in a different way?"
    },
    {
      "speaker": "Speaker 1 9:23",
      "text": "You know, I they have not, but I haven't asked either, simply because we we have these data at our fingertips. It's pretty easy, but as I mentioned at the end of the day, the fair market value has to be done locally from a board perspective, so I you know if Korn Ferry had that information, it could help inform us as a data point, but it would not be the benchmark that we would use in our final analysis."
    },
    {
      "speaker": "Interviewer 9:53",
      "text": "Okay, that's really helpful. Um, is there anything you know in any of the engagements that you've had over the last year that that hasn't met your expectations or could be improved upon."
    },
    {
      "speaker": "Speaker 1 10:07",
      "text": "Not, not, you know, we've we developed a pretty good rhythm. You know, they, as I mentioned, they really, they really know us well. We know them well. And, you know, it's interesting. We did four chair searches. And then when we were going to move towards the CBI director, and we're going to do a search for the chair of orthopedics, I contemplated, well, maybe I changed direction, you know, kind of mix things up a little bit. And the Dean of the School of Medicine and I worked pretty closely together on these searches and and we both pretty quickly agreed, like, if it ain't broke, why fix it? And you know, why spin up a different firm that wouldn't have the institutional memory of what we've accomplished recently? And I really think that each search has built on the prior one to help us become better, more efficient. I think they've got, they've improved too, as they learn more about us and, you know, and I think some of the conversations I have with with some of the Korn Ferry teams, you know, we've developed a degree of psychological safety and understanding that they can say anything, I can say anything. We built up enough trust to be completely honest with each other, which I think you know, is critically important in these searches,"
    },
    {
      "speaker": "Interviewer 11:25",
      "text": "absolutely once the candidates in role do, do you use Korn Ferry for kind of, I suppose, any support you know, in terms of getting them fully engaged, up to Speed, or kind of extending their peer to peer network, or, I know, obviously beyond kind of search, Korn Ferry has a whole organization, consultancy practice, is that something that you've used them for in the past, or would consider in the future?"
    },
    {
      "speaker": "Speaker 1 11:59",
      "text": "Well, we have not, and I don't think we'll consider it or need it in the future. We have a fairly robust onboarding program for our chairs to include. They all get executive coaching, including coaching for their dyad partner, and then I start meeting with them monthly before they arrive, and then monthly after they arrive for a period of time as part of that, since they report to me and and, of course, we have a number of other touch points during the month from an executive leadership standpoint. So we were pretty hands on with our new leaders when they come on board. And my and so I so far, you know, we've had some we've had smooth transitions for the leaders that we've brought on board."
    },
    {
      "speaker": "Interviewer 12:48",
      "text": "Okay, brilliant. And I suppose, in terms of your future needs, you know, how you see search, kind of, you know, if we're focusing purely in on search and your relationship with Korn Ferry and in that area, and Unknown Speaker 13:08 -- 3 of 5 -- thinking about"
    },
    {
      "speaker": "Interviewer 13:10",
      "text": "how both the workforce is changing, but also kind of with kind of AI and technology, is there anything you would expect to see from Korn Ferry moving forward to, I suppose, engage or embrace that more. Is it important to you, or is it very much around a kind of people? First relationship"
    },
    {
      "speaker": "Speaker 1 13:29",
      "text": "that's a that's a good one, you know? I for me, you know, and I love recruiting. I think the human touch the relationship is the key ingredient to a successful recruitment, whether or not AI can enhance some of the logistical things for Korn Ferry and the way their methodology so if it would enable them to expand their scope and or penetration in various markets or various specialties. Perhaps that's something that that would help but, but as it pertains to the interaction between me and my team and the Korn Ferry team, I don't, I mean, at least as of right now, I don't think AI or tech innovation would enhance that in any meaningful way, at least not as far as I can see. But then again, you know, who knows, five years from now, it may very well be, you know, some some novel technologies that enhance our ability to assess and on board, et cetera, but just haven't seen it yet. Haven't heard much about it. And in my position, we're always talking about AI and technologies that can help us be a stronger, more nimble health system."
    },
    {
      "speaker": "Interviewer 14:55",
      "text": "Do you use any of the I suppose the adjacent solutions around Korn Ferry when it comes to things like assessment of internally or within candidates. And you know the psychometric assessments as well, is that something that you have used in the past?"
    },
    {
      "speaker": "Speaker 1 15:14",
      "text": "No, but I know Korn Ferry, so I think for every one of our cheer searches, they will perform a leadership assessment. And I can't it's not a Meyer Briggs. It's one of the kind of personality leader assessments we do that here, as well as part of our executive coaching and assessment. As a matter of fact, I remember when I was a candidate, I, you know, filled out the leadership assessment that Korn Ferry had. And then when I came to curling clinic, I also did theirs, which is a prism assessment, which is a very comprehensive multimodal leadership and personality assessment that pulls together Myers, Brigg, disc and a bunch of others into a very large assessment. So, yeah, I you know, so, so we perform some redundancy there. I think Korn Ferry tool is good. It's helpful. And again, it's just one additional data point for us as we think through how we how we assess our candidates. And so far, you know, we haven't had a discordant assessment where the that leadership profile tells us something that was surprising or shocking about what we thought about candidates."
    },
    {
      "speaker": "Interviewer 16:35",
      "text": "Okay, great. I mean, I think that's it from my side. Tony, is there anything else you'd like to add to kind of you know that would be helpful. Please do share, but that's all the questions from me."
    },
    {
      "speaker": "Speaker 1 16:48",
      "text": "No, I think good, good questions. I think we covered the bases in terms of your relationship and engagement that we've had with Korn Ferry. And you know, I expect that we'll have future engagements, I hope not too soon, because it feels like all I've been doing this entire year moving into the next year are executive searches. I need a break. Everyone needs a break. But part of it is that our organization, they were kind of waiting for me to arrive to launch a couple searches, so I was already going to get involved in two or three searches to start. And then, as you know, things change over the year and a half. There are additional needs and but you know, hopefully the volume and cadence will be reduced here in the next fiscal year."
    },
    {
      "speaker": "Interviewer 17:40",
      "text": "It's good if they're new hires, but not if they're if not if you're constantly having to replace So, yeah, okay, brilliant. Well, look, travel safely. Thanks again for your time. Really appreciate it and and your candor. And nice to meet you. Unknown Speaker 17:56 Yeah, great to meet you. Interviewer, take care. -- 4 of 5 --"
    },
    {
      "speaker": "Interviewer 17:57",
      "text": "Thank you. Tony, bye, bye. Transcribed by https://otter.ai -- 5 of 5 --"
    }
  ],
  "rawText": "Interviewer 0:00: I am an external consultant. I've been working with Korn Ferry for the last five or six years. So so know them very well. So they've asked us to kind of lead these as a an agnostic, someone who can sit in the middle and just make sure that, hopefully, you can be as truthful with us as possible. Their commitment is to kind of continuously improve on their service with their clients. So the more honest you can be, the better we can kind of go back and make some adjustments where needed a couple of bits of admin before I start. Are you comfortable with me recording this? It's purely for my own note taking, and then I delete it afterwards.\n\nSpeaker 1 0:50: Yeah, no, I'm fine with that. Okay, thank you. Just do that.\n\nInterviewer 1:00: Okay, so it shouldn't. It shouldn't take the whole half an hour, but it would be great if we could just start by giving some context to the engagement and the relationship that you've got with Korn Ferry. So if you could start Tony by just explaining to me your job role within the company that you work for and the project that you answered your NPS score on? Yeah.\n\nSpeaker 1 1:31: So I'm an executive vice president and the chief physician executive for Carilion Clinic. This is a system level role, and I report directly to the CEO as part of the executive leadership team for the health system. And I'm not sure which engagement I responded to, because we I've been engaged with Korn Ferry now for five executive searches in this year, and we're about to launch a sixth search for those. Five of the six are for department chairs, and the sixth, which we are close to closing, is for Cardiovascular Institute Director position.\n\nInterviewer 2:12: Okay, so, I mean, it doesn't need to be specific. Then, Tony, let's, let's look at a kind of your experience as a whole. And so, yeah, I suppose the first thing is, is, how did you come to work with Korn Ferry in the first place? How did you select to work with them? And why?\n\nSpeaker 1 2:29: Yeah, so I couple a couple of ways. When I was at my prior organization, Korn Ferry led a search for a position at Yale that I was a finalist for I developed a relationship with John Denson, and, you know, we became kind of professionally connected as friends. He thought that there was, there'd be some place for me outside of where I was. And interestingly enough, when I applied for the position at Carilion Clinic, it happened to be Korn Ferry. John was not the executive working on that search, but they already had a lot of information on me, obviously from some other searches, and so that was helpful. And then so so I've had a couple of different touch points, and I would say a longer term relationship with John, with who's been with Korn Ferry for a very long time.\n\nInterviewer 3:33: Okay, great. So, and you've, obviously, you said you've used them several times across the year. So in terms of your overall experience, how, how are you finding the partnership?\n\nSpeaker 1 3:44: Oh, it's been excellent. And I wouldn't, I wouldn't stick with Korn Ferry and this team if we did not have success. And we've had consistent success, even in some pretty difficult searches, including our chair family community medicine and this current search for the Cardiovascular Institute Director, but, but we've done exceptionally well. -- 1 of 5 --\n\nInterviewer 4:06: And what makes it exceptional? What, what the kind of key factors that you really value, that you know that that makes\n\nSpeaker 1 4:16: So the bottom line is that they've been able to source candidates, and that, I believe, is predicated on a couple of things, you know, their attention to detail, their presence in the market. I think Korn Ferry does have a very strong reputation as one of the elite search firms, and so that provides some gravity. But then perhaps as importantly, or more importantly, they know me, and they know curling clinic exceptionally well, and so when they go to market, their filter is is such that it it provides a level of refinement and focus for the candidates that they present to me in our search committees to review to advance. So that creates efficiency, alignment, and so far, a lot of success.\n\nInterviewer 5:09: And do they do? They help shape the brief with you in terms of, you know, the type of person that you're after, are you or is that something that you do before you engage them?\n\nSpeaker 1 5:18: They do. We have it's been a little bit of a spectrum in terms of how much they have supported the prospectus that we've used, and that's because for some of our searches, we already had a prospectus that needed to be updated, and so that was easy for us to dust off, make some changes. We have a really strong marketing communication team. Give to Korn Ferry. They review it, provide suggestions, etc, and then together, we refine and finalize that document that is shared with with candidates.\n\nInterviewer 5:58: And so digging into, I suppose, the end to end process so it feels like you're on, you know, you're aligned at the from the very beginning on the brief, in terms of, suppose, regular communications, you know, and updates, is that something that you've, you've always felt, has worked well, or you'd like to see more of,\n\nSpeaker 1 6:16: no, I think, I think, I think it's, it works really well. And part of it is that we know, like I you know, Jenna, Abby, John. I mean, we know each other really well and and anytime, like, they will text me if there's a change or something I need to know. We'll communicate at any time, any day. And when I reach out to them, they're very responsive. In fact, I emailed John Denson and the team this morning and got a response back shortly thereafter for some feedback on a finalist interview that we completed this Tuesday evening. And yeah, they're quick. And as an example, what I asked for was an analysis on feedback from this visit and hoping that we could get it together and to me and the team by this Friday. And they thought that they could, and likely, I fully expect they will, so that we'll have, you know, a rapid cycle on an assessment of this candidate, which for me, is critical, because timing in these searches is very important for me, for the candidate, I insist on very efficient searches, so that there's very little downtime for candidates and for our teams, and Korn Ferry's been able to deliver on\n\nInterviewer 7:37: that right and The quality of candidates, and the number of candidates has always met your expectations.\n\nSpeaker 1 7:45: Yes, it's been superb, and I think it you know, that has resulted in us hiring tremendous talent to the organization. In my opinion, we've upgraded our talent pool with these searches, which is what my expectation was,\n\nInterviewer 8:00: amazing. And then in terms of, suppose, again, going back to that end to end, when you've come to do candidate selection, have you taken the lead on things like contracts and compensation, or is that something that you've used them to do?\n\nSpeaker 1 8:15: -- 2 of 5 -- So what I've used them for is to help us understand where the candidates are from a compensation standpoint and what their expectations are. And then my team gets to work on the contract and the analysis for fair market value. We use Sullivan Cotter and my finance team along with my HR leaders and legal team, they make pretty quick work of that. And because at the end of the day, for these for this level of compensation, for the leaders that we have, is reviewed by our board and our compensation committee. And so while Korn Ferry can help us, but when it comes to the refinement of those numbers, that's something that we need. We have to manage here ourselves. Yeah, and do you,\n\nInterviewer 9:09: does the Korn Ferry team bring in their own benchmarks, you know, their pay data to this? Or is that something that it's just kind of expected, or do they approach it in a different way?\n\nSpeaker 1 9:23: You know, I they have not, but I haven't asked either, simply because we we have these data at our fingertips. It's pretty easy, but as I mentioned at the end of the day, the fair market value has to be done locally from a board perspective, so I you know if Korn Ferry had that information, it could help inform us as a data point, but it would not be the benchmark that we would use in our final analysis.\n\nInterviewer 9:53: Okay, that's really helpful. Um, is there anything you know in any of the engagements that you've had over the last year that that hasn't met your expectations or could be improved upon.\n\nSpeaker 1 10:07: Not, not, you know, we've we developed a pretty good rhythm. You know, they, as I mentioned, they really, they really know us well. We know them well. And, you know, it's interesting. We did four chair searches. And then when we were going to move towards the CBI director, and we're going to do a search for the chair of orthopedics, I contemplated, well, maybe I changed direction, you know, kind of mix things up a little bit. And the Dean of the School of Medicine and I worked pretty closely together on these searches and and we both pretty quickly agreed, like, if it ain't broke, why fix it? And you know, why spin up a different firm that wouldn't have the institutional memory of what we've accomplished recently? And I really think that each search has built on the prior one to help us become better, more efficient. I think they've got, they've improved too, as they learn more about us and, you know, and I think some of the conversations I have with with some of the Korn Ferry teams, you know, we've developed a degree of psychological safety and understanding that they can say anything, I can say anything. We built up enough trust to be completely honest with each other, which I think you know, is critically important in these searches,\n\nInterviewer 11:25: absolutely once the candidates in role do, do you use Korn Ferry for kind of, I suppose, any support you know, in terms of getting them fully engaged, up to Speed, or kind of extending their peer to peer network, or, I know, obviously beyond kind of search, Korn Ferry has a whole organization, consultancy practice, is that something that you've used them for in the past, or would consider in the future?\n\nSpeaker 1 11:59: Well, we have not, and I don't think we'll consider it or need it in the future. We have a fairly robust onboarding program for our chairs to include. They all get executive coaching, including coaching for their dyad partner, and then I start meeting with them monthly before they arrive, and then monthly after they arrive for a period of time as part of that, since they report to me and and, of course, we have a number of other touch points during the month from an executive leadership standpoint. So we were pretty hands on with our new leaders when they come on board. And my and so I so far, you know, we've had some we've had smooth transitions for the leaders that we've brought on board.\n\nInterviewer 12:48: Okay, brilliant. And I suppose, in terms of your future needs, you know, how you see search, kind of, you know, if we're focusing purely in on search and your relationship with Korn Ferry and in that area, and Unknown Speaker 13:08 -- 3 of 5 -- thinking about\n\nInterviewer 13:10: how both the workforce is changing, but also kind of with kind of AI and technology, is there anything you would expect to see from Korn Ferry moving forward to, I suppose, engage or embrace that more. Is it important to you, or is it very much around a kind of people? First relationship\n\nSpeaker 1 13:29: that's a that's a good one, you know? I for me, you know, and I love recruiting. I think the human touch the relationship is the key ingredient to a successful recruitment, whether or not AI can enhance some of the logistical things for Korn Ferry and the way their methodology so if it would enable them to expand their scope and or penetration in various markets or various specialties. Perhaps that's something that that would help but, but as it pertains to the interaction between me and my team and the Korn Ferry team, I don't, I mean, at least as of right now, I don't think AI or tech innovation would enhance that in any meaningful way, at least not as far as I can see. But then again, you know, who knows, five years from now, it may very well be, you know, some some novel technologies that enhance our ability to assess and on board, et cetera, but just haven't seen it yet. Haven't heard much about it. And in my position, we're always talking about AI and technologies that can help us be a stronger, more nimble health system.\n\nInterviewer 14:55: Do you use any of the I suppose the adjacent solutions around Korn Ferry when it comes to things like assessment of internally or within candidates. And you know the psychometric assessments as well, is that something that you have used in the past?\n\nSpeaker 1 15:14: No, but I know Korn Ferry, so I think for every one of our cheer searches, they will perform a leadership assessment. And I can't it's not a Meyer Briggs. It's one of the kind of personality leader assessments we do that here, as well as part of our executive coaching and assessment. As a matter of fact, I remember when I was a candidate, I, you know, filled out the leadership assessment that Korn Ferry had. And then when I came to curling clinic, I also did theirs, which is a prism assessment, which is a very comprehensive multimodal leadership and personality assessment that pulls together Myers, Brigg, disc and a bunch of others into a very large assessment. So, yeah, I you know, so, so we perform some redundancy there. I think Korn Ferry tool is good. It's helpful. And again, it's just one additional data point for us as we think through how we how we assess our candidates. And so far, you know, we haven't had a discordant assessment where the that leadership profile tells us something that was surprising or shocking about what we thought about candidates.\n\nInterviewer 16:35: Okay, great. I mean, I think that's it from my side. Tony, is there anything else you'd like to add to kind of you know that would be helpful. Please do share, but that's all the questions from me.\n\nSpeaker 1 16:48: No, I think good, good questions. I think we covered the bases in terms of your relationship and engagement that we've had with Korn Ferry. And you know, I expect that we'll have future engagements, I hope not too soon, because it feels like all I've been doing this entire year moving into the next year are executive searches. I need a break. Everyone needs a break. But part of it is that our organization, they were kind of waiting for me to arrive to launch a couple searches, so I was already going to get involved in two or three searches to start. And then, as you know, things change over the year and a half. There are additional needs and but you know, hopefully the volume and cadence will be reduced here in the next fiscal year.\n\nInterviewer 17:40: It's good if they're new hires, but not if they're if not if you're constantly having to replace So, yeah, okay, brilliant. Well, look, travel safely. Thanks again for your time. Really appreciate it and and your candor. And nice to meet you. Unknown Speaker 17:56 Yeah, great to meet you. Interviewer, take care. -- 4 of 5 --\n\nInterviewer 17:57: Thank you. Tony, bye, bye. Transcribed by https://otter.ai -- 5 of 5 --"
}