{
  "id": "t-017",
  "sourceFile": "T12_NPS10_EMEA_PS_HOUSE_OCT25.pdf",
  "client": "Mike Arshinskiy",
  "interviewDate": "2025-10-13",
  "project": "Professional Search",
  "score": 10,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Interviewer 0:36",
      "text": "Nice to meet you. Nice to meet you. Tid, before we start, are you okay if I record this, it's for my team to help me write up notes."
    },
    {
      "speaker": "Speaker 1 0:47",
      "text": "Sure I might reserve some of the words in the end, but sure,"
    },
    {
      "speaker": "Interviewer 0:53",
      "text": "if there's any, well, I tell you what, I will finish it early, and then if, because I really want you to be able to speak freely. So let's do it that way. Is that, if that's good, brilliant."
    },
    {
      "speaker": "Speaker 1 1:03",
      "text": "I mean, all notes should be positive feedback, so I think you know should be fine, but just always cautious about this."
    },
    {
      "speaker": "Interviewer 1:12",
      "text": "Okay, brilliant. So thank you for joining I Interviewer. I head up a growth consultancy. We've been working with Korn Ferry for the last five years, so they've asked us to run these interviews so you can be as transparent and open as possible. Ultimately, you know they are make want to make sure that every engagement is as good as it can be. So by getting feedback, they can improve and take on board any incremental measures. So it'd be really good to start with, if you could explain to me your role in the organization and your current relationship or engagement with Korn. Ferry,"
    },
    {
      "speaker": "Speaker 1 1:56",
      "text": "sure. So I'm technology director at inflexion. I help our portfolio companies in areas of enterprise technology, product innovation and software engineering, and I work primarily with our portfolio companies throughout the investment life cycle, through the diligence up to the exit process. And I also help our portfolio companies to recruit and assess the technology and productile"
    },
    {
      "speaker": "Interviewer 2:25",
      "text": "right and have you worked with Korn Ferry across your portfolio?"
    },
    {
      "speaker": "Speaker 1 2:32",
      "text": "So I worked with Dan a few times before, right before he joined the Korn Ferry. And I always liked how he conducts the searches. This was probably, let me think it was, of my first, not as a firm, but my first experience with Korn Ferry. And, yeah,"
    },
    {
      "speaker": "Interviewer 2:57",
      "text": "how did you find it? Great."
    },
    {
      "speaker": "Speaker 1 3:00",
      "text": "I think Dan did a really good job, and he you know, so I was looking for the inflexion overall, right? So, yeah, it's always the in our industry, not an easy task, right? Because you're trying to balance quite a few things and at the same time, yeah, it's important for yourself. And I felt like Dan was a really good partner for for me in the journey. I could ask him, What do you think that? Is it the right thing to to do, or is it, you know, is it absolutely stupid? And then was always honest with me, and I felt like he was a partner in the session, or just, you know, as you get with some of this search firm advisors, yes, yeah. Like, you know, you want to, you want to try this, yeah, let's try this. You want to try this, let's try this. And then from down the line, you don't have an outcome. So I think, you know, he, he was really part in a search, and I felt like he also guided strategy as much as I would like to think that, you know, I'm smart enough to do it myself. I think Dan really guided the strategy of the search as well, not just execution of it. -- 1 of 5 --"
    },
    {
      "speaker": "Interviewer 4:19",
      "text": "Did. He? Did? He helped develop the job description. Did he do that? Or was that already done before you engaged him?"
    },
    {
      "speaker": "Speaker 1 4:27",
      "text": "So he prepared the brief. I have obviously prepared my side of the bargain, right? So the job description and key elements, but he put it together and adjusted a few things, and we did the review great."
    },
    {
      "speaker": "Interviewer 4:44",
      "text": "And in terms of the quantity and quality of candidates, how did you meet your expectations there?"
    },
    {
      "speaker": "Speaker 1 4:51",
      "text": "So that was fine. I knew I would, you know, I'll have to dig to find the right candidate. So we interviewed 16 in total, and in terms of the depth, I think it was exactly as we planned out, like, because we identified three areas of research, and we had, I think, decent bench for each one of them. There were couple of areas. Why 30? You know, they could have done slightly better. So one example is we mapped out all private equity firms and their value creation teams to so that, you know, we can identify fruitful hunting ground. And I felt like this came slightly later in the search than it should have been. And we did end up recruiting from that all, but it felt like, you know, could have been done slightly earlier. I think it's more of the function of junior research analyst who was on the search. Because I felt like, you know, Dan had to pull the weight. And Dean, I think, should have been done earlier in the search in terms of the quality of candidates. Think we had sort of our calibration, because we tried to consult him. Consulting was absolutely not the right area to go. And I think, you know, they pivoted. But in consulting area, felt like it was good, right? But, you know, we moved away from that strategy. And I think Dan reacted relatively fast to that, yeah. I think, all in all, like if I look at the candidates right now out of the 16, I think we had a good representation of all areas of life, and it was according to the search strategy. So good world,"
    },
    {
      "speaker": "Interviewer 6:56",
      "text": "and how do they compare to other search firms that you work with."
    },
    {
      "speaker": "Speaker 1 7:04",
      "text": "I'll be honest with you, Interviewer, I didn't feel like I was working exactly with Korn Ferry. I was working with Dan. And I know Dan, and he always delivers really well. He comes up with with original search criteria. So, yeah, can be like playing vanilla. Let's find CTO. Let's find CIO in exactly your industry. Doesn't really help. So he always like, finds, like, more creative and original approaches. Like, can we look into adjacent industry, maybe somebody who's been in and out of the industry, and move to something else? I said, He comes with quite creative approaches. I'm not sure if that's endemic of Korn Ferry. I think it's more like functional than to be honest, I didn't get to experience Korn Ferry beyond them in the search that junior research analyst that was on on that search was average at best."
    },
    {
      "speaker": "Interviewer 8:05",
      "text": "Okay? I mean, I suppose in terms of that broader Korn Ferry experience, is that something that you would like to see more of, would you expect that or because it feels like you've got a good relationship with Dan and the way he approaches the challenge that's actually more important to you."
    },
    {
      "speaker": "Speaker 1 8:24",
      "text": "So I would expect, given the size of the firm and the sheer scale, to have slightly better structured research from them. And I think this is a function of resource rather than anything else, because, you know, then, so the way that I prefer the work is I don't have to talk to candidates, so to speak, for the first time, it's usually the search partner job to talk to them, figure out a little bit their personality, what they want, so that, you know, I'm going into the discussion with a knowledge of, yeah, who is this person? Right? And I felt like, Dan spent a lot of time on this, and it's absolutely fine and right, but that meant that there was less resource doing the research, and that's why, you know, search took slightly longer. In terms of slightly longer, I don't think it was massive, but yeah, it did take like, two weeks longer than was planned, which, for searches, is not a huge deal. But again, coming back to expectation from a Korn Ferry, I would expect them to just slightly better job at one of the mill skilled -- 2 of 5 -- operations, like mapping out candidate tracking some of the benchmarking. And that was a little bit mixed the really good stuff, though, just to be very clear on contract, because we also did a psychometric assessment. How it was called, I think it's cave for CFF, for decay, for the Yes, thank you, which in itself, honestly speaking, if I received this report and just read it standalone, I wouldn't get anything like I think it's really bloated. There's a lot of inflexion, a lot of generic wording, like, I didn't get much value, but what Dan did is he kind of connected me with the individual who either designed them or runs those assessments. And that was super helpful, right? Because for the final list of candidates, he explained the profile a little bit you know, showed the things that you know was worth looking at. Like that was super helpful. And that's also to the credit of Korn Ferry, if you know, being more flexible and so saying, like, you know, choose the report, see ya right? But, yeah, I think you have some of these things. I would expect them to be doing slightly better, again, not negative, just a bit mixed."
    },
    {
      "speaker": "Interviewer 11:12",
      "text": "Would you use them for anything other than search? It's like, what? Well, I suppose more assessments at scale or benchmarking or org design."
    },
    {
      "speaker": "Speaker 1 11:27",
      "text": "So look, this is not exactly my area, so I can speak to org design other type of searches. I think, yeah, in our organization, that's Fred and amee who are doing this. I think they're broadly happy with this. But what I can speak to, apart from research, is, for example, assessments, right? I had experience for our preferred companies with assessments of Korn Ferry, and we have decided Oid, I have decided in my area never to use them again. It was unprofessional, took a long time, and insights that were delivered were lacking at best. So for me, you know, there are few things in those assessments. So one thing is, of course, we're looking for some red flags, right? So you know, if the candidate has done something horrible in the past. We don't want to work with individuals, but also we're trying to understand what kind of person is it, right? So that we can better fit the puzzle into the overall team management structure. Help the peers. So for example, in my case, CFF and CFF report into CEO. Helps you understand Who are you working with there, right? And I think Korn Ferry done absolutely horrible job at it. There are a couple of quality indicators. So just to be very clear, they have done the search for financing. Sorry, not search the assessment for financing. Have done assessment for CTO zero and group CFF, and there was nothing in that report of usefulness, I could see the low quality of work as well. Because for me, a the indication of quality is if they would find somebody critical or at least neutral on individual. There's always somebody in our life that we worked with who is not huge fan of ours. You cannot tell me that you Interviewer, you worked in the industry, and then there's not a single person who at least is neutral, like, that's not how life works,"
    },
    {
      "speaker": "Interviewer 13:39",
      "text": "so long as it's not negative,"
    },
    {
      "speaker": "Speaker 1 13:42",
      "text": "yeah, of course. But also, if you have somebody negative, adds extra inflexion. Why? What's the motivation? What's rubbed them wrong? You know, maybe, maybe it's just person is demand, you know, maybe he's rude, or maybe, you know, they didn't set objectives like it adds this layer of understanding nothing. And the other bit is we're trying to understand, sort of, how did the individual interact with with other people. And usually I would like to look at this same Level Up, Down, Right? And I have instructed specifically, I think, Carol on doing this, like this, yeah, so I want data on peers, data on up. She hasn't done it. She hasn't done it for the most important role. She just sent me, like, two pages of quotes saying, Oh yeah, I worked with an individual. It was great. Fine. Cool, zero additional information, right? Didn't do what was instructed, didn't answer the questions that we have discussed. So I I would not prefer to work with Carol again."
    },
    {
      "speaker": "Interviewer 14:58",
      "text": "Okay, and it is there an alternative provider that you've used that like that did meet your expectations?"
    },
    {
      "speaker": "Speaker 1 15:09",
      "text": "Yes, so we use also pebble, or I use pebble for CFF searches. They have done pretty good job, and they the candor of the assessment is really important. And they were very clear of where this individual is, like, not everybody is a nice person, right? Cannot hire just nice individuals. You need to hire people who are performers, right? They were very clear first, yeah, I'm not going to go into details -- 3 of 5 -- of who, but they were very clear that this individual and schismal language can be sometimes an a hole, right? So you need to manage carefully his communication, especially downwards. Get some coach to them, they'll be fine, right? And also, Pebble asked us about how you can measure the success of this candidate, because there's and they're absolutely right about this. There's never a right CFF or right CFF right CEO, there's the right CTO for the role in this moment in time for the organization. And they helped us to assess what are the chances that this individual will perform like, for example, in one of the cases, they mentioned that, you know, this individual doesn't really this individual wants things to get done. They don't care how right? And that's is really important in understanding the relationship with peers and who we are looking for next in the second level, like CFF, for example, in my case, right? It was, yeah, it's a useful information to have, and it's actionable, right? It's goes down to chairs. Can make sure that we build also around that, like, for example, in terms of board report. And maybe we want to see something more. We want to see somebody more in the board with Korn Ferry, it was more, yeah, blah blah, blah, blah, blah, blah, good person,"
    },
    {
      "speaker": "Interviewer 17:12",
      "text": "just not deep enough in terms of going back to suppose your experience with them for search. How did you rate their communication styles? Did it fit your needs? Was it adaptable? Did they ask you how you prefer to be engaged?"
    },
    {
      "speaker": "Speaker 1 17:29",
      "text": "Are we talking about Dan or Korn now Dan? Dan did a great job. He communicated with me really well. We had weekly calls. He had the report. You know, I think it was very clear. Because also what I expect from a search firm is to tell me when is the inflexion point in the search so we don't drag and scrape the barrel of the bucket of candidates, which is done right? Because usually you see, like, probably seven of them, and then you're done with this strategy. And he was very proactive and saying, like, Yeah, let's move to something else. Like we, for example, pivoted to Europe and had a look outside of the UK. And yeah, it was very good. And by the way, then also done the calls for reference call, not, not exactly what Carol does in terms of assessment, but a reference call with reference for finally, selected candidate was very insightful and very good, and he also did the communication with the individuals very well, because we want people to be engaged. We want them to want the job. I felt like when I was going into the call, they were on that page, right so and when, you know, as with any search, some of the individuals, we say, you know, it's not going to work out for you, he also handled it very well because the it's kind of his job to say negative news to them, and he handled it with grace. So like one of the individuals in search, I knew him through other channels, and he told me, like, Dan did a great job. He explained me why. He explained the reasons. That was a good indication for me as going in the right direction"
    },
    {
      "speaker": "Interviewer 19:22",
      "text": "in terms of the candidates they've placed. How do you know if Dan has continued to stay connected to those candidates? Do they have they offered any further support?"
    },
    {
      "speaker": "Speaker 1 19:33",
      "text": "I'm not sure I'm interested. You'll need to clarify the question."
    },
    {
      "speaker": "Interviewer 19:38",
      "text": "Well, sometimes the recruiter stays in contact and with the with the placement, so once they're involved, just, you know, to see how they're getting on, to see if there's anything else that they can support them with, if you know that that's happening,"
    },
    {
      "speaker": "Speaker 1 19:54",
      "text": "as far as I know, yes. And also, I think Dan also stayed in touch with candidates who didn't get the job."
    },
    {
      "speaker": "Interviewer 20:02",
      "text": "New moving forward. Is there anything that they can do better? I mean, specifically in search, and then I know we've talked about assessment,"
    },
    {
      "speaker": "Speaker 1 20:11",
      "text": "so I think in terms of the search, I would again prefer to see a bit more structured, a bit more well resourced research from them, where, I don't know it's their job to decide how, but I would imagine -- 4 of 5 -- them, or the person in charge of research, setting the strategy, explaining the buckets, and then there's somebody who's doing like hands on, a lot of like outreach analysis. And come back to us with numbers, figures and validation and least shortlist of people we need to talk to. So I think that the research bit should be just better, well, well, resourced. And the second that is in terms of the conf ferry standard documents, like, for example, like Korn D, it just needs to be reworked. Like it has a treasure trove of valuable information. It's incredibly hard to get out. So, you know, they need to probably work a documentation in terms of the Carol's work, the background reference. And I think they need to decide how they position themselves if they want to do the C level background referencing. That's not okay, what they're doing if they want to do like, you know, level below. Fine. That's a bit different price point they need to increase, in my opinion, depth, quality, and they need to be able to reference or however, they need to be able to assess against specific job rather than ask generic questions. So that's, that's my view, right?"
    },
    {
      "speaker": "Interviewer 22:00",
      "text": "Makes sense. I think that's pretty much it, unless there's anything else that you think would be useful to share at this stage."
    },
    {
      "speaker": "Speaker 1 22:06",
      "text": "No, no, look, I generally positive experience from my side for the search, less so for management, reference and assessment and yeah, I think Dan did a good job. Happy with the"
    },
    {
      "speaker": "Interviewer 22:21",
      "text": "outcome, brilliant. I'll feed that back. Mike, appreciate your time, especially on a Monday morning. Have a"
    },
    {
      "speaker": "Speaker 1 22:28",
      "text": "good week. Thank you. Interviewer's was a pleasure speaking to you. Have a good likewise. Thanks, Mike. Cheers. Bye. Transcribed by https://otter.ai -- 5 of 5 --"
    }
  ],
  "rawText": "Interviewer 0:36: Nice to meet you. Nice to meet you. Tid, before we start, are you okay if I record this, it's for my team to help me write up notes.\n\nSpeaker 1 0:47: Sure I might reserve some of the words in the end, but sure,\n\nInterviewer 0:53: if there's any, well, I tell you what, I will finish it early, and then if, because I really want you to be able to speak freely. So let's do it that way. Is that, if that's good, brilliant.\n\nSpeaker 1 1:03: I mean, all notes should be positive feedback, so I think you know should be fine, but just always cautious about this.\n\nInterviewer 1:12: Okay, brilliant. So thank you for joining I Interviewer. I head up a growth consultancy. We've been working with Korn Ferry for the last five years, so they've asked us to run these interviews so you can be as transparent and open as possible. Ultimately, you know they are make want to make sure that every engagement is as good as it can be. So by getting feedback, they can improve and take on board any incremental measures. So it'd be really good to start with, if you could explain to me your role in the organization and your current relationship or engagement with Korn. Ferry,\n\nSpeaker 1 1:56: sure. So I'm technology director at inflexion. I help our portfolio companies in areas of enterprise technology, product innovation and software engineering, and I work primarily with our portfolio companies throughout the investment life cycle, through the diligence up to the exit process. And I also help our portfolio companies to recruit and assess the technology and productile\n\nInterviewer 2:25: right and have you worked with Korn Ferry across your portfolio?\n\nSpeaker 1 2:32: So I worked with Dan a few times before, right before he joined the Korn Ferry. And I always liked how he conducts the searches. This was probably, let me think it was, of my first, not as a firm, but my first experience with Korn Ferry. And, yeah,\n\nInterviewer 2:57: how did you find it? Great.\n\nSpeaker 1 3:00: I think Dan did a really good job, and he you know, so I was looking for the inflexion overall, right? So, yeah, it's always the in our industry, not an easy task, right? Because you're trying to balance quite a few things and at the same time, yeah, it's important for yourself. And I felt like Dan was a really good partner for for me in the journey. I could ask him, What do you think that? Is it the right thing to to do, or is it, you know, is it absolutely stupid? And then was always honest with me, and I felt like he was a partner in the session, or just, you know, as you get with some of this search firm advisors, yes, yeah. Like, you know, you want to, you want to try this, yeah, let's try this. You want to try this, let's try this. And then from down the line, you don't have an outcome. So I think, you know, he, he was really part in a search, and I felt like he also guided strategy as much as I would like to think that, you know, I'm smart enough to do it myself. I think Dan really guided the strategy of the search as well, not just execution of it. -- 1 of 5 --\n\nInterviewer 4:19: Did. He? Did? He helped develop the job description. Did he do that? Or was that already done before you engaged him?\n\nSpeaker 1 4:27: So he prepared the brief. I have obviously prepared my side of the bargain, right? So the job description and key elements, but he put it together and adjusted a few things, and we did the review great.\n\nInterviewer 4:44: And in terms of the quantity and quality of candidates, how did you meet your expectations there?\n\nSpeaker 1 4:51: So that was fine. I knew I would, you know, I'll have to dig to find the right candidate. So we interviewed 16 in total, and in terms of the depth, I think it was exactly as we planned out, like, because we identified three areas of research, and we had, I think, decent bench for each one of them. There were couple of areas. Why 30? You know, they could have done slightly better. So one example is we mapped out all private equity firms and their value creation teams to so that, you know, we can identify fruitful hunting ground. And I felt like this came slightly later in the search than it should have been. And we did end up recruiting from that all, but it felt like, you know, could have been done slightly earlier. I think it's more of the function of junior research analyst who was on the search. Because I felt like, you know, Dan had to pull the weight. And Dean, I think, should have been done earlier in the search in terms of the quality of candidates. Think we had sort of our calibration, because we tried to consult him. Consulting was absolutely not the right area to go. And I think, you know, they pivoted. But in consulting area, felt like it was good, right? But, you know, we moved away from that strategy. And I think Dan reacted relatively fast to that, yeah. I think, all in all, like if I look at the candidates right now out of the 16, I think we had a good representation of all areas of life, and it was according to the search strategy. So good world,\n\nInterviewer 6:56: and how do they compare to other search firms that you work with.\n\nSpeaker 1 7:04: I'll be honest with you, Interviewer, I didn't feel like I was working exactly with Korn Ferry. I was working with Dan. And I know Dan, and he always delivers really well. He comes up with with original search criteria. So, yeah, can be like playing vanilla. Let's find CTO. Let's find CIO in exactly your industry. Doesn't really help. So he always like, finds, like, more creative and original approaches. Like, can we look into adjacent industry, maybe somebody who's been in and out of the industry, and move to something else? I said, He comes with quite creative approaches. I'm not sure if that's endemic of Korn Ferry. I think it's more like functional than to be honest, I didn't get to experience Korn Ferry beyond them in the search that junior research analyst that was on on that search was average at best.\n\nInterviewer 8:05: Okay? I mean, I suppose in terms of that broader Korn Ferry experience, is that something that you would like to see more of, would you expect that or because it feels like you've got a good relationship with Dan and the way he approaches the challenge that's actually more important to you.\n\nSpeaker 1 8:24: So I would expect, given the size of the firm and the sheer scale, to have slightly better structured research from them. And I think this is a function of resource rather than anything else, because, you know, then, so the way that I prefer the work is I don't have to talk to candidates, so to speak, for the first time, it's usually the search partner job to talk to them, figure out a little bit their personality, what they want, so that, you know, I'm going into the discussion with a knowledge of, yeah, who is this person? Right? And I felt like, Dan spent a lot of time on this, and it's absolutely fine and right, but that meant that there was less resource doing the research, and that's why, you know, search took slightly longer. In terms of slightly longer, I don't think it was massive, but yeah, it did take like, two weeks longer than was planned, which, for searches, is not a huge deal. But again, coming back to expectation from a Korn Ferry, I would expect them to just slightly better job at one of the mill skilled -- 2 of 5 -- operations, like mapping out candidate tracking some of the benchmarking. And that was a little bit mixed the really good stuff, though, just to be very clear on contract, because we also did a psychometric assessment. How it was called, I think it's cave for CFF, for decay, for the Yes, thank you, which in itself, honestly speaking, if I received this report and just read it standalone, I wouldn't get anything like I think it's really bloated. There's a lot of inflexion, a lot of generic wording, like, I didn't get much value, but what Dan did is he kind of connected me with the individual who either designed them or runs those assessments. And that was super helpful, right? Because for the final list of candidates, he explained the profile a little bit you know, showed the things that you know was worth looking at. Like that was super helpful. And that's also to the credit of Korn Ferry, if you know, being more flexible and so saying, like, you know, choose the report, see ya right? But, yeah, I think you have some of these things. I would expect them to be doing slightly better, again, not negative, just a bit mixed.\n\nInterviewer 11:12: Would you use them for anything other than search? It's like, what? Well, I suppose more assessments at scale or benchmarking or org design.\n\nSpeaker 1 11:27: So look, this is not exactly my area, so I can speak to org design other type of searches. I think, yeah, in our organization, that's Fred and amee who are doing this. I think they're broadly happy with this. But what I can speak to, apart from research, is, for example, assessments, right? I had experience for our preferred companies with assessments of Korn Ferry, and we have decided Oid, I have decided in my area never to use them again. It was unprofessional, took a long time, and insights that were delivered were lacking at best. So for me, you know, there are few things in those assessments. So one thing is, of course, we're looking for some red flags, right? So you know, if the candidate has done something horrible in the past. We don't want to work with individuals, but also we're trying to understand what kind of person is it, right? So that we can better fit the puzzle into the overall team management structure. Help the peers. So for example, in my case, CFF and CFF report into CEO. Helps you understand Who are you working with there, right? And I think Korn Ferry done absolutely horrible job at it. There are a couple of quality indicators. So just to be very clear, they have done the search for financing. Sorry, not search the assessment for financing. Have done assessment for CTO zero and group CFF, and there was nothing in that report of usefulness, I could see the low quality of work as well. Because for me, a the indication of quality is if they would find somebody critical or at least neutral on individual. There's always somebody in our life that we worked with who is not huge fan of ours. You cannot tell me that you Interviewer, you worked in the industry, and then there's not a single person who at least is neutral, like, that's not how life works,\n\nInterviewer 13:39: so long as it's not negative,\n\nSpeaker 1 13:42: yeah, of course. But also, if you have somebody negative, adds extra inflexion. Why? What's the motivation? What's rubbed them wrong? You know, maybe, maybe it's just person is demand, you know, maybe he's rude, or maybe, you know, they didn't set objectives like it adds this layer of understanding nothing. And the other bit is we're trying to understand, sort of, how did the individual interact with with other people. And usually I would like to look at this same Level Up, Down, Right? And I have instructed specifically, I think, Carol on doing this, like this, yeah, so I want data on peers, data on up. She hasn't done it. She hasn't done it for the most important role. She just sent me, like, two pages of quotes saying, Oh yeah, I worked with an individual. It was great. Fine. Cool, zero additional information, right? Didn't do what was instructed, didn't answer the questions that we have discussed. So I I would not prefer to work with Carol again.\n\nInterviewer 14:58: Okay, and it is there an alternative provider that you've used that like that did meet your expectations?\n\nSpeaker 1 15:09: Yes, so we use also pebble, or I use pebble for CFF searches. They have done pretty good job, and they the candor of the assessment is really important. And they were very clear of where this individual is, like, not everybody is a nice person, right? Cannot hire just nice individuals. You need to hire people who are performers, right? They were very clear first, yeah, I'm not going to go into details -- 3 of 5 -- of who, but they were very clear that this individual and schismal language can be sometimes an a hole, right? So you need to manage carefully his communication, especially downwards. Get some coach to them, they'll be fine, right? And also, Pebble asked us about how you can measure the success of this candidate, because there's and they're absolutely right about this. There's never a right CFF or right CFF right CEO, there's the right CTO for the role in this moment in time for the organization. And they helped us to assess what are the chances that this individual will perform like, for example, in one of the cases, they mentioned that, you know, this individual doesn't really this individual wants things to get done. They don't care how right? And that's is really important in understanding the relationship with peers and who we are looking for next in the second level, like CFF, for example, in my case, right? It was, yeah, it's a useful information to have, and it's actionable, right? It's goes down to chairs. Can make sure that we build also around that, like, for example, in terms of board report. And maybe we want to see something more. We want to see somebody more in the board with Korn Ferry, it was more, yeah, blah blah, blah, blah, blah, blah, good person,\n\nInterviewer 17:12: just not deep enough in terms of going back to suppose your experience with them for search. How did you rate their communication styles? Did it fit your needs? Was it adaptable? Did they ask you how you prefer to be engaged?\n\nSpeaker 1 17:29: Are we talking about Dan or Korn now Dan? Dan did a great job. He communicated with me really well. We had weekly calls. He had the report. You know, I think it was very clear. Because also what I expect from a search firm is to tell me when is the inflexion point in the search so we don't drag and scrape the barrel of the bucket of candidates, which is done right? Because usually you see, like, probably seven of them, and then you're done with this strategy. And he was very proactive and saying, like, Yeah, let's move to something else. Like we, for example, pivoted to Europe and had a look outside of the UK. And yeah, it was very good. And by the way, then also done the calls for reference call, not, not exactly what Carol does in terms of assessment, but a reference call with reference for finally, selected candidate was very insightful and very good, and he also did the communication with the individuals very well, because we want people to be engaged. We want them to want the job. I felt like when I was going into the call, they were on that page, right so and when, you know, as with any search, some of the individuals, we say, you know, it's not going to work out for you, he also handled it very well because the it's kind of his job to say negative news to them, and he handled it with grace. So like one of the individuals in search, I knew him through other channels, and he told me, like, Dan did a great job. He explained me why. He explained the reasons. That was a good indication for me as going in the right direction\n\nInterviewer 19:22: in terms of the candidates they've placed. How do you know if Dan has continued to stay connected to those candidates? Do they have they offered any further support?\n\nSpeaker 1 19:33: I'm not sure I'm interested. You'll need to clarify the question.\n\nInterviewer 19:38: Well, sometimes the recruiter stays in contact and with the with the placement, so once they're involved, just, you know, to see how they're getting on, to see if there's anything else that they can support them with, if you know that that's happening,\n\nSpeaker 1 19:54: as far as I know, yes. And also, I think Dan also stayed in touch with candidates who didn't get the job.\n\nInterviewer 20:02: New moving forward. Is there anything that they can do better? I mean, specifically in search, and then I know we've talked about assessment,\n\nSpeaker 1 20:11: so I think in terms of the search, I would again prefer to see a bit more structured, a bit more well resourced research from them, where, I don't know it's their job to decide how, but I would imagine -- 4 of 5 -- them, or the person in charge of research, setting the strategy, explaining the buckets, and then there's somebody who's doing like hands on, a lot of like outreach analysis. And come back to us with numbers, figures and validation and least shortlist of people we need to talk to. So I think that the research bit should be just better, well, well, resourced. And the second that is in terms of the conf ferry standard documents, like, for example, like Korn D, it just needs to be reworked. Like it has a treasure trove of valuable information. It's incredibly hard to get out. So, you know, they need to probably work a documentation in terms of the Carol's work, the background reference. And I think they need to decide how they position themselves if they want to do the C level background referencing. That's not okay, what they're doing if they want to do like, you know, level below. Fine. That's a bit different price point they need to increase, in my opinion, depth, quality, and they need to be able to reference or however, they need to be able to assess against specific job rather than ask generic questions. So that's, that's my view, right?\n\nInterviewer 22:00: Makes sense. I think that's pretty much it, unless there's anything else that you think would be useful to share at this stage.\n\nSpeaker 1 22:06: No, no, look, I generally positive experience from my side for the search, less so for management, reference and assessment and yeah, I think Dan did a good job. Happy with the\n\nInterviewer 22:21: outcome, brilliant. I'll feed that back. Mike, appreciate your time, especially on a Monday morning. Have a\n\nSpeaker 1 22:28: good week. Thank you. Interviewer's was a pleasure speaking to you. Have a good likewise. Thanks, Mike. Cheers. Bye. Transcribed by https://otter.ai -- 5 of 5 --"
}