{
  "id": "t-016",
  "sourceFile": "T11_NPS10_NA_ES_DIAMOND_OCT25.pdf",
  "client": "Cana Iwahara",
  "interviewDate": "2025-10-10",
  "project": "Executive Search",
  "score": 10,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Interviewer 0:01",
      "text": "hello. How are you? Yeah, I'm good. Thanks. How you doing? Nice to meet"
    },
    {
      "speaker": "Speaker 1 0:07",
      "text": "you. Good. Thank you. I see you have a note taking."
    },
    {
      "speaker": "Interviewer 0:12",
      "text": "Ai, yeah, I was gonna, I was gonna ask you if that's okay, if they can see, yeah, that's"
    },
    {
      "speaker": "Speaker 1 0:16",
      "text": "totally fine. That's amazing. I didn't know you can do that. Is that part of teams, or"
    },
    {
      "speaker": "Interviewer 0:22",
      "text": "you can do it as part of teams. You can get copilot, which is actually more expensive than otter. We've been using otter for about a year. It's just, it's really helpful for having things like this, where my team help will write, will write up the report so they can, yeah, transcripts, but it also does a summary, and so it'll kind of pull out all the key points, right?"
    },
    {
      "speaker": "Speaker 1 0:45",
      "text": "That's really cool. All right. Well, I'm going to talk to our tech team. We don't have we don't have anything. We have Macquarie AI, which is like an old version of chat GBT, which isn't very good, but I think we're kind of looking into how we can use AI more. So, oh"
    },
    {
      "speaker": "Interviewer 0:59",
      "text": "yeah. I mean, we've got a whole AI team now in in our consultancy, because, you know, we're using it every day, so we've built a whole kind of analysis tool for for these interviews. So, you know, it will give like kind of structured feedback Unknown Speaker 1:13 if we put it through it. So,"
    },
    {
      "speaker": "Interviewer 1:18",
      "text": "yeah, definitely get on it. Otter is a good one. Great. Thanks. Okay, so, yeah. So my first thing is, are you okay with that? So that's that first thing covered. Thank you for joining to talk through your NPS feedback for Korn Ferry. As you might have noticed, I'm not from Korn Ferry, so we're a consultancy that work with Korn Ferry. We've been working with them for five or six years, so we know them really well, and they've asked us to do these interviews, so hopefully, kind of give you an opportunity to speak more freely. They have a commitment to customer centricity, and they really want to make sure that they are offering the best service as possible. So by doing these, it helps kind of give feedback and make changes to anything that can be improved. So I'll try not to keep you too long, but it would be great just to kick off with, if you could turn my ring doorbell off, if you can start with just giving me an overview of your role at Macquarie and your relationship with Korn Ferry, so the engagements you've had today,"
    },
    {
      "speaker": "Speaker 1 2:31",
      "text": "yeah. So I lead the HR function for private markets within Macquarie asset management, so it's primarily our real assets group, which is primarily infrastructure private equity. I also cover another business within Macquarie asset management, which includes a few other investment teams like the secondaries investment team and the wealth wealth investment team. So, um, I have worked with, I can't, I don't even know how many times I think for me, Korn Ferry is the go to for executive search, and it's Jerry, Jerry upright and his team. So Francois, John Collett, I think they are who we primarily work with and the team that supports them. But Ym, I mean, on any kind of MD or senior MD search, -- 1 of 5 -- we get a few firms to pitch, and I always go to Jerry to see if there's capabilities in Korn Ferry, I think in the last I don't even know, for the last few years, but we consistently have at least like two or three searches going on. As of three months ago, we haven't had any, but it had been like four consecutive years of just like non stop searches. And I'm so glad, because I'm an HR business partner, so I do everything, so just recruiting. So I miss Jerry, but it's been kind of nice not having to be on these weekly calls for senior searches. But yeah, I think there really are go to Jerry's very good at relationship management. So you know, he's not just, he's not everyone's cup of tea. I don't know if you've met Jerry. I haven't. He's very like, American sales zE, but like, he's he definitely, like, has a good heart. I think he has the best intentions. And like, I love working with Jerry. I think Korn Ferry is really good at sales. And then they just do a really good job in the search, because they just hustle and they keep going. And Macquarie, we're a bit notorious for, like, having very long searches. Our process takes a little a little bit of time, but they never stop, and they keep going even if we're difficult and even if we're slow. And so we just really appreciate the partnership. So from my perspective, like, you know, it's, it's a really great partnership."
    },
    {
      "speaker": "Interviewer 5:06",
      "text": "Why is your process long? Is there? I mean, is there, like a framework, process that you guys use, or is it because different stakeholders that need to get passed?"
    },
    {
      "speaker": "Speaker 1 5:16",
      "text": "Yes, yes, we're quite consensus driven, so that really slows us down. And on a couple searches, it's just been, like, really unlucky where, you know, we've kind of landed on a candidate, and then it turned out they have this, like, 12 month non compete that they hadn't raised to us or, you know, but I think in general, since we're such a consensus driven organization, it just takes a little bit of time, and everyone, like interviews are very busy, so it's time to get it's hard to get on people's calendars."
    },
    {
      "speaker": "Interviewer 5:52",
      "text": "Yeah, and going back to your comment on that, Korn Ferry are really good at sales. Can you expand on that a little bit."
    },
    {
      "speaker": "Speaker 1 6:02",
      "text": "Oh, so I think, I don't know if this is true, but I think that Korn Ferry, as a search firm, places a lot of emphasis on, like, landing the deal so the pitch. So they're really, really good at the pitch, so they're extremely well prepared. You know, they prepare pretty quickly, like I try to give them, you know, more time than not, but they can usually pull together a pitch and, like, if rushed, like a week, but in two weeks. And they're very, just knowledgeable in the market. So anytime I put them in front of a hiring manager for a pitch, it ends up being quite, you know, an impressive conversation, okay?"
    },
    {
      "speaker": "Interviewer 6:41",
      "text": "And in terms of, I suppose, just managing the process end to end, how, how involved do they get, in terms of defining the job role, and all the way through to kind of then negotiation, compensation planning,"
    },
    {
      "speaker": "Speaker 1 6:58",
      "text": "they do everything. They do everything. I think ultimately, when we have the kind of offer conversation and discussions about compensation, our hiring managers will have that conversation, or I will have that conversation. But outside of that, they really do everything."
    },
    {
      "speaker": "Interviewer 7:19",
      "text": "And going back to Jerry, yeah, and you say he's not everyone's cup of tea, but he's, he's good at hustling. So, you know that it's good, right? Like, so he's relentless, you know, is it? Is it? Then how does, how does he fare on things like, kind of communication, stakeholder management,"
    },
    {
      "speaker": "Speaker 1 7:38",
      "text": "he's so good. He's so good. Jerry's Jerry's great. And I guess the one thing that I'll say is sometimes I worked on searches with Korn Ferry that worked with Jerry and his team, and I wasn't as impressed, like we had a talent search that was happening. And I think the person that was on it like he was fine, but then he ended up leaving, and so he wasn't as engaged. And then Jerry took over, and then we kind of were able to find move the process along pretty quickly. So I think it really depends on the team that you're working with, yeah, -- 2 of 5 --"
    },
    {
      "speaker": "Interviewer 8:11",
      "text": "and, and absolutely, and that's why I'm trying to get to, like, what's good about Jerry, so if I can then tell everybody else that there needs to be more Jerry. So yeah,"
    },
    {
      "speaker": "Speaker 1 8:19",
      "text": "so I mean, he's just, he's very communicative. He really takes the time to build the relationship, like with us and also the candidates. So he's just very communicative. Always informed, always acts quickly and puts, you know, strong candidates forward. So that's all we're really looking for, is someone to, you know, find a someone to hire. But I think it, I think it, I think it's, it is about the small things, right, just keeping us in the loop, um, and having like updates on every call, and really moving the process along. Okay?"
    },
    {
      "speaker": "Interviewer 9:19",
      "text": "So you feel, yeah, you feel in the loop. And then in terms of quantity and quality, do they always hit the mark?"
    },
    {
      "speaker": "Speaker 1 9:31",
      "text": "I mean, they eventually get there. Sometimes, you know, there's a calibration period and but that's with any search, you know, but, yeah, I mean, we've had, we have had, we did have a situation where we, I don't think Jerry was on the searches, but we kind of ended the engagement. But I think that was more of like a hiring manager preference, sort of thing. But typically, yeah, like, they really help us find great people,"
    },
    {
      "speaker": "Interviewer 10:09",
      "text": "great and once the person's in place, how much support do they continue to give those people in terms of, you know, peer group support or checking in? Is that something you'd expect? Does that happen?"
    },
    {
      "speaker": "Speaker 1 10:21",
      "text": "I think it happens, but I don't know that. I necessarily expect it. So I had lunch with Jerry a couple weeks ago, and you know, I was mentioning it to one of the hires that they made for us, and she was like, Oh yeah, he reached out to me the other day or something. So I think you know they do stay in touch, and they know it's really well, and so I think they can also give, like the hires, advice on how to best on board into Macquarie and be successful."
    },
    {
      "speaker": "Interviewer 10:55",
      "text": "Okay, and you said that they're your go to for exec search. Is that, yeah, across the organization, do you use any of their competitors, and how do they fare?"
    },
    {
      "speaker": "Speaker 1 11:06",
      "text": "So I only cover a very specific slice of Macquarie asset management. It's the biggest one. But we, we, you know, we do. We mainly work with two search firms, and Korn Ferry is one of them, and then another one is a boutique company we have. We used to pitch, you know, other shreks, but Korn Ferry kept winning, and so we kind of felt bad, and so we've kind of moved on. You know, it's really been the most competitive between Korn Ferry and this other boutique firm. So, you know, unless there's roles where, like, you know, we need certain, like industry expertise, like operational expertise, or something that Korn Ferry can't do, we'll definitely put them in front of the hiring manager."
    },
    {
      "speaker": "Interviewer 12:04",
      "text": "Okay, and have you ever used Korn Ferry for anything else beyond"
    },
    {
      "speaker": "Speaker 1 12:09",
      "text": "search? Um, we have used Korn Ferry's forensic referencing team under Carol house. I've always had a good experience. I did hear that there was some sort of negative experience, but I can't remember what it was, because I wasn't involved in the hire. I think it was. Yeah, I don't know exactly what it was, but I've, you know, we've used Carol, and I think it's been fine. My preference is not to do forensic CFF referencing, but when we when the hiring manager has wanted it, we've done it a few times. Okay? And what -- 3 of 5 --"
    },
    {
      "speaker": "Interviewer 12:49",
      "text": "about things like, kind of pay benchmarking, or, you know, kind of the, I mean, do you use the assessment tools as part of the hiring process anyway?"
    },
    {
      "speaker": "Speaker 1 12:58",
      "text": "So yeah, we have our own assessment tool that actually we use, we use Korn, Ferry testing system, but that kind of those decisions get made at more of a broader level. Yeah, okay, but yeah, I do think maybe the one thing that we could if we could get more like comp benchmarking surveys. I know that when we used to work at like, when we used to work with hydrogen struggles, they would send us, like an annual comp report, which was helpful. So like that would definitely be helpful."
    },
    {
      "speaker": "Interviewer 13:36",
      "text": "Yeah, as and would you see that as a kind of a value add, like part, part of the whole exec search experience."
    },
    {
      "speaker": "Speaker 1 13:45",
      "text": "Um, I do think it's a way for, I think it's a method that some search firms use just to stay connected with their potential clients. I mean, they don't, obviously, Korn Ferry doesn't really do it, and we've not, you know, gone away from them, so, but it would be, it would be, I guess it would be helpful for me. And when I do have questions, I kind of go to Jerry directly if I have, like, a specific question about, you know, market comp, yeah,"
    },
    {
      "speaker": "Interviewer 14:16",
      "text": "in terms of, I suppose you know your current priorities right now, aside from Korn Ferry, what? What are your biggest challenges that you're tackling"
    },
    {
      "speaker": "Speaker 1 14:30",
      "text": "from, like a business perspective or from a hiring perspective,"
    },
    {
      "speaker": "Interviewer 14:33",
      "text": "well, broad, I suppose, more broadly than hiring so more from a, you know, a more abroad, a broader HR perspective, what would your biggest priorities be right"
    },
    {
      "speaker": "Speaker 1 14:43",
      "text": "now? I mean, I guess this shouldn't be recorded, but Dei, okay, it just shouldn't be recorded because of US laws. But for me, that's always a priority. We are limited and diverse senior hires. And I know that Korn Ferry does try, and we'll do like a market map and make sure that they've, you know, at least, had an outreach to to like diverse candidates that might be able to fill the role. But, yeah, so dei for sure. Otherwise, I think, you know, we have a pretty stable business and infrastructure. You know, we're one of the top global infrastructure managers and so, you know, maybe less focus on that, but we're also growing in other areas. So we've set up a private equity and adjacencies business, where we're trying to launch our first fund. And so, you know, we're focused on making sure that that's successful, so that, you know, includes like training or team building, making sure that our leadership is equipped with, you know, the ability to to really develop an entrepreneurial team and integrate with Macquarie. So I think it's focusing on those growth areas. Otherwise. I mean, it's always like about talent development and how we can upskill our people. Unknown Speaker 16:32 So I'm always looking at opportunities to do that from an HR perspective."
    },
    {
      "speaker": "Interviewer 16:39",
      "text": "Okay, great. Anything else? If there's one thing that they improve on, just to smash it out of the park, what would it be?"
    },
    {
      "speaker": "Speaker 1 16:53",
      "text": "I think it's that extra, you know, market data, market you know, market landscape, like any updates, I guess it's information really"
    },
    {
      "speaker": "Interviewer 17:03",
      "text": "-- 4 of 5 -- how important is, like insight and also kind of tech, kind of play for you when it comes to, you know, I suppose HR, strategy and search. Wait, sorry,"
    },
    {
      "speaker": "Speaker 1 17:19",
      "text": "can you repeat the first part of your question? I think you cut out first. Think you cut out"
    },
    {
      "speaker": "Interviewer 17:23",
      "text": "for a sec. Oh, sorry. I think my internet's been rubbish all day. Apologies. Think it's Friday. How important is data and insight, but also kind of tech enabled decision making for you in both search and more broader HR strategy"
    },
    {
      "speaker": "Speaker 1 17:46",
      "text": "in search, probably not as much, you know, more broadly, I mean, across Macquarie, we're looking at, you know, different ways where we can digitize or digitalize our work. So it's a really, really big focus for us, and we are hiring a lot in, like our digital teams, and we're investing in, you know, companies that have advanced AI technology. And so it's definitely a strong focus. I haven't quite figured out how to use it in my role, specifically, other than, like, AI and, you know, like, chat GPT sort of thing. But yes, it's definitely a focus, a strong focus area for us."
    },
    {
      "speaker": "Interviewer 18:35",
      "text": "Okay, great, yeah, brilliant. I think that's it. That's been super helpful. Thank you so much. Really appreciate you taking the time. You. Yeah,"
    },
    {
      "speaker": "Speaker 1 18:44",
      "text": "I only like, I really love working with Korn Ferry. I really love Jerry and his team. Like, they're really amazing, so"
    },
    {
      "speaker": "Interviewer 18:50",
      "text": "great. And I'll feed that back to them if you're all right to do so,"
    },
    {
      "speaker": "Speaker 1 18:54",
      "text": "yes, of course. Brilliant. Great. All right. Thanks so much, Interviewer. Have a good weekend. Have a nice weekend. Bye. You. -- 5 of 5 --"
    }
  ],
  "rawText": "Interviewer 0:01: hello. How are you? Yeah, I'm good. Thanks. How you doing? Nice to meet\n\nSpeaker 1 0:07: you. Good. Thank you. I see you have a note taking.\n\nInterviewer 0:12: Ai, yeah, I was gonna, I was gonna ask you if that's okay, if they can see, yeah, that's\n\nSpeaker 1 0:16: totally fine. That's amazing. I didn't know you can do that. Is that part of teams, or\n\nInterviewer 0:22: you can do it as part of teams. You can get copilot, which is actually more expensive than otter. We've been using otter for about a year. It's just, it's really helpful for having things like this, where my team help will write, will write up the report so they can, yeah, transcripts, but it also does a summary, and so it'll kind of pull out all the key points, right?\n\nSpeaker 1 0:45: That's really cool. All right. Well, I'm going to talk to our tech team. We don't have we don't have anything. We have Macquarie AI, which is like an old version of chat GBT, which isn't very good, but I think we're kind of looking into how we can use AI more. So, oh\n\nInterviewer 0:59: yeah. I mean, we've got a whole AI team now in in our consultancy, because, you know, we're using it every day, so we've built a whole kind of analysis tool for for these interviews. So, you know, it will give like kind of structured feedback Unknown Speaker 1:13 if we put it through it. So,\n\nInterviewer 1:18: yeah, definitely get on it. Otter is a good one. Great. Thanks. Okay, so, yeah. So my first thing is, are you okay with that? So that's that first thing covered. Thank you for joining to talk through your NPS feedback for Korn Ferry. As you might have noticed, I'm not from Korn Ferry, so we're a consultancy that work with Korn Ferry. We've been working with them for five or six years, so we know them really well, and they've asked us to do these interviews, so hopefully, kind of give you an opportunity to speak more freely. They have a commitment to customer centricity, and they really want to make sure that they are offering the best service as possible. So by doing these, it helps kind of give feedback and make changes to anything that can be improved. So I'll try not to keep you too long, but it would be great just to kick off with, if you could turn my ring doorbell off, if you can start with just giving me an overview of your role at Macquarie and your relationship with Korn Ferry, so the engagements you've had today,\n\nSpeaker 1 2:31: yeah. So I lead the HR function for private markets within Macquarie asset management, so it's primarily our real assets group, which is primarily infrastructure private equity. I also cover another business within Macquarie asset management, which includes a few other investment teams like the secondaries investment team and the wealth wealth investment team. So, um, I have worked with, I can't, I don't even know how many times I think for me, Korn Ferry is the go to for executive search, and it's Jerry, Jerry upright and his team. So Francois, John Collett, I think they are who we primarily work with and the team that supports them. But Ym, I mean, on any kind of MD or senior MD search, -- 1 of 5 -- we get a few firms to pitch, and I always go to Jerry to see if there's capabilities in Korn Ferry, I think in the last I don't even know, for the last few years, but we consistently have at least like two or three searches going on. As of three months ago, we haven't had any, but it had been like four consecutive years of just like non stop searches. And I'm so glad, because I'm an HR business partner, so I do everything, so just recruiting. So I miss Jerry, but it's been kind of nice not having to be on these weekly calls for senior searches. But yeah, I think there really are go to Jerry's very good at relationship management. So you know, he's not just, he's not everyone's cup of tea. I don't know if you've met Jerry. I haven't. He's very like, American sales zE, but like, he's he definitely, like, has a good heart. I think he has the best intentions. And like, I love working with Jerry. I think Korn Ferry is really good at sales. And then they just do a really good job in the search, because they just hustle and they keep going. And Macquarie, we're a bit notorious for, like, having very long searches. Our process takes a little a little bit of time, but they never stop, and they keep going even if we're difficult and even if we're slow. And so we just really appreciate the partnership. So from my perspective, like, you know, it's, it's a really great partnership.\n\nInterviewer 5:06: Why is your process long? Is there? I mean, is there, like a framework, process that you guys use, or is it because different stakeholders that need to get passed?\n\nSpeaker 1 5:16: Yes, yes, we're quite consensus driven, so that really slows us down. And on a couple searches, it's just been, like, really unlucky where, you know, we've kind of landed on a candidate, and then it turned out they have this, like, 12 month non compete that they hadn't raised to us or, you know, but I think in general, since we're such a consensus driven organization, it just takes a little bit of time, and everyone, like interviews are very busy, so it's time to get it's hard to get on people's calendars.\n\nInterviewer 5:52: Yeah, and going back to your comment on that, Korn Ferry are really good at sales. Can you expand on that a little bit.\n\nSpeaker 1 6:02: Oh, so I think, I don't know if this is true, but I think that Korn Ferry, as a search firm, places a lot of emphasis on, like, landing the deal so the pitch. So they're really, really good at the pitch, so they're extremely well prepared. You know, they prepare pretty quickly, like I try to give them, you know, more time than not, but they can usually pull together a pitch and, like, if rushed, like a week, but in two weeks. And they're very, just knowledgeable in the market. So anytime I put them in front of a hiring manager for a pitch, it ends up being quite, you know, an impressive conversation, okay?\n\nInterviewer 6:41: And in terms of, I suppose, just managing the process end to end, how, how involved do they get, in terms of defining the job role, and all the way through to kind of then negotiation, compensation planning,\n\nSpeaker 1 6:58: they do everything. They do everything. I think ultimately, when we have the kind of offer conversation and discussions about compensation, our hiring managers will have that conversation, or I will have that conversation. But outside of that, they really do everything.\n\nInterviewer 7:19: And going back to Jerry, yeah, and you say he's not everyone's cup of tea, but he's, he's good at hustling. So, you know that it's good, right? Like, so he's relentless, you know, is it? Is it? Then how does, how does he fare on things like, kind of communication, stakeholder management,\n\nSpeaker 1 7:38: he's so good. He's so good. Jerry's Jerry's great. And I guess the one thing that I'll say is sometimes I worked on searches with Korn Ferry that worked with Jerry and his team, and I wasn't as impressed, like we had a talent search that was happening. And I think the person that was on it like he was fine, but then he ended up leaving, and so he wasn't as engaged. And then Jerry took over, and then we kind of were able to find move the process along pretty quickly. So I think it really depends on the team that you're working with, yeah, -- 2 of 5 --\n\nInterviewer 8:11: and, and absolutely, and that's why I'm trying to get to, like, what's good about Jerry, so if I can then tell everybody else that there needs to be more Jerry. So yeah,\n\nSpeaker 1 8:19: so I mean, he's just, he's very communicative. He really takes the time to build the relationship, like with us and also the candidates. So he's just very communicative. Always informed, always acts quickly and puts, you know, strong candidates forward. So that's all we're really looking for, is someone to, you know, find a someone to hire. But I think it, I think it, I think it's, it is about the small things, right, just keeping us in the loop, um, and having like updates on every call, and really moving the process along. Okay?\n\nInterviewer 9:19: So you feel, yeah, you feel in the loop. And then in terms of quantity and quality, do they always hit the mark?\n\nSpeaker 1 9:31: I mean, they eventually get there. Sometimes, you know, there's a calibration period and but that's with any search, you know, but, yeah, I mean, we've had, we have had, we did have a situation where we, I don't think Jerry was on the searches, but we kind of ended the engagement. But I think that was more of like a hiring manager preference, sort of thing. But typically, yeah, like, they really help us find great people,\n\nInterviewer 10:09: great and once the person's in place, how much support do they continue to give those people in terms of, you know, peer group support or checking in? Is that something you'd expect? Does that happen?\n\nSpeaker 1 10:21: I think it happens, but I don't know that. I necessarily expect it. So I had lunch with Jerry a couple weeks ago, and you know, I was mentioning it to one of the hires that they made for us, and she was like, Oh yeah, he reached out to me the other day or something. So I think you know they do stay in touch, and they know it's really well, and so I think they can also give, like the hires, advice on how to best on board into Macquarie and be successful.\n\nInterviewer 10:55: Okay, and you said that they're your go to for exec search. Is that, yeah, across the organization, do you use any of their competitors, and how do they fare?\n\nSpeaker 1 11:06: So I only cover a very specific slice of Macquarie asset management. It's the biggest one. But we, we, you know, we do. We mainly work with two search firms, and Korn Ferry is one of them, and then another one is a boutique company we have. We used to pitch, you know, other shreks, but Korn Ferry kept winning, and so we kind of felt bad, and so we've kind of moved on. You know, it's really been the most competitive between Korn Ferry and this other boutique firm. So, you know, unless there's roles where, like, you know, we need certain, like industry expertise, like operational expertise, or something that Korn Ferry can't do, we'll definitely put them in front of the hiring manager.\n\nInterviewer 12:04: Okay, and have you ever used Korn Ferry for anything else beyond\n\nSpeaker 1 12:09: search? Um, we have used Korn Ferry's forensic referencing team under Carol house. I've always had a good experience. I did hear that there was some sort of negative experience, but I can't remember what it was, because I wasn't involved in the hire. I think it was. Yeah, I don't know exactly what it was, but I've, you know, we've used Carol, and I think it's been fine. My preference is not to do forensic CFF referencing, but when we when the hiring manager has wanted it, we've done it a few times. Okay? And what -- 3 of 5 --\n\nInterviewer 12:49: about things like, kind of pay benchmarking, or, you know, kind of the, I mean, do you use the assessment tools as part of the hiring process anyway?\n\nSpeaker 1 12:58: So yeah, we have our own assessment tool that actually we use, we use Korn, Ferry testing system, but that kind of those decisions get made at more of a broader level. Yeah, okay, but yeah, I do think maybe the one thing that we could if we could get more like comp benchmarking surveys. I know that when we used to work at like, when we used to work with hydrogen struggles, they would send us, like an annual comp report, which was helpful. So like that would definitely be helpful.\n\nInterviewer 13:36: Yeah, as and would you see that as a kind of a value add, like part, part of the whole exec search experience.\n\nSpeaker 1 13:45: Um, I do think it's a way for, I think it's a method that some search firms use just to stay connected with their potential clients. I mean, they don't, obviously, Korn Ferry doesn't really do it, and we've not, you know, gone away from them, so, but it would be, it would be, I guess it would be helpful for me. And when I do have questions, I kind of go to Jerry directly if I have, like, a specific question about, you know, market comp, yeah,\n\nInterviewer 14:16: in terms of, I suppose you know your current priorities right now, aside from Korn Ferry, what? What are your biggest challenges that you're tackling\n\nSpeaker 1 14:30: from, like a business perspective or from a hiring perspective,\n\nInterviewer 14:33: well, broad, I suppose, more broadly than hiring so more from a, you know, a more abroad, a broader HR perspective, what would your biggest priorities be right\n\nSpeaker 1 14:43: now? I mean, I guess this shouldn't be recorded, but Dei, okay, it just shouldn't be recorded because of US laws. But for me, that's always a priority. We are limited and diverse senior hires. And I know that Korn Ferry does try, and we'll do like a market map and make sure that they've, you know, at least, had an outreach to to like diverse candidates that might be able to fill the role. But, yeah, so dei for sure. Otherwise, I think, you know, we have a pretty stable business and infrastructure. You know, we're one of the top global infrastructure managers and so, you know, maybe less focus on that, but we're also growing in other areas. So we've set up a private equity and adjacencies business, where we're trying to launch our first fund. And so, you know, we're focused on making sure that that's successful, so that, you know, includes like training or team building, making sure that our leadership is equipped with, you know, the ability to to really develop an entrepreneurial team and integrate with Macquarie. So I think it's focusing on those growth areas. Otherwise. I mean, it's always like about talent development and how we can upskill our people. Unknown Speaker 16:32 So I'm always looking at opportunities to do that from an HR perspective.\n\nInterviewer 16:39: Okay, great. Anything else? If there's one thing that they improve on, just to smash it out of the park, what would it be?\n\nSpeaker 1 16:53: I think it's that extra, you know, market data, market you know, market landscape, like any updates, I guess it's information really\n\nInterviewer 17:03: -- 4 of 5 -- how important is, like insight and also kind of tech, kind of play for you when it comes to, you know, I suppose HR, strategy and search. Wait, sorry,\n\nSpeaker 1 17:19: can you repeat the first part of your question? I think you cut out first. Think you cut out\n\nInterviewer 17:23: for a sec. Oh, sorry. I think my internet's been rubbish all day. Apologies. Think it's Friday. How important is data and insight, but also kind of tech enabled decision making for you in both search and more broader HR strategy\n\nSpeaker 1 17:46: in search, probably not as much, you know, more broadly, I mean, across Macquarie, we're looking at, you know, different ways where we can digitize or digitalize our work. So it's a really, really big focus for us, and we are hiring a lot in, like our digital teams, and we're investing in, you know, companies that have advanced AI technology. And so it's definitely a strong focus. I haven't quite figured out how to use it in my role, specifically, other than, like, AI and, you know, like, chat GPT sort of thing. But yes, it's definitely a focus, a strong focus area for us.\n\nInterviewer 18:35: Okay, great, yeah, brilliant. I think that's it. That's been super helpful. Thank you so much. Really appreciate you taking the time. You. Yeah,\n\nSpeaker 1 18:44: I only like, I really love working with Korn Ferry. I really love Jerry and his team. Like, they're really amazing, so\n\nInterviewer 18:50: great. And I'll feed that back to them if you're all right to do so,\n\nSpeaker 1 18:54: yes, of course. Brilliant. Great. All right. Thanks so much, Interviewer. Have a good weekend. Have a nice weekend. Bye. You. -- 5 of 5 --"
}