{
  "id": "t-018",
  "sourceFile": "T13_NPS9_EMEA_ES_MARQUEE_OCT25.pdf",
  "client": "Briony McKinn",
  "interviewDate": "2025-10-13",
  "project": "Executive Search",
  "score": 9,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Speaker 1 0:00",
      "text": "My I've got a team who work pretty closely with our UK based group execs, to work with them and their leadership team on all kind of, you know, business partnering HR, business partnering activity, and I've been in this role now for about 18 months. Yeah, so kind of HR, generalist activity, and then I've got a very small center of excellence around leadership development, which, ironically, we don't do any work with Korn Ferry on. I have worked with Korn Ferry on leadership development in a previous life, but we don't, we don't work with them here on that."
    },
    {
      "speaker": "Interviewer 0:34",
      "text": "And why is that? Is that, do you use someone else? Is it something you do in house?"
    },
    {
      "speaker": "Speaker 1 0:39",
      "text": "It's something we do in house, and we just don't have the budget allocated to it that I've had in previous organizations. But, you know, if I did, I would definitely be asking questions, because I've only ever had a, you know, had a very good experience in my previous role with Korn Ferry."
    },
    {
      "speaker": "Interviewer 0:56",
      "text": "Great. Thank you. And then so in terms of what you do, use Korn Ferry for, yeah. Is it just search, or is it anything? It's"
    },
    {
      "speaker": "Speaker 1 1:04",
      "text": "just Yeah, it's all it's it's just search. So we, and you know, Korn Ferry, are fairly well, I would say, embedded within IVC of odyymzyynmytzg, you know, veterinary care group we are, you know, where we've got presence in 19 countries around the world, just close to 40,000 colleagues, which is not an insignificant number, but within the UK in particular, which is our kind of biggest operating region, the UK and Ireland. And then we've kind of, you know, built out a significant footprint through acquisition into mainland Europe and Northern Europe as well. Through through acquisition, we have kind of, you know, Korn Ferry have been used, you know, I wouldn't say that they're not the only search firm that the that we use for our exec roles, but they certainly one of the go to go to search firms that are used for both. I use them extensively for finance. But I know that there are other, you know, other parts of the organization. Use Korn Ferry for kind of, you know, like CEO, general management type, type roles. And as I say, I've my I've mainly usable, since I've been here, I've used, used them for finance searches,"
    },
    {
      "speaker": "Interviewer 2:25",
      "text": "great. Unknown Speaker 2:28 And"
    },
    {
      "speaker": "Interviewer 2:30",
      "text": "why, specifically finance? Is it because that they have a kind of a deep sector understanding? Or,"
    },
    {
      "speaker": "Speaker 1 2:36",
      "text": "yeah, I would say both. So Rebecca Moreland, who is our main kind of, you know, our main partner that we work with at Korn Ferry, her and our group, CFF, have worked together for a number of years. There's an existing relationship there. He absolutely respects her. And, you know, we do use other finance search firms, you know, for kind of, some, some other kind of, like, more niche things, particularly in the interim space, but on the permanent search side, you know, Rebecca has and Heiner have, you know, probably worked together, I believe, for probably, you know, around about five or six years. They've no maybe even longer. I think he met her when, when he was in, I think he was leaving, he was the CFF for ISS, the facilities management business a number of years ago, and -- 1 of 6 -- when he was moving to Carlsberg, which he, which he was for a number of years before he came here. So they must have each other for nearly 10 years. I think she, he, he met her when they, they were doing the search to replace him, and then they've kind of stayed in contact. And I do believe that she was retained. I don't know this for sure because I wasn't here, but I do believe that she was retained to and she basically placed China here as well. So he's got a, you know, a long standing relationship with her. Do you mind it? I just need to get one. I've got an alarm going off in the background. I'll be off in the background. Unknown Speaker 4:16 Multitasking, working from home, Unknown Speaker 4:19 serious alarm. Yeah. No, no, no, it's fine."
    },
    {
      "speaker": "Interviewer 4:23",
      "text": "So in terms of when you do use, can you kind of outline for me, kind of the positives and, you know, the things that are not so good?"
    },
    {
      "speaker": "Speaker 1 4:31",
      "text": "Yeah, absolutely. So, as I say, so, you know, I Rebecca's relationship with with Heiner, and then also to the, you know, with IVC predates me, so I've probably worked with Rebecca for the and Korn, and her and her team at Korn Ferry for the past. It will be coming up to a year that I had a she'd done some work with someone who was in a version of my role beforehand. And then around November last year, we knew that we were going to have to make some changes in different parts of our finance organization. So Heiner introduced me to her, and, you know, we just got on, you know, we kind of got on, you know, really well from the start, and we're now, I think we're on our fourth search. It's just literally been non stop because we've had some different changes have had to manage. So I feel, you know, we joke around and say, it doesn't feel like there's been a week since, you know, the start of this year, this calendar year, that we've not had some kind of interaction with each other. So, yeah, I feel like, you know, it's that, you know, you know, she spent a long time, a lot of time. Well, she obviously knows Heiner very well. And so she understands, you know, what he's looking for, the things that that are going to both delight and and not delight him as well as kind of, you know, frustrate and like, Nope, that's not going to work kind of thing. So she knows him well. But I also appreciate the time that she and a number of her team have taken to also get to know me well, to, kind of, you know, understand, right? Well, how do I, how do I work with Heiner? And how do we, kind of, you know, play the, you know, how do we work as a team, you know, back at IVC, to kind of, you know, get the best experience possible, you know, for the candidates that we're, you know, that we're speaking to, and ultimately make placements, you know, along the way. So as I say, we are that we're we're on our I'm on the fourth search at the moment. And yes, she's, yeah, we've got a really good relationship with that, with the organization."
    },
    {
      "speaker": "Interviewer 6:36",
      "text": "Does she in terms of this, suppose the end to end process? Do they help you with the defining the job description, or is that all"
    },
    {
      "speaker": "Speaker 1 6:45",
      "text": "of it? Yeah, basically. So, you know, we've got, ironically so we've had so of the of of the four, of the four live searches that we've had two of them, one of them, the first one earlier this year, was for a regional CFF. And actually it was a new role. So we do have regional CFF, but we'd never had a regional CFF for, you know what we were looking at, which was for Central and Western Europe. So we really had to spend a bit of time looking at, well, what she'd hired the CFF, the regional CFF for both the UK and Ireland and also Canada, so that, and that was before my time. So we had a kind of, you know, that had been built. So we just had to make some adjustments to that. But because, you know, the regions that we were bringing together had never really operated that, you know, they'd never operated together, we had to spend time to properly, really define that and work out, well, actually, is this something that's going to be, is it going to be the impossible kind of search it proved to nearly be. But we got there in the end, and we placed someone who started, like a month, just over a month ago, so so that was good, you know, it was a, it was a long kind of, like, nervous period over the summer for him. So that was on that one. And then we don't, we also have been looking for we had we appointed a new group financial controller, and again, they've done the search on that a -- 2 of 6 -- number of years before, two and a half years ago, I believe. And we, we, so we again, we had to kind of refine that based on how it that role had evolved over that period of time. So no, they are absolutely key, like, right from that, and even even from before we confirm it, it's usually a phone call to say, look, this is what we're thinking about. Any insights you want to share before we kind of go, yeah, we're going to, we're definitely going to make the commitment that we're going to go to search on this. So they have very much involved, you know, from the from the get go and"
    },
    {
      "speaker": "Interviewer 8:50",
      "text": "then through to the end, they do, like comp negotiation, yes, great."
    },
    {
      "speaker": "Speaker 1 8:58",
      "text": "Yeah, definitely. And also, too, because of our ownership structure. That's becoming trickier and trickier because, you know, we're talking to candidates, you know, at the top end of the market, who you know, in many cases, because of our size. You know, we're a nearly 6 billion, you know, revenue, 6 billion pound revenue organization. If we were listed, we'd probably be in the FTSE 30. But you've never heard of us before. We're only 12 years old, and we're owned by private equity. So, you know, it's all of those things come together, people that we're looking for to come and help us, kind of, you know, mature the organization from a process and kind of, you know, governance and all of that kind of thing. You know, we need people that know what good looks like. And they're usually coming from big, very well established organizations. You know, they've got, you know, let you know, Legacy l tips there. You know, particularly if they are in enlisted businesses today, they will also have, you know, fairly lucrative short term bonus plans that are usually pretty good at paying out. We're then trying to entice them to come across into a PE owned business where we've got none of that established. We do have a, you know, a kind of a, you know, yearly or short term incentive plan. But obviously PE is notorious for pretty stretching targets on a year on year basis. So, you know, there's a real kind of skepticism, and sometimes rightly so, about whether or not you know, well, you're telling me I've got an up to 50% of base target bonus. Well, how likely is that going to pay at 50, or is it going to pay at 20? And, you know, I'm leaving x amount of L tip, and because of where we are at within our ownership cycle, what was a fairly attractive, you know, equity buy in a few years ago, there's, there's still opportunity there, don't get me wrong, but it's nowhere near as as, as lucrative as it, as it had, as it was. So they are instrumental in, kind of helping us tell the story really around, you know, what is it that is the attracting? We know what's attractive to candidates about that? So, yeah, they do that references. And you know, as early as you know, we're kind of cut towards the latter stages of a search at the moment. And you know, myself and one of our other group exec members did an interview with our preferred candidate on Friday. And you know what the execs members like, oh, you know, like yet, but, and I wonder if we can do, you know, kind of, you know, are we at references yet? And I said, No, no, we're not. But, you know, a quick phone call to Rebecca, and I was like, so this is what we need to try and overcome. And she's like, I know this person. I can do an inform, you know, I can do a, you know, informal kind of check, so things like that that I definitely appreciate."
    },
    {
      "speaker": "Interviewer 11:57",
      "text": "Yeah, great. And and in terms of, well, actually, I'll come with that to the second. So Do they, do you leverage any of their like assessments or pay benchmarks? Are they? Are they important to you? Are they, you know, are they critical, in terms of you selecting them or not selecting them?"
    },
    {
      "speaker": "Speaker 1 12:19",
      "text": "Um, I would say it's really interesting because, um, so the the psychometric assessments, the K for D, I've actually got, you know, I think it's at midday today, I've got a session with that, with them to do feedback on on two candidates for this role that, that I just mentioned earlier. And I do appreciate that that's also part of the, you know, I think it's a really good kind of, you know, inclusion within kind of, you know, the overall, the overall service. About a couple of months ago, we were looking to appoint, we were looking at what we're going to do for a search within our technology space. And one of our, one of our, we've got like, five different shareholders. And one of the kind of the shareholders is Silver Lake. And so they're, obviously, you know, they're, they're quite heavily invested in terms of, you know, globally, in different markets around, you know, technology, and they use a couple of different search firms that they've got there, that they've got their, you know, negotiated kind of fees with, and all the rest of it. And they said, Look, we really like, well, we weren't pressured. That's the wrong say, but it was very much. We strongly advise that, you know, you are, you know, we would like you to meet with these two firms and kind of make your decision. So, you know, we did, in the end, we've decided we actually, we did. We did decide to appoint one of them, and they and they were good. -- 3 of 6 -- They did a great kind of, you know, pitch to us and all the rest of it. But interestingly, they were you and they are one of the other Shrek firms, but they were not going to any of their assessments. They were all that was all going to be plus. And I just thought, you know what I I think make. I was like, Have I been spoiled just because of the relationship we have with Korn Ferry? But for me, I find that for some of these, you know, key C suite roles, that's kind of the It's the basic thing nowadays, and the fact that they didn't, and I did ask the question, I was like, you know, you know, your competitors actually include this. And they were, you know, obviously they've got an answer for me or as to why they don't, but I do appreciate that side of and also to the comp Intel as well. For sure,"
    },
    {
      "speaker": "Interviewer 14:45",
      "text": "is there anything else that you would expect all moving forward in terms of thinking about your broader challenges around kind of skills and workforce that you are looking for, a kind of a tech enabled or data kind of led consultancy on,"
    },
    {
      "speaker": "Speaker 1 15:05",
      "text": "you know, it's, it's really interesting, because I think again, one of the the process that, you know, when we were, when we were looking at that role, and obviously it was for a tech role. And, you know, I've never even asked Rebecca or the team at Korn Ferry, if this is, if this is possible. But, you know, all of the kind of the data sharing that was going to be all enabled through a platform, you know, that's where all of the kind of, you know, profiles are going to sit in a kind of, basically a hub. And, you know, I like that. But then I think, actually, I'm, you know, if Heiner, who is the key stakeholder here, and I don't mean to generalize my and I'm going to, and I'm saying, I'm apologizing for, I guess is, is that while you know some of my, you know, let's see you some of my leaders that I work with, particularly in the tech space, and some, maybe even in the finance space as well. They're very happily log into a portal, and right here's where all of my stuff is. And this is my one shop, one stop shop. And I'm going to also put my feedback in here. I think the reality is, is the demographic that we're working with with, you know, with Heiner in particular, like, you know, that's not how he's grown up in organizations. He's used to getting his, you know, report that, you know, we get sent through that's on email, you know, we're doing kind of, you know, feedback, either, you know, email, risk, you know feedback, or, you know, old call, phone call, like, what's the feedback kind of thing? So I, I think it very much depends on the stakeholders that you're working with as to whether or not that would be, that would be something that's valued or not. And I even know internally, we've got our own talent team that we use for, you know, every anything, anything sub 80,000 pounds in the UK, we, you know, our all our managers are encouraged to use our internal talent team, as opposed to going externally. And even getting people to use the ATS is tough, because they just want, you know, particularly if they've been working for 20 plus years or more, they're just kind of used to working in a certain way. And I have this, I know I have this thing where I think that in our personal lives, we are very happy to get an iPhone and use 10% of the functionality. Those that are really interested in knowing how it works more, we'll probably know 50% of the functionality, but we're actually okay to do a bit of a oh, well, we'll work it out for ourselves. Technology. But when it comes to what your work technology, most people expect, well, hang on, you haven't trained me on how to use this, and there's very different expectations. You're like, well, no one trains you how to use an iPhone. So why do you think you need to be, you know, no one trains you how to use Instagram, but you use it. Why do you think you should be trained to use, you know, an app that is going to help you do your job? So I think, you know, that's a very long answer to the question. But I think that"
    },
    {
      "speaker": "Speaker 2 18:18",
      "text": "if there's, if there's kind of newer"
    },
    {
      "speaker": "Speaker 1 18:23",
      "text": "ways of working that are going to be that are going to help the process, then brilliant. But if not, you know, I would much prefer that you know the investment to be made in in them spending time with getting to know the people that they're that they're introducing us to, and will they be successful in the roles that we're looking them to have, for them to feel for us?"
    },
    {
      "speaker": "Interviewer 18:45",
      "text": "Yeah, do they, I mean, do they talk to you about preference of communication? And, you know, do you have regular"
    },
    {
      "speaker": "Speaker 1 18:51",
      "text": "-- 4 of 6 -- Yeah, absolutely, for you, definitely. And, and ultimately, you know, I feel very fortunate as I say. You know, Rebecca and I have an incredibly good relationship, you know, we will text, we will call, you know, weekends, late into the evening. You know, we're pretty, you know, we're absolutely respectful of each other. But no, we, you know, we've, we've been able to build that up. And I would say that that's probably the same for, you know, a couple of the people in the team that that that work with her. But, you know, we're and all of them are super responsive. And I must say, if you know, when you're writing up the report, Rebecca's EA her name's Lucy tres Gothic. I mean, she is amazing. She is, like, I've said this to Rebecca as well, like, she is the absolute benchmark of EAs I've ever worked with in, you know, my 2026, year old, you know, year old work career, she, she's brilliant. And you know that support team around make a real difference to how something, you know, is successful or not"
    },
    {
      "speaker": "Interviewer 19:55",
      "text": "amazing. Is there anything that they could do better?"
    },
    {
      "speaker": "Speaker 1 20:00",
      "text": "Um, you know, I honestly, I don't think so, I mean, and I, I'm really thinking, I think that we had a really challenging search earlier in the year for this, for this central and western, Western European role where, you know, we were looking at, you know, and we don't give them easy briefs. It was, well, this person could be based in France, they could be based in Germany, they could be based in the Netherlands, they could be based in Spain, Portugal. So then all of a sudden, you're expecting them to be experts at, you know, or them, they're drawing on their on the teams within their those countries, they're on, okay, well, you're going to be an expert on, well, what is, you know, What would someone in who's going to be employed in Portugal, Portugal expect, versus someone in in Germany? I think, you know, there was some really challenging moments there, but it wasn't, it wasn't down to anyone not being responsible. You know, we were kind of in some uncharted territories for us, and so we were kind of working through those. But, yeah, it was no one's, I really can't think of anything that is that they could do more, you know, more of and, you know, they're so accommodating to us, like, you know, we, up until recently, haven't had an office in London, and we now I'm gonna call it an office. It's not really that much of an office, but, you know, so, you know, I can go in, I know I can contact Korn Ferry and say, Can we use your office? You know, I would never be so cheeky as to interview anyone who wasn't a Korn Ferry candidate there. But we've certainly, you know, I've certainly done meetings, you know, with my own team there about all my, all my boss on, on certain things, you know. So we're not just there when we're meeting candidates where, you know, and that's that's really appreciated very much. So"
    },
    {
      "speaker": "Interviewer 21:55",
      "text": "how do they compare on things like price?"
    },
    {
      "speaker": "Speaker 1 21:59",
      "text": "You know, I think they're actually again, if I have used the most recent, the most use it, recent experience we had with one of the other Shrek firms, they're kind of all the same, really, like, I mean, you're, you know, they're, you know, you get your you get your kind of, you know what. And I find it really interesting that I've worked in HR for, you know, 25 years, probably the last, you know, 20 years kind of became, became, you know, more exposed to kind of the executive search. And I do find it interesting that in that 20 year period, the kind of a third of, you know, a third of the salary, and we're going to, you know, how we're going to pay, it's not really changed. It's very it's very consistent. So I think that for the for the price, you know, you obviously know that you're paying more, but at this, on the flip side, Rebecca is also very fair. When I've said to her, this is our fourth search in 12 months. What can you do for me. And, you know, she's she, she takes that on board. And my CFF that, you know, I'm working with him, he drives, he drives a whole bargain I can and he says to me, he's like, Well, you know, you can negotiate that. And I'm like, I'm not gonna negotiate it, like, so, you know, and, but we, and I'm really fair with her. I don't expect you guys to do this for free. I don't want you to do it for free, but help me out here. I've got to show him something. And, you know, we work together to kind of go, Yep, we've got it for this so, but I do think, for the money that we pay, you know, the service absolutely backs it up, absolutely"
    },
    {
      "speaker": "Interviewer 23:39",
      "text": "great. I think that's it. That's that's really helpful. I do really appreciate your you kind of go getting into the detail with me. My pleasure. Well, lovely to meet you and have and you -- 5 of 6 -- Unknown Speaker 23:53 enjoy the rest of your week. Yeah,"
    },
    {
      "speaker": "Interviewer 23:54",
      "text": "likewise. Thanks. Briony, thanks. Interviewer, bye. God. Transcribed by https://otter.ai -- 6 of 6 --"
    }
  ],
  "rawText": "Speaker 1 0:00: My I've got a team who work pretty closely with our UK based group execs, to work with them and their leadership team on all kind of, you know, business partnering HR, business partnering activity, and I've been in this role now for about 18 months. Yeah, so kind of HR, generalist activity, and then I've got a very small center of excellence around leadership development, which, ironically, we don't do any work with Korn Ferry on. I have worked with Korn Ferry on leadership development in a previous life, but we don't, we don't work with them here on that.\n\nInterviewer 0:34: And why is that? Is that, do you use someone else? Is it something you do in house?\n\nSpeaker 1 0:39: It's something we do in house, and we just don't have the budget allocated to it that I've had in previous organizations. But, you know, if I did, I would definitely be asking questions, because I've only ever had a, you know, had a very good experience in my previous role with Korn Ferry.\n\nInterviewer 0:56: Great. Thank you. And then so in terms of what you do, use Korn Ferry for, yeah. Is it just search, or is it anything? It's\n\nSpeaker 1 1:04: just Yeah, it's all it's it's just search. So we, and you know, Korn Ferry, are fairly well, I would say, embedded within IVC of odyymzyynmytzg, you know, veterinary care group we are, you know, where we've got presence in 19 countries around the world, just close to 40,000 colleagues, which is not an insignificant number, but within the UK in particular, which is our kind of biggest operating region, the UK and Ireland. And then we've kind of, you know, built out a significant footprint through acquisition into mainland Europe and Northern Europe as well. Through through acquisition, we have kind of, you know, Korn Ferry have been used, you know, I wouldn't say that they're not the only search firm that the that we use for our exec roles, but they certainly one of the go to go to search firms that are used for both. I use them extensively for finance. But I know that there are other, you know, other parts of the organization. Use Korn Ferry for kind of, you know, like CEO, general management type, type roles. And as I say, I've my I've mainly usable, since I've been here, I've used, used them for finance searches,\n\nInterviewer 2:25: great. Unknown Speaker 2:28 And\n\nInterviewer 2:30: why, specifically finance? Is it because that they have a kind of a deep sector understanding? Or,\n\nSpeaker 1 2:36: yeah, I would say both. So Rebecca Moreland, who is our main kind of, you know, our main partner that we work with at Korn Ferry, her and our group, CFF, have worked together for a number of years. There's an existing relationship there. He absolutely respects her. And, you know, we do use other finance search firms, you know, for kind of, some, some other kind of, like, more niche things, particularly in the interim space, but on the permanent search side, you know, Rebecca has and Heiner have, you know, probably worked together, I believe, for probably, you know, around about five or six years. They've no maybe even longer. I think he met her when, when he was in, I think he was leaving, he was the CFF for ISS, the facilities management business a number of years ago, and -- 1 of 6 -- when he was moving to Carlsberg, which he, which he was for a number of years before he came here. So they must have each other for nearly 10 years. I think she, he, he met her when they, they were doing the search to replace him, and then they've kind of stayed in contact. And I do believe that she was retained. I don't know this for sure because I wasn't here, but I do believe that she was retained to and she basically placed China here as well. So he's got a, you know, a long standing relationship with her. Do you mind it? I just need to get one. I've got an alarm going off in the background. I'll be off in the background. Unknown Speaker 4:16 Multitasking, working from home, Unknown Speaker 4:19 serious alarm. Yeah. No, no, no, it's fine.\n\nInterviewer 4:23: So in terms of when you do use, can you kind of outline for me, kind of the positives and, you know, the things that are not so good?\n\nSpeaker 1 4:31: Yeah, absolutely. So, as I say, so, you know, I Rebecca's relationship with with Heiner, and then also to the, you know, with IVC predates me, so I've probably worked with Rebecca for the and Korn, and her and her team at Korn Ferry for the past. It will be coming up to a year that I had a she'd done some work with someone who was in a version of my role beforehand. And then around November last year, we knew that we were going to have to make some changes in different parts of our finance organization. So Heiner introduced me to her, and, you know, we just got on, you know, we kind of got on, you know, really well from the start, and we're now, I think we're on our fourth search. It's just literally been non stop because we've had some different changes have had to manage. So I feel, you know, we joke around and say, it doesn't feel like there's been a week since, you know, the start of this year, this calendar year, that we've not had some kind of interaction with each other. So, yeah, I feel like, you know, it's that, you know, you know, she spent a long time, a lot of time. Well, she obviously knows Heiner very well. And so she understands, you know, what he's looking for, the things that that are going to both delight and and not delight him as well as kind of, you know, frustrate and like, Nope, that's not going to work kind of thing. So she knows him well. But I also appreciate the time that she and a number of her team have taken to also get to know me well, to, kind of, you know, understand, right? Well, how do I, how do I work with Heiner? And how do we, kind of, you know, play the, you know, how do we work as a team, you know, back at IVC, to kind of, you know, get the best experience possible, you know, for the candidates that we're, you know, that we're speaking to, and ultimately make placements, you know, along the way. So as I say, we are that we're we're on our I'm on the fourth search at the moment. And yes, she's, yeah, we've got a really good relationship with that, with the organization.\n\nInterviewer 6:36: Does she in terms of this, suppose the end to end process? Do they help you with the defining the job description, or is that all\n\nSpeaker 1 6:45: of it? Yeah, basically. So, you know, we've got, ironically so we've had so of the of of the four, of the four live searches that we've had two of them, one of them, the first one earlier this year, was for a regional CFF. And actually it was a new role. So we do have regional CFF, but we'd never had a regional CFF for, you know what we were looking at, which was for Central and Western Europe. So we really had to spend a bit of time looking at, well, what she'd hired the CFF, the regional CFF for both the UK and Ireland and also Canada, so that, and that was before my time. So we had a kind of, you know, that had been built. So we just had to make some adjustments to that. But because, you know, the regions that we were bringing together had never really operated that, you know, they'd never operated together, we had to spend time to properly, really define that and work out, well, actually, is this something that's going to be, is it going to be the impossible kind of search it proved to nearly be. But we got there in the end, and we placed someone who started, like a month, just over a month ago, so so that was good, you know, it was a, it was a long kind of, like, nervous period over the summer for him. So that was on that one. And then we don't, we also have been looking for we had we appointed a new group financial controller, and again, they've done the search on that a -- 2 of 6 -- number of years before, two and a half years ago, I believe. And we, we, so we again, we had to kind of refine that based on how it that role had evolved over that period of time. So no, they are absolutely key, like, right from that, and even even from before we confirm it, it's usually a phone call to say, look, this is what we're thinking about. Any insights you want to share before we kind of go, yeah, we're going to, we're definitely going to make the commitment that we're going to go to search on this. So they have very much involved, you know, from the from the get go and\n\nInterviewer 8:50: then through to the end, they do, like comp negotiation, yes, great.\n\nSpeaker 1 8:58: Yeah, definitely. And also, too, because of our ownership structure. That's becoming trickier and trickier because, you know, we're talking to candidates, you know, at the top end of the market, who you know, in many cases, because of our size. You know, we're a nearly 6 billion, you know, revenue, 6 billion pound revenue organization. If we were listed, we'd probably be in the FTSE 30. But you've never heard of us before. We're only 12 years old, and we're owned by private equity. So, you know, it's all of those things come together, people that we're looking for to come and help us, kind of, you know, mature the organization from a process and kind of, you know, governance and all of that kind of thing. You know, we need people that know what good looks like. And they're usually coming from big, very well established organizations. You know, they've got, you know, let you know, Legacy l tips there. You know, particularly if they are in enlisted businesses today, they will also have, you know, fairly lucrative short term bonus plans that are usually pretty good at paying out. We're then trying to entice them to come across into a PE owned business where we've got none of that established. We do have a, you know, a kind of a, you know, yearly or short term incentive plan. But obviously PE is notorious for pretty stretching targets on a year on year basis. So, you know, there's a real kind of skepticism, and sometimes rightly so, about whether or not you know, well, you're telling me I've got an up to 50% of base target bonus. Well, how likely is that going to pay at 50, or is it going to pay at 20? And, you know, I'm leaving x amount of L tip, and because of where we are at within our ownership cycle, what was a fairly attractive, you know, equity buy in a few years ago, there's, there's still opportunity there, don't get me wrong, but it's nowhere near as as, as lucrative as it, as it had, as it was. So they are instrumental in, kind of helping us tell the story really around, you know, what is it that is the attracting? We know what's attractive to candidates about that? So, yeah, they do that references. And you know, as early as you know, we're kind of cut towards the latter stages of a search at the moment. And you know, myself and one of our other group exec members did an interview with our preferred candidate on Friday. And you know what the execs members like, oh, you know, like yet, but, and I wonder if we can do, you know, kind of, you know, are we at references yet? And I said, No, no, we're not. But, you know, a quick phone call to Rebecca, and I was like, so this is what we need to try and overcome. And she's like, I know this person. I can do an inform, you know, I can do a, you know, informal kind of check, so things like that that I definitely appreciate.\n\nInterviewer 11:57: Yeah, great. And and in terms of, well, actually, I'll come with that to the second. So Do they, do you leverage any of their like assessments or pay benchmarks? Are they? Are they important to you? Are they, you know, are they critical, in terms of you selecting them or not selecting them?\n\nSpeaker 1 12:19: Um, I would say it's really interesting because, um, so the the psychometric assessments, the K for D, I've actually got, you know, I think it's at midday today, I've got a session with that, with them to do feedback on on two candidates for this role that, that I just mentioned earlier. And I do appreciate that that's also part of the, you know, I think it's a really good kind of, you know, inclusion within kind of, you know, the overall, the overall service. About a couple of months ago, we were looking to appoint, we were looking at what we're going to do for a search within our technology space. And one of our, one of our, we've got like, five different shareholders. And one of the kind of the shareholders is Silver Lake. And so they're, obviously, you know, they're, they're quite heavily invested in terms of, you know, globally, in different markets around, you know, technology, and they use a couple of different search firms that they've got there, that they've got their, you know, negotiated kind of fees with, and all the rest of it. And they said, Look, we really like, well, we weren't pressured. That's the wrong say, but it was very much. We strongly advise that, you know, you are, you know, we would like you to meet with these two firms and kind of make your decision. So, you know, we did, in the end, we've decided we actually, we did. We did decide to appoint one of them, and they and they were good. -- 3 of 6 -- They did a great kind of, you know, pitch to us and all the rest of it. But interestingly, they were you and they are one of the other Shrek firms, but they were not going to any of their assessments. They were all that was all going to be plus. And I just thought, you know what I I think make. I was like, Have I been spoiled just because of the relationship we have with Korn Ferry? But for me, I find that for some of these, you know, key C suite roles, that's kind of the It's the basic thing nowadays, and the fact that they didn't, and I did ask the question, I was like, you know, you know, your competitors actually include this. And they were, you know, obviously they've got an answer for me or as to why they don't, but I do appreciate that side of and also to the comp Intel as well. For sure,\n\nInterviewer 14:45: is there anything else that you would expect all moving forward in terms of thinking about your broader challenges around kind of skills and workforce that you are looking for, a kind of a tech enabled or data kind of led consultancy on,\n\nSpeaker 1 15:05: you know, it's, it's really interesting, because I think again, one of the the process that, you know, when we were, when we were looking at that role, and obviously it was for a tech role. And, you know, I've never even asked Rebecca or the team at Korn Ferry, if this is, if this is possible. But, you know, all of the kind of the data sharing that was going to be all enabled through a platform, you know, that's where all of the kind of, you know, profiles are going to sit in a kind of, basically a hub. And, you know, I like that. But then I think, actually, I'm, you know, if Heiner, who is the key stakeholder here, and I don't mean to generalize my and I'm going to, and I'm saying, I'm apologizing for, I guess is, is that while you know some of my, you know, let's see you some of my leaders that I work with, particularly in the tech space, and some, maybe even in the finance space as well. They're very happily log into a portal, and right here's where all of my stuff is. And this is my one shop, one stop shop. And I'm going to also put my feedback in here. I think the reality is, is the demographic that we're working with with, you know, with Heiner in particular, like, you know, that's not how he's grown up in organizations. He's used to getting his, you know, report that, you know, we get sent through that's on email, you know, we're doing kind of, you know, feedback, either, you know, email, risk, you know feedback, or, you know, old call, phone call, like, what's the feedback kind of thing? So I, I think it very much depends on the stakeholders that you're working with as to whether or not that would be, that would be something that's valued or not. And I even know internally, we've got our own talent team that we use for, you know, every anything, anything sub 80,000 pounds in the UK, we, you know, our all our managers are encouraged to use our internal talent team, as opposed to going externally. And even getting people to use the ATS is tough, because they just want, you know, particularly if they've been working for 20 plus years or more, they're just kind of used to working in a certain way. And I have this, I know I have this thing where I think that in our personal lives, we are very happy to get an iPhone and use 10% of the functionality. Those that are really interested in knowing how it works more, we'll probably know 50% of the functionality, but we're actually okay to do a bit of a oh, well, we'll work it out for ourselves. Technology. But when it comes to what your work technology, most people expect, well, hang on, you haven't trained me on how to use this, and there's very different expectations. You're like, well, no one trains you how to use an iPhone. So why do you think you need to be, you know, no one trains you how to use Instagram, but you use it. Why do you think you should be trained to use, you know, an app that is going to help you do your job? So I think, you know, that's a very long answer to the question. But I think that\n\nSpeaker 2 18:18: if there's, if there's kind of newer\n\nSpeaker 1 18:23: ways of working that are going to be that are going to help the process, then brilliant. But if not, you know, I would much prefer that you know the investment to be made in in them spending time with getting to know the people that they're that they're introducing us to, and will they be successful in the roles that we're looking them to have, for them to feel for us?\n\nInterviewer 18:45: Yeah, do they, I mean, do they talk to you about preference of communication? And, you know, do you have regular\n\nSpeaker 1 18:51: -- 4 of 6 -- Yeah, absolutely, for you, definitely. And, and ultimately, you know, I feel very fortunate as I say. You know, Rebecca and I have an incredibly good relationship, you know, we will text, we will call, you know, weekends, late into the evening. You know, we're pretty, you know, we're absolutely respectful of each other. But no, we, you know, we've, we've been able to build that up. And I would say that that's probably the same for, you know, a couple of the people in the team that that that work with her. But, you know, we're and all of them are super responsive. And I must say, if you know, when you're writing up the report, Rebecca's EA her name's Lucy tres Gothic. I mean, she is amazing. She is, like, I've said this to Rebecca as well, like, she is the absolute benchmark of EAs I've ever worked with in, you know, my 2026, year old, you know, year old work career, she, she's brilliant. And you know that support team around make a real difference to how something, you know, is successful or not\n\nInterviewer 19:55: amazing. Is there anything that they could do better?\n\nSpeaker 1 20:00: Um, you know, I honestly, I don't think so, I mean, and I, I'm really thinking, I think that we had a really challenging search earlier in the year for this, for this central and western, Western European role where, you know, we were looking at, you know, and we don't give them easy briefs. It was, well, this person could be based in France, they could be based in Germany, they could be based in the Netherlands, they could be based in Spain, Portugal. So then all of a sudden, you're expecting them to be experts at, you know, or them, they're drawing on their on the teams within their those countries, they're on, okay, well, you're going to be an expert on, well, what is, you know, What would someone in who's going to be employed in Portugal, Portugal expect, versus someone in in Germany? I think, you know, there was some really challenging moments there, but it wasn't, it wasn't down to anyone not being responsible. You know, we were kind of in some uncharted territories for us, and so we were kind of working through those. But, yeah, it was no one's, I really can't think of anything that is that they could do more, you know, more of and, you know, they're so accommodating to us, like, you know, we, up until recently, haven't had an office in London, and we now I'm gonna call it an office. It's not really that much of an office, but, you know, so, you know, I can go in, I know I can contact Korn Ferry and say, Can we use your office? You know, I would never be so cheeky as to interview anyone who wasn't a Korn Ferry candidate there. But we've certainly, you know, I've certainly done meetings, you know, with my own team there about all my, all my boss on, on certain things, you know. So we're not just there when we're meeting candidates where, you know, and that's that's really appreciated very much. So\n\nInterviewer 21:55: how do they compare on things like price?\n\nSpeaker 1 21:59: You know, I think they're actually again, if I have used the most recent, the most use it, recent experience we had with one of the other Shrek firms, they're kind of all the same, really, like, I mean, you're, you know, they're, you know, you get your you get your kind of, you know what. And I find it really interesting that I've worked in HR for, you know, 25 years, probably the last, you know, 20 years kind of became, became, you know, more exposed to kind of the executive search. And I do find it interesting that in that 20 year period, the kind of a third of, you know, a third of the salary, and we're going to, you know, how we're going to pay, it's not really changed. It's very it's very consistent. So I think that for the for the price, you know, you obviously know that you're paying more, but at this, on the flip side, Rebecca is also very fair. When I've said to her, this is our fourth search in 12 months. What can you do for me. And, you know, she's she, she takes that on board. And my CFF that, you know, I'm working with him, he drives, he drives a whole bargain I can and he says to me, he's like, Well, you know, you can negotiate that. And I'm like, I'm not gonna negotiate it, like, so, you know, and, but we, and I'm really fair with her. I don't expect you guys to do this for free. I don't want you to do it for free, but help me out here. I've got to show him something. And, you know, we work together to kind of go, Yep, we've got it for this so, but I do think, for the money that we pay, you know, the service absolutely backs it up, absolutely\n\nInterviewer 23:39: great. I think that's it. That's that's really helpful. I do really appreciate your you kind of go getting into the detail with me. My pleasure. Well, lovely to meet you and have and you -- 5 of 6 -- Unknown Speaker 23:53 enjoy the rest of your week. Yeah,\n\nInterviewer 23:54: likewise. Thanks. Briony, thanks. Interviewer, bye. God. Transcribed by https://otter.ai -- 6 of 6 --"
}