{
  "id": "t-019",
  "sourceFile": "T14_NPS10_NA_ES_MARQUEE_OCT25.pdf",
  "client": "Dawn Willoughby",
  "interviewDate": "2025-10-14",
  "project": "Executive Search",
  "score": 10,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Interviewer 0:00",
      "text": "I'm good. How are you? I'm good. Thank you. Nice to meet you. Yes, nice to meet you. Thanks for going to do the follow up interview. So your response on your NPS score, just quickly before I start a couple of admin pieces. Are you all right? If I record this, it's for my team to help me write up the notes. Great. Thank you. And just to introduce myself, I'm Interviewer, so I'm the managing partner at a growth consultancy. We've worked with Korn Ferry for the last five years, so they've asked us to do these interviews, so hopefully to encourage you to speak more freely and give more honest feedback. So yeah, please feel free to speak your mind. Obviously, everything that we that you say, gets kind of wrapped back into a more aggregated feedback so they can continue to make improvements to their service. Great, great. Well, I'll try not to hold up you too long, so I don't think we'll need the whole half an hour. But if we can kick off by just starting off with who you are in your role and the relationship that you have with Korn Ferry, sure."
    },
    {
      "speaker": "Speaker 1 1:15",
      "text": "So my name is Dawn Willoughby, and my background is consumer packaged goods. So I spent my career at Procter and Gamble and Clorox, and since then, have been doing board work. I've been familiar with Korn Ferry, just from a recruiting perspective, where I've had contact about myself being a candidate, and then got engaged with them more deeply with IFF, which is the company that we're talking about, where I chair the Governance Committee. We did an RFP where we looked at several different firms, kind of the large firms you can imagine, or US based companies. And through that process, selected Korn Ferry as as the company we wanted to go with. We're making quite a few changes to our non executive directors, and wanted to select a firm that we could work with for the long term, that would know and be able to shape the board."
    },
    {
      "speaker": "Speaker 2 2:13",
      "text": "And if we start, I suppose, at the RFP process, what were the key"
    },
    {
      "speaker": "Interviewer 2:19",
      "text": "success factors, or key KPIs that you were looking for that made you select Korn"
    },
    {
      "speaker": "Speaker 1 2:24",
      "text": "Ferry, sure. So we were looking for somebody highly networked, so with no top candidates, and that had a process that we felt like fit well with IFF process and culture, having somebody as the point person that was well known was important to us. And Korn Ferry came up with Jane Stevenson, who I hadn't had exposure to, and I'm trying to think, I'm not sure any of us had had direct exposure to her on the selection committee, but was well known in the industry when we did the checks, and obviously she has a strong network, we were also impressed with kind of the strategic point of view that Korn Ferry brought during the RFP process about a broad look and how to shape a board Thinking, because we had multiple candidates we were looking for how to shape the board. Think about timing considerations, committee considerations, etc, so the strategic view mattered versus opportunistic, like we're just going after the let's get this person and this person, etc, but let's look holistically. So that was set Korn Ferry apart. The other thing that set Korn Ferry apart was Gary's engagement the CEO at that point where we're doing the RFP, I was a committee member, and now our now board chair, Kevin O'Byrne, was chairing governance back at that time. But Gary not only met with the selection committee, but also met with with Kevin, who at that point was the chair of governance, and I believe even in person over in London, and he may have also had connection with our CEO, Eric feyold, at that time. And so that showed us commitment to our long term partnership, and actually was a big difference maker. We didn't have that senior, you know, top person connection at the other at the other firms where we did the RFP. So not only did we like the process, strategic lens, Jane's capability with her team, but also the engagement from Gary told us that this could be a long term commitment, that that Korn Ferry was was interested in, right? -- 1 of 4 --"
    },
    {
      "speaker": "Interviewer 4:53",
      "text": "And has that lived up to your expectations? How has, how has the process been? To date,"
    },
    {
      "speaker": "Speaker 1 4:59",
      "text": "excellent, and we're in a bit of a pause, I would say we brought on. Gosh, you want to say ferry maybe five directors, four or five directors, with our Korn Ferry engagement, and have a have had a bit of on our side, on again, off again. Let's wait. Let's go fast, wait. Let's change the criteria in order. So it has been amazing that Jane, I say Jane, but I mean her whole team, but Jane and team were able to kind of work with us during all of that and keep the candidates interested in that during that timeframe. You know, it's as a candidate, you sit there and it's a little bit well, let's go fast. Wait. They want to hold a little bit, and if especially, I mean, the candidates we brought on were seasoned, so they're aware of of what goes on in a board and why that may happen. But nonetheless, Korn Ferry worked with us side by side, and terrifically, I can't say, say enough about it from that aspect. If there were any missteps, it was from our side. And we did get into, I would say, a little bit of a pickle with one of the candidates, but it's because on our side, we had connections with the candidate, and kind of move fast, without keeping Jane engaged, etc, and but we worked through all that and ended up in a"
    },
    {
      "speaker": "Interviewer 6:29",
      "text": "good spot, amazing and digging deeper into, I suppose, communications and managing those expectations were they set out from the outset. So did Jane and the team kind of understand your preferences for how you want to be communicated and kept up to date. Did they meet those expectations? Was it regular, or was it more ad hoc?"
    },
    {
      "speaker": "Speaker 1 6:53",
      "text": "They we didn't really talk about a formal communication process, how this would happen. We did engage on who really needed to be Tid on these searches, and that was a little tough, because it was myself, the chair, the CEO and and they didn't necessarily have a point person. Let's put it that way, because we were all running fast on our side. I always did think, okay, when I get a chance to take a breath with all these searches going on, I would recap with Jane, Hey, how can we be more effective with you on this? Because I tend to just email or text her. I know she works with a whole team, and I did ask her briefly about that, and she said, if you get a communication to any of us, we'll get the team engaged. So, you know, perhaps an efficiency way would be for me to understand, hey, who do you want me to connect with, on your side, on the coal group. But it worked out fine, because I always use Jane as my point of contact, and she is a dynamo. And crazily, I don't think ever took a weekend or evening off or must, because of the way that, you know, the way that she and her team work,"
    },
    {
      "speaker": "Interviewer 8:04",
      "text": "absolutely brilliant. And then in terms of, I suppose, the candidates that you have filled, have they, well, first of all, did, did they bring enough choice to the table? Was the quality good enough? So, quality and quantity of selection."
    },
    {
      "speaker": "Speaker 1 8:22",
      "text": "Yeah, it was great. We had some candidates come in through board members that got put into the pool that were good candidates. And instead of just they were great candidates. And instead of just going with them, they would come up with other options. So we had people to compare against, and they weren't just, let's put them on paper options, but they were also excellent candidates. We did, I don't know, always, I guess in the two instances, we did end up selecting the ones that were sort of brought forward through some of the board networks, but obviously vetted through Korn Ferry, not all of them, actually, but a couple we did and but we felt like we had a good, a good slate to look at and do some comparison and make some selection. James also was really helpful, just from, let's think about it from this angle. You know, what does this person bring? Or, you know, is there baggage that would come with their name on your board, sort of thing? And so she, and she obviously has a strong network, so was able to do some references, or back door references to kind of help us understand, were there things that we would need to check out in more depth during our interview process? So all of that worked out terrifically. She was definitely whether we brought forward a candidate or Korn Ferry found a candidate, they were all treated as equal. And let's really look at the full slate and how this impacts the total board. So yes, the slate was always good. There was one slate that wasn't as strong for one of the candidates and for one of the positions we were looking to fill. And we reviewed kind of the original before they reached out. And I did say these don't feel at the caliber of what we've -- 2 of 4 -- delivered for the other candidates. You know, is there a reason for that? Is, is there something about our company in this type of role, who we're looking for, that they wouldn't be candidates, wouldn't be interested. But then they came back with a slate that I would say was an A list slate, just like they had for the other other roles. One thing to note about how, you know, Jane and her team's approach, because she's so networked, we were able to even connect with some candidates that were on the very forefront, say they were recently retiring, and able to come up with an, you know, think about another board, etc. So I do feel like utilizing Korn Ferry, we got a bit of a upper hand on, you know, and it just knowledge about this candidate will become available, which is obviously critically important to have that as we're thinking about the caliber, you know, the top level caliber that that we want and that we've selected."
    },
    {
      "speaker": "Interviewer 11:19",
      "text": "So the network was, is, was critical in terms of, I suppose, what else Korn Ferry brought to the table? Did you utilize any of their assessment tools or pay benchmarks, or any other parts of the business?"
    },
    {
      "speaker": "Speaker 1 11:35",
      "text": "Well, for the board positions, we didn't. We utilized Korn Ferry on the background checks. And even as we've had members that have not come through Korn Ferry, we have a cooperation agreement with an investor, an activist investor, where they select the candidates. And in those instances, we also use the background check, which I know is outsourced, but just as works well for us. I do like as well. It keeps Jane abreast of who's on our board and who we're considering with these while we haven't, of the late had conversations about the the two we're bringing on from a just, hey, what do you know about this person and what do we need to be thinking about? I know that she's engaged with it, because it's going through her team, etc, so that that's been, been of help. We also did a bit of an RFP on CEO succession. So this is separate from our Ned searches. Obviously had Korn Ferry in the mix for that, and did select Korn Ferry, and specifically working with Jane, knowing that CEO being a board member is critical, so that link is critical, and then obviously had such a good experience with with her on the on the NED searches, that as we were thinking about, Who do we want to work with on the CEO succession, which to your question, does encompass assessment tools and some of those sorts of things we knew that would be a good match. So I think it just shows the initial from the initial RFP process where she outlined more of the strategic approach and long term partnership value, you know, is playing out for us here. Great."
    },
    {
      "speaker": "Interviewer 13:24",
      "text": "And I mean, is there anything that you that they could do better, so that you would expect to see from them, or, you know, any incremental, small changes that would improve your experience to date? Yeah."
    },
    {
      "speaker": "Speaker 1 13:42",
      "text": "Think about it in general? No, but I'm sure there's some around the edges that that would be meaningful. I think we did add to our profiles when we would look at initial slate revenue and market cap. Well, I don't think we had market cap in there originally. It's important to see the market cap. Obviously different industries have different scale that they're looking at. So I liked seeing that with the candidates. What sort of size business, scale business are they working with? Perhaps seeing some TSR during the 10 years for the CEO candidates and CFF candidates, particularly where it's more easily measurable. Hey, they were in their CFO role for these eight years. What was the TSR? And obviously there's plenty of reasons, cyclicality, etc, that doesn't have that be the be all, end all, but it is important to see what were the results. Yeah. Now we didn't necessarily need that data point, because Jane knows these people well, and knows how they're thought of in the industry, and is very willing to say, like, Yeah, I know this person has x reputation, but they also have Y, this y reputation that maybe is not as public. And we, you know, need to think about those, those two things. So that might be some trimming around the edges that would be helpful, you know, in the future process. So when we work, work with Jane, I mean, because it's Jane, I don't feel like I need it as much. And obviously, as we get down to a short list, we can always look up, you know, what have that person's results, shareholder results, been during that timeframe? It is unique in this search world. I don't feel like that. The person is so important, right in this it's Jane and her network, and she's obviously been there a long time, and it's got to be, you know, tough as Korn Ferry thinks about is, you know, I don't know what her tenure is going to be in terms of, is she going to work forever? But when she doesn't, it's not as easy as pass the torch directly to someone on the team, because they don't have those connections and network and history and those sorts of things. So at this point, you know, it's been a -- 3 of 4 -- short period of time that we've been working with Korn Ferry and Jane specifically. But you know, that's obviously always a question mark. You know, how do those relationships transition when somebody decides, you know, if they decide to retire or what have you? And hopefully Jane works forever, at least in my tenure with"
    },
    {
      "speaker": "Interviewer 16:26",
      "text": "and I can't answer that one. And I suppose, on the flip side of that, you know, kind of relationships and network and kind of black book is key, how about and I suppose this is a broader question that's not necessarily related just to Korn Ferry. But how important at a board level is it to you that, I suppose organization, consultancies that you work with, bring in the data, the insight and the tech piece into I suppose you know, not only hiring, but also workforce management and everything else around, kind of org design."
    },
    {
      "speaker": "Speaker 1 17:07",
      "text": "Well at IFF it is important, because that company is going through a lot of change, and so having the call it background data that leads to the insights, and then what we do about it is important. One of the areas that Jane and team pulled together was as we started changing candidates and config and determining kind of what does an end state for our board look like they put together. Call it a matrix, not a normal skills matrix, a little more in depth to see here's, here's what, here's what the end state looks like, and are we, what gaps do we have to fill as we think about the final one or two candidates that we pull in? So that was really helpful, and particularly because, as I mentioned, we are going through a lot of change at IFF, so a lot of those, what I'll say, foundational documents that I use in other boards that have been bit more stable over time. You know, we can do that on our own because they've been in place. It's not like we're making changes to half the board at one time. So maybe in those situations it's not as relevant. But for IFF it has been very relevant."
    },
    {
      "speaker": "Interviewer 18:22",
      "text": "Okay, great. I think that's probably it. That's been really helpful. Unless there's anything else that you think would be useful to share at this stage,"
    },
    {
      "speaker": "Speaker 1 18:32",
      "text": "I don't. I think the areas that I had on my mind that I thought would be relevant for this we've already discussed,"
    },
    {
      "speaker": "Interviewer 18:39",
      "text": "amazing, brilliant. Well, Dawn. Thank you very much for your time. I really appreciate it and for speaking so openly. Unknown Speaker 18:45 Absolutely good and nice. Thank you. Unknown Speaker 18:47 Thanks, Dawn. Bye. Transcribed by https://otter.ai -- 4 of 4 --"
    }
  ],
  "rawText": "Interviewer 0:00: I'm good. How are you? I'm good. Thank you. Nice to meet you. Yes, nice to meet you. Thanks for going to do the follow up interview. So your response on your NPS score, just quickly before I start a couple of admin pieces. Are you all right? If I record this, it's for my team to help me write up the notes. Great. Thank you. And just to introduce myself, I'm Interviewer, so I'm the managing partner at a growth consultancy. We've worked with Korn Ferry for the last five years, so they've asked us to do these interviews, so hopefully to encourage you to speak more freely and give more honest feedback. So yeah, please feel free to speak your mind. Obviously, everything that we that you say, gets kind of wrapped back into a more aggregated feedback so they can continue to make improvements to their service. Great, great. Well, I'll try not to hold up you too long, so I don't think we'll need the whole half an hour. But if we can kick off by just starting off with who you are in your role and the relationship that you have with Korn Ferry, sure.\n\nSpeaker 1 1:15: So my name is Dawn Willoughby, and my background is consumer packaged goods. So I spent my career at Procter and Gamble and Clorox, and since then, have been doing board work. I've been familiar with Korn Ferry, just from a recruiting perspective, where I've had contact about myself being a candidate, and then got engaged with them more deeply with IFF, which is the company that we're talking about, where I chair the Governance Committee. We did an RFP where we looked at several different firms, kind of the large firms you can imagine, or US based companies. And through that process, selected Korn Ferry as as the company we wanted to go with. We're making quite a few changes to our non executive directors, and wanted to select a firm that we could work with for the long term, that would know and be able to shape the board.\n\nSpeaker 2 2:13: And if we start, I suppose, at the RFP process, what were the key\n\nInterviewer 2:19: success factors, or key KPIs that you were looking for that made you select Korn\n\nSpeaker 1 2:24: Ferry, sure. So we were looking for somebody highly networked, so with no top candidates, and that had a process that we felt like fit well with IFF process and culture, having somebody as the point person that was well known was important to us. And Korn Ferry came up with Jane Stevenson, who I hadn't had exposure to, and I'm trying to think, I'm not sure any of us had had direct exposure to her on the selection committee, but was well known in the industry when we did the checks, and obviously she has a strong network, we were also impressed with kind of the strategic point of view that Korn Ferry brought during the RFP process about a broad look and how to shape a board Thinking, because we had multiple candidates we were looking for how to shape the board. Think about timing considerations, committee considerations, etc, so the strategic view mattered versus opportunistic, like we're just going after the let's get this person and this person, etc, but let's look holistically. So that was set Korn Ferry apart. The other thing that set Korn Ferry apart was Gary's engagement the CEO at that point where we're doing the RFP, I was a committee member, and now our now board chair, Kevin O'Byrne, was chairing governance back at that time. But Gary not only met with the selection committee, but also met with with Kevin, who at that point was the chair of governance, and I believe even in person over in London, and he may have also had connection with our CEO, Eric feyold, at that time. And so that showed us commitment to our long term partnership, and actually was a big difference maker. We didn't have that senior, you know, top person connection at the other at the other firms where we did the RFP. So not only did we like the process, strategic lens, Jane's capability with her team, but also the engagement from Gary told us that this could be a long term commitment, that that Korn Ferry was was interested in, right? -- 1 of 4 --\n\nInterviewer 4:53: And has that lived up to your expectations? How has, how has the process been? To date,\n\nSpeaker 1 4:59: excellent, and we're in a bit of a pause, I would say we brought on. Gosh, you want to say ferry maybe five directors, four or five directors, with our Korn Ferry engagement, and have a have had a bit of on our side, on again, off again. Let's wait. Let's go fast, wait. Let's change the criteria in order. So it has been amazing that Jane, I say Jane, but I mean her whole team, but Jane and team were able to kind of work with us during all of that and keep the candidates interested in that during that timeframe. You know, it's as a candidate, you sit there and it's a little bit well, let's go fast. Wait. They want to hold a little bit, and if especially, I mean, the candidates we brought on were seasoned, so they're aware of of what goes on in a board and why that may happen. But nonetheless, Korn Ferry worked with us side by side, and terrifically, I can't say, say enough about it from that aspect. If there were any missteps, it was from our side. And we did get into, I would say, a little bit of a pickle with one of the candidates, but it's because on our side, we had connections with the candidate, and kind of move fast, without keeping Jane engaged, etc, and but we worked through all that and ended up in a\n\nInterviewer 6:29: good spot, amazing and digging deeper into, I suppose, communications and managing those expectations were they set out from the outset. So did Jane and the team kind of understand your preferences for how you want to be communicated and kept up to date. Did they meet those expectations? Was it regular, or was it more ad hoc?\n\nSpeaker 1 6:53: They we didn't really talk about a formal communication process, how this would happen. We did engage on who really needed to be Tid on these searches, and that was a little tough, because it was myself, the chair, the CEO and and they didn't necessarily have a point person. Let's put it that way, because we were all running fast on our side. I always did think, okay, when I get a chance to take a breath with all these searches going on, I would recap with Jane, Hey, how can we be more effective with you on this? Because I tend to just email or text her. I know she works with a whole team, and I did ask her briefly about that, and she said, if you get a communication to any of us, we'll get the team engaged. So, you know, perhaps an efficiency way would be for me to understand, hey, who do you want me to connect with, on your side, on the coal group. But it worked out fine, because I always use Jane as my point of contact, and she is a dynamo. And crazily, I don't think ever took a weekend or evening off or must, because of the way that, you know, the way that she and her team work,\n\nInterviewer 8:04: absolutely brilliant. And then in terms of, I suppose, the candidates that you have filled, have they, well, first of all, did, did they bring enough choice to the table? Was the quality good enough? So, quality and quantity of selection.\n\nSpeaker 1 8:22: Yeah, it was great. We had some candidates come in through board members that got put into the pool that were good candidates. And instead of just they were great candidates. And instead of just going with them, they would come up with other options. So we had people to compare against, and they weren't just, let's put them on paper options, but they were also excellent candidates. We did, I don't know, always, I guess in the two instances, we did end up selecting the ones that were sort of brought forward through some of the board networks, but obviously vetted through Korn Ferry, not all of them, actually, but a couple we did and but we felt like we had a good, a good slate to look at and do some comparison and make some selection. James also was really helpful, just from, let's think about it from this angle. You know, what does this person bring? Or, you know, is there baggage that would come with their name on your board, sort of thing? And so she, and she obviously has a strong network, so was able to do some references, or back door references to kind of help us understand, were there things that we would need to check out in more depth during our interview process? So all of that worked out terrifically. She was definitely whether we brought forward a candidate or Korn Ferry found a candidate, they were all treated as equal. And let's really look at the full slate and how this impacts the total board. So yes, the slate was always good. There was one slate that wasn't as strong for one of the candidates and for one of the positions we were looking to fill. And we reviewed kind of the original before they reached out. And I did say these don't feel at the caliber of what we've -- 2 of 4 -- delivered for the other candidates. You know, is there a reason for that? Is, is there something about our company in this type of role, who we're looking for, that they wouldn't be candidates, wouldn't be interested. But then they came back with a slate that I would say was an A list slate, just like they had for the other other roles. One thing to note about how, you know, Jane and her team's approach, because she's so networked, we were able to even connect with some candidates that were on the very forefront, say they were recently retiring, and able to come up with an, you know, think about another board, etc. So I do feel like utilizing Korn Ferry, we got a bit of a upper hand on, you know, and it just knowledge about this candidate will become available, which is obviously critically important to have that as we're thinking about the caliber, you know, the top level caliber that that we want and that we've selected.\n\nInterviewer 11:19: So the network was, is, was critical in terms of, I suppose, what else Korn Ferry brought to the table? Did you utilize any of their assessment tools or pay benchmarks, or any other parts of the business?\n\nSpeaker 1 11:35: Well, for the board positions, we didn't. We utilized Korn Ferry on the background checks. And even as we've had members that have not come through Korn Ferry, we have a cooperation agreement with an investor, an activist investor, where they select the candidates. And in those instances, we also use the background check, which I know is outsourced, but just as works well for us. I do like as well. It keeps Jane abreast of who's on our board and who we're considering with these while we haven't, of the late had conversations about the the two we're bringing on from a just, hey, what do you know about this person and what do we need to be thinking about? I know that she's engaged with it, because it's going through her team, etc, so that that's been, been of help. We also did a bit of an RFP on CEO succession. So this is separate from our Ned searches. Obviously had Korn Ferry in the mix for that, and did select Korn Ferry, and specifically working with Jane, knowing that CEO being a board member is critical, so that link is critical, and then obviously had such a good experience with with her on the on the NED searches, that as we were thinking about, Who do we want to work with on the CEO succession, which to your question, does encompass assessment tools and some of those sorts of things we knew that would be a good match. So I think it just shows the initial from the initial RFP process where she outlined more of the strategic approach and long term partnership value, you know, is playing out for us here. Great.\n\nInterviewer 13:24: And I mean, is there anything that you that they could do better, so that you would expect to see from them, or, you know, any incremental, small changes that would improve your experience to date? Yeah.\n\nSpeaker 1 13:42: Think about it in general? No, but I'm sure there's some around the edges that that would be meaningful. I think we did add to our profiles when we would look at initial slate revenue and market cap. Well, I don't think we had market cap in there originally. It's important to see the market cap. Obviously different industries have different scale that they're looking at. So I liked seeing that with the candidates. What sort of size business, scale business are they working with? Perhaps seeing some TSR during the 10 years for the CEO candidates and CFF candidates, particularly where it's more easily measurable. Hey, they were in their CFO role for these eight years. What was the TSR? And obviously there's plenty of reasons, cyclicality, etc, that doesn't have that be the be all, end all, but it is important to see what were the results. Yeah. Now we didn't necessarily need that data point, because Jane knows these people well, and knows how they're thought of in the industry, and is very willing to say, like, Yeah, I know this person has x reputation, but they also have Y, this y reputation that maybe is not as public. And we, you know, need to think about those, those two things. So that might be some trimming around the edges that would be helpful, you know, in the future process. So when we work, work with Jane, I mean, because it's Jane, I don't feel like I need it as much. And obviously, as we get down to a short list, we can always look up, you know, what have that person's results, shareholder results, been during that timeframe? It is unique in this search world. I don't feel like that. The person is so important, right in this it's Jane and her network, and she's obviously been there a long time, and it's got to be, you know, tough as Korn Ferry thinks about is, you know, I don't know what her tenure is going to be in terms of, is she going to work forever? But when she doesn't, it's not as easy as pass the torch directly to someone on the team, because they don't have those connections and network and history and those sorts of things. So at this point, you know, it's been a -- 3 of 4 -- short period of time that we've been working with Korn Ferry and Jane specifically. But you know, that's obviously always a question mark. You know, how do those relationships transition when somebody decides, you know, if they decide to retire or what have you? And hopefully Jane works forever, at least in my tenure with\n\nInterviewer 16:26: and I can't answer that one. And I suppose, on the flip side of that, you know, kind of relationships and network and kind of black book is key, how about and I suppose this is a broader question that's not necessarily related just to Korn Ferry. But how important at a board level is it to you that, I suppose organization, consultancies that you work with, bring in the data, the insight and the tech piece into I suppose you know, not only hiring, but also workforce management and everything else around, kind of org design.\n\nSpeaker 1 17:07: Well at IFF it is important, because that company is going through a lot of change, and so having the call it background data that leads to the insights, and then what we do about it is important. One of the areas that Jane and team pulled together was as we started changing candidates and config and determining kind of what does an end state for our board look like they put together. Call it a matrix, not a normal skills matrix, a little more in depth to see here's, here's what, here's what the end state looks like, and are we, what gaps do we have to fill as we think about the final one or two candidates that we pull in? So that was really helpful, and particularly because, as I mentioned, we are going through a lot of change at IFF, so a lot of those, what I'll say, foundational documents that I use in other boards that have been bit more stable over time. You know, we can do that on our own because they've been in place. It's not like we're making changes to half the board at one time. So maybe in those situations it's not as relevant. But for IFF it has been very relevant.\n\nInterviewer 18:22: Okay, great. I think that's probably it. That's been really helpful. Unless there's anything else that you think would be useful to share at this stage,\n\nSpeaker 1 18:32: I don't. I think the areas that I had on my mind that I thought would be relevant for this we've already discussed,\n\nInterviewer 18:39: amazing, brilliant. Well, Dawn. Thank you very much for your time. I really appreciate it and for speaking so openly. Unknown Speaker 18:45 Absolutely good and nice. Thank you. Unknown Speaker 18:47 Thanks, Dawn. Bye. Transcribed by https://otter.ai -- 4 of 4 --"
}