{
  "id": "t-011",
  "sourceFile": "T6_NPS9_NA_ES_MARQUEE_SEP25.pdf",
  "client": "Michael Baker",
  "interviewDate": "2025-09-23",
  "project": "Exec Search",
  "score": 9,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Speaker 2 2:59",
      "text": "to you. Yeah. Thank you. Yeah. So first things first, before we jump in, are you happy for me to record this? It's for my team, so they can help me do the report. 100% Yep, no problem. And then then it gets deleted afterwards, it doesn't get saved on the system. Unknown Speaker 3:17 Totally fine. So yeah, thank you"
    },
    {
      "speaker": "Speaker 2 3:19",
      "text": "for agreeing to do this, and for filling in the NPS score, I,"
    },
    {
      "speaker": "Interviewer 3:27",
      "text": "I head up a consulting firm we've been working with Korn Ferry for the last five years, so we know their business really well, and they've asked us to lead on these interviews, so hopefully we can get a little bit more transparency, and we encourage you to be as honest as possible. It's very much around their commitment towards customer experience and continuous improvement. So the more you can share your experiences, the better we can make it in"
    },
    {
      "speaker": "Speaker 3 3:55",
      "text": "the future. Happy to do it great."
    },
    {
      "speaker": "Interviewer 3:58",
      "text": "So it'd be great if you could just start with explaining your role and your I suppose your relationship or an engagement with Korn Ferry to date,"
    },
    {
      "speaker": "Speaker 1 4:09",
      "text": "yeah, for sure. So my role at Cargill is I manage our executive recruitment. And this might seem kind of surprising, but we only have one executive recruiter at Cargill, and that's me. I have a one partner that I work with. Her name is Molly, and she handles sort of all the coordination and logistics and scheduling and and much more. But it's just us. It's so that we do everything. I've been here for about five years, and I've been in this role for about two I think. And so I've used Korn Ferry a fair amount. I do not use them exclusively. They know that. I usually recommend several options to our leaders and say, hey, you know you're the expert in accounting, or you're the expert in technology. I want you to pick the firm you feel most comfortable with, but funny, quirky connection on this role. So the woman who heads up like the accounting executive practice, Chief accounting officer practice at Korn Ferry was actually the Director of Career and Professional Development At my law school, which is hysterical. Yeah, it's really funny. So when I was like, and I can talk about my age, when I was like, I don't know, 29 years old, 27 years old, and I was running around law school in downtown Minneapolis here, Ashley Bose Johnson was in charge of helping all of us students find, you know, jobs upon graduation. And so then, of course, we had, like, a 10 year sort of where we didn't chat at all, and totally randomly, I was like, You're a Korn Ferry. Like, I didn't know you did this kind of work. And, you know, that was by no means why we selected them, but it is a funny kind of connection of how our our lives came to bet gather after, you know, years and years, you know, I'm pretty I'm pretty tough on search firms because I used to do headhunting myself. I hold them to a very high standard. I don't like cargo paying fees for hiring internal candidates or hiring somebody that our CFO worked with a General Mills like, you know I don't need to pay you $200,000 to call somebody for me. Korn Ferry understands that. They know that they believe that. To me, your fee is earned in three ways. One, you find somebody I didn't know about, right? And just tell me, Hey, what about Interviewer like, well, I already know Interviewer like, that's you know, to engaging them, getting them on the phone, and them believing that you have substantive media roles that they would want to hear about, like -- 1 of 7 -- becoming the next chief accounting Officer of Cargill, the largest privately held company in the United States, which I would say is kind of a cool job, if that's what you want to do. And then third, you know, shepherding them through the process, being a Sherpa for them, being a guide, being a broker between the two of us and and really not making it like candidate versus Cargill. It's a, it's a, should be a copacetic, harmonious, you know, connection. And I'm kind of going beyond your question, but"
    },
    {
      "speaker": "Speaker 2 7:50",
      "text": "I mean, you're only answering my next question, yeah, well, good."
    },
    {
      "speaker": "Speaker 1 7:55",
      "text": "You know, I'd say they were, they did a really phenomenal job on this search. You know, the proof is always in the pudding, right? Like, how did this end? Well, Cargill ended up getting an awesome human being who is, you know, the chief accounting Officer of one of the largest oil and gas companies in the world, and he's here, and he's great, and I'm having lunch with him next week."
    },
    {
      "speaker": "Speaker 2 8:21",
      "text": "So amazing. Yeah, digging into, I suppose, the end to end experience. How I mean, I suppose, in terms of expectations and the"
    },
    {
      "speaker": "Interviewer 8:37",
      "text": "the reality of when you engage them, did they help craft the job role to how much did they kind of advise on that, that it was done? So where did they really come in, what worked really well, and what, what necessarily didn't,"
    },
    {
      "speaker": "Speaker 1 8:52",
      "text": "you know, they didn't help us craft the role. I mean, it was a pretty finite position, right? Because, I mean, our chief accounting office, this is not a secret. It's well known. She was essentially recruited out by a major competitor. So the role was pretty well defined. They did help us, though. The person who had that role before her name was, we'll just call her cn, her initials, lovely person. There's no bad blood or, you know, Ill Will here. Her role was very big, like very big. They did thought partner with us on okay, if this is somebody's first rodeo, maybe they don't take on the full remit that Carrie had, or if it's somebody super senior like Charlie gear who joined us, maybe they do. They were a good thought partner on that. They were really good thought partner on process, like who the candidate should interview with. In fact, they were, they were bold and said, Hey, you really should have your audit chair from the board meet with this candidate. And that was something that we were contemplating, but we weren't firm on. So, you know, Ashley and Michael were, you know, when you go to the doctor and the doctor doesn't ask you, like, what you think is wrong with you, they're like, here's what's wrong with you, and here's what you need to do. They were the latter, like it was obvious that they were experts. They had command. They weren't bullish or rude, but they were never shy about like, hey, we think you guys should do this. Or, you know, we think this process is taking too long. You're going to lose engagement from this person, or whatever they spoke up when they needed to great."
    },
    {
      "speaker": "Interviewer 10:44",
      "text": "And then in terms of, I suppose, leaning into using some of their benchmarks and things, was that something that that happened here? Did they look at kind of pay benchmarks? Did they do assessments? All of that was part of the x, and is that a reason to have chosen them, or is that something that you would expect?"
    },
    {
      "speaker": "Speaker 1 11:05",
      "text": "I would expect that, you know, I would expect at this level, and you know, for, you know, multi $100,000 fee, you should do that. But that doesn't take away from the fact that they did it very well. Like I said, I have high expectations of these firms, right? You should know who the fortune 500 Well, maybe not 500 but fortune 100 fortune 200 caos are. You should be able to get some of them to the table. You should know generally what their compensation is. I mean, it's getting a little harder with the United States laws to know all those things. Some of these people. You probably know this Interviewer, if they're at a publicly traded company, their salaries might have to be disclosed. So in that case, it's very easy to find them through proxy statements to shareholders and things like that. You have a company like Cargill, you can't find out what our CHRO or our sido makes, right? In fact, I might not even know that. It's not as it's not as interesting as you think it might be. Let me just tell you, -- 2 of 7 -- we're quite boring. People think we're a lot more interesting than we are. I sometimes joke that people see the show succession on HBO, and they're like, Oh, is that what cargo is like? And I just laugh. I'm like, that is this company. This company is run by a family of very lovely, low profile, nice, calm people, but yeah, so they knew all that stuff. They knew what these people earned. They had good command of their compensation. The one thing you brought up that I want to touch on for sure is assessment. Now, this is not Korn Ferry's fault at all. This was a learning for all of us, but Korn Ferry does this assessment called the Korn Ferry 4d or something. I don't know. It's a very quick assessment. There's nothing wrong with it, but it's like 30 minutes. The candidate takes a quiz, we fill out a quiz, and then they sort of mash up, okay, is this person a fit or not? Yeah. At our company, we use a wholly separate, very, very intense six hour assessment. Now, whether that's necessary, it's a moot point. We do it. Our executive team wants us to do it. There's no getting around it. So this term assessment means a lot of different things to a lot of different people. To us, it means this six hour, you know, deep dive cycle metric. Who is Interviewer, you know, like, you know, you getting into, yeah, right, terrifying, right? I don't want to, I don't want to take one of these. I'd probably be locked out immediately afterwards. But one recommendation or suggestion is make sure that they tell the client early that, hey, this is our assessment. And essentially ask the client, do you want us to do this or not? Because when you get and theirs is included part and parcel, right? So it's free, it's part of the deal. Ours is not free. Let me just tell you, it's quite expensive, quite involved and very"
    },
    {
      "speaker": "Speaker 2 14:22",
      "text": "by a third party. Michael, yes, it is, yep, a potential competitor in some ways"
    },
    {
      "speaker": "Speaker 1 14:28",
      "text": "to come back, yes, 100% it's a direct competitor. So now I will tell you this with these people. You know you're talking about the chief accounting Officer of Pepsi or Halliburton. These people's time is worth a lot, right? 1000s of dollars an hour, and even if they're lovely people, we need to be respectful of their time, right? So in Korn Ferry, the one thing, one takeaway, the little bumpy road in this search, was we didn't know they were doing that automatically, and we didn't necessarily tell them, hey, although they should know this, because they worked with us a lot, we're going to put them through a really deep assessment towards the end of this. So don't do that. Don't make them do both. It's it's just a lot, yeah, and that was a learning from now, my flag goes up right away, and I'm like, Hey, Korn Ferry. You probably know this, but I'm going to remind you, we do ours. You do not need to do yours. Now, the wrinkles is on lower level roles, we don't do our assessment, so their assessment actually has some value, right? And I've seen some of our teams, particularly in in APAC, they love these things, right? Because they're like, well, Korn Ferry is going to assess something. I'm like, Hold on guys, like, it's a, it's a 30 minute quiz. Like, let's not, this isn't the gospel, according to Korn Ferry, it's, it's just one little data piece. But to be fair, if it's free and it's included and we don't do ours, it is a nice add on. So that would be, my only recommendation, is make sure you have a very clear conversation with your client about your assessment, whether they have one, and whether it makes sense to do both. Yeah, upfront,"
    },
    {
      "speaker": "Speaker 2 16:21",
      "text": "I suppose, building on that point, how did you find overall communication, so in terms of, you know, project management and understanding how progress has been made. Did that meet expectations? Was it a regular kind of meeting? How did it work?"
    },
    {
      "speaker": "Speaker 1 16:37",
      "text": "Yeah, we met every week. You know, I would text with Ashley regularly about certain matters. I mean, I drive these people around when they come visit. I literally go pick them up to the airport, bring them to Cargill, show them. I'm kind of like, their their wedding planner, you know, their guide. And so I would even be texting Ashley, you know, while they were here. I'm like, you know, I think it's going really well. I think Charlie's having a nice time, like he's funny. I didn't know he collected comic books. It's funny. These people are all just people at the end of the day. Yeah, they're their communication was exemplary. Unknown Speaker 17:14 And in terms of, then kind of,"
    },
    {
      "speaker": "Speaker 2 17:20",
      "text": "-- 3 of 7 -- the contracts compensation? Was that something that they ran their end, or is this something that you took on? How did it"
    },
    {
      "speaker": "Speaker 1 17:26",
      "text": "work? We do it together. You know, like the laws in the United States are very quirky. You can't ask people what they make right now. If they are in a proxy statement or something, then you can know. But Korn Ferry does a good job of being like, Look, can you give us, sort of your yes numbers like, what, what is, what is a win for you, if you were to, you know, you and your wife to buy a home in Minnesota and uproot from Texas, and that was never an issue. The offer negotiation part was as smooth as I've ever had it on one of these, and I've done probably 40 or 50 of these, well, hundreds, if you include non exec requisitions. And they just did a bang up job. There was no back and forth, there was no we don't understand LTI, like they understood our comp. We understood the candidates comp, and they did a really good job. Great."
    },
    {
      "speaker": "Speaker 2 18:21",
      "text": "How? I mean, obviously you say you work with other of their competitors. How do they compare? What is the kind of the pros and the cons of Korn Ferry?"
    },
    {
      "speaker": "Speaker 1 18:30",
      "text": "Yeah. Well, while some of them don't like this, I did a five year audit, I look back at every person they placed, the fees we paid them, the diversity of the candidates. Are they still here? Have they been promoted? Did they leave? And I will just tell you, point blank, the data, no matter what way you cut it, Unknown Speaker 18:56 their performance is the best,"
    },
    {
      "speaker": "Speaker 1 18:59",
      "text": "compared to the three that we work with regularly, and the five that we work with Unknown Speaker 19:04 in some now"
    },
    {
      "speaker": "Speaker 1 19:09",
      "text": "I am like I was joking yesterday on one of these pitch calls, like, I can't be bought, right? Like I'm gonna give my clients at Cargill the best search firm, whether it's Korn Ferry, Russell Reynolds, Spencer Stewart or Michael baker.com. I don't care. When I look back at the data, they had the most people that are still here, that are doing well, they didn't get a bunch of fees for us hiring internals, like when they we went to them and got me wrong. Internal hires are great if that's the right person. But I don't want to pay ADC search firm $200,000 to tell me that that this person should be our next CFO, like I could tell you that she's amazing. She should be our next CFO, and she is, Unknown Speaker 19:58 you know,"
    },
    {
      "speaker": "Speaker 1 20:02",
      "text": "the their body of work. And I put them all like, literally on a graph, like, next to each other. It does rise above. It does rise Unknown Speaker 20:09 above. And how do they compare? Cost wise, same."
    },
    {
      "speaker": "Speaker 1 20:15",
      "text": "I mean, most of these firms are all right about the same. You know, one thing they know that I don't care for is admin fees. And I take a pretty hard line on this, because I don't charge you for my partner Molly to help support our process. You know, if you need to hire project managers or executive assistants, that's your cost to do in business like nobody's forcing you to do that. So we have kind of a fun spat about that occasionally. You know, it's like anything else. It's like if I'm buying concert tickets to go see the Rolling Stones, why do I need to pay a $5 surcharge to Ticketmaster, like I get it. Competition is fierce. You know that these five major Shrek firms, we call them Shrek firms because it's Spencer Stewart, Heidrick and struggles Russell Reynolds, Egon centers and Korn Ferry, right? -- 4 of 7 -- And it stands for Shrek, just a funny acronym that my kids think is hysterical. But, you know, they're all right about the same. So they're all trying to, you know, I'm not nickel and diming is not fair. But like, you know, I get it you, you know you want every search to have a good return on your investment, right? You know, I had hundreds of searches that, if I'm honest, I probably put more time in than I earned. But that is another thing I wanted to make sure to call out, is some of the other firms we work with are very commercially motivated, and it's painfully obvious, and we don't like that, right? I get that you need to make money, but if the first question you ask me is, what's the comp range, I don't love that. What I love is, Hey, Michael, what level is the role? Like, do you have an idea? Like, is there internal candidates like Korn Ferry never asks me, how much money are we going to make? They asked me, How can we help? They've done roles for me that, you know, they're not far over $200,000 USD, right? Like, there's some firms that'll thumb their nose at those and be like, Eh, that's not really what we do. Michael, okay, cool, fine. That's your business model. But Korn Ferry, I mean, I've, I've texted with them from my son's football games, saying, hey guys like, you know I have a senior director level role. Would you Is this too low level, or would you want to take us? Michael, we'd be happy to help great. They seem to understand, like when I was in search. I don't mean to be preachy, but I would work a job that paid $15 as hard as I would pay a job that paid $150,000 and you might be like, Sure you did, Michael, I really did. In fact, my boss would look at me funny, like, Michael, you understand, we stand to make way less money on that one than this one. Yep, I don't care. I like both clients, and I want to deliver for both of them. Okay, well, you're weird, but cool. That's how they show up to me. Now, maybe they've got me snowed and got the wool pull over my eyes, but I don't think so. Yeah. I mean, other firms have minimum search fees. Like, our minimum search fee is $150,000 Korn Ferry's is like 60, which is great. Like, sometimes our businesses are on tight budgets and they can't afford a $200,000 search fee. And other firms will be like, this isn't really our sweet spot, so we're going to pass where Korn Ferry, I think is they're not penny wise and pound foolish. They understand that every person walking the halls here. Well, how did you end up at cargo Korn Ferry? Okay, well, that person might be a director today, but they might go on to be a senior vice president. And you never forget, like, who? Who helped you get here, Unknown Speaker 24:37 you know? And so, yeah, I mean,"
    },
    {
      "speaker": "Speaker 1 24:40",
      "text": "all in all, I would say they did a stellar job. I think they handled our internals really, really well too, which I think matters. They didn't make them feel like, I mean, some of this is really hard, but when you hire a search firm, an internal is always going to feel like, well, this place is trying to beat me out, right? You can't take, there's a saying in law, you can't take the skunk out of the jury box, right? There's always going to be some of that. But I think they did as good of a job as you possibly could. And they did come back and share that they were wildly impressed with some of our internals, right? They weren't like, Oh, these people aren't good. You should hire an external and pay us three times as much, you know? So that part was, was also appreciated. I think the only thing areas of opportunity were the assessment thing, right? And then at one point in the search, we did kind of feel like we had all our eggs in one candidate that's good. Unknown Speaker 25:46 And part of that"
    },
    {
      "speaker": "Speaker 1 25:51",
      "text": "is how many people in this world are qualified to be the chief accounting officer of the largest privately held company in the United States? I do try to counsel our clients, like, look, this isn't going to be like the bachelor. We're not going to have 27 contestants, and they get a rose each week and we get down to one. That's not how this is going to go. If we have two three people, that is a massive win, I will tell you at the 11th Hour, Korn Ferry pulled a rabbit out of their hat with the candidate that ultimately got this job. He came in late. He was fantastic. He, you know, he happens to be an empty nester, and was able to kind of turn on a dime and come up and visit quickly. So we weren't, you know, leaving the other candidate on ice for days and days and days, I should say, weeks. But that was the only thing. There was some stress at one point that, like, Man, are we putting all our eggs in the ss basket at this fake initials, yeah, and that. And then unfortunately, or fortunately, I should say, they found Charlie, who ultimately joined us and everybody kind of collectively exhaled like, oh, we have options. And I think this is an important point Interviewer, is if you're an executive member, you're going to get asked by the board, well, how many people did you talk to? -- 5 of 7 -- Unknown Speaker 27:19 One? Yeah,"
    },
    {
      "speaker": "Speaker 1 27:21",
      "text": "they don't want to hear that choice, yeah, so it's not unreasonable to want options. Right now, if the executive team and board members have met with two or three people and think, Okay, now we feel like, you know, we've talked to three fortune 50 CEOs, and we think this is our person. It's like anything else. You know, the CFO needs to show her work the same way I do. I need to show my work, right? I need to show that I brought people to the CFO and she had a choice, and she didn't feel shoehorned. She needs to show that, right? It's good old due diligence. We did our due diligence, right? We looked high, far and wide and and we didn't just pick the, you know, the first person that waddled into the door. So, you know, we Yeah, and at the end of the day, they did that. They we had options. We had good, good people. We didn't feel shoehorned in. And I'm very, very convinced that the person we hired was the right person. He's awesome."
    },
    {
      "speaker": "Speaker 2 28:29",
      "text": "And just last question, have you used them for anything beyond search?"
    },
    {
      "speaker": "Speaker 1 28:34",
      "text": "I mean, these free assessments, I guess you could say sort of. I've, we've, I've never done any leadership development stuff with them. I believe that our talent development team has worked with I think, Unknown Speaker 28:49 you know, we we're"
    },
    {
      "speaker": "Speaker 1 28:51",
      "text": "not siloed in the sense that we don't know what's going on at the other part of the block or the other part of the neighborhood. But that's just not my remit. You know, I don't do that stuff, but I'm pretty confident that our talent development team has worked with them on some things. Yes, okay, great."
    },
    {
      "speaker": "Speaker 2 29:15",
      "text": "I think that's it. I look at right, right the hour. So that was great. Thank you so much for kind of, you know, a detailed summary of your experience, and it's great to hear that it's a positive one, so be excited to take that back to the team."
    },
    {
      "speaker": "Speaker 1 29:30",
      "text": "Yeah, yeah. Normally I wouldn't do this, but, you know, I think I'm hard on agencies when they don't answer the call, and I can be feisty, but I am also the first to give a standing ovation at a job well done. And you know, you help us hire the chief accounting officer from the largest oil and gas company in the world. He's great guy, great person, clearly an expert in his field and and the right person for for Joanne and her team. Right now, be the first one to stand up and clap and, Unknown Speaker 30:04 you know, I think,"
    },
    {
      "speaker": "Speaker 1 30:07",
      "text": "especially Ashley, you know, being, you know, professional friend, whatever you want to call it. I I was like, I'd be happy to take 30 minutes to talk and share more, because search work is really hard, and you are only as good as the last thing you did, and people need to hear when they do a good job. Ashley. And don't forget Michael, too. Michael Swanson, Michael is awesome. He's a great dude. Unknown Speaker 30:34 He worked his tail off on the search, and he and Ashley do it right. They do it."
    },
    {
      "speaker": "Speaker 2 30:40",
      "text": "Right? Brilliant. Thank you. Well, I was welcome to get that back to them. Well, lovely to meet you. Thank you again for your time. -- 6 of 7 --"
    },
    {
      "speaker": "Speaker 1 30:47",
      "text": "Thanks, Interviewer. Take care over there. I love where you live, and I like if I didn't have two, if I didn't have two little kids, I'd get over there more and go see that beautiful part of the world. So be well. Unknown Speaker 30:59 Bye. Thanks, Interviewer, you. Transcribed by https://otter.ai -- 7 of 7 --"
    }
  ],
  "rawText": "Speaker 2 2:59: to you. Yeah. Thank you. Yeah. So first things first, before we jump in, are you happy for me to record this? It's for my team, so they can help me do the report. 100% Yep, no problem. And then then it gets deleted afterwards, it doesn't get saved on the system. Unknown Speaker 3:17 Totally fine. So yeah, thank you\n\nSpeaker 2 3:19: for agreeing to do this, and for filling in the NPS score, I,\n\nInterviewer 3:27: I head up a consulting firm we've been working with Korn Ferry for the last five years, so we know their business really well, and they've asked us to lead on these interviews, so hopefully we can get a little bit more transparency, and we encourage you to be as honest as possible. It's very much around their commitment towards customer experience and continuous improvement. So the more you can share your experiences, the better we can make it in\n\nSpeaker 3 3:55: the future. Happy to do it great.\n\nInterviewer 3:58: So it'd be great if you could just start with explaining your role and your I suppose your relationship or an engagement with Korn Ferry to date,\n\nSpeaker 1 4:09: yeah, for sure. So my role at Cargill is I manage our executive recruitment. And this might seem kind of surprising, but we only have one executive recruiter at Cargill, and that's me. I have a one partner that I work with. Her name is Molly, and she handles sort of all the coordination and logistics and scheduling and and much more. But it's just us. It's so that we do everything. I've been here for about five years, and I've been in this role for about two I think. And so I've used Korn Ferry a fair amount. I do not use them exclusively. They know that. I usually recommend several options to our leaders and say, hey, you know you're the expert in accounting, or you're the expert in technology. I want you to pick the firm you feel most comfortable with, but funny, quirky connection on this role. So the woman who heads up like the accounting executive practice, Chief accounting officer practice at Korn Ferry was actually the Director of Career and Professional Development At my law school, which is hysterical. Yeah, it's really funny. So when I was like, and I can talk about my age, when I was like, I don't know, 29 years old, 27 years old, and I was running around law school in downtown Minneapolis here, Ashley Bose Johnson was in charge of helping all of us students find, you know, jobs upon graduation. And so then, of course, we had, like, a 10 year sort of where we didn't chat at all, and totally randomly, I was like, You're a Korn Ferry. Like, I didn't know you did this kind of work. And, you know, that was by no means why we selected them, but it is a funny kind of connection of how our our lives came to bet gather after, you know, years and years, you know, I'm pretty I'm pretty tough on search firms because I used to do headhunting myself. I hold them to a very high standard. I don't like cargo paying fees for hiring internal candidates or hiring somebody that our CFO worked with a General Mills like, you know I don't need to pay you $200,000 to call somebody for me. Korn Ferry understands that. They know that they believe that. To me, your fee is earned in three ways. One, you find somebody I didn't know about, right? And just tell me, Hey, what about Interviewer like, well, I already know Interviewer like, that's you know, to engaging them, getting them on the phone, and them believing that you have substantive media roles that they would want to hear about, like -- 1 of 7 -- becoming the next chief accounting Officer of Cargill, the largest privately held company in the United States, which I would say is kind of a cool job, if that's what you want to do. And then third, you know, shepherding them through the process, being a Sherpa for them, being a guide, being a broker between the two of us and and really not making it like candidate versus Cargill. It's a, it's a, should be a copacetic, harmonious, you know, connection. And I'm kind of going beyond your question, but\n\nSpeaker 2 7:50: I mean, you're only answering my next question, yeah, well, good.\n\nSpeaker 1 7:55: You know, I'd say they were, they did a really phenomenal job on this search. You know, the proof is always in the pudding, right? Like, how did this end? Well, Cargill ended up getting an awesome human being who is, you know, the chief accounting Officer of one of the largest oil and gas companies in the world, and he's here, and he's great, and I'm having lunch with him next week.\n\nSpeaker 2 8:21: So amazing. Yeah, digging into, I suppose, the end to end experience. How I mean, I suppose, in terms of expectations and the\n\nInterviewer 8:37: the reality of when you engage them, did they help craft the job role to how much did they kind of advise on that, that it was done? So where did they really come in, what worked really well, and what, what necessarily didn't,\n\nSpeaker 1 8:52: you know, they didn't help us craft the role. I mean, it was a pretty finite position, right? Because, I mean, our chief accounting office, this is not a secret. It's well known. She was essentially recruited out by a major competitor. So the role was pretty well defined. They did help us, though. The person who had that role before her name was, we'll just call her cn, her initials, lovely person. There's no bad blood or, you know, Ill Will here. Her role was very big, like very big. They did thought partner with us on okay, if this is somebody's first rodeo, maybe they don't take on the full remit that Carrie had, or if it's somebody super senior like Charlie gear who joined us, maybe they do. They were a good thought partner on that. They were really good thought partner on process, like who the candidate should interview with. In fact, they were, they were bold and said, Hey, you really should have your audit chair from the board meet with this candidate. And that was something that we were contemplating, but we weren't firm on. So, you know, Ashley and Michael were, you know, when you go to the doctor and the doctor doesn't ask you, like, what you think is wrong with you, they're like, here's what's wrong with you, and here's what you need to do. They were the latter, like it was obvious that they were experts. They had command. They weren't bullish or rude, but they were never shy about like, hey, we think you guys should do this. Or, you know, we think this process is taking too long. You're going to lose engagement from this person, or whatever they spoke up when they needed to great.\n\nInterviewer 10:44: And then in terms of, I suppose, leaning into using some of their benchmarks and things, was that something that that happened here? Did they look at kind of pay benchmarks? Did they do assessments? All of that was part of the x, and is that a reason to have chosen them, or is that something that you would expect?\n\nSpeaker 1 11:05: I would expect that, you know, I would expect at this level, and you know, for, you know, multi $100,000 fee, you should do that. But that doesn't take away from the fact that they did it very well. Like I said, I have high expectations of these firms, right? You should know who the fortune 500 Well, maybe not 500 but fortune 100 fortune 200 caos are. You should be able to get some of them to the table. You should know generally what their compensation is. I mean, it's getting a little harder with the United States laws to know all those things. Some of these people. You probably know this Interviewer, if they're at a publicly traded company, their salaries might have to be disclosed. So in that case, it's very easy to find them through proxy statements to shareholders and things like that. You have a company like Cargill, you can't find out what our CHRO or our sido makes, right? In fact, I might not even know that. It's not as it's not as interesting as you think it might be. Let me just tell you, -- 2 of 7 -- we're quite boring. People think we're a lot more interesting than we are. I sometimes joke that people see the show succession on HBO, and they're like, Oh, is that what cargo is like? And I just laugh. I'm like, that is this company. This company is run by a family of very lovely, low profile, nice, calm people, but yeah, so they knew all that stuff. They knew what these people earned. They had good command of their compensation. The one thing you brought up that I want to touch on for sure is assessment. Now, this is not Korn Ferry's fault at all. This was a learning for all of us, but Korn Ferry does this assessment called the Korn Ferry 4d or something. I don't know. It's a very quick assessment. There's nothing wrong with it, but it's like 30 minutes. The candidate takes a quiz, we fill out a quiz, and then they sort of mash up, okay, is this person a fit or not? Yeah. At our company, we use a wholly separate, very, very intense six hour assessment. Now, whether that's necessary, it's a moot point. We do it. Our executive team wants us to do it. There's no getting around it. So this term assessment means a lot of different things to a lot of different people. To us, it means this six hour, you know, deep dive cycle metric. Who is Interviewer, you know, like, you know, you getting into, yeah, right, terrifying, right? I don't want to, I don't want to take one of these. I'd probably be locked out immediately afterwards. But one recommendation or suggestion is make sure that they tell the client early that, hey, this is our assessment. And essentially ask the client, do you want us to do this or not? Because when you get and theirs is included part and parcel, right? So it's free, it's part of the deal. Ours is not free. Let me just tell you, it's quite expensive, quite involved and very\n\nSpeaker 2 14:22: by a third party. Michael, yes, it is, yep, a potential competitor in some ways\n\nSpeaker 1 14:28: to come back, yes, 100% it's a direct competitor. So now I will tell you this with these people. You know you're talking about the chief accounting Officer of Pepsi or Halliburton. These people's time is worth a lot, right? 1000s of dollars an hour, and even if they're lovely people, we need to be respectful of their time, right? So in Korn Ferry, the one thing, one takeaway, the little bumpy road in this search, was we didn't know they were doing that automatically, and we didn't necessarily tell them, hey, although they should know this, because they worked with us a lot, we're going to put them through a really deep assessment towards the end of this. So don't do that. Don't make them do both. It's it's just a lot, yeah, and that was a learning from now, my flag goes up right away, and I'm like, Hey, Korn Ferry. You probably know this, but I'm going to remind you, we do ours. You do not need to do yours. Now, the wrinkles is on lower level roles, we don't do our assessment, so their assessment actually has some value, right? And I've seen some of our teams, particularly in in APAC, they love these things, right? Because they're like, well, Korn Ferry is going to assess something. I'm like, Hold on guys, like, it's a, it's a 30 minute quiz. Like, let's not, this isn't the gospel, according to Korn Ferry, it's, it's just one little data piece. But to be fair, if it's free and it's included and we don't do ours, it is a nice add on. So that would be, my only recommendation, is make sure you have a very clear conversation with your client about your assessment, whether they have one, and whether it makes sense to do both. Yeah, upfront,\n\nSpeaker 2 16:21: I suppose, building on that point, how did you find overall communication, so in terms of, you know, project management and understanding how progress has been made. Did that meet expectations? Was it a regular kind of meeting? How did it work?\n\nSpeaker 1 16:37: Yeah, we met every week. You know, I would text with Ashley regularly about certain matters. I mean, I drive these people around when they come visit. I literally go pick them up to the airport, bring them to Cargill, show them. I'm kind of like, their their wedding planner, you know, their guide. And so I would even be texting Ashley, you know, while they were here. I'm like, you know, I think it's going really well. I think Charlie's having a nice time, like he's funny. I didn't know he collected comic books. It's funny. These people are all just people at the end of the day. Yeah, they're their communication was exemplary. Unknown Speaker 17:14 And in terms of, then kind of,\n\nSpeaker 2 17:20: -- 3 of 7 -- the contracts compensation? Was that something that they ran their end, or is this something that you took on? How did it\n\nSpeaker 1 17:26: work? We do it together. You know, like the laws in the United States are very quirky. You can't ask people what they make right now. If they are in a proxy statement or something, then you can know. But Korn Ferry does a good job of being like, Look, can you give us, sort of your yes numbers like, what, what is, what is a win for you, if you were to, you know, you and your wife to buy a home in Minnesota and uproot from Texas, and that was never an issue. The offer negotiation part was as smooth as I've ever had it on one of these, and I've done probably 40 or 50 of these, well, hundreds, if you include non exec requisitions. And they just did a bang up job. There was no back and forth, there was no we don't understand LTI, like they understood our comp. We understood the candidates comp, and they did a really good job. Great.\n\nSpeaker 2 18:21: How? I mean, obviously you say you work with other of their competitors. How do they compare? What is the kind of the pros and the cons of Korn Ferry?\n\nSpeaker 1 18:30: Yeah. Well, while some of them don't like this, I did a five year audit, I look back at every person they placed, the fees we paid them, the diversity of the candidates. Are they still here? Have they been promoted? Did they leave? And I will just tell you, point blank, the data, no matter what way you cut it, Unknown Speaker 18:56 their performance is the best,\n\nSpeaker 1 18:59: compared to the three that we work with regularly, and the five that we work with Unknown Speaker 19:04 in some now\n\nSpeaker 1 19:09: I am like I was joking yesterday on one of these pitch calls, like, I can't be bought, right? Like I'm gonna give my clients at Cargill the best search firm, whether it's Korn Ferry, Russell Reynolds, Spencer Stewart or Michael baker.com. I don't care. When I look back at the data, they had the most people that are still here, that are doing well, they didn't get a bunch of fees for us hiring internals, like when they we went to them and got me wrong. Internal hires are great if that's the right person. But I don't want to pay ADC search firm $200,000 to tell me that that this person should be our next CFO, like I could tell you that she's amazing. She should be our next CFO, and she is, Unknown Speaker 19:58 you know,\n\nSpeaker 1 20:02: the their body of work. And I put them all like, literally on a graph, like, next to each other. It does rise above. It does rise Unknown Speaker 20:09 above. And how do they compare? Cost wise, same.\n\nSpeaker 1 20:15: I mean, most of these firms are all right about the same. You know, one thing they know that I don't care for is admin fees. And I take a pretty hard line on this, because I don't charge you for my partner Molly to help support our process. You know, if you need to hire project managers or executive assistants, that's your cost to do in business like nobody's forcing you to do that. So we have kind of a fun spat about that occasionally. You know, it's like anything else. It's like if I'm buying concert tickets to go see the Rolling Stones, why do I need to pay a $5 surcharge to Ticketmaster, like I get it. Competition is fierce. You know that these five major Shrek firms, we call them Shrek firms because it's Spencer Stewart, Heidrick and struggles Russell Reynolds, Egon centers and Korn Ferry, right? -- 4 of 7 -- And it stands for Shrek, just a funny acronym that my kids think is hysterical. But, you know, they're all right about the same. So they're all trying to, you know, I'm not nickel and diming is not fair. But like, you know, I get it you, you know you want every search to have a good return on your investment, right? You know, I had hundreds of searches that, if I'm honest, I probably put more time in than I earned. But that is another thing I wanted to make sure to call out, is some of the other firms we work with are very commercially motivated, and it's painfully obvious, and we don't like that, right? I get that you need to make money, but if the first question you ask me is, what's the comp range, I don't love that. What I love is, Hey, Michael, what level is the role? Like, do you have an idea? Like, is there internal candidates like Korn Ferry never asks me, how much money are we going to make? They asked me, How can we help? They've done roles for me that, you know, they're not far over $200,000 USD, right? Like, there's some firms that'll thumb their nose at those and be like, Eh, that's not really what we do. Michael, okay, cool, fine. That's your business model. But Korn Ferry, I mean, I've, I've texted with them from my son's football games, saying, hey guys like, you know I have a senior director level role. Would you Is this too low level, or would you want to take us? Michael, we'd be happy to help great. They seem to understand, like when I was in search. I don't mean to be preachy, but I would work a job that paid $15 as hard as I would pay a job that paid $150,000 and you might be like, Sure you did, Michael, I really did. In fact, my boss would look at me funny, like, Michael, you understand, we stand to make way less money on that one than this one. Yep, I don't care. I like both clients, and I want to deliver for both of them. Okay, well, you're weird, but cool. That's how they show up to me. Now, maybe they've got me snowed and got the wool pull over my eyes, but I don't think so. Yeah. I mean, other firms have minimum search fees. Like, our minimum search fee is $150,000 Korn Ferry's is like 60, which is great. Like, sometimes our businesses are on tight budgets and they can't afford a $200,000 search fee. And other firms will be like, this isn't really our sweet spot, so we're going to pass where Korn Ferry, I think is they're not penny wise and pound foolish. They understand that every person walking the halls here. Well, how did you end up at cargo Korn Ferry? Okay, well, that person might be a director today, but they might go on to be a senior vice president. And you never forget, like, who? Who helped you get here, Unknown Speaker 24:37 you know? And so, yeah, I mean,\n\nSpeaker 1 24:40: all in all, I would say they did a stellar job. I think they handled our internals really, really well too, which I think matters. They didn't make them feel like, I mean, some of this is really hard, but when you hire a search firm, an internal is always going to feel like, well, this place is trying to beat me out, right? You can't take, there's a saying in law, you can't take the skunk out of the jury box, right? There's always going to be some of that. But I think they did as good of a job as you possibly could. And they did come back and share that they were wildly impressed with some of our internals, right? They weren't like, Oh, these people aren't good. You should hire an external and pay us three times as much, you know? So that part was, was also appreciated. I think the only thing areas of opportunity were the assessment thing, right? And then at one point in the search, we did kind of feel like we had all our eggs in one candidate that's good. Unknown Speaker 25:46 And part of that\n\nSpeaker 1 25:51: is how many people in this world are qualified to be the chief accounting officer of the largest privately held company in the United States? I do try to counsel our clients, like, look, this isn't going to be like the bachelor. We're not going to have 27 contestants, and they get a rose each week and we get down to one. That's not how this is going to go. If we have two three people, that is a massive win, I will tell you at the 11th Hour, Korn Ferry pulled a rabbit out of their hat with the candidate that ultimately got this job. He came in late. He was fantastic. He, you know, he happens to be an empty nester, and was able to kind of turn on a dime and come up and visit quickly. So we weren't, you know, leaving the other candidate on ice for days and days and days, I should say, weeks. But that was the only thing. There was some stress at one point that, like, Man, are we putting all our eggs in the ss basket at this fake initials, yeah, and that. And then unfortunately, or fortunately, I should say, they found Charlie, who ultimately joined us and everybody kind of collectively exhaled like, oh, we have options. And I think this is an important point Interviewer, is if you're an executive member, you're going to get asked by the board, well, how many people did you talk to? -- 5 of 7 -- Unknown Speaker 27:19 One? Yeah,\n\nSpeaker 1 27:21: they don't want to hear that choice, yeah, so it's not unreasonable to want options. Right now, if the executive team and board members have met with two or three people and think, Okay, now we feel like, you know, we've talked to three fortune 50 CEOs, and we think this is our person. It's like anything else. You know, the CFO needs to show her work the same way I do. I need to show my work, right? I need to show that I brought people to the CFO and she had a choice, and she didn't feel shoehorned. She needs to show that, right? It's good old due diligence. We did our due diligence, right? We looked high, far and wide and and we didn't just pick the, you know, the first person that waddled into the door. So, you know, we Yeah, and at the end of the day, they did that. They we had options. We had good, good people. We didn't feel shoehorned in. And I'm very, very convinced that the person we hired was the right person. He's awesome.\n\nSpeaker 2 28:29: And just last question, have you used them for anything beyond search?\n\nSpeaker 1 28:34: I mean, these free assessments, I guess you could say sort of. I've, we've, I've never done any leadership development stuff with them. I believe that our talent development team has worked with I think, Unknown Speaker 28:49 you know, we we're\n\nSpeaker 1 28:51: not siloed in the sense that we don't know what's going on at the other part of the block or the other part of the neighborhood. But that's just not my remit. You know, I don't do that stuff, but I'm pretty confident that our talent development team has worked with them on some things. Yes, okay, great.\n\nSpeaker 2 29:15: I think that's it. I look at right, right the hour. So that was great. Thank you so much for kind of, you know, a detailed summary of your experience, and it's great to hear that it's a positive one, so be excited to take that back to the team.\n\nSpeaker 1 29:30: Yeah, yeah. Normally I wouldn't do this, but, you know, I think I'm hard on agencies when they don't answer the call, and I can be feisty, but I am also the first to give a standing ovation at a job well done. And you know, you help us hire the chief accounting officer from the largest oil and gas company in the world. He's great guy, great person, clearly an expert in his field and and the right person for for Joanne and her team. Right now, be the first one to stand up and clap and, Unknown Speaker 30:04 you know, I think,\n\nSpeaker 1 30:07: especially Ashley, you know, being, you know, professional friend, whatever you want to call it. I I was like, I'd be happy to take 30 minutes to talk and share more, because search work is really hard, and you are only as good as the last thing you did, and people need to hear when they do a good job. Ashley. And don't forget Michael, too. Michael Swanson, Michael is awesome. He's a great dude. Unknown Speaker 30:34 He worked his tail off on the search, and he and Ashley do it right. They do it.\n\nSpeaker 2 30:40: Right? Brilliant. Thank you. Well, I was welcome to get that back to them. Well, lovely to meet you. Thank you again for your time. -- 6 of 7 --\n\nSpeaker 1 30:47: Thanks, Interviewer. Take care over there. I love where you live, and I like if I didn't have two, if I didn't have two little kids, I'd get over there more and go see that beautiful part of the world. So be well. Unknown Speaker 30:59 Bye. Thanks, Interviewer, you. Transcribed by https://otter.ai -- 7 of 7 --"
}