{
  "id": "t-010",
  "sourceFile": "T5_NPS6_NA_ES_HOUSE_SEP25.pdf",
  "client": "Shannon Fulmer",
  "interviewDate": "2025-09-22",
  "project": "Exec Search",
  "score": 6,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Interviewer 0:00",
      "text": "Going to do the call. I'll keep it as swift as I can. Obviously. Thank you for filling in the NPS score. What we wanted to do was, obviously just dig into it a little bit further. Before I do that, a couple of admin points. Are you comfortable with me recording this? Shannon, so I can share the notes with my team? Absolutely great. Thank you. Obviously, I'm external to Korn Ferry, so I've been working with them for the last five years, so I know their business well, but the aim of getting an external person to run these is to hopefully get as much truth and authenticity and transparency as possible. So as much as you feel comfortable with sharing, we do encourage kind of as stark a feedback as you can provide. So it would be great if you could start off by just explaining your role in the business and your overall relationship with Korn Ferry. So how you engage with them? How long you've been working with them, for sure."
    },
    {
      "speaker": "Speaker 1 1:06",
      "text": "So I am the Senior Director of Human Resources. I am the leader of HR. I do all of the policy writing and all of the strategic planning for our organization, and I've been with them now six years, almost seven, and my role for this particular one was to find a company to help us to to recruit for our president and CEO role. And in reviewing these we chose Korn Ferry because they had worked with associations before. Associations are a bit of a different animal than regular nonprofits and or corporations, in that our members are very much an active participant in our daily lives, as well as our strategy placement. So not just board members, but actual member companies government affairs spend a lot of time with us through committee and advocacy work within the Oil and Gas Association and within that industry. So we chose them based on some of the work that they had previously done for another Association. As a matter of fact, our national association, they found the president for that Okay."
    },
    {
      "speaker": "Interviewer 2:34",
      "text": "And do you work with them in any other capacity? Shannon, or is it purely on a search engagement?"
    },
    {
      "speaker": "Speaker 1 2:41",
      "text": "It was strictly on a search engagement. We had not worked with them before."
    },
    {
      "speaker": "Interviewer 2:45",
      "text": "Okay, so this is your first time of working with them. Yeah, great. Then, did you, when you what made you choose them? I mean, obviously you just kind of talked about the fact that they've got experience in this space. Were there any other factors that led to you selecting them, and did you pitch it? Did you go out to other people, or was it really just from a short list that you made,"
    },
    {
      "speaker": "Speaker 1 3:07",
      "text": "kind of a short list, but we had just worked with another organization on our who had recruited our vice president and communications to someone else, and then we use them. So it was between Korn Ferry and one other person, one other group. So it was a very short list, because, again, the type of work that we do. And then Korn Ferry was chosen because they had done the API President search and found someone for them. Okay, so they're, they're, they're being so deeply involved with our national association. Kind of gave them the upper hand in that area, our president, our our outgoing president as well, had either had worked with them before, or felt that they were kind of the the ones to go with. So she had a strong hand in that discussion as well. Okay, great,"
    },
    {
      "speaker": "Interviewer 4:11",
      "text": "and you gave them a six is, yeah, yeah. I mean, so can you, I suppose, expand on what drove that score? Yes."
    },
    {
      "speaker": "Speaker 1 4:21",
      "text": "-- 1 of 6 -- So, um, it was a combination of things. And I actually sometimes was thinking lower score than that, because of just how it kind of incorporated itself. So we as an association, we have a written Recruitment Policy that is three board members. We ended up with four, but three board members and the me, a senior director of HR, another senior leadership and our general counsel as the recruiting as the recruiting committee, so it's already in writing, board approved that that's our way to go. And Charlie, who was our contact person, really struggled with that, and on multiple occasions, not just to me, but to others, made the comment I I'm I've never worked with employees. It's always been the bull, even through consultation, and I was the direct contact. And things were supposed to be go see what our board of directors Chairman thought. And there were several in which Charlie went to the Board of Director right and got opinions from him that were contrary to what the majority of us would have come to an agreement on, which was fine, but not fine."
    },
    {
      "speaker": "Interviewer 6:06",
      "text": "Yeah, yeah. If you're leading it, it's,"
    },
    {
      "speaker": "Speaker 1 6:10",
      "text": "well, we're in the process of saying, Hey, listen, if you know our chairman says something, then we're going to go with it. And I felt that Charlie was looking for an answer that maybe he thought he wasn't going to get from me and the other team members. Yeah, and he's probably and he's probably right, because twice when he went to him, he got time frames changed and meetings changed, and that not would not have happened had the internal group been able to have the conversation with our board members. So so that was part of the issue with that, and that kind of happened a little bit later in the process, a couple of times, and but to start the process, they got us a group of people that potentially could be interested. So when we started, one of them was somebody who was very well known to us. She was the Vice President of Government Affairs for an acquired company, and the vice that our vice chairman of the board, who was also on the committee, was very, very well. She was very well known. And on paper, she looks brilliant. And in actual practice, she is not just because, again, she's very strong and very it's either my company's way or no way. So we were really looking for that person that could be a mediator, that could be someone who brings people to the table. And so she was an immediate no from our board members, as well as two of the internal people who had worked with her directly. And Charlie was like, Well, I don't understand this. Why would you not consider her? And they had literally just explained why they wouldn't. He's like, it's just weird. She's got all these great references. And we're like, we have no doubt she has these great references. She's in. She's a brilliant young she's a brilliant woman. She's a great advocate for lobbying. No, just not a fit. And we had actually worked with her on our Government Affairs Committee as a member for seven years or so and so. And then, like I said, our Vice Chair literally chose somebody else, as opposed to keeping her. So it was, it felt as if he was trying to get more bodies than what we were saying we were looking for. And that happened a couple of times in which it was kind of like, well, so and so said, this was great fit. We're like, this isn't even a discussion. So it got to the point where instead of trying to get us bodies, we told them, hey, listen, we need two or three people, if that right, because we had a very strong internal candidate who we actually ended up going with. But we wanted to be sure. We said, you know, this is the bar. They got to be as good as our internal candidate, or better. And that was kind of the bar. Well, Charlie or someone took that as let me call people in Sacramento and see who might be interested. The only problem with that is the internal candidate knows the majority of people they call, and we were getting calls. Hey, why aren't you going with Jody? Hey, why is this place calling me at one point, somebody at Korn Ferry called Governor Newsom's. He's our governor, Yeah, unfortunately, but called Governor Newsom's PR company. Governor Newsom wouldn't even talk to our president at the time, right? So they called the PR company. This is the same PR company that had dinner with him at the French Laundry during covid, and there was a big scandal behind it. So we're getting all these calls. People are meeting with people, and I had to call Charlie twice and tell him, Listen, stop calling people. If they're not coming to you that then they're not you know, everybody knew what was going on. Everybody knew our other current president was heading out. We were looking for a new one like this wasn't like something that we're trying to do behind the scenes to find people. It took me calling him twice to get that to stop, and so it was that type of thing that it felt more like he was trying to get us bodies, which I think, obviously they want to give good candidates. They want to get a lot of them, but when given the guidance and feedback, it took a couple of times to truly get them to to hear what either the board members or I was saying. So it became a struggle more to the point where I'm like, I don't want to have coffee. Like, if we can get the board members and the three of us, and we're all ready to go, then that's where I want to leave it. And it wasn't that, you know, -- 2 of 6 -- the intention wasn't to keep them out, but they weren't hearing kind of everything that we were saying, and that just kind of everything up into a little bow,"
    },
    {
      "speaker": "Interviewer 11:42",
      "text": "yeah, I mean, and that makes sense. And then I guess there's a trust issue. Then moving forward, of if they're not listening the first time, are they going to continue to listen? So it feels like it's a breakdown of a relationship from the outset,"
    },
    {
      "speaker": "Speaker 1 11:57",
      "text": "and honestly, I don't know that she. Charlie understood the association part. We had been told that you that they have an association arm, but we didn't get that person, which is fine, but I don't think he understood. I mean, this is a 36 person organization. He brought us one candidate, candidate who that was the other part I should have mentioned. I don't think in California, you have to tell people what the salary range is, yeah, and we cannot ask for their salaries. It's a non, non negotiable, which is great. But he brought us someone who, again, looks good and presented well, who is well over a million dollars in salary, and he knew ours was like at 600 right around 700,000 total. So again, great candidate. But then we find out she's going to be like, $1.5 million"
    },
    {
      "speaker": "Interviewer 13:00",
      "text": "yeah. And"
    },
    {
      "speaker": "Speaker 1 13:03",
      "text": "so yeah, and I don't know that she would have been chosen, but she was absolutely strong, even against our internal one. And our internal one brought a million but my my own candidate had to ask me, our internal candidate had to finally say, what is the range? And so I don't know that they were sharing that externally when they were talking to people. And it's a requirement in California. It's, it's a non negotiable, right? It's an actual law here."
    },
    {
      "speaker": "Interviewer 13:37",
      "text": "And what did did when you fed back this to Charlie, what was his response like? Was he pushing it to see if there was flex on it, or would you think it was?"
    },
    {
      "speaker": "Speaker 1 13:49",
      "text": "There were a couple conversations at the beginning, but we he knew the hard line, there was no way. 1.5 million was going No way. And he knew that we were very honest from the firm we gave them, it's a 40% bonus plus the range. And the range was 350, to 600 so the person that, again, that was we were considering that, or that presented, presented at 1.5 base, from what I understand, that was the discussion, okay?"
    },
    {
      "speaker": "Interviewer 14:28",
      "text": "And in terms of the candidate that you have got, is that something that came via Charlie? Did you go with the internal candidate?"
    },
    {
      "speaker": "Speaker 1 14:37",
      "text": "She was, she's our internal, yeah, and, and she was great, and we figured our biggest thing was we wanted to be sure as an organization, because Jody was our, our operational, our operations person who didn't get a lot of opportunities under the last president. So she really had to come out and prove herself. She did. She there's no way would have chosen anybody else once they met with her and had her, 3060, 90, nobody knew it better. The board wanted to be sure they had the right person, because California is its own beast. And so she she had a leg up from the beginning, and we all knew that, but we also didn't know who was out there we had. They did bring a good candidate from API, which is our national organization. The guy just couldn't present. He was very government affairs. He was very Washington, DC, and not his fault. It is, you know what I mean. It is what he is. He was a good candidate, but just not, ultimately not what we were looking for. And that's again, we knew that Korn Ferry was either going to find us somebody, or was we were going to go internal. That wasn't a question. We knew what we were paying for from the very beginning."
    },
    {
      "speaker": "Interviewer 15:58",
      "text": "And if you, I suppose, reflecting on what you've just said about the kind of the internal candidate being in the front, running the position, and from the beginning, would would reflecting on the journey that -- 3 of 6 -- you had of engaging Korn Ferry. Would you have changed anything in retrospect, or would it still remain the same in terms of, you know, find us someone that's better and and that's the break,"
    },
    {
      "speaker": "Speaker 1 16:22",
      "text": "no, no, the board was really clear that they needed to see other candidates. There was no there was no opportunity. And again, had had our person been properly succession planned, we wouldn't have gone externally. But that was an internal thing that we had to deal with on our own, but we absolutely would have done it. There's no question about it. And rightfully so, we needed her to be the actual pick, not just the easy pick, yeah, yeah, makes sense."
    },
    {
      "speaker": "Interviewer 17:00",
      "text": "And in terms of the project, I mean, was there anything that you felt the team did?"
    },
    {
      "speaker": "Speaker 1 17:05",
      "text": "Well, yeah, I mean, it was, I think that, and this is just coming from someone who doesn't have the skill set, getting meetings, set up, set up, calling the proper, you know, getting the emails, getting everybody on the same page. Their administrative assistant was, was a phenom. She was, and I told her, as such, she was quite the talented, you know, calendar keeper. And, you know, the biggest thing was, like, I said, it's hard right now. I think that one, the packaging of the candidates was good. I don't know that the assessment was very helpful to us. We didn't spend a lot of time on that. But again, that's more understanding our members. Our members need those relationships. It's less what it tells us on paper that they might be good at. Now, I think it's helpful, but we did not utilize it"
    },
    {
      "speaker": "Interviewer 18:15",
      "text": "at all. Okay, so value that to you."
    },
    {
      "speaker": "Speaker 1 18:19",
      "text": "Yeah, for that one. But again, I think that it, if we had a more close candidate pool, it might have come into play, but Jody really walked away with it toward at the end like there was no question. So I don't it. I don't think it played a huge part in our assessment, but it could have so I don't want to, I don't want to say it was bad. It definitely wasn't that, but it just wasn't relevant, because our internal candidate turned out to be so strong, so again, so that necessarily, you know, I think the way that the packaging is the questions for the board members, the layout of the interview process, I think really helped, especially since, you know, our board members are engineers, they're they're government affairs or lobbyists. They're not HR. They don't spend any time interviewing people. They love having questions ready for them. And it was it. The packaging was great, right? So, the questions were good. It helped them stay on track. It helped keeping them in line with time. And so it was overall, it was really that that whole packaging, the questions were very relevant. They were actually formed to what we would need to know. So, you know, understanding and taking notes on what we were looking for in people. I thought Korn Ferry did well, okay,"
    },
    {
      "speaker": "Interviewer 19:47",
      "text": "so again, going back to reflecting on the engagement, just, I suppose, pay it back to you. Is there anything else that you would like to have seen them do differently. It feels like there was a need to kind of respect the entire steer CO and lines of communication, and kind of the listening element of actually, kind of really listening feedback isn't and actioning"
    },
    {
      "speaker": "Speaker 1 20:16",
      "text": "it. Yeah, I think Charlie had an idea of what he typically does. As I said, even our internal candidate had mentioned, Charlie said a couple of times, I don't know why we have internal people. That's just it's only the board that we should be dealing with so it again, not knowing. But the truth is, and I had this conversation with Charlie directly, I said, I understand you're used to dealing with the board of directors. I said, but what you don't understand is that they don't know our daily operations, and so they're looking for, potentially, something that's going to be shiny and pretty on the outside, we need something that has internal understanding Association, not only Association experience, but also Association knowledge. So the one person, for example, that had the $1.5 million price tag on her, she's a lobbyist, politician. The board loved her. I found her ineffective because she was a politician, yeah, so again, not knowing what we need and understanding what the internal process is and the importance behind understanding the association. He just didn't have that whole I almost feel like it bothered him. Yeah, that it was like, I, you know, we're doing this because this is what we do. And -- 4 of 6 -- under normal circumstances, I would say is not wrong. I worked for a 20,000 person organization, and I couldn't imagine anyone internally hiring the president for it. That wouldn't make any sense. But the association is 36 people. We run all the advocacy, all the lobbying for the oil and gas on the west coast that includes Arizona, Nevada, Washington and Oregon. So it was really him. He again, he would always say, you know, okay, well, I'll do this. Well, then he'd call the board of director, like Charlie. Why would you call him? Yeah, like you guys agreed to change this. We didn't need to change it. So it I think he's just struggled with the concept of that, and I don't know why, yeah, but I did have the conversation directly with him at one point. Said, listen, we're not your typical Association. We we have to have someone who also understands the internal operations. I don't just need a figurehead out there, because, again, we have a lot of laws and regulations in California that external people don't understand. There's also a whole lot of smoothing that has to go on with politicians, but you also have to have the knowledge of the industry. This one candidate, again, she was brilliant. I'm not knocking her, but she could talk surface stuff, but it would have taken us a year and a half to get our product speed. So I again, I think it was a little bit more along the lines of not really understanding that portion for us. But, I mean, he was, he was a fine man. I mean, there's no no issues personality wise. It just for whatever reason that little sticking point was really hard just didn't"
    },
    {
      "speaker": "Interviewer 24:07",
      "text": "click. I'm not sure why"
    },
    {
      "speaker": "Speaker 1 24:09",
      "text": "he mentioned it. I'm not sure why he mentioned it to our internal candidate. Yeah, and here's what I will say, it did come across in several of the meetings that he gave less weight. He didn't say anything in particular that I can point to. It was a manner in which is he was communicating that gave less weight or moved on from any our and we had myself, the Vice President of Communications was on it, who works hand in hand with the President and our general counsel, and it just seemed he wasn't always for some of the commentary that that came from that, and would always defer to the board. So there was just in we never confronted him in person, or any, you know anything like that. So I don't know what that hang up was, but it came across pretty clear. Okay, great."
    },
    {
      "speaker": "Interviewer 25:10",
      "text": "I'm conscious that we're nearly up at time. Shannon, obviously you said this was the first time that you'd worked with Korn Ferry. Would you use them again in a different circumstance?"
    },
    {
      "speaker": "Speaker 1 25:27",
      "text": "Honestly, I don't think so. And here's why, the last company that I had used previously, the communication was really strong. And again, potentially I wouldn't, I don't like to cancel people out. I think Charlie would be a no, but so you know right now they would not be on top of the list a call for sure, okay, right?"
    },
    {
      "speaker": "Interviewer 26:03",
      "text": "I think, well, I mean, that's really helpful. No, I mean, that's exactly why we do these calls, right? It's to really understand the kind of the expectations and for the team to continue to feedback and get better. So I do appreciate, yeah,"
    },
    {
      "speaker": "Speaker 1 26:19",
      "text": "and I will, I will, you know, again, they've, we've had other executives that have reached out to Korn Ferry to, you know, we get poached all the time. People try and poach us. Oh, which is good, because I like the fact that we have very talented people just all you want. But so there was positive feedback from that. I did learn, like I said earlier, that there is an association arm and for whatever reason, and that's what I was told. So maybe there isn't, but that would have been the the people that I would have expected. And the reason I say there was an association arm is that Jody, who actually is our president, was part of an API, not an API, but a Korn Ferry interview for the Banking Association, and it turned out not to be a good fit. So she stayed with us, thank goodness, but she had worked with somebody who had direct association experience. So I think that's important. It sounds weird, because a lot of times you think, well, this is different associations. Are just different breeds, because they're not just ruled by a board, they're ruled by their members. And so the Board of Directors also made up of all the members, but government affairs, our government affairs committee is our strongest and most powerful when it comes to making decisions. So so I guess just having that association understanding, I you know, we're at a spot now where we're not going to need an -- 5 of 6 -- executive search for a while. Yeah, we've got, yeah, we've got. Our last President worked there 30 years. Our current president, Jody, has been there 25 years now, our general counsel who will probably take Jody's spot is in her early 30s, like we have, we have a very strong bench behind this so, but so it could be a while. So I wouldn't, I wouldn't say no, I would say this was a hard first experience for"
    },
    {
      "speaker": "Interviewer 28:39",
      "text": "sure. Yeah, okay, that's really helpful. Great. Well, Shannon, I think we're at time, but thank you. I appreciate you the early start. I'm sorry that"
    },
    {
      "speaker": "Speaker 1 28:51",
      "text": "I'm in the car, so it worked out perfect. I just saw your times. I'm like, Oh, I don't want to get up at 5am yeah. Anyway, the dogs want to go out at 5am they're like, Hey, so, but I appreciate this. I appreciate you giving me the opportunity to give feedback, and I'm happy to talk again if anything's needed,"
    },
    {
      "speaker": "Interviewer 29:14",
      "text": "that's great. I really do appreciate it. Thank you, Shannon, have a great day. Thanks. You too. Bye, so? -- 6 of 6 --"
    }
  ],
  "rawText": "Interviewer 0:00: Going to do the call. I'll keep it as swift as I can. Obviously. Thank you for filling in the NPS score. What we wanted to do was, obviously just dig into it a little bit further. Before I do that, a couple of admin points. Are you comfortable with me recording this? Shannon, so I can share the notes with my team? Absolutely great. Thank you. Obviously, I'm external to Korn Ferry, so I've been working with them for the last five years, so I know their business well, but the aim of getting an external person to run these is to hopefully get as much truth and authenticity and transparency as possible. So as much as you feel comfortable with sharing, we do encourage kind of as stark a feedback as you can provide. So it would be great if you could start off by just explaining your role in the business and your overall relationship with Korn Ferry. So how you engage with them? How long you've been working with them, for sure.\n\nSpeaker 1 1:06: So I am the Senior Director of Human Resources. I am the leader of HR. I do all of the policy writing and all of the strategic planning for our organization, and I've been with them now six years, almost seven, and my role for this particular one was to find a company to help us to to recruit for our president and CEO role. And in reviewing these we chose Korn Ferry because they had worked with associations before. Associations are a bit of a different animal than regular nonprofits and or corporations, in that our members are very much an active participant in our daily lives, as well as our strategy placement. So not just board members, but actual member companies government affairs spend a lot of time with us through committee and advocacy work within the Oil and Gas Association and within that industry. So we chose them based on some of the work that they had previously done for another Association. As a matter of fact, our national association, they found the president for that Okay.\n\nInterviewer 2:34: And do you work with them in any other capacity? Shannon, or is it purely on a search engagement?\n\nSpeaker 1 2:41: It was strictly on a search engagement. We had not worked with them before.\n\nInterviewer 2:45: Okay, so this is your first time of working with them. Yeah, great. Then, did you, when you what made you choose them? I mean, obviously you just kind of talked about the fact that they've got experience in this space. Were there any other factors that led to you selecting them, and did you pitch it? Did you go out to other people, or was it really just from a short list that you made,\n\nSpeaker 1 3:07: kind of a short list, but we had just worked with another organization on our who had recruited our vice president and communications to someone else, and then we use them. So it was between Korn Ferry and one other person, one other group. So it was a very short list, because, again, the type of work that we do. And then Korn Ferry was chosen because they had done the API President search and found someone for them. Okay, so they're, they're, they're being so deeply involved with our national association. Kind of gave them the upper hand in that area, our president, our our outgoing president as well, had either had worked with them before, or felt that they were kind of the the ones to go with. So she had a strong hand in that discussion as well. Okay, great,\n\nInterviewer 4:11: and you gave them a six is, yeah, yeah. I mean, so can you, I suppose, expand on what drove that score? Yes.\n\nSpeaker 1 4:21: -- 1 of 6 -- So, um, it was a combination of things. And I actually sometimes was thinking lower score than that, because of just how it kind of incorporated itself. So we as an association, we have a written Recruitment Policy that is three board members. We ended up with four, but three board members and the me, a senior director of HR, another senior leadership and our general counsel as the recruiting as the recruiting committee, so it's already in writing, board approved that that's our way to go. And Charlie, who was our contact person, really struggled with that, and on multiple occasions, not just to me, but to others, made the comment I I'm I've never worked with employees. It's always been the bull, even through consultation, and I was the direct contact. And things were supposed to be go see what our board of directors Chairman thought. And there were several in which Charlie went to the Board of Director right and got opinions from him that were contrary to what the majority of us would have come to an agreement on, which was fine, but not fine.\n\nInterviewer 6:06: Yeah, yeah. If you're leading it, it's,\n\nSpeaker 1 6:10: well, we're in the process of saying, Hey, listen, if you know our chairman says something, then we're going to go with it. And I felt that Charlie was looking for an answer that maybe he thought he wasn't going to get from me and the other team members. Yeah, and he's probably and he's probably right, because twice when he went to him, he got time frames changed and meetings changed, and that not would not have happened had the internal group been able to have the conversation with our board members. So so that was part of the issue with that, and that kind of happened a little bit later in the process, a couple of times, and but to start the process, they got us a group of people that potentially could be interested. So when we started, one of them was somebody who was very well known to us. She was the Vice President of Government Affairs for an acquired company, and the vice that our vice chairman of the board, who was also on the committee, was very, very well. She was very well known. And on paper, she looks brilliant. And in actual practice, she is not just because, again, she's very strong and very it's either my company's way or no way. So we were really looking for that person that could be a mediator, that could be someone who brings people to the table. And so she was an immediate no from our board members, as well as two of the internal people who had worked with her directly. And Charlie was like, Well, I don't understand this. Why would you not consider her? And they had literally just explained why they wouldn't. He's like, it's just weird. She's got all these great references. And we're like, we have no doubt she has these great references. She's in. She's a brilliant young she's a brilliant woman. She's a great advocate for lobbying. No, just not a fit. And we had actually worked with her on our Government Affairs Committee as a member for seven years or so and so. And then, like I said, our Vice Chair literally chose somebody else, as opposed to keeping her. So it was, it felt as if he was trying to get more bodies than what we were saying we were looking for. And that happened a couple of times in which it was kind of like, well, so and so said, this was great fit. We're like, this isn't even a discussion. So it got to the point where instead of trying to get us bodies, we told them, hey, listen, we need two or three people, if that right, because we had a very strong internal candidate who we actually ended up going with. But we wanted to be sure. We said, you know, this is the bar. They got to be as good as our internal candidate, or better. And that was kind of the bar. Well, Charlie or someone took that as let me call people in Sacramento and see who might be interested. The only problem with that is the internal candidate knows the majority of people they call, and we were getting calls. Hey, why aren't you going with Jody? Hey, why is this place calling me at one point, somebody at Korn Ferry called Governor Newsom's. He's our governor, Yeah, unfortunately, but called Governor Newsom's PR company. Governor Newsom wouldn't even talk to our president at the time, right? So they called the PR company. This is the same PR company that had dinner with him at the French Laundry during covid, and there was a big scandal behind it. So we're getting all these calls. People are meeting with people, and I had to call Charlie twice and tell him, Listen, stop calling people. If they're not coming to you that then they're not you know, everybody knew what was going on. Everybody knew our other current president was heading out. We were looking for a new one like this wasn't like something that we're trying to do behind the scenes to find people. It took me calling him twice to get that to stop, and so it was that type of thing that it felt more like he was trying to get us bodies, which I think, obviously they want to give good candidates. They want to get a lot of them, but when given the guidance and feedback, it took a couple of times to truly get them to to hear what either the board members or I was saying. So it became a struggle more to the point where I'm like, I don't want to have coffee. Like, if we can get the board members and the three of us, and we're all ready to go, then that's where I want to leave it. And it wasn't that, you know, -- 2 of 6 -- the intention wasn't to keep them out, but they weren't hearing kind of everything that we were saying, and that just kind of everything up into a little bow,\n\nInterviewer 11:42: yeah, I mean, and that makes sense. And then I guess there's a trust issue. Then moving forward, of if they're not listening the first time, are they going to continue to listen? So it feels like it's a breakdown of a relationship from the outset,\n\nSpeaker 1 11:57: and honestly, I don't know that she. Charlie understood the association part. We had been told that you that they have an association arm, but we didn't get that person, which is fine, but I don't think he understood. I mean, this is a 36 person organization. He brought us one candidate, candidate who that was the other part I should have mentioned. I don't think in California, you have to tell people what the salary range is, yeah, and we cannot ask for their salaries. It's a non, non negotiable, which is great. But he brought us someone who, again, looks good and presented well, who is well over a million dollars in salary, and he knew ours was like at 600 right around 700,000 total. So again, great candidate. But then we find out she's going to be like, $1.5 million\n\nInterviewer 13:00: yeah. And\n\nSpeaker 1 13:03: so yeah, and I don't know that she would have been chosen, but she was absolutely strong, even against our internal one. And our internal one brought a million but my my own candidate had to ask me, our internal candidate had to finally say, what is the range? And so I don't know that they were sharing that externally when they were talking to people. And it's a requirement in California. It's, it's a non negotiable, right? It's an actual law here.\n\nInterviewer 13:37: And what did did when you fed back this to Charlie, what was his response like? Was he pushing it to see if there was flex on it, or would you think it was?\n\nSpeaker 1 13:49: There were a couple conversations at the beginning, but we he knew the hard line, there was no way. 1.5 million was going No way. And he knew that we were very honest from the firm we gave them, it's a 40% bonus plus the range. And the range was 350, to 600 so the person that, again, that was we were considering that, or that presented, presented at 1.5 base, from what I understand, that was the discussion, okay?\n\nInterviewer 14:28: And in terms of the candidate that you have got, is that something that came via Charlie? Did you go with the internal candidate?\n\nSpeaker 1 14:37: She was, she's our internal, yeah, and, and she was great, and we figured our biggest thing was we wanted to be sure as an organization, because Jody was our, our operational, our operations person who didn't get a lot of opportunities under the last president. So she really had to come out and prove herself. She did. She there's no way would have chosen anybody else once they met with her and had her, 3060, 90, nobody knew it better. The board wanted to be sure they had the right person, because California is its own beast. And so she she had a leg up from the beginning, and we all knew that, but we also didn't know who was out there we had. They did bring a good candidate from API, which is our national organization. The guy just couldn't present. He was very government affairs. He was very Washington, DC, and not his fault. It is, you know what I mean. It is what he is. He was a good candidate, but just not, ultimately not what we were looking for. And that's again, we knew that Korn Ferry was either going to find us somebody, or was we were going to go internal. That wasn't a question. We knew what we were paying for from the very beginning.\n\nInterviewer 15:58: And if you, I suppose, reflecting on what you've just said about the kind of the internal candidate being in the front, running the position, and from the beginning, would would reflecting on the journey that -- 3 of 6 -- you had of engaging Korn Ferry. Would you have changed anything in retrospect, or would it still remain the same in terms of, you know, find us someone that's better and and that's the break,\n\nSpeaker 1 16:22: no, no, the board was really clear that they needed to see other candidates. There was no there was no opportunity. And again, had had our person been properly succession planned, we wouldn't have gone externally. But that was an internal thing that we had to deal with on our own, but we absolutely would have done it. There's no question about it. And rightfully so, we needed her to be the actual pick, not just the easy pick, yeah, yeah, makes sense.\n\nInterviewer 17:00: And in terms of the project, I mean, was there anything that you felt the team did?\n\nSpeaker 1 17:05: Well, yeah, I mean, it was, I think that, and this is just coming from someone who doesn't have the skill set, getting meetings, set up, set up, calling the proper, you know, getting the emails, getting everybody on the same page. Their administrative assistant was, was a phenom. She was, and I told her, as such, she was quite the talented, you know, calendar keeper. And, you know, the biggest thing was, like, I said, it's hard right now. I think that one, the packaging of the candidates was good. I don't know that the assessment was very helpful to us. We didn't spend a lot of time on that. But again, that's more understanding our members. Our members need those relationships. It's less what it tells us on paper that they might be good at. Now, I think it's helpful, but we did not utilize it\n\nInterviewer 18:15: at all. Okay, so value that to you.\n\nSpeaker 1 18:19: Yeah, for that one. But again, I think that it, if we had a more close candidate pool, it might have come into play, but Jody really walked away with it toward at the end like there was no question. So I don't it. I don't think it played a huge part in our assessment, but it could have so I don't want to, I don't want to say it was bad. It definitely wasn't that, but it just wasn't relevant, because our internal candidate turned out to be so strong, so again, so that necessarily, you know, I think the way that the packaging is the questions for the board members, the layout of the interview process, I think really helped, especially since, you know, our board members are engineers, they're they're government affairs or lobbyists. They're not HR. They don't spend any time interviewing people. They love having questions ready for them. And it was it. The packaging was great, right? So, the questions were good. It helped them stay on track. It helped keeping them in line with time. And so it was overall, it was really that that whole packaging, the questions were very relevant. They were actually formed to what we would need to know. So, you know, understanding and taking notes on what we were looking for in people. I thought Korn Ferry did well, okay,\n\nInterviewer 19:47: so again, going back to reflecting on the engagement, just, I suppose, pay it back to you. Is there anything else that you would like to have seen them do differently. It feels like there was a need to kind of respect the entire steer CO and lines of communication, and kind of the listening element of actually, kind of really listening feedback isn't and actioning\n\nSpeaker 1 20:16: it. Yeah, I think Charlie had an idea of what he typically does. As I said, even our internal candidate had mentioned, Charlie said a couple of times, I don't know why we have internal people. That's just it's only the board that we should be dealing with so it again, not knowing. But the truth is, and I had this conversation with Charlie directly, I said, I understand you're used to dealing with the board of directors. I said, but what you don't understand is that they don't know our daily operations, and so they're looking for, potentially, something that's going to be shiny and pretty on the outside, we need something that has internal understanding Association, not only Association experience, but also Association knowledge. So the one person, for example, that had the $1.5 million price tag on her, she's a lobbyist, politician. The board loved her. I found her ineffective because she was a politician, yeah, so again, not knowing what we need and understanding what the internal process is and the importance behind understanding the association. He just didn't have that whole I almost feel like it bothered him. Yeah, that it was like, I, you know, we're doing this because this is what we do. And -- 4 of 6 -- under normal circumstances, I would say is not wrong. I worked for a 20,000 person organization, and I couldn't imagine anyone internally hiring the president for it. That wouldn't make any sense. But the association is 36 people. We run all the advocacy, all the lobbying for the oil and gas on the west coast that includes Arizona, Nevada, Washington and Oregon. So it was really him. He again, he would always say, you know, okay, well, I'll do this. Well, then he'd call the board of director, like Charlie. Why would you call him? Yeah, like you guys agreed to change this. We didn't need to change it. So it I think he's just struggled with the concept of that, and I don't know why, yeah, but I did have the conversation directly with him at one point. Said, listen, we're not your typical Association. We we have to have someone who also understands the internal operations. I don't just need a figurehead out there, because, again, we have a lot of laws and regulations in California that external people don't understand. There's also a whole lot of smoothing that has to go on with politicians, but you also have to have the knowledge of the industry. This one candidate, again, she was brilliant. I'm not knocking her, but she could talk surface stuff, but it would have taken us a year and a half to get our product speed. So I again, I think it was a little bit more along the lines of not really understanding that portion for us. But, I mean, he was, he was a fine man. I mean, there's no no issues personality wise. It just for whatever reason that little sticking point was really hard just didn't\n\nInterviewer 24:07: click. I'm not sure why\n\nSpeaker 1 24:09: he mentioned it. I'm not sure why he mentioned it to our internal candidate. Yeah, and here's what I will say, it did come across in several of the meetings that he gave less weight. He didn't say anything in particular that I can point to. It was a manner in which is he was communicating that gave less weight or moved on from any our and we had myself, the Vice President of Communications was on it, who works hand in hand with the President and our general counsel, and it just seemed he wasn't always for some of the commentary that that came from that, and would always defer to the board. So there was just in we never confronted him in person, or any, you know anything like that. So I don't know what that hang up was, but it came across pretty clear. Okay, great.\n\nInterviewer 25:10: I'm conscious that we're nearly up at time. Shannon, obviously you said this was the first time that you'd worked with Korn Ferry. Would you use them again in a different circumstance?\n\nSpeaker 1 25:27: Honestly, I don't think so. And here's why, the last company that I had used previously, the communication was really strong. And again, potentially I wouldn't, I don't like to cancel people out. I think Charlie would be a no, but so you know right now they would not be on top of the list a call for sure, okay, right?\n\nInterviewer 26:03: I think, well, I mean, that's really helpful. No, I mean, that's exactly why we do these calls, right? It's to really understand the kind of the expectations and for the team to continue to feedback and get better. So I do appreciate, yeah,\n\nSpeaker 1 26:19: and I will, I will, you know, again, they've, we've had other executives that have reached out to Korn Ferry to, you know, we get poached all the time. People try and poach us. Oh, which is good, because I like the fact that we have very talented people just all you want. But so there was positive feedback from that. I did learn, like I said earlier, that there is an association arm and for whatever reason, and that's what I was told. So maybe there isn't, but that would have been the the people that I would have expected. And the reason I say there was an association arm is that Jody, who actually is our president, was part of an API, not an API, but a Korn Ferry interview for the Banking Association, and it turned out not to be a good fit. So she stayed with us, thank goodness, but she had worked with somebody who had direct association experience. So I think that's important. It sounds weird, because a lot of times you think, well, this is different associations. Are just different breeds, because they're not just ruled by a board, they're ruled by their members. And so the Board of Directors also made up of all the members, but government affairs, our government affairs committee is our strongest and most powerful when it comes to making decisions. So so I guess just having that association understanding, I you know, we're at a spot now where we're not going to need an -- 5 of 6 -- executive search for a while. Yeah, we've got, yeah, we've got. Our last President worked there 30 years. Our current president, Jody, has been there 25 years now, our general counsel who will probably take Jody's spot is in her early 30s, like we have, we have a very strong bench behind this so, but so it could be a while. So I wouldn't, I wouldn't say no, I would say this was a hard first experience for\n\nInterviewer 28:39: sure. Yeah, okay, that's really helpful. Great. Well, Shannon, I think we're at time, but thank you. I appreciate you the early start. I'm sorry that\n\nSpeaker 1 28:51: I'm in the car, so it worked out perfect. I just saw your times. I'm like, Oh, I don't want to get up at 5am yeah. Anyway, the dogs want to go out at 5am they're like, Hey, so, but I appreciate this. I appreciate you giving me the opportunity to give feedback, and I'm happy to talk again if anything's needed,\n\nInterviewer 29:14: that's great. I really do appreciate it. Thank you, Shannon, have a great day. Thanks. You too. Bye, so? -- 6 of 6 --"
}