{
  "id": "t-012",
  "sourceFile": "T7_NPS8_EMEA_ES_HOUSE_SEP25.pdf",
  "client": "Dr Nina Johanna Haltern",
  "interviewDate": "2025-09-29",
  "project": "Executive Search",
  "score": 8,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Interviewer 0:36",
      "text": "like, it's on reflex, yeah, no, that's fine. It's on. It's on in the background. If you're all right, I will also record this. It's just purely so my team can help me with the notes, so I'm not scribbling away. And then we delete it straight after we've we've finished taking the notes on it, so it's not saved anywhere for a long time. So it'd be great if we could start by if you could just give me an overview of your role in the business and your relationship with Korn Ferry. So how long you've been working with them?"
    },
    {
      "speaker": "Speaker 1 1:12",
      "text": "Okay, so I'm working as head of HR in Tenglemann, and I have another colleague who is our Chief People Officer and part of our management board, and she had been working with Korn Ferry for quite a while and in different different cases, and the search that I did with them a couple of months ago, we started in when we did? We start in April or so, was my first one with them, and it was about a role reporting to our CFO. And actually our Chief People Officer hired our CFO together with Korn Ferry. And then we thought it might be, it might make sense to also hire, hire this other pretty person reporting to her with Korn Ferry as well, since they already knew the kind of environment and the whole company situation. So to say"
    },
    {
      "speaker": "Interviewer 2:16",
      "text": "so, had you if this was your first time working with them in your current role? Had you previously had any engagements with him, or was this your first"
    },
    {
      "speaker": "Speaker 1 2:23",
      "text": "experience with Korn Ferry or with other consultants with Korn Ferry? With Korn Ferry? No, it was rather like secondhand information that I had via my via my boss who worked with them, not me. Great. So this was my first, very first time to really work with them."
    },
    {
      "speaker": "Speaker 2 2:42",
      "text": "Yeah. And you scored them an eight. Is that correct? Yeah. What was the scale out of 10? Unknown Speaker 2:51 Out of 10? Okay, yeah, yeah. So yeah, that's possible."
    },
    {
      "speaker": "Interviewer 2:56",
      "text": "It's hard to remember these days. Yeah. And if you could just maybe explain a little bit behind that scoring. So what worked well and what didn't work quite so well?"
    },
    {
      "speaker": "Speaker 1 3:07",
      "text": "So what worked well was the quality of the candidates they came up with, and I think they really had a good understanding of what we needed, because the role was also a bit special, especially for a German context. I would say, I think in the Anglo Saxonian Rome, it's a bit different, but that was, as I was told, a bit special in the German environment. And I think there was a really good understanding of the role, and they came out with good profiles. It took some time, and I have to say, maybe why, I know you wanted to hear about the good things first,"
    },
    {
      "speaker": "Interviewer 3:55",
      "text": "either or whatever comes naturally, because I'll capture it all anyway. Unknown Speaker 4:00 Yeah, I'm going to do this freestyle then. So profiles were really convincing."
    },
    {
      "speaker": "Speaker 1 4:10",
      "text": "-- 1 of 6 -- It took some time, which was a bit new to me, because I had been used to work with other smaller consultancies, rather boutique consultancies, where we were Unknown Speaker 4:26 perhaps so more important as a client, so to say, and"
    },
    {
      "speaker": "Speaker 1 4:34",
      "text": "and sometimes it this kind of collaboration with the smaller ones seemed more pragmatic to me, so it kind of rather matched my working style, whereas with Korn Ferry, I really, sometimes I have the impression they really need to to follow their standard procedure, which obviously makes sense because it's Also part of quality management and so on. And sometimes I would have liked them to be a bit more responsive. Is the wrong word, but, but Unknown Speaker 5:12 going with our flow, flexible,"
    },
    {
      "speaker": "Speaker 1 5:14",
      "text": "yeah, yeah, yeah. And that was maybe I this impression was even reinforced, because our CFO is very pushy, so she was the business person to hire the other one, and then she was really impatient. And I already always had to kind of balancing her impatience and there, yeah, when we follow our process and you, you need to, you need to to trust us and react. We are coming up with colleagues, but with candidates, but it takes some time and so on. So this was maybe also my, my role in between, so that she was very pushy, and sometimes I would also say that reaction time could have been shorter, so sometimes it took like 30 hours or so and but you have an email to three persons so that you one would have thought, okay, at least one of them could just tell me, Look, we are going to answer maybe tomorrow, but that you just gotten reaction, but in the end, I mean, candidates were really good, and we also found somebody now that we are very happy with. And I also, I mean, I also like the people involved, I have nice conversations with them. So that's also important. I mean,"
    },
    {
      "speaker": "Speaker 2 6:45",
      "text": "if you like the people, Well, absolutely,"
    },
    {
      "speaker": "Speaker 1 6:49",
      "text": "if you need to, when you need to work with them, yeah."
    },
    {
      "speaker": "Interviewer 6:51",
      "text": "So digging into, I guess, breaking down some of those areas we look at communication did, I mean, it's, did you have a regular kind of touch base in the in the diary, or was it ad hoc, depending on when there was progress regular,"
    },
    {
      "speaker": "Speaker 1 7:10",
      "text": "regular meeting? Yes, I did not even remember. At least we had planned to do it. No, but we also have we also had a regular touch point, but then on top, we also have these spontaneous meetings, yeah,"
    },
    {
      "speaker": "Interviewer 7:31",
      "text": "absolutely. And did they ask you, kind of how you prefer to engage, like, what channel suits you best? And in terms of managing your expectations. It feels like there was maybe sometimes a mismatch there on response rate."
    },
    {
      "speaker": "Speaker 1 7:46",
      "text": "Yeah, they asked me, and I even told them, Look, sometimes it's just, I mean, I understand if it takes some time for you to produce these nice reports and so on with all the logos and all the nice pictures from our website in there. Okay, that's your process, but sometimes it would have helped me to just get, like, the LinkedIn profile, which I obviously would not download from LinkedIn, but which would have helped me to see, okay, you're looking for the right people, and I can tell our CFO, they're working on it. And we have some other people, persons in the in the funnel."
    },
    {
      "speaker": "Interviewer 8:27",
      "text": "-- 2 of 6 -- Do they have much engagement with, I suppose your your key stakeholders, like the CFO, or all communications channel through you"
    },
    {
      "speaker": "Speaker 1 8:38",
      "text": "it was mostly with me. We had one call in the beginning with the CFO so that she could tell them exactly what she was looking for, and to also ensure, yeah, the right understanding of the role, which I obviously, I'm not a finance person, so I'm not able to really well explained what what is needed. So that was in the beginning. And then we had one more call where she was engaged. But this was already kind of a, let's say very first escalation is too much sad, but it was like, Okay, guys, could you please? Could you please get started, because we really need somebody, and are you really interested in this engagement? Because I do not get the impression right now, because she was very, very pushy and very, very much waiting, of course, for for the first profiles so but I mean, that was also something which I, of course, I understand they have the process, and it takes some time to find the right people and and I also see that they do not want To come up with profiles, which maybe then give the impression they haven't really understood what's, what it's all about. So it's, of course, it's a, it's a balancing of quality and and pace, yeah, which I perfectly understand. But in our case, it would have, it would have been, or some sort of flexibility, or a bigger flexibility towards pace, would have been helpful in terms of adaption to Unknown Speaker 10:29 our needs, or the personal need or of the involved people"
    },
    {
      "speaker": "Interviewer 10:35",
      "text": "make sense, and then in terms of the space of sector knowledge, so, you know, you said, it's not your area of expertise."
    },
    {
      "speaker": "Speaker 1 10:46",
      "text": "Yeah, there was really, there was really good and I think they really approached the right people in the right industries, and there was really, there was really good understanding. And then broaden up a bit also when or broaden the scope, when we asked them to do so. But that was, yeah, just to get some more profiles and get some more ideas of who else that could possibly be. But so they did that as well. And yeah, that was really convincing."
    },
    {
      "speaker": "Interviewer 11:20",
      "text": "Okay, nice. And so you've talked about quality and quantity. Were there enough quality candidates? Did that meet your expectations?"
    },
    {
      "speaker": "Speaker 1 11:31",
      "text": "Yeah, it was enough quality candidates. And I understand it wasn't that easy to find such a person. So this wasn't, yeah, accounting role, but with some other, some other tasks as well. So I guess it wasn't easy to come up with so many candidates, but it was rather, it was rather the it was not like quantity versus quality, but rather quality versus pace. So I think they have the understanding of, okay, we are going to work for a couple of weeks, and then we come up with a really nice short list and the fully described profiles and so on. And for us in this period, it would have been better to just get kind of the first profile to to work with, and maybe then already tell them, yeah, perfect. That's going in, that's going in the right direction. Or we would need one more of this, or maybe this person is, is nice, but it would would be good to have some more experience in this and that sector or whatever, but it was like waiting time for us, and especially this very impatient CFO who wanted to get started with the surge was felt a bit too long. But as I said, I mean, I understand the idea behind it, and the ideas to, as I said, deliver the perfect shortlist and so on. But maybe that a bit more adaptivity would have helped. But as I said, in the result it was, it was really good."
    },
    {
      "speaker": "Interviewer 13:15",
      "text": "And in terms of, then, I suppose finding the candidate did have, I mean, did they help? How did you find the experience of, I suppose, interview guides through to kind of negotiating the right package and signing contracts? Did? Did they assist in this? Would you expected them to?"
    },
    {
      "speaker": "Speaker 1 13:37",
      "text": "Yes, they assisted. And we, we also had a candidate who was very interesting for us, but who came up then with, yeah, an idea of a package which was really far beyond what we were able to, able or -- 3 of 6 -- willing to pay, which was not as clear as as it could have been from the very first moment. But I'm in this case, I think it was also, I mean, he, he maybe didn't play very honestly from the first moment, also with them. I mean, he gave some numbers, but it wasn't, it wasn't clear, neither to them nor to us, that this was, for him, kind of the minimum, and for us, it was like, okay, yeah, too high the direction, but it's, it's maybe a bit too much, okay, and so that was one, one difficult point. But then I mean, this is also something which I normally do do and which, and the situation showed me again that it really makes sense to talk about packages rather early in the process to at least Yeah, make sure that you're not on different planets."
    },
    {
      "speaker": "Interviewer 15:09",
      "text": "Absolutely, yeah, waste everybody's time."
    },
    {
      "speaker": "Speaker 1 15:14",
      "text": "So yeah, maybe that could have been managed, or that certainly could have been managed better from my end, during the during the process. But it was also because we had some some different steps. And it was, yeah, it was also for me, the first time to work with this new person, to work together with this new person. So also here internally, we had to kind of manage and find out how we best, we can best work together. So that was a bit different, also from other processes, where I'm much more used to work with the person, or at least I already know that person, even if it's the first time i i am working on a searching process together, but I already have have a better understanding of how this person thinks and behaves and so on. So it was kind of a very new constellation for all of us."
    },
    {
      "speaker": "Interviewer 16:12",
      "text": "Makes sense, kind of, I suppose, flipping to what did go well, especially, it'd be great to kind of bring in your context of working with other, maybe boutique search firms, what, how did they compare, and what worked well in terms of what they brought to the to the project"
    },
    {
      "speaker": "Speaker 1 16:31",
      "text": "Korn, Ferry, you mean no, as I said, good, good understanding of the role. I think it was also helpful to have them approaching the candidates because, I mean, it's also their name. I mean, that helps so people Unknown Speaker 16:53 are more probable to answer, I think, to confer ferry than to a no name."
    },
    {
      "speaker": "Speaker 1 17:02",
      "text": "What I also like was kind of the range of candidates in terms of very different types of people, both from a personal point of view, but also in terms of company cultural background. So to say that was also helpful. And what I also like was when, when you gave them comb, you it worked so you, they were they. I mean, they were always supportable, so to say. And they always told me, Look, we can support you even better, and so on. But then I also have to admit that from the point of getting to know the person a bit better, our policy internally is to also talk to them directly, because once you got this person to know, it's also a bit kind of artificial to then always have the triangle and talk to the to the consultant, and then, instead of talking directly To the candidate. So but maybe I understand, or that's maybe also something which they are more used to when it comes to sea level searches, which in our case was, I mean, in our case, it was just the head of function. And, yeah, I think they would have expected or and they are more used to be more involved over the whole process, and, yeah, and maybe we could have used them better, even especially in these, in these package related questions,"
    },
    {
      "speaker": "Interviewer 19:08",
      "text": "would you, I mean, on that, I suppose, reflecting on what you could have done differently too. Would you consider using them again?"
    },
    {
      "speaker": "Speaker 1 19:15",
      "text": "Yes, absolutely. I don't know our CFO, but yes, and maybe because she, in the very beginning, really had the impression they didn't want to do the they didn't want to have the job. Because she kind of had the impression it was just too low level for them, and they there was something missing, at least for her, from her perspective. And I was rather like, look, they need some time to sort, to sort things -- 4 of 6 -- out, and to to come up with a short list and so on. And yeah, it's not a boutique consultancy, but that's what we decided. And yeah, so, but make maybe this is just one interpersonal thing, or, you know, sometimes it's just Unknown Speaker 20:06 miscommunication,"
    },
    {
      "speaker": "Speaker 1 20:07",
      "text": "yeah, between, between the people involved. And I think I'm, I'm more easy going, more adaptive, maybe brilliant."
    },
    {
      "speaker": "Interviewer 20:19",
      "text": "And have you? I mean, have you come across their work, or, as anyone in the organization, kind of beyond search, so in more organization consulting, have you used them in that space? Or would you consider doing that? Unknown Speaker 20:34 I didn't understand the question. Sorry, I didn't get the"
    },
    {
      "speaker": "Interviewer 20:38",
      "text": "so called ferry of obviously, do more than search. So, you know, they look at kind of organizational consulting, kind of whether it's leadership assessment, succession"
    },
    {
      "speaker": "Speaker 1 20:53",
      "text": "structures, yes, I think so, but that would then rather be in one of our portfolio companies, and not for us as the holding. But I think, yes, yeah, definitely, also when maybe, if you are working closely with them already for the searches, and then they already know parts of the management team at least, or that they know the whole story, the challenges and so on. Of course, it could be of great help to also get them involved when it comes to redesigning organizational structures or so. Yeah, I think so, at least on the upper level. Of course, yeah,"
    },
    {
      "speaker": "Interviewer 21:37",
      "text": "great. And then last question that's a bit broader in terms of using consultancies and search. Search consultancies and firms, how much do you expect them to lean into kind of data and tech enabled insights to be able to drive you know whether it's better candidates or benchmarking for pay, is that, is that something that you expect as a given, that you look out for?"
    },
    {
      "speaker": "Speaker 1 22:08",
      "text": "I mean, at least I expect them to be informed about the market, which obviously, in these times, also means to be technically on a level that it's not just kind of a intuition or so, but it's kind of data based also and but yes, I somehow I would expect them to to also support post tech enabled solutions and so on. But on the other hand, my impression of the whole consultancy or Headhunter industry is that they are not that much tech driven, because you always get these PDFs and these nice pictures and so on. So for them, it was already like, ah, yeah, I think we are, yeah, we are going to send them by email. And I was like, No, I don't. Didn't want to get them by email. I didn't want to have any profiles in my in my inbox. I just going to share your drive, and you could put them there, and when once the search is finished, I'm just going to close the drive, then I'm perfectly fine with all the data security things and so on. And that was already like, Ah, okay, yeah, yeah, if you want, we can do that. So, but this is an experience that I have had, that I already made a couple of times that they the whole industry does not seem to be at the very pioneer position in terms of what is technically possible or maybe also recommendable. Yeah. Oh, that's"
    },
    {
      "speaker": "Interviewer 23:57",
      "text": "really interesting. That's great. I think that's great. I think that's it. From my side. Is there anything else that you would find it useful to share?"
    },
    {
      "speaker": "Speaker 1 24:09",
      "text": "No, I don't think so. I I've told you everything, and I really want to make sure. I mean, I'm really happy with the result. I like the people they were, I really liked the process also, even it was a bit slow in the -- 5 of 6 -- beginning and had some challenges also for me in in this internal collaboration. But I really, really like, like the collaboration, and I'm just a person who gives Unknown Speaker 24:41 feedback. They really look for. Unknown Speaker 24:45 I do it, but it's, I do not want to give them any negative grades or so absolutely."
    },
    {
      "speaker": "Interviewer 24:57",
      "text": "I mean, so So you know what happens is that we write it up into report for their team. But I mean, as you said, there's nothing in here that's a cause for alarm or negativity. You know, the whole point of this program is to make incremental change to solve some of those kind of smaller gripes. And, you know, make sure that actually there is a every time there's an engagement, it meets your expectations or exceeds them, which is obviously where they're where they're aiming for. So any feedback is always positive and good, and it's all and that, you know, the team over there, when I've been feeling it back to them, they've been really receptive to it and and really open to it as well. So there isn't no one's going to feel like they're been taken to the headmaster's office."
    },
    {
      "speaker": "Speaker 1 25:44",
      "text": "Okay, and I didn't tell you anything that I wouldn't have told them. I exactly"
    },
    {
      "speaker": "Interviewer 25:50",
      "text": "it's just, it just gives us an opportunity to surface it. So really appreciate you taking the time to do that and being so clear with us. And Lovely to meet you. Lovely to meet you. Thanks -- 6 of 6 --"
    }
  ],
  "rawText": "Interviewer 0:36: like, it's on reflex, yeah, no, that's fine. It's on. It's on in the background. If you're all right, I will also record this. It's just purely so my team can help me with the notes, so I'm not scribbling away. And then we delete it straight after we've we've finished taking the notes on it, so it's not saved anywhere for a long time. So it'd be great if we could start by if you could just give me an overview of your role in the business and your relationship with Korn Ferry. So how long you've been working with them?\n\nSpeaker 1 1:12: Okay, so I'm working as head of HR in Tenglemann, and I have another colleague who is our Chief People Officer and part of our management board, and she had been working with Korn Ferry for quite a while and in different different cases, and the search that I did with them a couple of months ago, we started in when we did? We start in April or so, was my first one with them, and it was about a role reporting to our CFO. And actually our Chief People Officer hired our CFO together with Korn Ferry. And then we thought it might be, it might make sense to also hire, hire this other pretty person reporting to her with Korn Ferry as well, since they already knew the kind of environment and the whole company situation. So to say\n\nInterviewer 2:16: so, had you if this was your first time working with them in your current role? Had you previously had any engagements with him, or was this your first\n\nSpeaker 1 2:23: experience with Korn Ferry or with other consultants with Korn Ferry? With Korn Ferry? No, it was rather like secondhand information that I had via my via my boss who worked with them, not me. Great. So this was my first, very first time to really work with them.\n\nSpeaker 2 2:42: Yeah. And you scored them an eight. Is that correct? Yeah. What was the scale out of 10? Unknown Speaker 2:51 Out of 10? Okay, yeah, yeah. So yeah, that's possible.\n\nInterviewer 2:56: It's hard to remember these days. Yeah. And if you could just maybe explain a little bit behind that scoring. So what worked well and what didn't work quite so well?\n\nSpeaker 1 3:07: So what worked well was the quality of the candidates they came up with, and I think they really had a good understanding of what we needed, because the role was also a bit special, especially for a German context. I would say, I think in the Anglo Saxonian Rome, it's a bit different, but that was, as I was told, a bit special in the German environment. And I think there was a really good understanding of the role, and they came out with good profiles. It took some time, and I have to say, maybe why, I know you wanted to hear about the good things first,\n\nInterviewer 3:55: either or whatever comes naturally, because I'll capture it all anyway. Unknown Speaker 4:00 Yeah, I'm going to do this freestyle then. So profiles were really convincing.\n\nSpeaker 1 4:10: -- 1 of 6 -- It took some time, which was a bit new to me, because I had been used to work with other smaller consultancies, rather boutique consultancies, where we were Unknown Speaker 4:26 perhaps so more important as a client, so to say, and\n\nSpeaker 1 4:34: and sometimes it this kind of collaboration with the smaller ones seemed more pragmatic to me, so it kind of rather matched my working style, whereas with Korn Ferry, I really, sometimes I have the impression they really need to to follow their standard procedure, which obviously makes sense because it's Also part of quality management and so on. And sometimes I would have liked them to be a bit more responsive. Is the wrong word, but, but Unknown Speaker 5:12 going with our flow, flexible,\n\nSpeaker 1 5:14: yeah, yeah, yeah. And that was maybe I this impression was even reinforced, because our CFO is very pushy, so she was the business person to hire the other one, and then she was really impatient. And I already always had to kind of balancing her impatience and there, yeah, when we follow our process and you, you need to, you need to to trust us and react. We are coming up with colleagues, but with candidates, but it takes some time and so on. So this was maybe also my, my role in between, so that she was very pushy, and sometimes I would also say that reaction time could have been shorter, so sometimes it took like 30 hours or so and but you have an email to three persons so that you one would have thought, okay, at least one of them could just tell me, Look, we are going to answer maybe tomorrow, but that you just gotten reaction, but in the end, I mean, candidates were really good, and we also found somebody now that we are very happy with. And I also, I mean, I also like the people involved, I have nice conversations with them. So that's also important. I mean,\n\nSpeaker 2 6:45: if you like the people, Well, absolutely,\n\nSpeaker 1 6:49: if you need to, when you need to work with them, yeah.\n\nInterviewer 6:51: So digging into, I guess, breaking down some of those areas we look at communication did, I mean, it's, did you have a regular kind of touch base in the in the diary, or was it ad hoc, depending on when there was progress regular,\n\nSpeaker 1 7:10: regular meeting? Yes, I did not even remember. At least we had planned to do it. No, but we also have we also had a regular touch point, but then on top, we also have these spontaneous meetings, yeah,\n\nInterviewer 7:31: absolutely. And did they ask you, kind of how you prefer to engage, like, what channel suits you best? And in terms of managing your expectations. It feels like there was maybe sometimes a mismatch there on response rate.\n\nSpeaker 1 7:46: Yeah, they asked me, and I even told them, Look, sometimes it's just, I mean, I understand if it takes some time for you to produce these nice reports and so on with all the logos and all the nice pictures from our website in there. Okay, that's your process, but sometimes it would have helped me to just get, like, the LinkedIn profile, which I obviously would not download from LinkedIn, but which would have helped me to see, okay, you're looking for the right people, and I can tell our CFO, they're working on it. And we have some other people, persons in the in the funnel.\n\nInterviewer 8:27: -- 2 of 6 -- Do they have much engagement with, I suppose your your key stakeholders, like the CFO, or all communications channel through you\n\nSpeaker 1 8:38: it was mostly with me. We had one call in the beginning with the CFO so that she could tell them exactly what she was looking for, and to also ensure, yeah, the right understanding of the role, which I obviously, I'm not a finance person, so I'm not able to really well explained what what is needed. So that was in the beginning. And then we had one more call where she was engaged. But this was already kind of a, let's say very first escalation is too much sad, but it was like, Okay, guys, could you please? Could you please get started, because we really need somebody, and are you really interested in this engagement? Because I do not get the impression right now, because she was very, very pushy and very, very much waiting, of course, for for the first profiles so but I mean, that was also something which I, of course, I understand they have the process, and it takes some time to find the right people and and I also see that they do not want To come up with profiles, which maybe then give the impression they haven't really understood what's, what it's all about. So it's, of course, it's a, it's a balancing of quality and and pace, yeah, which I perfectly understand. But in our case, it would have, it would have been, or some sort of flexibility, or a bigger flexibility towards pace, would have been helpful in terms of adaption to Unknown Speaker 10:29 our needs, or the personal need or of the involved people\n\nInterviewer 10:35: make sense, and then in terms of the space of sector knowledge, so, you know, you said, it's not your area of expertise.\n\nSpeaker 1 10:46: Yeah, there was really, there was really good and I think they really approached the right people in the right industries, and there was really, there was really good understanding. And then broaden up a bit also when or broaden the scope, when we asked them to do so. But that was, yeah, just to get some more profiles and get some more ideas of who else that could possibly be. But so they did that as well. And yeah, that was really convincing.\n\nInterviewer 11:20: Okay, nice. And so you've talked about quality and quantity. Were there enough quality candidates? Did that meet your expectations?\n\nSpeaker 1 11:31: Yeah, it was enough quality candidates. And I understand it wasn't that easy to find such a person. So this wasn't, yeah, accounting role, but with some other, some other tasks as well. So I guess it wasn't easy to come up with so many candidates, but it was rather, it was rather the it was not like quantity versus quality, but rather quality versus pace. So I think they have the understanding of, okay, we are going to work for a couple of weeks, and then we come up with a really nice short list and the fully described profiles and so on. And for us in this period, it would have been better to just get kind of the first profile to to work with, and maybe then already tell them, yeah, perfect. That's going in, that's going in the right direction. Or we would need one more of this, or maybe this person is, is nice, but it would would be good to have some more experience in this and that sector or whatever, but it was like waiting time for us, and especially this very impatient CFO who wanted to get started with the surge was felt a bit too long. But as I said, I mean, I understand the idea behind it, and the ideas to, as I said, deliver the perfect shortlist and so on. But maybe that a bit more adaptivity would have helped. But as I said, in the result it was, it was really good.\n\nInterviewer 13:15: And in terms of, then, I suppose finding the candidate did have, I mean, did they help? How did you find the experience of, I suppose, interview guides through to kind of negotiating the right package and signing contracts? Did? Did they assist in this? Would you expected them to?\n\nSpeaker 1 13:37: Yes, they assisted. And we, we also had a candidate who was very interesting for us, but who came up then with, yeah, an idea of a package which was really far beyond what we were able to, able or -- 3 of 6 -- willing to pay, which was not as clear as as it could have been from the very first moment. But I'm in this case, I think it was also, I mean, he, he maybe didn't play very honestly from the first moment, also with them. I mean, he gave some numbers, but it wasn't, it wasn't clear, neither to them nor to us, that this was, for him, kind of the minimum, and for us, it was like, okay, yeah, too high the direction, but it's, it's maybe a bit too much, okay, and so that was one, one difficult point. But then I mean, this is also something which I normally do do and which, and the situation showed me again that it really makes sense to talk about packages rather early in the process to at least Yeah, make sure that you're not on different planets.\n\nInterviewer 15:09: Absolutely, yeah, waste everybody's time.\n\nSpeaker 1 15:14: So yeah, maybe that could have been managed, or that certainly could have been managed better from my end, during the during the process. But it was also because we had some some different steps. And it was, yeah, it was also for me, the first time to work with this new person, to work together with this new person. So also here internally, we had to kind of manage and find out how we best, we can best work together. So that was a bit different, also from other processes, where I'm much more used to work with the person, or at least I already know that person, even if it's the first time i i am working on a searching process together, but I already have have a better understanding of how this person thinks and behaves and so on. So it was kind of a very new constellation for all of us.\n\nInterviewer 16:12: Makes sense, kind of, I suppose, flipping to what did go well, especially, it'd be great to kind of bring in your context of working with other, maybe boutique search firms, what, how did they compare, and what worked well in terms of what they brought to the to the project\n\nSpeaker 1 16:31: Korn, Ferry, you mean no, as I said, good, good understanding of the role. I think it was also helpful to have them approaching the candidates because, I mean, it's also their name. I mean, that helps so people Unknown Speaker 16:53 are more probable to answer, I think, to confer ferry than to a no name.\n\nSpeaker 1 17:02: What I also like was kind of the range of candidates in terms of very different types of people, both from a personal point of view, but also in terms of company cultural background. So to say that was also helpful. And what I also like was when, when you gave them comb, you it worked so you, they were they. I mean, they were always supportable, so to say. And they always told me, Look, we can support you even better, and so on. But then I also have to admit that from the point of getting to know the person a bit better, our policy internally is to also talk to them directly, because once you got this person to know, it's also a bit kind of artificial to then always have the triangle and talk to the to the consultant, and then, instead of talking directly To the candidate. So but maybe I understand, or that's maybe also something which they are more used to when it comes to sea level searches, which in our case was, I mean, in our case, it was just the head of function. And, yeah, I think they would have expected or and they are more used to be more involved over the whole process, and, yeah, and maybe we could have used them better, even especially in these, in these package related questions,\n\nInterviewer 19:08: would you, I mean, on that, I suppose, reflecting on what you could have done differently too. Would you consider using them again?\n\nSpeaker 1 19:15: Yes, absolutely. I don't know our CFO, but yes, and maybe because she, in the very beginning, really had the impression they didn't want to do the they didn't want to have the job. Because she kind of had the impression it was just too low level for them, and they there was something missing, at least for her, from her perspective. And I was rather like, look, they need some time to sort, to sort things -- 4 of 6 -- out, and to to come up with a short list and so on. And yeah, it's not a boutique consultancy, but that's what we decided. And yeah, so, but make maybe this is just one interpersonal thing, or, you know, sometimes it's just Unknown Speaker 20:06 miscommunication,\n\nSpeaker 1 20:07: yeah, between, between the people involved. And I think I'm, I'm more easy going, more adaptive, maybe brilliant.\n\nInterviewer 20:19: And have you? I mean, have you come across their work, or, as anyone in the organization, kind of beyond search, so in more organization consulting, have you used them in that space? Or would you consider doing that? Unknown Speaker 20:34 I didn't understand the question. Sorry, I didn't get the\n\nInterviewer 20:38: so called ferry of obviously, do more than search. So, you know, they look at kind of organizational consulting, kind of whether it's leadership assessment, succession\n\nSpeaker 1 20:53: structures, yes, I think so, but that would then rather be in one of our portfolio companies, and not for us as the holding. But I think, yes, yeah, definitely, also when maybe, if you are working closely with them already for the searches, and then they already know parts of the management team at least, or that they know the whole story, the challenges and so on. Of course, it could be of great help to also get them involved when it comes to redesigning organizational structures or so. Yeah, I think so, at least on the upper level. Of course, yeah,\n\nInterviewer 21:37: great. And then last question that's a bit broader in terms of using consultancies and search. Search consultancies and firms, how much do you expect them to lean into kind of data and tech enabled insights to be able to drive you know whether it's better candidates or benchmarking for pay, is that, is that something that you expect as a given, that you look out for?\n\nSpeaker 1 22:08: I mean, at least I expect them to be informed about the market, which obviously, in these times, also means to be technically on a level that it's not just kind of a intuition or so, but it's kind of data based also and but yes, I somehow I would expect them to to also support post tech enabled solutions and so on. But on the other hand, my impression of the whole consultancy or Headhunter industry is that they are not that much tech driven, because you always get these PDFs and these nice pictures and so on. So for them, it was already like, ah, yeah, I think we are, yeah, we are going to send them by email. And I was like, No, I don't. Didn't want to get them by email. I didn't want to have any profiles in my in my inbox. I just going to share your drive, and you could put them there, and when once the search is finished, I'm just going to close the drive, then I'm perfectly fine with all the data security things and so on. And that was already like, Ah, okay, yeah, yeah, if you want, we can do that. So, but this is an experience that I have had, that I already made a couple of times that they the whole industry does not seem to be at the very pioneer position in terms of what is technically possible or maybe also recommendable. Yeah. Oh, that's\n\nInterviewer 23:57: really interesting. That's great. I think that's great. I think that's it. From my side. Is there anything else that you would find it useful to share?\n\nSpeaker 1 24:09: No, I don't think so. I I've told you everything, and I really want to make sure. I mean, I'm really happy with the result. I like the people they were, I really liked the process also, even it was a bit slow in the -- 5 of 6 -- beginning and had some challenges also for me in in this internal collaboration. But I really, really like, like the collaboration, and I'm just a person who gives Unknown Speaker 24:41 feedback. They really look for. Unknown Speaker 24:45 I do it, but it's, I do not want to give them any negative grades or so absolutely.\n\nInterviewer 24:57: I mean, so So you know what happens is that we write it up into report for their team. But I mean, as you said, there's nothing in here that's a cause for alarm or negativity. You know, the whole point of this program is to make incremental change to solve some of those kind of smaller gripes. And, you know, make sure that actually there is a every time there's an engagement, it meets your expectations or exceeds them, which is obviously where they're where they're aiming for. So any feedback is always positive and good, and it's all and that, you know, the team over there, when I've been feeling it back to them, they've been really receptive to it and and really open to it as well. So there isn't no one's going to feel like they're been taken to the headmaster's office.\n\nSpeaker 1 25:44: Okay, and I didn't tell you anything that I wouldn't have told them. I exactly\n\nInterviewer 25:50: it's just, it just gives us an opportunity to surface it. So really appreciate you taking the time to do that and being so clear with us. And Lovely to meet you. Lovely to meet you. Thanks -- 6 of 6 --"
}