{
  "id": "t-024",
  "sourceFile": "T19_NPS9_NA_ES_HOUSE_OCT25.pdf",
  "client": "Jen Anderson",
  "interviewDate": "2025-10-27",
  "project": "Executive Search",
  "score": 9,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Interviewer 0:13",
      "text": "Hello, Hi, Jen, nice to meet you. Nice to meet you today. Yeah, I'm good. Thank you. Thanks for changing the time"
    },
    {
      "speaker": "Speaker 1 0:21",
      "text": "to appreciate it. No worries at all. Totally understand. Great."
    },
    {
      "speaker": "Interviewer 0:25",
      "text": "Thank you. So I'll try not to take up your whole half an hour, but a little bit of admin first. Are you okay if I record this, it's my team. Could help me make notes. Yeah, no problem. Thank you. It doesn't, it doesn't delete it after that, so soon and yeah, just to introduce myself, so I'm Interview. I'm the managing partner at a growth consultancy. We've worked with Korn Ferry for about five or six years now, so we know their business well, and they've asked us to run these interviews with the hope that you can speak more freely, be more transparent with us, and then obviously, you know, they can really work on, how do they improve their customer service to their clients? So I'll just start with, if you asking you if you can give me the context of your role in the organization and your relationship that you've had with Korn Ferry to date."
    },
    {
      "speaker": "Speaker 1 1:23",
      "text": "So my role in the organization, I lead strategy M and A and ESG within Generac, my relationship with the firm, thus far, I've had an on and off relationship from they've called me with regards to roles historically, but I've never actually been placed by them. And then, because of that historic relationship where I got to know some of the recruiters and enjoyed the experience, I called one of their recruiters who I knew best in order to engage the firm to help me with two specific roles that I needed to place people"
    },
    {
      "speaker": "Interviewer 2:03",
      "text": "right. And with those specific roles, did you only go to them first, or did you? Did you put it out to tender to other people as well? I just went to them okay? And could do you determine what those two roles were?"
    },
    {
      "speaker": "Speaker 1 2:20",
      "text": "It was a director of sustainability and a Senior Director of Corporate"
    },
    {
      "speaker": "Interviewer 2:26",
      "text": "Development, okay, great. And how was the experience overall? How did it? Did it live up to expectations for you?"
    },
    {
      "speaker": "Speaker 1 2:33",
      "text": "-- 1 of 8 -- Yeah, I would say I dealt with two very distinct teams, and I had two separate experiences. The corporate development experience was, I would say exactly I would as I would have expected, and very, very good. And that was the team I was most familiar with previously, the ESG experience. And so we did place somebody, and my team, they're working out great, and it's been a great experience. The ESG role, or sustainability role, we were not able to find somebody, and so we ended up canceling the placement and not moving forward with the role. The experience was okay, but I would say it was not quite the same as the m&a role. Probably, I would say a bit, because I was so used to how the M and A roles were done, that I was expecting kind of the same experience, and they are very different functions, so my expectation was probably a little bit"
    },
    {
      "speaker": "Interviewer 3:33",
      "text": "different. And in terms of the ESG role that didn't move forward. I mean, is that a reflection of them not being able to find the right candidate, or did other things change in the business as well"
    },
    {
      "speaker": "Speaker 1 3:45",
      "text": "not being able to find the right candidate, but I think partly because of also our compensation levels with regards to the role, and probably A bit of a mismatch upfront with expectation versus compensation level, and where we thought the market was for the our ability to get somebody at that level relative to the compensation we had available."
    },
    {
      "speaker": "Interviewer 4:14",
      "text": "Yeah, makes sense. Did they dig into that at the beginning? Did they flag that as a potential issue?"
    },
    {
      "speaker": "Speaker 1 4:22",
      "text": "A little, probably not as much as we realistically needed, because at the end of the day, we ended up getting quite junior people for a director level role that just weren't going to work for our organization to give a director level. And so, you know, for instance, having somebody that was a manager somewhere else, that had only been a manager for like, a year or two, we weren't going to be able to put as a director in our organization. And so it was just a mismatch of experience levels. But admittedly, our compensation wasn't, at least for that moment in time where it needed to be. It seems to be able to get the director level talent we were hoping to get. And so I think it was just a mismatch. So that's why we decided to just stop, because we weren't getting what we seem to need to get. And so it feel felt a little futile at a certain point. Okay?"
    },
    {
      "speaker": "Interviewer 5:14",
      "text": "And is that something that you are going to as an organization? Is it a role that you still need? Are you going to revisit it later on, down the line, or"
    },
    {
      "speaker": "Speaker 1 5:22",
      "text": "potentially, yeah, right now I'm dealing with it with outside consultants in order to fill the gap until either they the compensation of those roles kind of normalizes. Or, I mean, I'll just keep using outside support, because I think there when I was recruiting for it in particular, it was coming off the tail end of when sustainability was the, you -- 2 of 8 -- know, hot roll. And so compensation had gotten very high relative to what historically it had been. And so people were demanding very, very high compensation. Relative to what I think, you know, firms like ours were traditionally thinking of spending for those"
    },
    {
      "speaker": "Interviewer 6:09",
      "text": "kind of roles. Did did that team bring in anybody from the Korn Ferry, ESG practice to support here? Or is that? I mean, are you aware that they've got that Unknown Speaker 6:18 team? Yeah, that was the team that was helping, yeah,"
    },
    {
      "speaker": "Interviewer 6:22",
      "text": "not, not in state, but yeah, in terms of their, their whole ESG consultancy practice, Unknown Speaker 6:30 no, okay,"
    },
    {
      "speaker": "Interviewer 6:34",
      "text": "and in terms of both projects, how was the how's the communication with you from start to finish? Did it meet your expectations in terms of keeping you up to date, kind of managing multiple stakeholders? If that was the case,"
    },
    {
      "speaker": "Speaker 1 6:49",
      "text": "yes, I think we did neat weekly for both projects, weekly meetings in order to update myself as well as other constituents that were helping with the process. There were email updates, and then we would do the weekly meeting. And then if we were bringing somebody in, there were prep packages. Along with that, they had, again, a bit different styles with regards to how it was handled. The M and A team had a PowerPoint that was given each week that had profiles of every candidate that were included, and then, like a tracker that was in there, so it was, you could reference it later with all the details in there. The ESG team was more, I would say, informal with their delivery of materials, and that it was email more and less formalized, but communication was still very active. It was just a different style of communication. And again, I think it's because of different types of"
    },
    {
      "speaker": "Interviewer 7:50",
      "text": "functions. Yeah, yeah. What would your preference be if you could choose?"
    },
    {
      "speaker": "Speaker 1 7:54",
      "text": "Again, I'm at heart an m&a person, so I was more used to the m&a side."
    },
    {
      "speaker": "Interviewer 8:00",
      "text": "And if we focus on the M and a role, how did they do in terms of providing both quality and quantity of candidates? Did they meet your expectations?"
    },
    {
      "speaker": "Speaker 1 8:13",
      "text": "Yeah, absolutely. It was very strong, great."
    },
    {
      "speaker": "Interviewer 8:17",
      "text": "-- 3 of 8 -- And did they? Did they then, in terms of then the selection process. Did they help negotiate the package and contracts, or was that something you guys did"
    },
    {
      "speaker": "Speaker 1 8:29",
      "text": "a bit yes, my internal team ended up doing a bit more of it, just because of preference, not because of capability, because our internal recruiters like to do a lot of that. Yeah, but they provided background, and I would say, a lot of the level setting and positioning that let made it an easy process for our team to come in, so there wasn't a lot of back and forth. So they kind of laid all the groundwork. Great."
    },
    {
      "speaker": "Interviewer 8:55",
      "text": "Thank you. Did you use any of the, I suppose, additional tools? So their assessment tools, pay benchmarking and anything like that, to help with the process. Unknown Speaker 9:09 No"
    },
    {
      "speaker": "Interviewer 9:12",
      "text": "is I mean, is that something you that you were aware of, or what did they talk to you about those Was it something that you chose"
    },
    {
      "speaker": "Speaker 1 9:20",
      "text": "to not use the pay I we talked more whole, like, philosophically, let's say i The budget was the budget so I knew where we were relative to market."
    },
    {
      "speaker": "Interviewer 9:33",
      "text": "Whatever you say,"
    },
    {
      "speaker": "Speaker 1 9:35",
      "text": "yeah, like, yes, we're light. So that wasn't probably a good use of funds on that one on the assessment tools, we didn't talk about it. I was aware that there were tools that could have been used, but it wasn't something we spent a lot of time about. It's probably something that if I were hiring more people, I would have probably engaged in for an individual role, and my team is so small, it probably wasn't as an effective of a thing to go to do, just given the nature of the role I was hiring for and the size team and such, yeah."
    },
    {
      "speaker": "Interviewer 10:20",
      "text": "And in terms of the yes was the overall experience, is there anything they could have done better? Obviously, we'll come back to the ESG one, but when you're thinking about the MNA one, um, I"
    },
    {
      "speaker": "Speaker 1 10:43",
      "text": "I think at the end of the day, it was a difficult role to fill. We needed in person. We needed somebody with, you know, a lot of skilled transaction experience, and at that odd senior, but not highest level senior, kind of tenor, and they were able to find a number of qualified candidates, and so I think they did a really good job. I can't say anything negative about the experience. So overall, I would hire them again, and potentially we might for next year to fill my second senior director role that I have open. So we're just waiting on hiring that till next year. Okay, -- 4 of 8 --"
    },
    {
      "speaker": "Interviewer 11:27",
      "text": "so it was very positive. Would you use them for anything else? I mean, are you familiar with the kind of, I suppose, the range of things that they do? Yes."
    },
    {
      "speaker": "Speaker 1 11:35",
      "text": "So we use them as a company last year for our spans and layers exercise, our culture assessment. So they had been working with the company on those type of projects, and I think we've used them for, you know, a few other HR related projects. So I think, yes, I would use them. I think the firm is very strong on people related capabilities. I'm not familiar with every capability, but I've used them on a few different avenues, and certainly for the recruiting side, I think they've got very strong capabilities and relationships, which is, I think you know half of the battle, right?"
    },
    {
      "speaker": "Interviewer 12:23",
      "text": "Well, and that was my follow up point. So yeah, I suppose, in terms of what you use them for, from recruitment, what's more important to you, is it the, is it the individual that you get and their relationships and their black book, or is it the kind of the board, the brand, the brand Halo and being able to have the kind of broader frameworks and practice,"
    },
    {
      "speaker": "Speaker 1 12:51",
      "text": "I think you know, so it probably depends on function at the end of the day a little bit. But my experiences thus far have been relationship driven in that they've been able to bring really strong candidates to me and and the even on the other side, when I've been the person they've been for really great companies that I've had conversations with them with regards to, I don't know if that's because they have great relationships or because it's Korn Ferry, yeah. But regardless, the the type of candidates in the type of companies that Korn Ferry works with are very strong on both sides. So it leads me to want to partner with them versus some other firms. I've worked with smaller firms in the past, and I've found, while they can be very helpful in niche categories where they're very focused for broad based recruiting or capabilities, this tends working with somebody like a Korn Ferry has been very helpful to have a firm with the breadth of name recognition as well as relationships."
    },
    {
      "speaker": "Interviewer 14:11",
      "text": "Is there any kind of value add activity that you would expect to see from them now you've kind of engaged them directly so ongoing."
    },
    {
      "speaker": "Speaker 1 14:23",
      "text": "I think the thing that would be helpful is probably just the follow up afterwards, so that it's not just the you know we place somebody, they know that I have another role that I might look to fill later, or on the ESG side that we didn't fill the role. So perhaps if they see candidates in the future that might be a good fit, now that they know our culture and what we're looking for, even if they're not actively engaged, that if they find somebody they think might be a good fit, saying, Hey, we do have somebody. Would you want to see them so that I could proactively engage them again, versus having to go through a huge process, right? That would be very helpful, because I am still looking for both of those roles, and if I could easily fit somebody in that, and I'm happy to pay them for it, it's more about just finding, instead of, you know, doing -- 5 of 8 -- a massive search. If we could find somebody that they know now that they know me and they know my teams, that would be very valuable."
    },
    {
      "speaker": "Interviewer 15:17",
      "text": "Yeah, amazing. Okay. And then I suppose, in terms of future proofing your team, I mean, how much are you thinking about the balance between kind of current skills and future skills and things like AI? Is that? Is that something that's a challenge or a concern for you right now,"
    },
    {
      "speaker": "Speaker 1 15:38",
      "text": "that issue was particularly for both actually, it's been one of the things we were focused on. For instance, with the MNA role, when we thought about the two roles we needed, we started with one, and one of the big focus areas was finding, given the skill sets we had already from junior team members, how do we fill out the skill set on the team. And then when we found the candidate, we found for our next candidate, then we could whereas we had very strict qualifications. For instance, I didn't want somebody coming straight from banking, because they thought it would be very challenging in our corporate environment. But since we found somebody who had a different set of skills, then we could fill somebody in, perhaps for the next role that had come straight from banking, because we could balance out similarly with the AI question. For instance, I am no longer looking for just analyst level work, because I can cover a lot of the analyst level work with AI based programs and leverage that for some of the more lower level skilled work. So I think we're kind of using some of the more intelligent solutions out there to cover some of the base work, and so we can upskill the team levels. And same for the ESG work. One of our abilities was, we're driving automation and some machine learning to do a lot of the work we had initially thought we would do with people, so it is allowing us to have less lower level skilled work. Is driving no higher requiring higher level people though to be able to analyze and actually ensure that it's actually being done right, and then we're driving the correct conclusions out of all the data, because you can grab a lot of data, but what do you do with it? Yeah,"
    },
    {
      "speaker": "Interviewer 17:25",
      "text": "exactly, okay. And I suppose, going back to the role that you they didn't fill is, I mean, do you want to just expand on, I suppose your experience there, and where did the kind of frustrations kind of kick in? If there were any,"
    },
    {
      "speaker": "Speaker 1 17:41",
      "text": "um, sure, yeah, I don't know that it was per se frustration with the team or with the service being provided at all. I actually thought very skilled team, and they were bringing very actively candidates and we're searching very actively. I truthfully think the biggest issue, like I mentioned before, was the the gap between where we were with compensation, with where the market was, with comp, with needing to be in person, which the sustainability field had gotten very far away from that at that moment in time. It's only kind of now starting to move to more in person, and that field in particular, had gotten very used to being like it doesn't matter where you are because of what they do by nature. And so most people we talked to didn't want to even consider moving. And our culture is a very in office culture, so that was a very big hurdle. And culturally within the Generac construct, a director is considered as a pretty senior role. And so the people that were taking our calls, that were willing to -- 6 of 8 -- move at the comp level were more like current managers, or people who had just made manager, and they were very young in their careers, and it would not have been very well accepted. They would not have been very well accepted in Generac as director level employees, they didn't have the right experience or seniority. So we had this big gap between what was our expectations relative to what we could find and so that's why we just stopped it, because it felt like either we needed to come up with more compensation for the role, and was that role worth more to us to have in house, or wait until, perhaps, given the political dynamic that was going on, that we could wait it out a bit and try again in another year or so, where perhaps things had normalized back to where they had been a couple years prior?"
    },
    {
      "speaker": "Interviewer 20:01",
      "text": "Okay, that's really helpful. I think that's pretty much all the things I wanted to ask, is there anything that you wanted you think would be useful to share with me? Now,"
    },
    {
      "speaker": "Speaker 1 20:16",
      "text": "I mean, the one thing I would say that, you know, it's funny, I not that this is necessarily how Korn Ferry's model is, but it the reason I ended up ironically going part of the reason was the person I had a relationship with ended up acting almost like my client manager. She wasn't the person who actually did my m&a search, nor my ESG search. She was a finance recruiter for more traditional finance, but she kind of shepherded the processes to make sure things were going well, or that, you know, I was kind of getting what I wanted other processes. I'll just say that worked really well, so that if I needed an outside person to say, hey, you know, like, for instance, with the ESG, that we just felt like there was a dislocation, and it had nothing to do with the team or with the process, but it just didn't feel like we were going to find what we were needing. And she helped manage that for us. That was a very helpful resource to be able to use outside of the actual search. I don't know if that's my experience historically using Korn Ferry, we didn't have necessarily that it was just this team you were using for a search. So I'll say that was really beneficial for me in that moment."
    },
    {
      "speaker": "Interviewer 21:24",
      "text": "And I mean, I guess moving forward is that something you'll continue to do with any project? Would you always go via that initial contact that you have?"
    },
    {
      "speaker": "Speaker 1 21:34",
      "text": "I probably would, because I really like her, and she's been a great resource to me. If I don't know if it gives her credit or not, but if it does give her credit, I'd be happy to have her get the credit, if you will."
    },
    {
      "speaker": "Interviewer 21:48",
      "text": "Brilliant, okay, and, and did, I mean, how active was she in the I suppose, day to day, or was she literally just kind of the person that you could go to to raise any concerns,"
    },
    {
      "speaker": "Speaker 1 21:58",
      "text": "she would show up, I would say, like, at least once a month on the calls and check in, probably once a month, yeah, just to make sure, like, yeah. And if there was something going on, she would call and check in, and we would chit chat to make -- 7 of 8 -- sure you know, how's it going, or what's the issue. And so she was available if I needed her. And she would depending on where in the beginning of the searches, she was there for every call. Like, as we were more into regular process, she would just kind of check in depending on where we were, you know, because it was just every day, like, checking in on candidates and such, that's really helpful. Yeah. So I thought it was, I know that's not their normal model, but I came from investment banking forever ago, right? And when you had a client relation, client relationship person, it actually can be a helpful person that's outside of the moment of recruiting if you needed to have a resource. So I just say that as a interesting experience for me at least."
    },
    {
      "speaker": "Interviewer 22:56",
      "text": "Yeah, that's great feedback. Thank you. Well, thanks again for taking the time and for moving the time. Do appreciate it, and yeah, nice to meet you. Thank"
    },
    {
      "speaker": "Speaker 2 23:05",
      "text": "you so much. Thanks. Jen, bye, bye. Transcribed by https://otter.ai -- 8 of 8 --"
    }
  ],
  "rawText": "Interviewer 0:13: Hello, Hi, Jen, nice to meet you. Nice to meet you today. Yeah, I'm good. Thank you. Thanks for changing the time\n\nSpeaker 1 0:21: to appreciate it. No worries at all. Totally understand. Great.\n\nInterviewer 0:25: Thank you. So I'll try not to take up your whole half an hour, but a little bit of admin first. Are you okay if I record this, it's my team. Could help me make notes. Yeah, no problem. Thank you. It doesn't, it doesn't delete it after that, so soon and yeah, just to introduce myself, so I'm Interview. I'm the managing partner at a growth consultancy. We've worked with Korn Ferry for about five or six years now, so we know their business well, and they've asked us to run these interviews with the hope that you can speak more freely, be more transparent with us, and then obviously, you know, they can really work on, how do they improve their customer service to their clients? So I'll just start with, if you asking you if you can give me the context of your role in the organization and your relationship that you've had with Korn Ferry to date.\n\nSpeaker 1 1:23: So my role in the organization, I lead strategy M and A and ESG within Generac, my relationship with the firm, thus far, I've had an on and off relationship from they've called me with regards to roles historically, but I've never actually been placed by them. And then, because of that historic relationship where I got to know some of the recruiters and enjoyed the experience, I called one of their recruiters who I knew best in order to engage the firm to help me with two specific roles that I needed to place people\n\nInterviewer 2:03: right. And with those specific roles, did you only go to them first, or did you? Did you put it out to tender to other people as well? I just went to them okay? And could do you determine what those two roles were?\n\nSpeaker 1 2:20: It was a director of sustainability and a Senior Director of Corporate\n\nInterviewer 2:26: Development, okay, great. And how was the experience overall? How did it? Did it live up to expectations for you?\n\nSpeaker 1 2:33: -- 1 of 8 -- Yeah, I would say I dealt with two very distinct teams, and I had two separate experiences. The corporate development experience was, I would say exactly I would as I would have expected, and very, very good. And that was the team I was most familiar with previously, the ESG experience. And so we did place somebody, and my team, they're working out great, and it's been a great experience. The ESG role, or sustainability role, we were not able to find somebody, and so we ended up canceling the placement and not moving forward with the role. The experience was okay, but I would say it was not quite the same as the m&a role. Probably, I would say a bit, because I was so used to how the M and A roles were done, that I was expecting kind of the same experience, and they are very different functions, so my expectation was probably a little bit\n\nInterviewer 3:33: different. And in terms of the ESG role that didn't move forward. I mean, is that a reflection of them not being able to find the right candidate, or did other things change in the business as well\n\nSpeaker 1 3:45: not being able to find the right candidate, but I think partly because of also our compensation levels with regards to the role, and probably A bit of a mismatch upfront with expectation versus compensation level, and where we thought the market was for the our ability to get somebody at that level relative to the compensation we had available.\n\nInterviewer 4:14: Yeah, makes sense. Did they dig into that at the beginning? Did they flag that as a potential issue?\n\nSpeaker 1 4:22: A little, probably not as much as we realistically needed, because at the end of the day, we ended up getting quite junior people for a director level role that just weren't going to work for our organization to give a director level. And so, you know, for instance, having somebody that was a manager somewhere else, that had only been a manager for like, a year or two, we weren't going to be able to put as a director in our organization. And so it was just a mismatch of experience levels. But admittedly, our compensation wasn't, at least for that moment in time where it needed to be. It seems to be able to get the director level talent we were hoping to get. And so I think it was just a mismatch. So that's why we decided to just stop, because we weren't getting what we seem to need to get. And so it feel felt a little futile at a certain point. Okay?\n\nInterviewer 5:14: And is that something that you are going to as an organization? Is it a role that you still need? Are you going to revisit it later on, down the line, or\n\nSpeaker 1 5:22: potentially, yeah, right now I'm dealing with it with outside consultants in order to fill the gap until either they the compensation of those roles kind of normalizes. Or, I mean, I'll just keep using outside support, because I think there when I was recruiting for it in particular, it was coming off the tail end of when sustainability was the, you -- 2 of 8 -- know, hot roll. And so compensation had gotten very high relative to what historically it had been. And so people were demanding very, very high compensation. Relative to what I think, you know, firms like ours were traditionally thinking of spending for those\n\nInterviewer 6:09: kind of roles. Did did that team bring in anybody from the Korn Ferry, ESG practice to support here? Or is that? I mean, are you aware that they've got that Unknown Speaker 6:18 team? Yeah, that was the team that was helping, yeah,\n\nInterviewer 6:22: not, not in state, but yeah, in terms of their, their whole ESG consultancy practice, Unknown Speaker 6:30 no, okay,\n\nInterviewer 6:34: and in terms of both projects, how was the how's the communication with you from start to finish? Did it meet your expectations in terms of keeping you up to date, kind of managing multiple stakeholders? If that was the case,\n\nSpeaker 1 6:49: yes, I think we did neat weekly for both projects, weekly meetings in order to update myself as well as other constituents that were helping with the process. There were email updates, and then we would do the weekly meeting. And then if we were bringing somebody in, there were prep packages. Along with that, they had, again, a bit different styles with regards to how it was handled. The M and A team had a PowerPoint that was given each week that had profiles of every candidate that were included, and then, like a tracker that was in there, so it was, you could reference it later with all the details in there. The ESG team was more, I would say, informal with their delivery of materials, and that it was email more and less formalized, but communication was still very active. It was just a different style of communication. And again, I think it's because of different types of\n\nInterviewer 7:50: functions. Yeah, yeah. What would your preference be if you could choose?\n\nSpeaker 1 7:54: Again, I'm at heart an m&a person, so I was more used to the m&a side.\n\nInterviewer 8:00: And if we focus on the M and a role, how did they do in terms of providing both quality and quantity of candidates? Did they meet your expectations?\n\nSpeaker 1 8:13: Yeah, absolutely. It was very strong, great.\n\nInterviewer 8:17: -- 3 of 8 -- And did they? Did they then, in terms of then the selection process. Did they help negotiate the package and contracts, or was that something you guys did\n\nSpeaker 1 8:29: a bit yes, my internal team ended up doing a bit more of it, just because of preference, not because of capability, because our internal recruiters like to do a lot of that. Yeah, but they provided background, and I would say, a lot of the level setting and positioning that let made it an easy process for our team to come in, so there wasn't a lot of back and forth. So they kind of laid all the groundwork. Great.\n\nInterviewer 8:55: Thank you. Did you use any of the, I suppose, additional tools? So their assessment tools, pay benchmarking and anything like that, to help with the process. Unknown Speaker 9:09 No\n\nInterviewer 9:12: is I mean, is that something you that you were aware of, or what did they talk to you about those Was it something that you chose\n\nSpeaker 1 9:20: to not use the pay I we talked more whole, like, philosophically, let's say i The budget was the budget so I knew where we were relative to market.\n\nInterviewer 9:33: Whatever you say,\n\nSpeaker 1 9:35: yeah, like, yes, we're light. So that wasn't probably a good use of funds on that one on the assessment tools, we didn't talk about it. I was aware that there were tools that could have been used, but it wasn't something we spent a lot of time about. It's probably something that if I were hiring more people, I would have probably engaged in for an individual role, and my team is so small, it probably wasn't as an effective of a thing to go to do, just given the nature of the role I was hiring for and the size team and such, yeah.\n\nInterviewer 10:20: And in terms of the yes was the overall experience, is there anything they could have done better? Obviously, we'll come back to the ESG one, but when you're thinking about the MNA one, um, I\n\nSpeaker 1 10:43: I think at the end of the day, it was a difficult role to fill. We needed in person. We needed somebody with, you know, a lot of skilled transaction experience, and at that odd senior, but not highest level senior, kind of tenor, and they were able to find a number of qualified candidates, and so I think they did a really good job. I can't say anything negative about the experience. So overall, I would hire them again, and potentially we might for next year to fill my second senior director role that I have open. So we're just waiting on hiring that till next year. Okay, -- 4 of 8 --\n\nInterviewer 11:27: so it was very positive. Would you use them for anything else? I mean, are you familiar with the kind of, I suppose, the range of things that they do? Yes.\n\nSpeaker 1 11:35: So we use them as a company last year for our spans and layers exercise, our culture assessment. So they had been working with the company on those type of projects, and I think we've used them for, you know, a few other HR related projects. So I think, yes, I would use them. I think the firm is very strong on people related capabilities. I'm not familiar with every capability, but I've used them on a few different avenues, and certainly for the recruiting side, I think they've got very strong capabilities and relationships, which is, I think you know half of the battle, right?\n\nInterviewer 12:23: Well, and that was my follow up point. So yeah, I suppose, in terms of what you use them for, from recruitment, what's more important to you, is it the, is it the individual that you get and their relationships and their black book, or is it the kind of the board, the brand, the brand Halo and being able to have the kind of broader frameworks and practice,\n\nSpeaker 1 12:51: I think you know, so it probably depends on function at the end of the day a little bit. But my experiences thus far have been relationship driven in that they've been able to bring really strong candidates to me and and the even on the other side, when I've been the person they've been for really great companies that I've had conversations with them with regards to, I don't know if that's because they have great relationships or because it's Korn Ferry, yeah. But regardless, the the type of candidates in the type of companies that Korn Ferry works with are very strong on both sides. So it leads me to want to partner with them versus some other firms. I've worked with smaller firms in the past, and I've found, while they can be very helpful in niche categories where they're very focused for broad based recruiting or capabilities, this tends working with somebody like a Korn Ferry has been very helpful to have a firm with the breadth of name recognition as well as relationships.\n\nInterviewer 14:11: Is there any kind of value add activity that you would expect to see from them now you've kind of engaged them directly so ongoing.\n\nSpeaker 1 14:23: I think the thing that would be helpful is probably just the follow up afterwards, so that it's not just the you know we place somebody, they know that I have another role that I might look to fill later, or on the ESG side that we didn't fill the role. So perhaps if they see candidates in the future that might be a good fit, now that they know our culture and what we're looking for, even if they're not actively engaged, that if they find somebody they think might be a good fit, saying, Hey, we do have somebody. Would you want to see them so that I could proactively engage them again, versus having to go through a huge process, right? That would be very helpful, because I am still looking for both of those roles, and if I could easily fit somebody in that, and I'm happy to pay them for it, it's more about just finding, instead of, you know, doing -- 5 of 8 -- a massive search. If we could find somebody that they know now that they know me and they know my teams, that would be very valuable.\n\nInterviewer 15:17: Yeah, amazing. Okay. And then I suppose, in terms of future proofing your team, I mean, how much are you thinking about the balance between kind of current skills and future skills and things like AI? Is that? Is that something that's a challenge or a concern for you right now,\n\nSpeaker 1 15:38: that issue was particularly for both actually, it's been one of the things we were focused on. For instance, with the MNA role, when we thought about the two roles we needed, we started with one, and one of the big focus areas was finding, given the skill sets we had already from junior team members, how do we fill out the skill set on the team. And then when we found the candidate, we found for our next candidate, then we could whereas we had very strict qualifications. For instance, I didn't want somebody coming straight from banking, because they thought it would be very challenging in our corporate environment. But since we found somebody who had a different set of skills, then we could fill somebody in, perhaps for the next role that had come straight from banking, because we could balance out similarly with the AI question. For instance, I am no longer looking for just analyst level work, because I can cover a lot of the analyst level work with AI based programs and leverage that for some of the more lower level skilled work. So I think we're kind of using some of the more intelligent solutions out there to cover some of the base work, and so we can upskill the team levels. And same for the ESG work. One of our abilities was, we're driving automation and some machine learning to do a lot of the work we had initially thought we would do with people, so it is allowing us to have less lower level skilled work. Is driving no higher requiring higher level people though to be able to analyze and actually ensure that it's actually being done right, and then we're driving the correct conclusions out of all the data, because you can grab a lot of data, but what do you do with it? Yeah,\n\nInterviewer 17:25: exactly, okay. And I suppose, going back to the role that you they didn't fill is, I mean, do you want to just expand on, I suppose your experience there, and where did the kind of frustrations kind of kick in? If there were any,\n\nSpeaker 1 17:41: um, sure, yeah, I don't know that it was per se frustration with the team or with the service being provided at all. I actually thought very skilled team, and they were bringing very actively candidates and we're searching very actively. I truthfully think the biggest issue, like I mentioned before, was the the gap between where we were with compensation, with where the market was, with comp, with needing to be in person, which the sustainability field had gotten very far away from that at that moment in time. It's only kind of now starting to move to more in person, and that field in particular, had gotten very used to being like it doesn't matter where you are because of what they do by nature. And so most people we talked to didn't want to even consider moving. And our culture is a very in office culture, so that was a very big hurdle. And culturally within the Generac construct, a director is considered as a pretty senior role. And so the people that were taking our calls, that were willing to -- 6 of 8 -- move at the comp level were more like current managers, or people who had just made manager, and they were very young in their careers, and it would not have been very well accepted. They would not have been very well accepted in Generac as director level employees, they didn't have the right experience or seniority. So we had this big gap between what was our expectations relative to what we could find and so that's why we just stopped it, because it felt like either we needed to come up with more compensation for the role, and was that role worth more to us to have in house, or wait until, perhaps, given the political dynamic that was going on, that we could wait it out a bit and try again in another year or so, where perhaps things had normalized back to where they had been a couple years prior?\n\nInterviewer 20:01: Okay, that's really helpful. I think that's pretty much all the things I wanted to ask, is there anything that you wanted you think would be useful to share with me? Now,\n\nSpeaker 1 20:16: I mean, the one thing I would say that, you know, it's funny, I not that this is necessarily how Korn Ferry's model is, but it the reason I ended up ironically going part of the reason was the person I had a relationship with ended up acting almost like my client manager. She wasn't the person who actually did my m&a search, nor my ESG search. She was a finance recruiter for more traditional finance, but she kind of shepherded the processes to make sure things were going well, or that, you know, I was kind of getting what I wanted other processes. I'll just say that worked really well, so that if I needed an outside person to say, hey, you know, like, for instance, with the ESG, that we just felt like there was a dislocation, and it had nothing to do with the team or with the process, but it just didn't feel like we were going to find what we were needing. And she helped manage that for us. That was a very helpful resource to be able to use outside of the actual search. I don't know if that's my experience historically using Korn Ferry, we didn't have necessarily that it was just this team you were using for a search. So I'll say that was really beneficial for me in that moment.\n\nInterviewer 21:24: And I mean, I guess moving forward is that something you'll continue to do with any project? Would you always go via that initial contact that you have?\n\nSpeaker 1 21:34: I probably would, because I really like her, and she's been a great resource to me. If I don't know if it gives her credit or not, but if it does give her credit, I'd be happy to have her get the credit, if you will.\n\nInterviewer 21:48: Brilliant, okay, and, and did, I mean, how active was she in the I suppose, day to day, or was she literally just kind of the person that you could go to to raise any concerns,\n\nSpeaker 1 21:58: she would show up, I would say, like, at least once a month on the calls and check in, probably once a month, yeah, just to make sure, like, yeah. And if there was something going on, she would call and check in, and we would chit chat to make -- 7 of 8 -- sure you know, how's it going, or what's the issue. And so she was available if I needed her. And she would depending on where in the beginning of the searches, she was there for every call. Like, as we were more into regular process, she would just kind of check in depending on where we were, you know, because it was just every day, like, checking in on candidates and such, that's really helpful. Yeah. So I thought it was, I know that's not their normal model, but I came from investment banking forever ago, right? And when you had a client relation, client relationship person, it actually can be a helpful person that's outside of the moment of recruiting if you needed to have a resource. So I just say that as a interesting experience for me at least.\n\nInterviewer 22:56: Yeah, that's great feedback. Thank you. Well, thanks again for taking the time and for moving the time. Do appreciate it, and yeah, nice to meet you. Thank\n\nSpeaker 2 23:05: you so much. Thanks. Jen, bye, bye. Transcribed by https://otter.ai -- 8 of 8 --"
}