{
  "id": "t-027",
  "sourceFile": "T22_NPS9_NA_ES_HOUSE_OCT25.pdf",
  "client": "Michael Citro",
  "interviewDate": "2025-10-29",
  "project": "Executive Search",
  "score": 9,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Interviewer 0:00",
      "text": "So if you could start by just giving me a, I suppose, an intro to your role and the relationship that you have with Korn. Ferry,"
    },
    {
      "speaker": "Speaker 1 0:07",
      "text": "sure, yeah, I'm, I'm the Vice President and Chief of Staff at the University of Pennsylvania, which you know our our institution is 12 individual schools and a health system that's comprised of six regional hospitals, and we're depending on census numbers. We're we're the largest or second largest private employer in the city of Philadelphia. And I've used, we've used and partnered with Korn Ferry on three different occasions in the past four years, all of which had been executive searches. And the reason we came back to them for our most recent search was because we've had nothing but positive experiences with them. So I'm sure we'll get into this. But I think the bulk of my comments are largely kind of laudatory and largely pleased with what the experience has been with them, great."
    },
    {
      "speaker": "Interviewer 1:18",
      "text": "And I suppose comparing them to other experiences without naming names. What is it about their experience that meets or exceeds your expectations without putting words in your mouth? Yeah?"
    },
    {
      "speaker": "Speaker 1 1:32",
      "text": "So, yeah. We our office. The office of the president runs nearly all of the executive searches for the enterprise, so academic teams, vice presidents, head of the health system, all kind of runs through our office. So we we do request for proposals and interview and engage many of like the the search firms, a lot of like the standard, big names, Korn Ferry, you know, first landed on my radar because just reputationally, some folks said Oid, you should talk to Peter McDermott, who was the search consultant in the communications realm. And right from the onset, it was clear that he had some subject matter expertise, but he also kind of brought just a savvy and an agility to kind of understand higher education that was distinct from some other places that we had talked to, and so that search consultant was our on our first two searches in recent years, we used, we partnered with a different team for our most recent search, which was to oversee our government relations. And I would say it was that similar characteristic of, you know, expertise and savvy, but also we benefited from the fact that, I don't know how they do it, and I'm sure there's probably some system like there was just kind of a better understanding of our organization that allowed them to kind of articulate, you know, how they might work with us. And I would just say on the most recent one for Government Relations, they were really distinct and kind of understanding what we were looking for in the job, but also being able to articulate how they were going to work with us, right? So we just knew that on government relations, because of how the institution sits in the city of Philadelphia, what was happening in higher education, the external pressures about who we hire and who's referred to us, and you know, how we manage those relationships, was going to be a bit of a pressure cooker, and it was, and Korn Ferry named that at the onset and articulated how they'd be really helpful In managing some of those external pressures, and that was unique and distinct. I think I interviewed four different firms for that search."
    },
    {
      "speaker": "Interviewer 4:27",
      "text": "Okay, and so it sounds like, you know, when you're initially engaged in it was due to an individual, but actually, your you know, your experience has been consistent across the board, absolutely."
    },
    {
      "speaker": "Speaker 1 4:41",
      "text": "And one of the things that I appreciated about Korn Ferry was in the in the two earlier searches, we saw Junior consultants, not the right word, but kind of a more in treatment level, associate analyst who was spectacular. And when we were talking about this most recent search, I said, gosh, we were really impressed by Sophie. I know this isn't in her domain, but is there any way we could think about having her join the team, because she knows the institution, she knows us, and, you know, without fail, Korn Ferry. I was like, Yeah, well, we'll make that work, which I think served all of us really well, to -- 1 of 4 -- have someone who, who was on every search and could kind of speak both Korn Ferry and could speak pen in a way that allowed us to be successful."
    },
    {
      "speaker": "Interviewer 5:36",
      "text": "Do you have that same thing at the senior end? So almost like a, you know, a partner that might not necessarily run the search, but you'll go to for these discussions."
    },
    {
      "speaker": "Speaker 1 5:48",
      "text": "Yeah, so I don't, you know, I don't know who's full Tid, but the first person who we worked with, Peter McDermott, was our point of entry, and he's checked in and been in touch through all of the searches and even when we weren't in search mode, and probably without fail, when we have to do our next search, Peter would be my first phone call to say, Would you all be interested in this? Do you have expertise in it? What are you thinking? So I would be a return customer to him to help and, you know, recognize, he'd hand me off to maybe another line to the business."
    },
    {
      "speaker": "Interviewer 6:26",
      "text": "Yeah, great. And in terms of, I suppose, the broader business and what they bring to that search, do have you used or utilize any of the things like assessments or pay data benchmarks."
    },
    {
      "speaker": "Speaker 1 6:44",
      "text": "We we've done the assessment the 4d i think it's called on two of our three searches with them."
    },
    {
      "speaker": "Speaker 1 6:59",
      "text": "I'm not negative on it, but I'm not positive on it. I mean, I think it was in both instances, it affirmed some of things that we saw in our search process. But I wasn't blown away. I don't think our president was blown away by it. I also just found the delivery of it a little underwhelming. The the the organizational psychologist who presented on it was fine, but it was, you know, if, if given, if given a choice, and if you know, we were in a cost containment mode, I would cut that and feel like we wouldn't lose anything in the process. If that makes sense. Yeah, it does."
    },
    {
      "speaker": "Interviewer 7:50",
      "text": "That's really helpful in then going back to I suppose the team, how did they manage if there were various stakeholders in terms of communication, was it clear? Was it timely? Did you feel in the loop?"
    },
    {
      "speaker": "Speaker 1 8:10",
      "text": "Yes, speaking, most recently, we closed our last search, probably August of this year, and in that search in particular, you know, as I said, government relations, it felt as though it was kind of a level of white glove service that, you know, I had senators, I had congressmen, I had elected local officials calling and writing saying, you you really need to think about Person X or Y, and we had a very seamless system with the search team where I would hand that over to them, and within a few hours of me providing that referral, they were in touch, taking good care and just Managing expectations throughout. And we had some really challenging people, and as best I can tell, they did a phenomenal job with it, because 99% of the people are ultimately getting news that they don't want, right? It's the one person who gets the news that they want, and even the people who we signed off were, I think they came out kind of positive on the institution of the experience, which is important to us."
    },
    {
      "speaker": "Interviewer 9:26",
      "text": "Yeah, absolutely. So, I mean, Were you satisfied by the overall levels of quality and quantity of candidates that you've had on each search? Unknown Speaker 9:42 Yeah? I"
    },
    {
      "speaker": "Speaker 1 9:48",
      "text": "I think what I appreciated that hesitation you're reading in me is not anything bad. It's it's just trying to figure out, like, how to frame it right? I think what I appreciated was that there was a in the early stages, there was a lot of important calibration with the search team, where the first kind of pool of candidates that they started to identify, they presented, and then they teased out some questions to say, like, so Candidate B didn't really seem to be of interest to you. Like, was it X or Y? Are you looking more for Z on this and so with both, we had to go through this kind of process to calibrate of -- 2 of 4 -- what are we looking for? Once we got there, I think the quality was was good. I think the quantity was appropriate. And they didn't. They did a nice job of managing that for us, and they pushed us a little bit and times. I mean, in the in the government relationship in particular, I appreciated that they also pushed us of like, is this what you really want, or because you're saying x and y, and we're giving you that, but it doesn't seem to be working. So it was, it was healthy in that sense."
    },
    {
      "speaker": "Interviewer 11:09",
      "text": "And did they help with things like kind of, you know, expectations on compensation, or was that something that you had already in place?"
    },
    {
      "speaker": "Speaker 1 11:21",
      "text": "We largely managed it internally. So they we, I didn't rely on them. We didn't rely on them for for compensation information at all, as best I can recall,"
    },
    {
      "speaker": "Interviewer 11:35",
      "text": "what could they do differently? What could they have improved on? Yeah,"
    },
    {
      "speaker": "Speaker 1 11:52",
      "text": "one, one small area with all of the searches, the three searches that we've done with them recently, the kind of day of logistics for candidates Coming to our campus were a bit clunky, and I say that with, you know, just some reticence in that part of that is likely on our team in terms of how we were interfacing and what information we were giving them. And part of it, I think, was probably owned by the search team of there could have just been, I think the details could have been managed a little bit easier, and not felt like they were coming together for context. You know, in our in the war, in our higher ed world, and we do day, day and a half long in person interviews, where we're jostling schedules and figuring out lunches and dinners and so there's, there's a lot of like minutia in the weeds that needs to happen. And I just think it could have been a little bit more seamless. And I'm not exactly sure how we would have gotten there. But I think there's probably an opportunity in the search process to just sync with them a little bit better to say, what's the division of labor? Who's going to do? What? How are we going to do this, rather than a lot of like back and forth emails. That's that's the only thing that first comes to mind."
    },
    {
      "speaker": "Interviewer 13:43",
      "text": "And just on that, I suppose, you know, using things like emails as a channel to communicate, but also to share information. CVS is, I mean, is that your preferred choice, or would did you use a platform? Would you have preferred something different? Yeah,"
    },
    {
      "speaker": "Speaker 1 14:06",
      "text": "yes, I think the, I think this system and the process of, you know, emails and slide decks and trading paper worked. I I don't know that I have a good answer on what a good alternative would be to be able to evaluate it right, to be able to say, like, oh yeah, I wish we did something on teams or slack or something like that. We've just not tried it. So it's hard for me to assess okay."
    },
    {
      "speaker": "Interviewer 14:40",
      "text": "And then I suppose, finally, digging into what we said at the beginning about that, you know, the team, what's important for you, or the most important factors in that, in finding a good search partner, is it around the individual and their network? Is it around the brand that sits behind them, and the frameworks and the support. Or is it, is it something else? Is it the knowledge of your business?"
    },
    {
      "speaker": "Speaker 1 15:11",
      "text": "I think the two most important things to me, and they're probably tied for one or you know, they on any given day they could switch between one and two, is the Rolodex and the network that the the lead person or the team brings to the specific search and how quickly they can cultivate a great and talented pool. I think that's essential. Second is, I'm looking for someone who will be a true partner, and in every sense of the word, who will you know, as I said, push back and say you're saying you want x, but that's not how you're evaluating these people. Or saying to me, this person is a little outside the box, but we know you well enough, and we know the institution I think you should look at this person, and it's also on the other side of all of these search have twists and turns, and I want to be comfortable and feel assured that, like, when I pick up the phone, I'm going to have a partner to say, like, Hey, can we talk about this? And with these searches, I had that in spades. I mean, they -- 3 of 4 -- were, you know, there were, I was cooking dinner one night on the phone with my kids and our search consultant about, you know, just kind of this really challenging candidate and an elected official, and she was phenomenal in this most recent search. And, you know, I think that level of relationship is key for these type of searches."
    },
    {
      "speaker": "Interviewer 16:57",
      "text": "Brilliant, great. I think that's it. I mean, is if there's anything else that you think would be good to share,"
    },
    {
      "speaker": "Speaker 1 17:06",
      "text": "think so, yeah, I'm kind of, I don't know how your other calls go. I feel like I'm I'm kind of a champion and a fan of this, and I've"
    },
    {
      "speaker": "Interviewer 17:13",
      "text": "seen a bunch of other one, which is really nice, really Yeah,"
    },
    {
      "speaker": "Speaker 1 17:17",
      "text": "I mean, for what it's worth, I don't know. I did one of the surveys at the end too. I mean, the the three people who I've worked with most have been Peter McDermott, Beth Fowler and Sophie Carr. And, you know, they might not have expertise in something like auditing compliance or something like that, but if, if I were doing that search, they would be the first calls that I would make, that's that's how good it's been for my experience."
    },
    {
      "speaker": "Interviewer 17:44",
      "text": "Fantastic. Well, I'll be sure to pass that back on to them and and their managers, if that's all right with you. And great to hear that you've had a positive experience. So, yeah, cool. Thanks very much. I appreciate your time. Thanks again, and nice to meet you Unknown Speaker 17:59 likewise. Thanks so much. Have a good day."
    },
    {
      "speaker": "Speaker 2 18:01",
      "text": "Yeah, thanks, Michael, bye, bye. Transcribed by https://otter.ai -- 4 of 4 --"
    }
  ],
  "rawText": "Interviewer 0:00: So if you could start by just giving me a, I suppose, an intro to your role and the relationship that you have with Korn. Ferry,\n\nSpeaker 1 0:07: sure, yeah, I'm, I'm the Vice President and Chief of Staff at the University of Pennsylvania, which you know our our institution is 12 individual schools and a health system that's comprised of six regional hospitals, and we're depending on census numbers. We're we're the largest or second largest private employer in the city of Philadelphia. And I've used, we've used and partnered with Korn Ferry on three different occasions in the past four years, all of which had been executive searches. And the reason we came back to them for our most recent search was because we've had nothing but positive experiences with them. So I'm sure we'll get into this. But I think the bulk of my comments are largely kind of laudatory and largely pleased with what the experience has been with them, great.\n\nInterviewer 1:18: And I suppose comparing them to other experiences without naming names. What is it about their experience that meets or exceeds your expectations without putting words in your mouth? Yeah?\n\nSpeaker 1 1:32: So, yeah. We our office. The office of the president runs nearly all of the executive searches for the enterprise, so academic teams, vice presidents, head of the health system, all kind of runs through our office. So we we do request for proposals and interview and engage many of like the the search firms, a lot of like the standard, big names, Korn Ferry, you know, first landed on my radar because just reputationally, some folks said Oid, you should talk to Peter McDermott, who was the search consultant in the communications realm. And right from the onset, it was clear that he had some subject matter expertise, but he also kind of brought just a savvy and an agility to kind of understand higher education that was distinct from some other places that we had talked to, and so that search consultant was our on our first two searches in recent years, we used, we partnered with a different team for our most recent search, which was to oversee our government relations. And I would say it was that similar characteristic of, you know, expertise and savvy, but also we benefited from the fact that, I don't know how they do it, and I'm sure there's probably some system like there was just kind of a better understanding of our organization that allowed them to kind of articulate, you know, how they might work with us. And I would just say on the most recent one for Government Relations, they were really distinct and kind of understanding what we were looking for in the job, but also being able to articulate how they were going to work with us, right? So we just knew that on government relations, because of how the institution sits in the city of Philadelphia, what was happening in higher education, the external pressures about who we hire and who's referred to us, and you know, how we manage those relationships, was going to be a bit of a pressure cooker, and it was, and Korn Ferry named that at the onset and articulated how they'd be really helpful In managing some of those external pressures, and that was unique and distinct. I think I interviewed four different firms for that search.\n\nInterviewer 4:27: Okay, and so it sounds like, you know, when you're initially engaged in it was due to an individual, but actually, your you know, your experience has been consistent across the board, absolutely.\n\nSpeaker 1 4:41: And one of the things that I appreciated about Korn Ferry was in the in the two earlier searches, we saw Junior consultants, not the right word, but kind of a more in treatment level, associate analyst who was spectacular. And when we were talking about this most recent search, I said, gosh, we were really impressed by Sophie. I know this isn't in her domain, but is there any way we could think about having her join the team, because she knows the institution, she knows us, and, you know, without fail, Korn Ferry. I was like, Yeah, well, we'll make that work, which I think served all of us really well, to -- 1 of 4 -- have someone who, who was on every search and could kind of speak both Korn Ferry and could speak pen in a way that allowed us to be successful.\n\nInterviewer 5:36: Do you have that same thing at the senior end? So almost like a, you know, a partner that might not necessarily run the search, but you'll go to for these discussions.\n\nSpeaker 1 5:48: Yeah, so I don't, you know, I don't know who's full Tid, but the first person who we worked with, Peter McDermott, was our point of entry, and he's checked in and been in touch through all of the searches and even when we weren't in search mode, and probably without fail, when we have to do our next search, Peter would be my first phone call to say, Would you all be interested in this? Do you have expertise in it? What are you thinking? So I would be a return customer to him to help and, you know, recognize, he'd hand me off to maybe another line to the business.\n\nInterviewer 6:26: Yeah, great. And in terms of, I suppose, the broader business and what they bring to that search, do have you used or utilize any of the things like assessments or pay data benchmarks.\n\nSpeaker 1 6:44: We we've done the assessment the 4d i think it's called on two of our three searches with them.\n\nSpeaker 1 6:59: I'm not negative on it, but I'm not positive on it. I mean, I think it was in both instances, it affirmed some of things that we saw in our search process. But I wasn't blown away. I don't think our president was blown away by it. I also just found the delivery of it a little underwhelming. The the the organizational psychologist who presented on it was fine, but it was, you know, if, if given, if given a choice, and if you know, we were in a cost containment mode, I would cut that and feel like we wouldn't lose anything in the process. If that makes sense. Yeah, it does.\n\nInterviewer 7:50: That's really helpful in then going back to I suppose the team, how did they manage if there were various stakeholders in terms of communication, was it clear? Was it timely? Did you feel in the loop?\n\nSpeaker 1 8:10: Yes, speaking, most recently, we closed our last search, probably August of this year, and in that search in particular, you know, as I said, government relations, it felt as though it was kind of a level of white glove service that, you know, I had senators, I had congressmen, I had elected local officials calling and writing saying, you you really need to think about Person X or Y, and we had a very seamless system with the search team where I would hand that over to them, and within a few hours of me providing that referral, they were in touch, taking good care and just Managing expectations throughout. And we had some really challenging people, and as best I can tell, they did a phenomenal job with it, because 99% of the people are ultimately getting news that they don't want, right? It's the one person who gets the news that they want, and even the people who we signed off were, I think they came out kind of positive on the institution of the experience, which is important to us.\n\nInterviewer 9:26: Yeah, absolutely. So, I mean, Were you satisfied by the overall levels of quality and quantity of candidates that you've had on each search? Unknown Speaker 9:42 Yeah? I\n\nSpeaker 1 9:48: I think what I appreciated that hesitation you're reading in me is not anything bad. It's it's just trying to figure out, like, how to frame it right? I think what I appreciated was that there was a in the early stages, there was a lot of important calibration with the search team, where the first kind of pool of candidates that they started to identify, they presented, and then they teased out some questions to say, like, so Candidate B didn't really seem to be of interest to you. Like, was it X or Y? Are you looking more for Z on this and so with both, we had to go through this kind of process to calibrate of -- 2 of 4 -- what are we looking for? Once we got there, I think the quality was was good. I think the quantity was appropriate. And they didn't. They did a nice job of managing that for us, and they pushed us a little bit and times. I mean, in the in the government relationship in particular, I appreciated that they also pushed us of like, is this what you really want, or because you're saying x and y, and we're giving you that, but it doesn't seem to be working. So it was, it was healthy in that sense.\n\nInterviewer 11:09: And did they help with things like kind of, you know, expectations on compensation, or was that something that you had already in place?\n\nSpeaker 1 11:21: We largely managed it internally. So they we, I didn't rely on them. We didn't rely on them for for compensation information at all, as best I can recall,\n\nInterviewer 11:35: what could they do differently? What could they have improved on? Yeah,\n\nSpeaker 1 11:52: one, one small area with all of the searches, the three searches that we've done with them recently, the kind of day of logistics for candidates Coming to our campus were a bit clunky, and I say that with, you know, just some reticence in that part of that is likely on our team in terms of how we were interfacing and what information we were giving them. And part of it, I think, was probably owned by the search team of there could have just been, I think the details could have been managed a little bit easier, and not felt like they were coming together for context. You know, in our in the war, in our higher ed world, and we do day, day and a half long in person interviews, where we're jostling schedules and figuring out lunches and dinners and so there's, there's a lot of like minutia in the weeds that needs to happen. And I just think it could have been a little bit more seamless. And I'm not exactly sure how we would have gotten there. But I think there's probably an opportunity in the search process to just sync with them a little bit better to say, what's the division of labor? Who's going to do? What? How are we going to do this, rather than a lot of like back and forth emails. That's that's the only thing that first comes to mind.\n\nInterviewer 13:43: And just on that, I suppose, you know, using things like emails as a channel to communicate, but also to share information. CVS is, I mean, is that your preferred choice, or would did you use a platform? Would you have preferred something different? Yeah,\n\nSpeaker 1 14:06: yes, I think the, I think this system and the process of, you know, emails and slide decks and trading paper worked. I I don't know that I have a good answer on what a good alternative would be to be able to evaluate it right, to be able to say, like, oh yeah, I wish we did something on teams or slack or something like that. We've just not tried it. So it's hard for me to assess okay.\n\nInterviewer 14:40: And then I suppose, finally, digging into what we said at the beginning about that, you know, the team, what's important for you, or the most important factors in that, in finding a good search partner, is it around the individual and their network? Is it around the brand that sits behind them, and the frameworks and the support. Or is it, is it something else? Is it the knowledge of your business?\n\nSpeaker 1 15:11: I think the two most important things to me, and they're probably tied for one or you know, they on any given day they could switch between one and two, is the Rolodex and the network that the the lead person or the team brings to the specific search and how quickly they can cultivate a great and talented pool. I think that's essential. Second is, I'm looking for someone who will be a true partner, and in every sense of the word, who will you know, as I said, push back and say you're saying you want x, but that's not how you're evaluating these people. Or saying to me, this person is a little outside the box, but we know you well enough, and we know the institution I think you should look at this person, and it's also on the other side of all of these search have twists and turns, and I want to be comfortable and feel assured that, like, when I pick up the phone, I'm going to have a partner to say, like, Hey, can we talk about this? And with these searches, I had that in spades. I mean, they -- 3 of 4 -- were, you know, there were, I was cooking dinner one night on the phone with my kids and our search consultant about, you know, just kind of this really challenging candidate and an elected official, and she was phenomenal in this most recent search. And, you know, I think that level of relationship is key for these type of searches.\n\nInterviewer 16:57: Brilliant, great. I think that's it. I mean, is if there's anything else that you think would be good to share,\n\nSpeaker 1 17:06: think so, yeah, I'm kind of, I don't know how your other calls go. I feel like I'm I'm kind of a champion and a fan of this, and I've\n\nInterviewer 17:13: seen a bunch of other one, which is really nice, really Yeah,\n\nSpeaker 1 17:17: I mean, for what it's worth, I don't know. I did one of the surveys at the end too. I mean, the the three people who I've worked with most have been Peter McDermott, Beth Fowler and Sophie Carr. And, you know, they might not have expertise in something like auditing compliance or something like that, but if, if I were doing that search, they would be the first calls that I would make, that's that's how good it's been for my experience.\n\nInterviewer 17:44: Fantastic. Well, I'll be sure to pass that back on to them and and their managers, if that's all right with you. And great to hear that you've had a positive experience. So, yeah, cool. Thanks very much. I appreciate your time. Thanks again, and nice to meet you Unknown Speaker 17:59 likewise. Thanks so much. Have a good day.\n\nSpeaker 2 18:01: Yeah, thanks, Michael, bye, bye. Transcribed by https://otter.ai -- 4 of 4 --"
}