{
  "id": "t-022",
  "sourceFile": "T17_NPS8_NA_PS_HOUSE_OCT25.pdf",
  "client": "Daryl Teitler",
  "interviewDate": "2025-10-16",
  "project": "Professional Search",
  "score": 8,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Speaker 1 0:00",
      "text": "Could, and that made for a very difficult discussion for the manager that timing wise, would have preferred that they were just ferry from from a timing wise, they just should have probably waited until the manager did their part before they communicated. So there the employees first understanding that they didn't get the job came from Korn Ferry, as opposed to the leader. So and"
    },
    {
      "speaker": "Interviewer 0:30",
      "text": "do you and is that is indicative of your overall experience on communication? How was communication for the whole project,"
    },
    {
      "speaker": "Speaker 1 0:40",
      "text": "or was good. It was good through the whole project, they set up weekly meetings with us give us updates in regards to the recruiting, where they were. They several times great to get on the phone with us when it wasn't a planned call, so that we could kind of talk through different components of the recruiting process. So overall, it was excellent. And I think the leader would tell you that at the end of the day she's very happy. It just it was a moment like that that we had, we had a couple of hiccups. That was one of them."
    },
    {
      "speaker": "Interviewer 1:20",
      "text": "Okay, can you expand on any of the others?"
    },
    {
      "speaker": "Speaker 1 1:23",
      "text": "Yeah, so this is now going to go back to the individual. Is that okay? Because we like them and we we like our relationship with them. The other example was unrelated to So, right before the new chief medical officer started her role, Unknown Speaker 1:50 we had learned that"
    },
    {
      "speaker": "Speaker 1 1:57",
      "text": "Brian had a conversation with another one of our employees, a senior level employee, and somehow during that conversation, that when they chatted, either the employee was Just getting confirmation, or somehow was able to determine who we were, who we selected. And so then in a separate staff meeting, the leader and the senior level employee were talking, and the the employee said, Oh, I know who you, who you are going to select. And we hadn't communicated yet, even though we knew who it was going to be. So I'd actually reached out to Brian one evening and said, Hey, Brian, I need to chat with you. Shared the example they indeed had the conversation, the what Brian had shared back shared back was that in no means Did he ever share who the final candidate was. However, the employee surmised it is kind of what we think happened. But you know, at the end of day, we would just have preferred not to have any discussion regards to that somebody that wasn't involved in the interview process. So Brian was very, you know, he, he absolutely owned it. He absolutely apologized. Said, you know, I've been doing this for 20 plus years, and we would just have rather had you know if they're going to talk just to talk about whatever else, but not, yeah."
    },
    {
      "speaker": "Interviewer 3:50",
      "text": "So just that those were too small. Attention to detail that has a consequence."
    },
    {
      "speaker": "Speaker 1 3:55",
      "text": "Yeah? So again, overall, great experience. We would do it again, but just need to that part just needs to be a little bit more clean."
    },
    {
      "speaker": "Interviewer 4:07",
      "text": "-- 1 of 5 -- Yeah, did you use their assessment tool for these hires? Absolutely every one of them. Yeah. And how did they compare to, I suppose the previous time with the with the competitor,"
    },
    {
      "speaker": "Speaker 1 4:21",
      "text": "they were they were different and they were helpful. I really can't say that one was better than the other, because the other firm that we use was also a national firm, but it created good discussion. The expert that came on the line to walk it through with us did a great job, you know, sharing their observations of the assessment, and we only used it as one of many data points."
    },
    {
      "speaker": "Interviewer 4:56",
      "text": "And is it something that you will continue to use as part of so it's ongoing development plan."
    },
    {
      "speaker": "Speaker 1 5:06",
      "text": "You know, that's a great question. We haven't gotten that far yet, but I could, I could absolutely see us using it in between, like the first of, you know, sit down performance review, but I do think that the leader, matter of fact, both leaders, the one for the other position, has enjoyed using it as well and trying to understand a little bit about each individual, their strengths, their developmental areas. And I know you're not supposed to compare and contrast, but our leaders tendency to do that, and it just gave them a I did like their their graphs were really nice. You know how you could how they were overlaid so you could see them. One thing that I asked them to do, which they were very willing to do, not sure that they would have offered it was, you know, if we were looking at three candidates, originally, we were going to get three different separate sheets. And I asked them if they could put, you know, some of the graphing all on one sheet so we could see it. And that was very helpful. Great."
    },
    {
      "speaker": "Interviewer 6:19",
      "text": "Okay, that's helpful in terms of the end to end experience. How involved did they get in helping craft the job role and the skills needed for the for the for the role? Or was that already done? Did you guys do that beforehand? Yeah."
    },
    {
      "speaker": "Speaker 1 6:40",
      "text": "So they did, they did do a little bit of work. We already had much of it put together. They helped to prepare the position paper that they were going to use. So they took the information from our job descriptions and from the interview that they did with the senior leader, and crafted something that I think was more targeted, which was very helpful, but we did have a lot of our material already prepared."
    },
    {
      "speaker": "Interviewer 7:11",
      "text": "And what about things like kind of compensation benchmarking? Was that something that they that they bought or to the table, or was that something that you'd already"
    },
    {
      "speaker": "Speaker 1 7:21",
      "text": "decided on, yeah, we already we gave them where we thought we wanted to be, and we did a lot of our own market analysis through our executive comp area, where they came in was to provide us either what the current comp was, total comp was, or kind of what they were asking for, but not necessarily as much from a recommendation perspective. You know, they tell us, you know, hey, look, you're, you know, you are a statewide organization competing in a global market, and you may have some challenges, but we didn't get into a lot of numbers."
    },
    {
      "speaker": "Interviewer 8:05",
      "text": "Yeah, and did they? Did they take the lead on negotiating the contracts? Or was that something that you guys did?"
    },
    {
      "speaker": "Speaker 1 8:14",
      "text": "No, they, they, they did much of the negotiation and much of the encouragement and and much of the maybe helping the candidates understand what the total package looked like,"
    },
    {
      "speaker": "Speaker 2 8:32",
      "text": "great and in terms of,"
    },
    {
      "speaker": "Interviewer 8:37",
      "text": "-- 2 of 5 -- well, I mean, overall, minus the blips that we've talked about. You know, where could they make improvements Unknown Speaker 8:46 in their service? So think both of"
    },
    {
      "speaker": "Speaker 1 8:56",
      "text": "the the searches, I think maybe being more proactive in setting up"
    },
    {
      "speaker": "Speaker 2 9:10",
      "text": "the weekly or, you know, bi weekly meetings,"
    },
    {
      "speaker": "Speaker 1 9:16",
      "text": "even when they didn't have candidates or any any additional The other thing that I've had to kind of push them on a little bit is like now we're down to two or three top candidates, but at the end of the day, I don't know if we'll go with any of the three and making sure that they continue to recruit until an offer is signed, sealed and delivered, it feels like it slows down considerably once two or three candidates are kind of at the top of the list."
    },
    {
      "speaker": "Interviewer 9:53",
      "text": "Yeah, makes sense. And I mean in terms of the quality, you know, and the quantity in that initial stage, has that met your expectations?"
    },
    {
      "speaker": "Speaker 1 10:05",
      "text": "It's been different between the two. But in fairness to Korn Ferry, the chief medical officer was fantastic. There were a lot of quality candidates to choose from. You know our the industry now and where people want to work is more of a challenge. It's a challenge from the standpoint of what candidates want versus what employers want. So employers want people to be on site, you know, and now candidates want to work remote, and don't want to, you know, make the move so, you know, we had to do a little bit of hand wrangling there. But overall, I was real pleased with the Chief Medical Officer, both on the quantity and the quality. We had a lot of people to talk to, and a lot of people to choose from. On our Vice President of Finance and Accounting, my senior leader was looking for a little bit of a unicorn, and probably had too many expectations, so both Korn Ferry and and I had to help him kind of reset his expectations. But that was much that has been more of a difficult role to find people that met probably 75% of what I think the leader was looking for, okay?"
    },
    {
      "speaker": "Interviewer 11:31",
      "text": "And I suppose that leads me to my next question in terms of what's more important to you, is working with a recruiter? Is it the individual recruiting themselves and their network, or is it then being part of a, you know, a big recognized brand like Korn Ferry, where people will pick up the phone and the systems like the assessments in place"
    },
    {
      "speaker": "Speaker 1 11:57",
      "text": "towards a firm like Korn Ferry, is their their technology, their pipeline and their experience in the industry, you know, so they had very specific health care insurance experience that was really attractive. They had technology, including the assessments that made our the executives lives a little easier and gave them more confidence in the search. I think that was important. And then we just know that there is a number of executives that know to reach out to a few firms. And so our reach, you know, from a local perspective, our local recruiters are Korn, they just don't have the depth or breadth. You know, one thing I really liked about Brian was, when we first talked with him, he was able to give comfort and give confidence to the leaders, that he understood the industry, that he understood the major players, and they also understood individuals in the market. So they started talking about individuals that they both ran across, that they they they knew, and he knew that, and I thought that was very helpful for the leader. Great."
    },
    {
      "speaker": "Interviewer 13:19",
      "text": "So would you, would you ever use Korn Ferry for anything beyond search?"
    },
    {
      "speaker": "Speaker 1 13:26",
      "text": "-- 3 of 5 -- They would definitely be in consideration. It would depend on probably the level of the role, and, you know what we were looking for. I always have to balance whether it's something we can do internally or whether I think it's kind of beyond our scope. So they would definitely be in consideration. I've had good experience with Korn Ferry and a few others. So you know, if it comes down to expertise and price, I'll definitely, you know, look at two or three and kind of against each other to see what they're willing to do to provide the best for the organization."
    },
    {
      "speaker": "Interviewer 14:04",
      "text": "And were you before you obviously brought them in for that original RFP for your CEO search how Unknown Speaker 14:11 familiar work with the Korn Ferry."
    },
    {
      "speaker": "Speaker 1 14:15",
      "text": "I had used them when I was with I think you might know them as Fiserv, but before that, they were known as first data. I had used first data. I used Korn Ferry a few times in my experience at first data, so that was really what prompted me to pursue Korn Ferry, right?"
    },
    {
      "speaker": "Interviewer 14:37",
      "text": "And would you recommend them to other people? Unknown Speaker 14:42 Yeah, I definitely would."
    },
    {
      "speaker": "Interviewer 14:44",
      "text": "And going broader, like thinking about kind of the challenges in your organization when it comes to people, what are the key challenges that you're facing right now? Unknown Speaker 14:57 Actually, the market is such now where talents a little easier to find. Unknown Speaker 15:05 I think"
    },
    {
      "speaker": "Speaker 1 15:07",
      "text": "really finding individuals with healthcare and insurance experience, there are certain areas where we struggle a bit more than others. So I have no problem finding a head of HR or finding, but there are rules like, you know, medical that I would have more difficult, you know, like a chief medical officer, actuarial is very difficult. I probably would have to use a Korn Ferry if I was looking for a senior level role and I wasn't anticipating having difficulty with finance, but I think it was the combination of different things that the leader was looking for, that we were looking for somebody that had a little bit of everything, and we found that there was a lot of specialty, and he just had to come to terms with finding a specialty and then growing somebody into other aspects, or depending on our current talent. So I would just say right now, it's the challenge is certain positions and finding people with that very particular knowledge and experience that will help us. And then also, we have a tendency to prefer Blue Cross experience. And you know, with them being 30 plus Blue Cross, you know, I find that Blue Cross, their approach looks a little bit different than like a united or Aetna or a fortune 500 and have to report to the street, as opposed to a mutual like us, okay?"
    },
    {
      "speaker": "Interviewer 16:52",
      "text": "And then in terms of, I suppose, the use of data in in, you know, I suppose HR functions and how important is it that you're able to, well, I suppose, work with people like Korn Ferry, and they bring a kind of a data led approach to the work that they do, and able to tap into either their insights and benchmarks or yours."
    },
    {
      "speaker": "Speaker 1 17:22",
      "text": "Yeah, that's very important. We're really, we're really trying to focus on data to make decisions. So we have a little line in here that we say data before stories, you know, and being able to present to the CEO, the assessment data and any other data that helps give him confidence, because he's involved in a lot of these senior level decisions, gives us more credibility as an HR function. I think Korn Ferry -- 4 of 5 -- represented us well, which I was confident when we brought the candidates to him, and he loves the data, and he wants to see that. So, you know, I felt sorry for some of our candidates, because when he interviews, it's very data specific. So the fact that Korn Ferry already brings that up and in some respects, prepares the candidates. We were prepping Korn Ferry to prep our candidates before they met with the senior leader, so that they could put their best foot forward."
    },
    {
      "speaker": "Interviewer 18:33",
      "text": "Right? Got you? Yeah, that's been really helpful. I don't think there's anything other questions from my side, unless there's anything else you think would be useful to share."
    },
    {
      "speaker": "Speaker 1 18:44",
      "text": "You know, outside of the fact that we've been very pleased, we're close to the end of our second search, so far, both senior leaders have been very happy, overall with the product and results. I've been happy with the team that has been assigned to us. Brian has done a very nice job with this team. You know, as I'd mentioned, there was a difference between the two searches. One had a lot of candidates, the other one was a little bit more difficult. But hopefully we're close to an end. We've got the final interviews set up in two weeks, and unless something goes haywire, hopefully we'll start the negotiation process. So really appreciate Korn Ferry and what they've done, and they'll continue to be, you know, on our agenda if we have to do other searches, right? Brilliant."
    },
    {
      "speaker": "Interviewer 19:37",
      "text": "Daryl, thank you. That was really helpful, and it was really lovely to"
    },
    {
      "speaker": "Speaker 1 19:40",
      "text": "meet you. Nice to meet you as well. Have a wonderful weekend."
    },
    {
      "speaker": "Interviewer 19:43",
      "text": "Yeah, you too. Thanks. Transcribed by https://otter.ai -- 5 of 5 --"
    }
  ],
  "rawText": "Speaker 1 0:00: Could, and that made for a very difficult discussion for the manager that timing wise, would have preferred that they were just ferry from from a timing wise, they just should have probably waited until the manager did their part before they communicated. So there the employees first understanding that they didn't get the job came from Korn Ferry, as opposed to the leader. So and\n\nInterviewer 0:30: do you and is that is indicative of your overall experience on communication? How was communication for the whole project,\n\nSpeaker 1 0:40: or was good. It was good through the whole project, they set up weekly meetings with us give us updates in regards to the recruiting, where they were. They several times great to get on the phone with us when it wasn't a planned call, so that we could kind of talk through different components of the recruiting process. So overall, it was excellent. And I think the leader would tell you that at the end of the day she's very happy. It just it was a moment like that that we had, we had a couple of hiccups. That was one of them.\n\nInterviewer 1:20: Okay, can you expand on any of the others?\n\nSpeaker 1 1:23: Yeah, so this is now going to go back to the individual. Is that okay? Because we like them and we we like our relationship with them. The other example was unrelated to So, right before the new chief medical officer started her role, Unknown Speaker 1:50 we had learned that\n\nSpeaker 1 1:57: Brian had a conversation with another one of our employees, a senior level employee, and somehow during that conversation, that when they chatted, either the employee was Just getting confirmation, or somehow was able to determine who we were, who we selected. And so then in a separate staff meeting, the leader and the senior level employee were talking, and the the employee said, Oh, I know who you, who you are going to select. And we hadn't communicated yet, even though we knew who it was going to be. So I'd actually reached out to Brian one evening and said, Hey, Brian, I need to chat with you. Shared the example they indeed had the conversation, the what Brian had shared back shared back was that in no means Did he ever share who the final candidate was. However, the employee surmised it is kind of what we think happened. But you know, at the end of day, we would just have preferred not to have any discussion regards to that somebody that wasn't involved in the interview process. So Brian was very, you know, he, he absolutely owned it. He absolutely apologized. Said, you know, I've been doing this for 20 plus years, and we would just have rather had you know if they're going to talk just to talk about whatever else, but not, yeah.\n\nInterviewer 3:50: So just that those were too small. Attention to detail that has a consequence.\n\nSpeaker 1 3:55: Yeah? So again, overall, great experience. We would do it again, but just need to that part just needs to be a little bit more clean.\n\nInterviewer 4:07: -- 1 of 5 -- Yeah, did you use their assessment tool for these hires? Absolutely every one of them. Yeah. And how did they compare to, I suppose the previous time with the with the competitor,\n\nSpeaker 1 4:21: they were they were different and they were helpful. I really can't say that one was better than the other, because the other firm that we use was also a national firm, but it created good discussion. The expert that came on the line to walk it through with us did a great job, you know, sharing their observations of the assessment, and we only used it as one of many data points.\n\nInterviewer 4:56: And is it something that you will continue to use as part of so it's ongoing development plan.\n\nSpeaker 1 5:06: You know, that's a great question. We haven't gotten that far yet, but I could, I could absolutely see us using it in between, like the first of, you know, sit down performance review, but I do think that the leader, matter of fact, both leaders, the one for the other position, has enjoyed using it as well and trying to understand a little bit about each individual, their strengths, their developmental areas. And I know you're not supposed to compare and contrast, but our leaders tendency to do that, and it just gave them a I did like their their graphs were really nice. You know how you could how they were overlaid so you could see them. One thing that I asked them to do, which they were very willing to do, not sure that they would have offered it was, you know, if we were looking at three candidates, originally, we were going to get three different separate sheets. And I asked them if they could put, you know, some of the graphing all on one sheet so we could see it. And that was very helpful. Great.\n\nInterviewer 6:19: Okay, that's helpful in terms of the end to end experience. How involved did they get in helping craft the job role and the skills needed for the for the for the role? Or was that already done? Did you guys do that beforehand? Yeah.\n\nSpeaker 1 6:40: So they did, they did do a little bit of work. We already had much of it put together. They helped to prepare the position paper that they were going to use. So they took the information from our job descriptions and from the interview that they did with the senior leader, and crafted something that I think was more targeted, which was very helpful, but we did have a lot of our material already prepared.\n\nInterviewer 7:11: And what about things like kind of compensation benchmarking? Was that something that they that they bought or to the table, or was that something that you'd already\n\nSpeaker 1 7:21: decided on, yeah, we already we gave them where we thought we wanted to be, and we did a lot of our own market analysis through our executive comp area, where they came in was to provide us either what the current comp was, total comp was, or kind of what they were asking for, but not necessarily as much from a recommendation perspective. You know, they tell us, you know, hey, look, you're, you know, you are a statewide organization competing in a global market, and you may have some challenges, but we didn't get into a lot of numbers.\n\nInterviewer 8:05: Yeah, and did they? Did they take the lead on negotiating the contracts? Or was that something that you guys did?\n\nSpeaker 1 8:14: No, they, they, they did much of the negotiation and much of the encouragement and and much of the maybe helping the candidates understand what the total package looked like,\n\nSpeaker 2 8:32: great and in terms of,\n\nInterviewer 8:37: -- 2 of 5 -- well, I mean, overall, minus the blips that we've talked about. You know, where could they make improvements Unknown Speaker 8:46 in their service? So think both of\n\nSpeaker 1 8:56: the the searches, I think maybe being more proactive in setting up\n\nSpeaker 2 9:10: the weekly or, you know, bi weekly meetings,\n\nSpeaker 1 9:16: even when they didn't have candidates or any any additional The other thing that I've had to kind of push them on a little bit is like now we're down to two or three top candidates, but at the end of the day, I don't know if we'll go with any of the three and making sure that they continue to recruit until an offer is signed, sealed and delivered, it feels like it slows down considerably once two or three candidates are kind of at the top of the list.\n\nInterviewer 9:53: Yeah, makes sense. And I mean in terms of the quality, you know, and the quantity in that initial stage, has that met your expectations?\n\nSpeaker 1 10:05: It's been different between the two. But in fairness to Korn Ferry, the chief medical officer was fantastic. There were a lot of quality candidates to choose from. You know our the industry now and where people want to work is more of a challenge. It's a challenge from the standpoint of what candidates want versus what employers want. So employers want people to be on site, you know, and now candidates want to work remote, and don't want to, you know, make the move so, you know, we had to do a little bit of hand wrangling there. But overall, I was real pleased with the Chief Medical Officer, both on the quantity and the quality. We had a lot of people to talk to, and a lot of people to choose from. On our Vice President of Finance and Accounting, my senior leader was looking for a little bit of a unicorn, and probably had too many expectations, so both Korn Ferry and and I had to help him kind of reset his expectations. But that was much that has been more of a difficult role to find people that met probably 75% of what I think the leader was looking for, okay?\n\nInterviewer 11:31: And I suppose that leads me to my next question in terms of what's more important to you, is working with a recruiter? Is it the individual recruiting themselves and their network, or is it then being part of a, you know, a big recognized brand like Korn Ferry, where people will pick up the phone and the systems like the assessments in place\n\nSpeaker 1 11:57: towards a firm like Korn Ferry, is their their technology, their pipeline and their experience in the industry, you know, so they had very specific health care insurance experience that was really attractive. They had technology, including the assessments that made our the executives lives a little easier and gave them more confidence in the search. I think that was important. And then we just know that there is a number of executives that know to reach out to a few firms. And so our reach, you know, from a local perspective, our local recruiters are Korn, they just don't have the depth or breadth. You know, one thing I really liked about Brian was, when we first talked with him, he was able to give comfort and give confidence to the leaders, that he understood the industry, that he understood the major players, and they also understood individuals in the market. So they started talking about individuals that they both ran across, that they they they knew, and he knew that, and I thought that was very helpful for the leader. Great.\n\nInterviewer 13:19: So would you, would you ever use Korn Ferry for anything beyond search?\n\nSpeaker 1 13:26: -- 3 of 5 -- They would definitely be in consideration. It would depend on probably the level of the role, and, you know what we were looking for. I always have to balance whether it's something we can do internally or whether I think it's kind of beyond our scope. So they would definitely be in consideration. I've had good experience with Korn Ferry and a few others. So you know, if it comes down to expertise and price, I'll definitely, you know, look at two or three and kind of against each other to see what they're willing to do to provide the best for the organization.\n\nInterviewer 14:04: And were you before you obviously brought them in for that original RFP for your CEO search how Unknown Speaker 14:11 familiar work with the Korn Ferry.\n\nSpeaker 1 14:15: I had used them when I was with I think you might know them as Fiserv, but before that, they were known as first data. I had used first data. I used Korn Ferry a few times in my experience at first data, so that was really what prompted me to pursue Korn Ferry, right?\n\nInterviewer 14:37: And would you recommend them to other people? Unknown Speaker 14:42 Yeah, I definitely would.\n\nInterviewer 14:44: And going broader, like thinking about kind of the challenges in your organization when it comes to people, what are the key challenges that you're facing right now? Unknown Speaker 14:57 Actually, the market is such now where talents a little easier to find. Unknown Speaker 15:05 I think\n\nSpeaker 1 15:07: really finding individuals with healthcare and insurance experience, there are certain areas where we struggle a bit more than others. So I have no problem finding a head of HR or finding, but there are rules like, you know, medical that I would have more difficult, you know, like a chief medical officer, actuarial is very difficult. I probably would have to use a Korn Ferry if I was looking for a senior level role and I wasn't anticipating having difficulty with finance, but I think it was the combination of different things that the leader was looking for, that we were looking for somebody that had a little bit of everything, and we found that there was a lot of specialty, and he just had to come to terms with finding a specialty and then growing somebody into other aspects, or depending on our current talent. So I would just say right now, it's the challenge is certain positions and finding people with that very particular knowledge and experience that will help us. And then also, we have a tendency to prefer Blue Cross experience. And you know, with them being 30 plus Blue Cross, you know, I find that Blue Cross, their approach looks a little bit different than like a united or Aetna or a fortune 500 and have to report to the street, as opposed to a mutual like us, okay?\n\nInterviewer 16:52: And then in terms of, I suppose, the use of data in in, you know, I suppose HR functions and how important is it that you're able to, well, I suppose, work with people like Korn Ferry, and they bring a kind of a data led approach to the work that they do, and able to tap into either their insights and benchmarks or yours.\n\nSpeaker 1 17:22: Yeah, that's very important. We're really, we're really trying to focus on data to make decisions. So we have a little line in here that we say data before stories, you know, and being able to present to the CEO, the assessment data and any other data that helps give him confidence, because he's involved in a lot of these senior level decisions, gives us more credibility as an HR function. I think Korn Ferry -- 4 of 5 -- represented us well, which I was confident when we brought the candidates to him, and he loves the data, and he wants to see that. So, you know, I felt sorry for some of our candidates, because when he interviews, it's very data specific. So the fact that Korn Ferry already brings that up and in some respects, prepares the candidates. We were prepping Korn Ferry to prep our candidates before they met with the senior leader, so that they could put their best foot forward.\n\nInterviewer 18:33: Right? Got you? Yeah, that's been really helpful. I don't think there's anything other questions from my side, unless there's anything else you think would be useful to share.\n\nSpeaker 1 18:44: You know, outside of the fact that we've been very pleased, we're close to the end of our second search, so far, both senior leaders have been very happy, overall with the product and results. I've been happy with the team that has been assigned to us. Brian has done a very nice job with this team. You know, as I'd mentioned, there was a difference between the two searches. One had a lot of candidates, the other one was a little bit more difficult. But hopefully we're close to an end. We've got the final interviews set up in two weeks, and unless something goes haywire, hopefully we'll start the negotiation process. So really appreciate Korn Ferry and what they've done, and they'll continue to be, you know, on our agenda if we have to do other searches, right? Brilliant.\n\nInterviewer 19:37: Daryl, thank you. That was really helpful, and it was really lovely to\n\nSpeaker 1 19:40: meet you. Nice to meet you as well. Have a wonderful weekend.\n\nInterviewer 19:43: Yeah, you too. Thanks. Transcribed by https://otter.ai -- 5 of 5 --"
}