{
  "id": "t-026",
  "sourceFile": "T21_NPS10_EMEA_ES_MARQUEE_OCT25.pdf",
  "client": "Gerd Pircher",
  "interviewDate": "2025-10-29",
  "project": "Executive Search",
  "score": 10,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Speaker 1 0:00",
      "text": "We had much more, much more recruitments, and we used them more frequently. Yes, great, same same firm, same offices, same partners. So was quite familiar, brilliant."
    },
    {
      "speaker": "Interviewer 0:18",
      "text": "And in terms of the search, if you could just, I mean, if you could just outline kind of what the role was for and what your, I suppose your expectations were for it."
    },
    {
      "speaker": "Speaker 1 0:32",
      "text": "Well, everything started by a resignation here in HSBC. Of really good head of global transaction transaction solution, and since the beginning, we tried to cover the role internally, but for a bunch of reason, we couldn't find a matching profile, we had to look outside because we were searching for some someone fresher, one more motivated, someone maybe younger, of course, but eager to succeed. Which is, which was and which is the philosophy we would like to apply to the company and to the people from few months ago onwards. So we thought it would have been better looking outside,"
    },
    {
      "speaker": "Interviewer 1:38",
      "text": "right, and in terms of then creating that job role and scoping out, you know, the role itself, was that something that the Korn Fery team helped with, or had you done that already?"
    },
    {
      "speaker": "Speaker 1 1:53",
      "text": "Yes, and no. I mean, we were pretty clear with what we needed, and we, we started recruiting by ourselves, maybe not recruiting as a process, but we, we had the chance to interview few people on the market. Maybe people knew by clients, people knew known by other colleagues, but then we needed someone with deep roots within this particular branch of the market. That's why we we use the Korn Fery because they they have deep roots and knowledge of the market itself, and especially for this typical product, which is which is not really common,"
    },
    {
      "speaker": "Interviewer 2:48",
      "text": "and overall, how was your experience with the team? How from end to end, how did do they meet expectations?"
    },
    {
      "speaker": "Speaker 1 2:59",
      "text": "Yes, they did in the past, I had the chance to work with other Headhunters, I would say, typology or firm, but they provided us not just a senior partner, but two senior partners and other two or three people to set meetings exploring deeper the market. It was quite a big team. Instead of one ad hunter, a partner providing us the service. It was maybe not the whole branch, but three, four people trying to help, investigating, asking questions, finding solutions and providing proposals, and availability to discuss and availability to Interview a bunch of people, which is not a common thing, because those profile are quite senior, and also on, I would say, also on an organizational point of view, it's tough. So they provided, also those this service to us, which is fundamental right."
    },
    {
      "speaker": "Interviewer 4:21",
      "text": "And in terms of providing you with quality and the quantity of candidates did that, how did did that meet your expectations? Unknown Speaker 4:33 Yes, I would say yes, yes."
    },
    {
      "speaker": "Interviewer 4:36",
      "text": "And and then in terms of finding the candidate and onboarding them. Did they help all the way through in terms of negotiation and contracts? -- 1 of 5 --"
    },
    {
      "speaker": "Speaker 1 4:52",
      "text": "No, we did it autonomously. I mean, the negotiation and did they autonomously"
    },
    {
      "speaker": "Interviewer 5:04",
      "text": "and did that? Sorry to interrupt. Did they help advise on things like compensation levels? Did they bring any of their external benchmarks around pay into this project?"
    },
    {
      "speaker": "Speaker 1 5:19",
      "text": "No, we didn't ask for it. We add our numbers in our minds. So we did not we we were not so in need of such data."
    },
    {
      "speaker": "Interviewer 5:37",
      "text": "Okay, great. And what about things like assessment tools. Did they assess your final candidates using their tools? Or was that something you did as well or maybe didn't"
    },
    {
      "speaker": "Speaker 1 5:49",
      "text": "do well? We as a part of recruitment, it is mandatory in HSBC attending a value test. It's provided globally by Korn Fery. It was not a topic related to this, to this, to this recruitment, but it's a product HSBC globally. We did buy from them, all right,"
    },
    {
      "speaker": "Interviewer 6:19",
      "text": "and how? I mean, are you close to that product or or at least the output of it is, is that something you're familiar with,"
    },
    {
      "speaker": "Speaker 1 6:29",
      "text": "I am familiar with. It is an exceptional product, quite simple, intuitive, straightforward. It's easy to be used great."
    },
    {
      "speaker": "Interviewer 6:42",
      "text": "And in terms of the team, you obviously said, there was a large team that that that was brought around this, in terms of style of communication and keeping you up to date and abreast of kind of you know, the candidates was that a weekly thing? Was it a did they ask you how you preferred to to engage? Or was it more ad hoc?"
    },
    {
      "speaker": "Speaker 1 7:11",
      "text": "It was? I mean, we were, since the beginning, pretty clear on our needs, and we also advise them what firm to look at, what profile to look at, and maybe also some names, right? I would say 70% the remaining 30% they did some proposals, they did some digging on our behalf, and they represented the market through pitching activity on a periodical time frame, I would say, great."
    },
    {
      "speaker": "Interviewer 7:53",
      "text": "And did in terms of communication and keeping you informed. Did that? Did that go well?"
    },
    {
      "speaker": "Speaker 1 8:03",
      "text": "They were brilliant, extremely precise, extremely comprehensive, nothing to nothing to add. I would say,"
    },
    {
      "speaker": "Interviewer 8:13",
      "text": "Okay, is there anything that they could have done differently, that they could improve on?"
    },
    {
      "speaker": "Speaker 1 8:24",
      "text": "One thing. This is, this should not be highlighted as a negative thing. But when we were, you know, telling our opinion on the on the final candidate compensation, we had in mind a package. It was a particular situation, quite hard to be discussed, but we had a certain package in mind, and I represented what our intention were at the time, and I would have expected a little bit more of support by Tid Hunter, because they answered me, you know, about what you're proposing. It's not really, I mean, the candidate might lose this, this and that probably you should offer a little bit more. And we said, okay, for whom you are working for, for us, for the candidate, I would have appreciated a little bit more of challenging behavior versus the candidate. Because, you know, within a negotiation, you can -- 2 of 5 -- start by a lower starting point, I would say, and maybe you can just meet in the middle while they were Why don't you offer immediately, a little bit more? No, I would like to offer maybe a little bit less, because I think it is already extremely fair. So okay, I don't know. I understand, yeah."
    },
    {
      "speaker": "Interviewer 10:13",
      "text": "I totally understand, yeah. And in terms of where you landed on that point, I mean, did you did you without, obviously going into details, did you have to kind of go higher, or was it something where, if you, if you started where you wanted to, did? Did that work on?"
    },
    {
      "speaker": "Speaker 1 10:35",
      "text": "No. First of all, when they asked if they want them to interact on our behalf, on the negotiation with it. Now we will go straight ahead by ourselves. And I think that the CEO was a good negotiator, and he bought the candidate without any problem, immediately, without, without rising our offer, which was an extremely fair offer."
    },
    {
      "speaker": "Interviewer 11:08",
      "text": "Great, okay. And then in terms of, is the candidate now in place? Have they started? Yes, yes. And has the Korn Fery team kind of supported them in, you know, in terms of their onboarding or then a follow up. You might not know."
    },
    {
      "speaker": "Speaker 1 11:28",
      "text": "I don't know. I have no idea if they did follow up with the candidate, and there was no need for them to support us in the in the onboarding and whatsoever I did, I did it myself."
    },
    {
      "speaker": "Interviewer 11:43",
      "text": "Yeah, and forward. Would you use them again? Unknown Speaker 11:53 I would say yes, yes,"
    },
    {
      "speaker": "Interviewer 11:57",
      "text": "anything specific or a more, you know, is there anywhere that you would think that's not suitable for them?"
    },
    {
      "speaker": "Speaker 1 12:10",
      "text": "No, for for this kind of candidate, I would say they are perfectly matching our expectation. No, no, I think they are at three, 360, degrees capable companies and a good, I would say, Work Business companion for HSBC or whatever other client. I would advise other people using them."
    },
    {
      "speaker": "Interviewer 12:44",
      "text": "Here is good. I'll let him in."
    },
    {
      "speaker": "Speaker 2 12:53",
      "text": "Sincere apologies, sorry, sorry, sorry, sorry, but I had a previous call. Brutally overrun. No worries,"
    },
    {
      "speaker": "Interviewer 13:02",
      "text": "we've made a really good start without you. So I hope you don't mind. Unknown Speaker 13:06 Oh, not at all."
    },
    {
      "speaker": "Interviewer 13:10",
      "text": "So GERD, just to back up a little bit, I'm Interviewer the managing partner a consultancy and we've been working with Korn Fery for five or six years, and they've asked us to run these follow up interviews to MPs, really to just dig into what they can do better, so in the hope that you can speak more freely to a third party. So Marco has been really great in setting the scene of the search project that we're specifically talking about and and how Korn Ferry have performed. But it would be great to hear from you as one of the key stakeholders, too. Yeah."
    },
    {
      "speaker": "Speaker 2 13:52",
      "text": "-- 3 of 5 -- First of all, the fact that I took this call already says a lot about how pleased I am with how com Fery did this job. I normally miss these opportunities of giving feedback because I just don't see the point. But in this case, I really wanted to what went particularly well. I've been using headhunters for senior hires in many different situations, in many different roles in many different geographies. I've had the privilege to work around the world with HSBC, and rarely have I experienced such a quick grasp of our brief, real follow up around what we then gave in terms of feedback as interviews went on, we kept giving feedback. We like this aspect about this candidate. We are disappointed about this audio aspect this candidate, we think is a waste of time because ABC and we could sense and feel a real reaction to that, so real reactivity, in general, to the brief from the outset and then to our ongoing feedback. I liked the overall breadth and quality of the long list of candidates. I liked. I liked the hand holding throughout the process. I mean, everything was really easy, also from a logistical point of view, my my life is a very complicated one. I do two jobs in HSBC at the time, at the moment, and and I'm just difficult to grasp, but it to catch. But it all worked fine. And I think we got a terrific candidate, and all the merit for that goes to Korn Fery, so well done. Fantastic."
    },
    {
      "speaker": "Interviewer 15:51",
      "text": "I'll keep this brief, given that you're you're doing your two jobs, but is there anything that they could have done differently? Is there anything they could improve upon?"
    },
    {
      "speaker": "Speaker 2 16:00",
      "text": "Now, what's interesting. Everything you now heard from me is my post factor view my my experience of the actual briefing call was was not a good one. I felt that the team there didn't fully understand what we were after didn't fully grasp what we wanted. It is a bit of a hybrid role. Our understanding of trade finance we hired for the head of trade for Italy is a broader one than the rest of the market and and I was not sure this message had landed, but I was wrong. So I'm telling you this story just to give you their full disclosure from the candidate long list, we understood that they had grasped they had really thrown the neck widely because we encouraged them. We are the leading trade bank in the world, and Italy is no exception to this. So we we encourage them strongly, not to bring the usual suspects, because we know the trade heads of the other banks in Italy and and while they are one or two of them where and would have been and should have been viable candidates, we actively encourage them to throw The net more widely and approach non obvious profiles Italians who work abroad, corporate treasurers who might consider a switch into banking, etc, etc, and and they absolutely did. They delivered on that. And I was very impressed,"
    },
    {
      "speaker": "Interviewer 17:36",
      "text": "right? What was it in that first meeting that made you think that they didn't get it."
    },
    {
      "speaker": "Speaker 2 17:45",
      "text": "I've been a banker for 30 years, and I've been doing these meetings, and I I just felt it's totally subjective. There is nothing. And please be very careful how you mean it is, you know, I didn't I, I wouldn't want to send a message that they treated us badly in that meeting. It just felt, it to me, that they weren't fully grasping the nuances of what we were briefing. But they did. I was wrong. It's not an even better. If it is just feedback. I can't give you an even better we had a great candidate slate. We hired a great candidate,"
    },
    {
      "speaker": "Interviewer 18:27",
      "text": "end of story, and then met your expectations. Obviously it sounds like in terms of quality, but also in terms of the speed of which you wanted to fill that role. Absolutely, we"
    },
    {
      "speaker": "Speaker 2 18:38",
      "text": "were in our timeline. Normally on timelines, we are the weakest link. HSBC is a slow organization to hire and to jump through all the hoops of multiple layers of interviews, negotiations, blah, blah, blah, but in this case, we absolutely were in our timeline, what?"
    },
    {
      "speaker": "Interviewer 19:02",
      "text": "Where do they stand out or differentiate from the experience you've had previously with other headhunters?"
    },
    {
      "speaker": "Speaker 2 19:11",
      "text": "-- 4 of 5 -- Right question. In Italy, we have historically hired senior roles with Egon Zender, who are known to be especially one partner, sort of with if you ask anyone in the market to the strong head hunters in the finance world in Italy, You would normally get the answer Egon Zehnder and"
    },
    {
      "speaker": "Speaker 2 19:42",
      "text": "a Giovanna. Galli Marco, you tell me"
    },
    {
      "speaker": "Interviewer 19:51",
      "text": "not hydropon struggles,"
    },
    {
      "speaker": "Speaker 2 19:53",
      "text": "or it will come to me anyway. Another one not confess. Spencer Stewart Stewart, thank you. Spencer Stewart, the lead partners in Egon Zehnder are tomaszo arena, and the lead partner in Spencer Stuart is Joanna Galilee. We don't like Spencer Stewart. We've worked for a long time with Tomaso in Egon Zehnder, and on this one, we just said, Let's try someone else, just for the sake of it. And Korn Fery were great, unexpectedly, so which makes everything I said even more valuable, because it was a really nice, positive surprise. And the key differentiator to tomaszo, who has become a friend, and, you know, I don't want to talk badly about him and Allan Zender, but they are so good that I felt in the last briefing conversation and then hiring process I run with him that that he wanted to tell me how to hire and how to interview, and ultimately, who to hire, and with all due respect. But you know, you are a paid agent, paid to help me take the right decision, but it's my hire and it's my decision, so I once again going back to Korn Ferry. The Korn Ferry team, having absolutely grasped the brief correctly and having executed on it, they did exactly what I what I missed, what I yeah, what I missed with with a gun, Zehnder, and what I would like head hunter to do, which is to support me in doing my search great."
    },
    {
      "speaker": "Interviewer 21:48",
      "text": "And then last question, in terms of, I suppose, what's most valuable to you in finding that right partner, I think you know, as you're describing it, to support you. Is it around their network? Is it around, the way in which they work with you, which sounds like it's important, or is it around? Or is it around the I suppose the infrastructure and the company that sits behind them, so the brand and the frameworks and the team,"
    },
    {
      "speaker": "Speaker 2 22:16",
      "text": "I don't care about the brand at all. To the contrary, big brands only means a bigger fee, and I wouldn't mind if it was lower. But you pay for quality, you get what you pay for. I guess that's the contradiction to my own statement. The most difficult part of this search was grasping a non obvious brief, a non straightforward brief, and to execute on our invitation because of the non obviousness of the brief, to throw the net widely. And that's easily said, but I am sure I appreciate that it's difficult to do, and they did it commendably. I don't know how they do it, how they did it, but they did it very well,"
    },
    {
      "speaker": "Interviewer 23:06",
      "text": "right? That is it. So I really appreciate you both jumping on and being so candid, especially have given how busy are and delighted that you're happy with them. So I will feed back that positivity and and, and you know, hope that they will have an opportunity to work with you again. Unknown Speaker 23:25 Sure, brilliant, again for joining late."
    },
    {
      "speaker": "Interviewer 23:29",
      "text": "No worries. Thank you very much. Thanks. Bye."
    },
    {
      "speaker": "Speaker 1 23:31",
      "text": "Thank you. Bye. Transcribed by https://otter.ai -- 5 of 5 --"
    }
  ],
  "rawText": "Speaker 1 0:00: We had much more, much more recruitments, and we used them more frequently. Yes, great, same same firm, same offices, same partners. So was quite familiar, brilliant.\n\nInterviewer 0:18: And in terms of the search, if you could just, I mean, if you could just outline kind of what the role was for and what your, I suppose your expectations were for it.\n\nSpeaker 1 0:32: Well, everything started by a resignation here in HSBC. Of really good head of global transaction transaction solution, and since the beginning, we tried to cover the role internally, but for a bunch of reason, we couldn't find a matching profile, we had to look outside because we were searching for some someone fresher, one more motivated, someone maybe younger, of course, but eager to succeed. Which is, which was and which is the philosophy we would like to apply to the company and to the people from few months ago onwards. So we thought it would have been better looking outside,\n\nInterviewer 1:38: right, and in terms of then creating that job role and scoping out, you know, the role itself, was that something that the Korn Fery team helped with, or had you done that already?\n\nSpeaker 1 1:53: Yes, and no. I mean, we were pretty clear with what we needed, and we, we started recruiting by ourselves, maybe not recruiting as a process, but we, we had the chance to interview few people on the market. Maybe people knew by clients, people knew known by other colleagues, but then we needed someone with deep roots within this particular branch of the market. That's why we we use the Korn Fery because they they have deep roots and knowledge of the market itself, and especially for this typical product, which is which is not really common,\n\nInterviewer 2:48: and overall, how was your experience with the team? How from end to end, how did do they meet expectations?\n\nSpeaker 1 2:59: Yes, they did in the past, I had the chance to work with other Headhunters, I would say, typology or firm, but they provided us not just a senior partner, but two senior partners and other two or three people to set meetings exploring deeper the market. It was quite a big team. Instead of one ad hunter, a partner providing us the service. It was maybe not the whole branch, but three, four people trying to help, investigating, asking questions, finding solutions and providing proposals, and availability to discuss and availability to Interview a bunch of people, which is not a common thing, because those profile are quite senior, and also on, I would say, also on an organizational point of view, it's tough. So they provided, also those this service to us, which is fundamental right.\n\nInterviewer 4:21: And in terms of providing you with quality and the quantity of candidates did that, how did did that meet your expectations? Unknown Speaker 4:33 Yes, I would say yes, yes.\n\nInterviewer 4:36: And and then in terms of finding the candidate and onboarding them. Did they help all the way through in terms of negotiation and contracts? -- 1 of 5 --\n\nSpeaker 1 4:52: No, we did it autonomously. I mean, the negotiation and did they autonomously\n\nInterviewer 5:04: and did that? Sorry to interrupt. Did they help advise on things like compensation levels? Did they bring any of their external benchmarks around pay into this project?\n\nSpeaker 1 5:19: No, we didn't ask for it. We add our numbers in our minds. So we did not we we were not so in need of such data.\n\nInterviewer 5:37: Okay, great. And what about things like assessment tools. Did they assess your final candidates using their tools? Or was that something you did as well or maybe didn't\n\nSpeaker 1 5:49: do well? We as a part of recruitment, it is mandatory in HSBC attending a value test. It's provided globally by Korn Fery. It was not a topic related to this, to this, to this recruitment, but it's a product HSBC globally. We did buy from them, all right,\n\nInterviewer 6:19: and how? I mean, are you close to that product or or at least the output of it is, is that something you're familiar with,\n\nSpeaker 1 6:29: I am familiar with. It is an exceptional product, quite simple, intuitive, straightforward. It's easy to be used great.\n\nInterviewer 6:42: And in terms of the team, you obviously said, there was a large team that that that was brought around this, in terms of style of communication and keeping you up to date and abreast of kind of you know, the candidates was that a weekly thing? Was it a did they ask you how you preferred to to engage? Or was it more ad hoc?\n\nSpeaker 1 7:11: It was? I mean, we were, since the beginning, pretty clear on our needs, and we also advise them what firm to look at, what profile to look at, and maybe also some names, right? I would say 70% the remaining 30% they did some proposals, they did some digging on our behalf, and they represented the market through pitching activity on a periodical time frame, I would say, great.\n\nInterviewer 7:53: And did in terms of communication and keeping you informed. Did that? Did that go well?\n\nSpeaker 1 8:03: They were brilliant, extremely precise, extremely comprehensive, nothing to nothing to add. I would say,\n\nInterviewer 8:13: Okay, is there anything that they could have done differently, that they could improve on?\n\nSpeaker 1 8:24: One thing. This is, this should not be highlighted as a negative thing. But when we were, you know, telling our opinion on the on the final candidate compensation, we had in mind a package. It was a particular situation, quite hard to be discussed, but we had a certain package in mind, and I represented what our intention were at the time, and I would have expected a little bit more of support by Tid Hunter, because they answered me, you know, about what you're proposing. It's not really, I mean, the candidate might lose this, this and that probably you should offer a little bit more. And we said, okay, for whom you are working for, for us, for the candidate, I would have appreciated a little bit more of challenging behavior versus the candidate. Because, you know, within a negotiation, you can -- 2 of 5 -- start by a lower starting point, I would say, and maybe you can just meet in the middle while they were Why don't you offer immediately, a little bit more? No, I would like to offer maybe a little bit less, because I think it is already extremely fair. So okay, I don't know. I understand, yeah.\n\nInterviewer 10:13: I totally understand, yeah. And in terms of where you landed on that point, I mean, did you did you without, obviously going into details, did you have to kind of go higher, or was it something where, if you, if you started where you wanted to, did? Did that work on?\n\nSpeaker 1 10:35: No. First of all, when they asked if they want them to interact on our behalf, on the negotiation with it. Now we will go straight ahead by ourselves. And I think that the CEO was a good negotiator, and he bought the candidate without any problem, immediately, without, without rising our offer, which was an extremely fair offer.\n\nInterviewer 11:08: Great, okay. And then in terms of, is the candidate now in place? Have they started? Yes, yes. And has the Korn Fery team kind of supported them in, you know, in terms of their onboarding or then a follow up. You might not know.\n\nSpeaker 1 11:28: I don't know. I have no idea if they did follow up with the candidate, and there was no need for them to support us in the in the onboarding and whatsoever I did, I did it myself.\n\nInterviewer 11:43: Yeah, and forward. Would you use them again? Unknown Speaker 11:53 I would say yes, yes,\n\nInterviewer 11:57: anything specific or a more, you know, is there anywhere that you would think that's not suitable for them?\n\nSpeaker 1 12:10: No, for for this kind of candidate, I would say they are perfectly matching our expectation. No, no, I think they are at three, 360, degrees capable companies and a good, I would say, Work Business companion for HSBC or whatever other client. I would advise other people using them.\n\nInterviewer 12:44: Here is good. I'll let him in.\n\nSpeaker 2 12:53: Sincere apologies, sorry, sorry, sorry, sorry, but I had a previous call. Brutally overrun. No worries,\n\nInterviewer 13:02: we've made a really good start without you. So I hope you don't mind. Unknown Speaker 13:06 Oh, not at all.\n\nInterviewer 13:10: So GERD, just to back up a little bit, I'm Interviewer the managing partner a consultancy and we've been working with Korn Fery for five or six years, and they've asked us to run these follow up interviews to MPs, really to just dig into what they can do better, so in the hope that you can speak more freely to a third party. So Marco has been really great in setting the scene of the search project that we're specifically talking about and and how Korn Ferry have performed. But it would be great to hear from you as one of the key stakeholders, too. Yeah.\n\nSpeaker 2 13:52: -- 3 of 5 -- First of all, the fact that I took this call already says a lot about how pleased I am with how com Fery did this job. I normally miss these opportunities of giving feedback because I just don't see the point. But in this case, I really wanted to what went particularly well. I've been using headhunters for senior hires in many different situations, in many different roles in many different geographies. I've had the privilege to work around the world with HSBC, and rarely have I experienced such a quick grasp of our brief, real follow up around what we then gave in terms of feedback as interviews went on, we kept giving feedback. We like this aspect about this candidate. We are disappointed about this audio aspect this candidate, we think is a waste of time because ABC and we could sense and feel a real reaction to that, so real reactivity, in general, to the brief from the outset and then to our ongoing feedback. I liked the overall breadth and quality of the long list of candidates. I liked. I liked the hand holding throughout the process. I mean, everything was really easy, also from a logistical point of view, my my life is a very complicated one. I do two jobs in HSBC at the time, at the moment, and and I'm just difficult to grasp, but it to catch. But it all worked fine. And I think we got a terrific candidate, and all the merit for that goes to Korn Fery, so well done. Fantastic.\n\nInterviewer 15:51: I'll keep this brief, given that you're you're doing your two jobs, but is there anything that they could have done differently? Is there anything they could improve upon?\n\nSpeaker 2 16:00: Now, what's interesting. Everything you now heard from me is my post factor view my my experience of the actual briefing call was was not a good one. I felt that the team there didn't fully understand what we were after didn't fully grasp what we wanted. It is a bit of a hybrid role. Our understanding of trade finance we hired for the head of trade for Italy is a broader one than the rest of the market and and I was not sure this message had landed, but I was wrong. So I'm telling you this story just to give you their full disclosure from the candidate long list, we understood that they had grasped they had really thrown the neck widely because we encouraged them. We are the leading trade bank in the world, and Italy is no exception to this. So we we encourage them strongly, not to bring the usual suspects, because we know the trade heads of the other banks in Italy and and while they are one or two of them where and would have been and should have been viable candidates, we actively encourage them to throw The net more widely and approach non obvious profiles Italians who work abroad, corporate treasurers who might consider a switch into banking, etc, etc, and and they absolutely did. They delivered on that. And I was very impressed,\n\nInterviewer 17:36: right? What was it in that first meeting that made you think that they didn't get it.\n\nSpeaker 2 17:45: I've been a banker for 30 years, and I've been doing these meetings, and I I just felt it's totally subjective. There is nothing. And please be very careful how you mean it is, you know, I didn't I, I wouldn't want to send a message that they treated us badly in that meeting. It just felt, it to me, that they weren't fully grasping the nuances of what we were briefing. But they did. I was wrong. It's not an even better. If it is just feedback. I can't give you an even better we had a great candidate slate. We hired a great candidate,\n\nInterviewer 18:27: end of story, and then met your expectations. Obviously it sounds like in terms of quality, but also in terms of the speed of which you wanted to fill that role. Absolutely, we\n\nSpeaker 2 18:38: were in our timeline. Normally on timelines, we are the weakest link. HSBC is a slow organization to hire and to jump through all the hoops of multiple layers of interviews, negotiations, blah, blah, blah, but in this case, we absolutely were in our timeline, what?\n\nInterviewer 19:02: Where do they stand out or differentiate from the experience you've had previously with other headhunters?\n\nSpeaker 2 19:11: -- 4 of 5 -- Right question. In Italy, we have historically hired senior roles with Egon Zender, who are known to be especially one partner, sort of with if you ask anyone in the market to the strong head hunters in the finance world in Italy, You would normally get the answer Egon Zehnder and\n\nSpeaker 2 19:42: a Giovanna. Galli Marco, you tell me\n\nInterviewer 19:51: not hydropon struggles,\n\nSpeaker 2 19:53: or it will come to me anyway. Another one not confess. Spencer Stewart Stewart, thank you. Spencer Stewart, the lead partners in Egon Zehnder are tomaszo arena, and the lead partner in Spencer Stuart is Joanna Galilee. We don't like Spencer Stewart. We've worked for a long time with Tomaso in Egon Zehnder, and on this one, we just said, Let's try someone else, just for the sake of it. And Korn Fery were great, unexpectedly, so which makes everything I said even more valuable, because it was a really nice, positive surprise. And the key differentiator to tomaszo, who has become a friend, and, you know, I don't want to talk badly about him and Allan Zender, but they are so good that I felt in the last briefing conversation and then hiring process I run with him that that he wanted to tell me how to hire and how to interview, and ultimately, who to hire, and with all due respect. But you know, you are a paid agent, paid to help me take the right decision, but it's my hire and it's my decision, so I once again going back to Korn Ferry. The Korn Ferry team, having absolutely grasped the brief correctly and having executed on it, they did exactly what I what I missed, what I yeah, what I missed with with a gun, Zehnder, and what I would like head hunter to do, which is to support me in doing my search great.\n\nInterviewer 21:48: And then last question, in terms of, I suppose, what's most valuable to you in finding that right partner, I think you know, as you're describing it, to support you. Is it around their network? Is it around, the way in which they work with you, which sounds like it's important, or is it around? Or is it around the I suppose the infrastructure and the company that sits behind them, so the brand and the frameworks and the team,\n\nSpeaker 2 22:16: I don't care about the brand at all. To the contrary, big brands only means a bigger fee, and I wouldn't mind if it was lower. But you pay for quality, you get what you pay for. I guess that's the contradiction to my own statement. The most difficult part of this search was grasping a non obvious brief, a non straightforward brief, and to execute on our invitation because of the non obviousness of the brief, to throw the net widely. And that's easily said, but I am sure I appreciate that it's difficult to do, and they did it commendably. I don't know how they do it, how they did it, but they did it very well,\n\nInterviewer 23:06: right? That is it. So I really appreciate you both jumping on and being so candid, especially have given how busy are and delighted that you're happy with them. So I will feed back that positivity and and, and you know, hope that they will have an opportunity to work with you again. Unknown Speaker 23:25 Sure, brilliant, again for joining late.\n\nInterviewer 23:29: No worries. Thank you very much. Thanks. Bye.\n\nSpeaker 1 23:31: Thank you. Bye. Transcribed by https://otter.ai -- 5 of 5 --"
}