{
  "id": "t-025",
  "sourceFile": "T20_NPS10_EMEA_CONSULTING_REGIONAL_OCT25.pdf",
  "client": "Matthew Hussein",
  "interviewDate": "2025-10-27",
  "project": "Consulting",
  "score": 10,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Speaker 1 0:00",
      "text": "Sure. Okay, so I work in our people experience team. I'm responsible for our engagement survey. So we engaged Korn Ferry to support us transition from a previous model of engagement and help us design a new a new strategy for measuring the sentiment of our employees. So the scope of work that we asked them to do really was adopting their model and helping us through the transition onto a new platform called tricks. So we went through a tender process, I think, probably about 18 to 18 months two years ago, of course, they were successful, and we've worked with them for about 18 months now. Great."
    },
    {
      "speaker": "Interviewer 0:47",
      "text": "Had you, have you previously worked with them before? How did you"
    },
    {
      "speaker": "Speaker 1 0:52",
      "text": "go on? Yeah, so they, they've supported our business, so ferry in other elements. So we've used them for 360 for example, and they work with us on pay grading as well. So it was an internal recommendation. When we were looking for for candidates who may be useful for us, we were put in contact with Ben, who's the contract lead, and then the discussions followed. There we went through a formal tender process, so we they were included with, I think, three or four other candidates, but they were selected as the best fit for"
    },
    {
      "speaker": "Interviewer 1:29",
      "text": "us, right? And if you're able to recall what were the main criteria for selection within that process,"
    },
    {
      "speaker": "Speaker 1 1:37",
      "text": "understanding our business, understanding the challenges that we were going through. Obviously the economic part came into play with our procurement team. Their proposal was very pragmatic and cost effective. Unlike some of the other candidates, they were much more flexible, so they understood that it was a piece of work that wasn't necessarily able to map out A to B to C to D. It was a discussion about where we want to get to. And then so they built in an element of flexibility that allowed us to say, Okay, if we don't go down this path, maybe we could reallocate some of the time that we have the Korn Ferry on to this other part. So this was one of the key reasons that we selected them as well as their global scope. And you know, this was a global brief for our Global Engagement Survey."
    },
    {
      "speaker": "Interviewer 2:27",
      "text": "Okay, great. And, I mean, how has the experience been? Has it met your expectations?"
    },
    {
      "speaker": "Speaker 1 2:36",
      "text": "-- 1 of 5 -- We probably exceeded our expectations, to be honest, from the very start. I think what we appreciated from Korn Ferry is they were, they were very flexible in terms of, you know, even when we started initial conversations, they were, you know, they invested time with us to, you know, be a sounding board to discuss ideas, not necessarily selling to us, but just, you know, giving us some good basis to, you know, start to collect, to collect our thoughts in terms of what they delivered. No complaints at all. Ben and his team have been really, really, really proactive as well, something else that we appreciate for them. They, you know, we had the scope of work, but they've always been really proactive in suggesting, okay, maybe we need to do a meeting with your senior leaders. I'd really love to be involved in that. If I can get involved with the training, that would be great. So Neil, our lead consultant, was brilliant. And everyone who's interacted with the guys at Korn Ferry have been really, really impressed with the value that they that they give us."
    },
    {
      "speaker": "Interviewer 3:40",
      "text": "Great That's great to hear in terms of things like communication with multiple stakeholders. Did, did that? Did that work? Well, you know, did they manage the kind of I guess I get assuming there were various stakeholders, effectively, yeah,"
    },
    {
      "speaker": "Speaker 1 3:55",
      "text": "there were, there were various stakeholders. But, you know, the way that we wanted to engage Korn Ferry was not necessarily have them running a project and dealing with all of our stakeholders and spending a lot of time, you know, herding us all together and getting us to make decisions. So I was the lead point of contact for Korn Ferry. The decisions were made with the business via me. So the interactions with them were always quite lean, but whenever we've had them come and speak to any of our stakeholders. For example, our chief it officer and our chief HR officer, the way that they integrate and the value and their expertise is always evident. So in those scenarios where we were putting them in front of our most senior people, the impression, as I said before, everyone's impression was, you know, these guys understand us. They know what they're talking about. They're offering some expertise. So there was no issues in terms of their their communication, or their client service with all of our stakeholders,"
    },
    {
      "speaker": "Interviewer 4:53",
      "text": "and in terms of, then the project rollout. So how did that go, from a, I suppose, an internal perspective, was it can was it seamless? Was there anything that could have been improved? It was,"
    },
    {
      "speaker": "Speaker 1 5:05",
      "text": "it was pretty seamless. To be totally honest with you. We had a date in mind that we wanted to launch. We hit that date. They were very useful in mapping out the the things that we needed to achieve along along those timelines to reach the rollout. We didn't really experience any hiccups, hiccups at all throughout the process. To be totally honest with you, it was all very, very smooth. You know, some of the comments that we work with a lot of consultants as ferry, you know, normally Accenture, or, you know, ey, but you know, some of the feedback I heard was, you know, probably the my manager said, you know, probably the best experience I've had with consultants, because they're so you know, sometimes it feels when with with Accenture, we've got a team of eight people on a call, seven of whom are silent, -- 2 of 5 -- and one of them is talking, and we're spending a lot of money not really discussing or achieving very much. But with Korn Ferry, every interaction is, you know, the style of Ben and his team is very reassuring. You know, sitting with them, you know that they're the experts. There's no panic. There's no worry. They know everything that they need to do and we need to do so honestly, no complaints at all about the level of expertise and the service that they provided."
    },
    {
      "speaker": "Interviewer 6:21",
      "text": "And digging into that kind of comparison to some of the, I suppose, the Big Four consultants was, if it sounds like, and I don't want to put words in your mouth, but there was a kind of an execution or a momentum level to it as well, not just a here's what you need to do, but actually taking it through to delivery. Yeah."
    },
    {
      "speaker": "Speaker 1 6:43",
      "text": "So very hands on, very, very practical. So good balance of both the strategic side and supporting us technically and what we needed to do, as I said, so with some of the other consultants we work from, and this is my, my perspective, not the company's perspective, is we need to prescribe to them exactly what we want before they will deliver a piece of work. The opposite side with Korn Ferry is they tend to, as I said before, be more proactive in understanding or anticipating what we need and proposing and just getting on and doing it, and not necessarily having this really formal way of working where, you know, let's go back to the scope of work, and let's look at how many hours we've delivered against this particular objective, and what we particularly we've delivered against this that has never been and, you know, maybe it's the background of, you know, we work with them in the business. This is a new opportunity and a new area of expertise, and they they understand the bigger picture, or someone is understanding the bigger picture of the wider scope of work within the business. So it really felt like they wanted to create a really strong partnership with us for the long term, rather than just engaging them on this finite piece of work where they deliver and that's it, and we go off and"
    },
    {
      "speaker": "Interviewer 7:58",
      "text": "and has that been the case like have, has, has someone, based on your side and their side, kind of connected the dots of all the different engagements? Is there a future opportunity that says bigger than the sum of the parts?"
    },
    {
      "speaker": "Speaker 1 8:12",
      "text": "I think so. I think so. You know, we, we're still in discussion with them now. I mean, we engage them for the for the employee survey, but we're still, we're working with them on, you know, the next stage of employee life cycle measurement. You know, there's, there's very different account leaders based on the different responsibilities. But we're all kind of, we're all coordinated, so through our overall lead for Korn Ferry, you know, the introduction was made with Ben. So behind the scenes for them, it very much felt like they understood the bigger picture of, okay, this is another way to, you know, to build on our partnership, which, obviously it felt like, in terms of their approach, it was they were thinking more long term in how they could support us and and I think they've done that. So they, as I said, they have added a lot of value for us. We wouldn't have been able to do the survey without their expertise."
    },
    {
      "speaker": "Interviewer 9:09",
      "text": "-- 3 of 5 -- Amazing is there? I mean, there's anything they could have improved on,"
    },
    {
      "speaker": "Speaker 1 9:16",
      "text": "only one minor thing. And so one of the project managers we had assigned was unbelievably technically, with a huge amount of expertise. Her style in engaging with us as a team was one that would focus on the risks and the negatives of you know, if you don't do this, if you don't do this, then you're not going to meet the deadline. And her delivery to some of the people in our team struck a lot of fear, whereas experience with another project manager when she was off leave was very much one of supporting, you know, okay, reassuring, you know, you've done most of the things you need to focus on this. So it was just really the style of one particular stakeholder or one particular project manager. As I said, her contribution to the project was was perfect. She knows her stuff. She's an expert. It was just in a particular meeting with my manager, it kind of struck fear about, you know, how this was all going to go wrong, rather than focusing on how we were going to succeed and how it was going to go right. And I understand that's probably part of her personality and her delivery, but it's feedback that I heard from a few people, and one of our sister companies is now working with Korn Ferry as well for a similar and they had similar feedback about this particular person."
    },
    {
      "speaker": "Interviewer 10:36",
      "text": "So that's really helpful. Thank you. Great. And then I suppose, kind of going broader beyond Korn Ferry and thinking about them as an organization, consultancy, taking that aside, what, what are your kind of critical challenges right now that you have around people? And I suppose kind of, you know, retention skills, what's, what's the thing that's top of mind for you?"
    },
    {
      "speaker": "Speaker 1 11:10",
      "text": "So, I mean, not necessarily on, on retention, more on, you know, Ferry, as a company, we're acquiring a lot of other companies, so people, culture is becoming more important. So we've gone from a traditional, you know, Italian, European company, where we're very lucky that we have very low turnover. People want to stay with us and work with us a long time. That's been one of the strengths of the company, but now we're acquiring lots of other companies with a different history and a different background. So the challenge for us now is how we we articulate our culture and the company that we're creating, because we've doubled the number of employees with in the last 10 years. You know, 50% of our employees didn't start their journey in Ferrero. They were acquired by ferry. So the the understanding or or the experience about people considering we can't necessarily rely on people's love for the company and their loyalty, because the general population of employees is a big mix of people that have come from lots of different backgrounds. So, you know, Kellogg's we've acquired in the US, again, is a is a company with really strong values and a really strong history, but they're different from Ferrero, and it's a it's a huge organization, so these are some of the questions that we're asking ourselves about, you know, what we want people to understand about our culture, considering the different legacies of where they've come From?"
    },
    {
      "speaker": "Interviewer 12:37",
      "text": "-- 4 of 5 -- Yeah, okay, great. I think that's it. I mean, yeah, it's great to hear that you've had a positive experience, and anything else that you think at this stage would be useful to share."
    },
    {
      "speaker": "Speaker 1 12:51",
      "text": "I don't think so. I don't think so. Just to reiterate the fact that every person who has dealt with Korn Ferry, or the team that we've worked with in Korn, ferry has been massively impressed by their expertise and their knowledge and the support they've given us. It makes me look really good, to be honest. For you know what we did with our engagement survey, which we delivered at the start of this year, but as I said at the start, we couldn't have done it without them. Their expertise and their support was invaluable throughout the whole process, great."
    },
    {
      "speaker": "Interviewer 13:26",
      "text": "And then I suppose just one last question on Korn Ferry as a you mentioned, you know, one of the reasons that you maybe selected them is because they have that global reach as a brand. How familiar are you with Korn Ferry in terms of what they do kind of end to end."
    },
    {
      "speaker": "Speaker 1 13:42",
      "text": "I mean my visibility. I mean in previous companies, we'd worked with Korn, ferry or hay, as they were, in terms of engagement surveys. So always have them in the background. In my mind, probably the grading is probably the other part. In terms of my wider knowledge of the rest of their consultancy is not, not something I proactively looked into, for example. So if you're leading to you know, would I, would we consider them for other consultancy that maybe isn't part of the pay grading or the employee engagement measurement, considering their scope of experience, in my mind, for me, personally, no, because I don't know enough about the organization, it was really based on this specific need, based on to my, my job role, rather than the the wider scope of, yeah, of services that they offer. That's"
    },
    {
      "speaker": "Interviewer 14:33",
      "text": "great no as asking, just trying to get an understanding of kind of brand, understanding of Korn Ferry as a org consultancy versus, as you said, the kind of the different be used that they have. So that's helpful. Okay, great. Well, that's it. I'll give you 40 minutes back. Appreciate you jumping on the call and giving more detail to your feedback."
    },
    {
      "speaker": "Speaker 2 14:56",
      "text": "My pleasure. Yes, you too. Bye bye bye. Life, I. Transcribed by https://otter.ai -- 5 of 5 --"
    }
  ],
  "rawText": "Speaker 1 0:00: Sure. Okay, so I work in our people experience team. I'm responsible for our engagement survey. So we engaged Korn Ferry to support us transition from a previous model of engagement and help us design a new a new strategy for measuring the sentiment of our employees. So the scope of work that we asked them to do really was adopting their model and helping us through the transition onto a new platform called tricks. So we went through a tender process, I think, probably about 18 to 18 months two years ago, of course, they were successful, and we've worked with them for about 18 months now. Great.\n\nInterviewer 0:47: Had you, have you previously worked with them before? How did you\n\nSpeaker 1 0:52: go on? Yeah, so they, they've supported our business, so ferry in other elements. So we've used them for 360 for example, and they work with us on pay grading as well. So it was an internal recommendation. When we were looking for for candidates who may be useful for us, we were put in contact with Ben, who's the contract lead, and then the discussions followed. There we went through a formal tender process, so we they were included with, I think, three or four other candidates, but they were selected as the best fit for\n\nInterviewer 1:29: us, right? And if you're able to recall what were the main criteria for selection within that process,\n\nSpeaker 1 1:37: understanding our business, understanding the challenges that we were going through. Obviously the economic part came into play with our procurement team. Their proposal was very pragmatic and cost effective. Unlike some of the other candidates, they were much more flexible, so they understood that it was a piece of work that wasn't necessarily able to map out A to B to C to D. It was a discussion about where we want to get to. And then so they built in an element of flexibility that allowed us to say, Okay, if we don't go down this path, maybe we could reallocate some of the time that we have the Korn Ferry on to this other part. So this was one of the key reasons that we selected them as well as their global scope. And you know, this was a global brief for our Global Engagement Survey.\n\nInterviewer 2:27: Okay, great. And, I mean, how has the experience been? Has it met your expectations?\n\nSpeaker 1 2:36: -- 1 of 5 -- We probably exceeded our expectations, to be honest, from the very start. I think what we appreciated from Korn Ferry is they were, they were very flexible in terms of, you know, even when we started initial conversations, they were, you know, they invested time with us to, you know, be a sounding board to discuss ideas, not necessarily selling to us, but just, you know, giving us some good basis to, you know, start to collect, to collect our thoughts in terms of what they delivered. No complaints at all. Ben and his team have been really, really, really proactive as well, something else that we appreciate for them. They, you know, we had the scope of work, but they've always been really proactive in suggesting, okay, maybe we need to do a meeting with your senior leaders. I'd really love to be involved in that. If I can get involved with the training, that would be great. So Neil, our lead consultant, was brilliant. And everyone who's interacted with the guys at Korn Ferry have been really, really impressed with the value that they that they give us.\n\nInterviewer 3:40: Great That's great to hear in terms of things like communication with multiple stakeholders. Did, did that? Did that work? Well, you know, did they manage the kind of I guess I get assuming there were various stakeholders, effectively, yeah,\n\nSpeaker 1 3:55: there were, there were various stakeholders. But, you know, the way that we wanted to engage Korn Ferry was not necessarily have them running a project and dealing with all of our stakeholders and spending a lot of time, you know, herding us all together and getting us to make decisions. So I was the lead point of contact for Korn Ferry. The decisions were made with the business via me. So the interactions with them were always quite lean, but whenever we've had them come and speak to any of our stakeholders. For example, our chief it officer and our chief HR officer, the way that they integrate and the value and their expertise is always evident. So in those scenarios where we were putting them in front of our most senior people, the impression, as I said before, everyone's impression was, you know, these guys understand us. They know what they're talking about. They're offering some expertise. So there was no issues in terms of their their communication, or their client service with all of our stakeholders,\n\nInterviewer 4:53: and in terms of, then the project rollout. So how did that go, from a, I suppose, an internal perspective, was it can was it seamless? Was there anything that could have been improved? It was,\n\nSpeaker 1 5:05: it was pretty seamless. To be totally honest with you. We had a date in mind that we wanted to launch. We hit that date. They were very useful in mapping out the the things that we needed to achieve along along those timelines to reach the rollout. We didn't really experience any hiccups, hiccups at all throughout the process. To be totally honest with you, it was all very, very smooth. You know, some of the comments that we work with a lot of consultants as ferry, you know, normally Accenture, or, you know, ey, but you know, some of the feedback I heard was, you know, probably the my manager said, you know, probably the best experience I've had with consultants, because they're so you know, sometimes it feels when with with Accenture, we've got a team of eight people on a call, seven of whom are silent, -- 2 of 5 -- and one of them is talking, and we're spending a lot of money not really discussing or achieving very much. But with Korn Ferry, every interaction is, you know, the style of Ben and his team is very reassuring. You know, sitting with them, you know that they're the experts. There's no panic. There's no worry. They know everything that they need to do and we need to do so honestly, no complaints at all about the level of expertise and the service that they provided.\n\nInterviewer 6:21: And digging into that kind of comparison to some of the, I suppose, the Big Four consultants was, if it sounds like, and I don't want to put words in your mouth, but there was a kind of an execution or a momentum level to it as well, not just a here's what you need to do, but actually taking it through to delivery. Yeah.\n\nSpeaker 1 6:43: So very hands on, very, very practical. So good balance of both the strategic side and supporting us technically and what we needed to do, as I said, so with some of the other consultants we work from, and this is my, my perspective, not the company's perspective, is we need to prescribe to them exactly what we want before they will deliver a piece of work. The opposite side with Korn Ferry is they tend to, as I said before, be more proactive in understanding or anticipating what we need and proposing and just getting on and doing it, and not necessarily having this really formal way of working where, you know, let's go back to the scope of work, and let's look at how many hours we've delivered against this particular objective, and what we particularly we've delivered against this that has never been and, you know, maybe it's the background of, you know, we work with them in the business. This is a new opportunity and a new area of expertise, and they they understand the bigger picture, or someone is understanding the bigger picture of the wider scope of work within the business. So it really felt like they wanted to create a really strong partnership with us for the long term, rather than just engaging them on this finite piece of work where they deliver and that's it, and we go off and\n\nInterviewer 7:58: and has that been the case like have, has, has someone, based on your side and their side, kind of connected the dots of all the different engagements? Is there a future opportunity that says bigger than the sum of the parts?\n\nSpeaker 1 8:12: I think so. I think so. You know, we, we're still in discussion with them now. I mean, we engage them for the for the employee survey, but we're still, we're working with them on, you know, the next stage of employee life cycle measurement. You know, there's, there's very different account leaders based on the different responsibilities. But we're all kind of, we're all coordinated, so through our overall lead for Korn Ferry, you know, the introduction was made with Ben. So behind the scenes for them, it very much felt like they understood the bigger picture of, okay, this is another way to, you know, to build on our partnership, which, obviously it felt like, in terms of their approach, it was they were thinking more long term in how they could support us and and I think they've done that. So they, as I said, they have added a lot of value for us. We wouldn't have been able to do the survey without their expertise.\n\nInterviewer 9:09: -- 3 of 5 -- Amazing is there? I mean, there's anything they could have improved on,\n\nSpeaker 1 9:16: only one minor thing. And so one of the project managers we had assigned was unbelievably technically, with a huge amount of expertise. Her style in engaging with us as a team was one that would focus on the risks and the negatives of you know, if you don't do this, if you don't do this, then you're not going to meet the deadline. And her delivery to some of the people in our team struck a lot of fear, whereas experience with another project manager when she was off leave was very much one of supporting, you know, okay, reassuring, you know, you've done most of the things you need to focus on this. So it was just really the style of one particular stakeholder or one particular project manager. As I said, her contribution to the project was was perfect. She knows her stuff. She's an expert. It was just in a particular meeting with my manager, it kind of struck fear about, you know, how this was all going to go wrong, rather than focusing on how we were going to succeed and how it was going to go right. And I understand that's probably part of her personality and her delivery, but it's feedback that I heard from a few people, and one of our sister companies is now working with Korn Ferry as well for a similar and they had similar feedback about this particular person.\n\nInterviewer 10:36: So that's really helpful. Thank you. Great. And then I suppose, kind of going broader beyond Korn Ferry and thinking about them as an organization, consultancy, taking that aside, what, what are your kind of critical challenges right now that you have around people? And I suppose kind of, you know, retention skills, what's, what's the thing that's top of mind for you?\n\nSpeaker 1 11:10: So, I mean, not necessarily on, on retention, more on, you know, Ferry, as a company, we're acquiring a lot of other companies, so people, culture is becoming more important. So we've gone from a traditional, you know, Italian, European company, where we're very lucky that we have very low turnover. People want to stay with us and work with us a long time. That's been one of the strengths of the company, but now we're acquiring lots of other companies with a different history and a different background. So the challenge for us now is how we we articulate our culture and the company that we're creating, because we've doubled the number of employees with in the last 10 years. You know, 50% of our employees didn't start their journey in Ferrero. They were acquired by ferry. So the the understanding or or the experience about people considering we can't necessarily rely on people's love for the company and their loyalty, because the general population of employees is a big mix of people that have come from lots of different backgrounds. So, you know, Kellogg's we've acquired in the US, again, is a is a company with really strong values and a really strong history, but they're different from Ferrero, and it's a it's a huge organization, so these are some of the questions that we're asking ourselves about, you know, what we want people to understand about our culture, considering the different legacies of where they've come From?\n\nInterviewer 12:37: -- 4 of 5 -- Yeah, okay, great. I think that's it. I mean, yeah, it's great to hear that you've had a positive experience, and anything else that you think at this stage would be useful to share.\n\nSpeaker 1 12:51: I don't think so. I don't think so. Just to reiterate the fact that every person who has dealt with Korn Ferry, or the team that we've worked with in Korn, ferry has been massively impressed by their expertise and their knowledge and the support they've given us. It makes me look really good, to be honest. For you know what we did with our engagement survey, which we delivered at the start of this year, but as I said at the start, we couldn't have done it without them. Their expertise and their support was invaluable throughout the whole process, great.\n\nInterviewer 13:26: And then I suppose just one last question on Korn Ferry as a you mentioned, you know, one of the reasons that you maybe selected them is because they have that global reach as a brand. How familiar are you with Korn Ferry in terms of what they do kind of end to end.\n\nSpeaker 1 13:42: I mean my visibility. I mean in previous companies, we'd worked with Korn, ferry or hay, as they were, in terms of engagement surveys. So always have them in the background. In my mind, probably the grading is probably the other part. In terms of my wider knowledge of the rest of their consultancy is not, not something I proactively looked into, for example. So if you're leading to you know, would I, would we consider them for other consultancy that maybe isn't part of the pay grading or the employee engagement measurement, considering their scope of experience, in my mind, for me, personally, no, because I don't know enough about the organization, it was really based on this specific need, based on to my, my job role, rather than the the wider scope of, yeah, of services that they offer. That's\n\nInterviewer 14:33: great no as asking, just trying to get an understanding of kind of brand, understanding of Korn Ferry as a org consultancy versus, as you said, the kind of the different be used that they have. So that's helpful. Okay, great. Well, that's it. I'll give you 40 minutes back. Appreciate you jumping on the call and giving more detail to your feedback.\n\nSpeaker 2 14:56: My pleasure. Yes, you too. Bye bye bye. Life, I. Transcribed by https://otter.ai -- 5 of 5 --"
}