{
  "id": "t-028",
  "sourceFile": "T23_NPS7_NA_PS_HOUSE_OCT25.pdf",
  "client": "Leslie Fall",
  "interviewDate": "2025-10-29",
  "project": "Professional Search",
  "score": 7,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Interviewer 1:42",
      "text": "so, just by way of quick introduction. So I'm the managing partner at a growth consultancy. We've been working with Korn Ferry for about five or six years, so we know their business really well, and they've asked us to conduct these interviews to encourage complete transparency so feedback as much as possible, so we can help them help you in the future. Are you all right if I record it, so my team could help me write up the notes. Not a problem. Okay, great. And so, yeah, I mean, if we could start with just if you could introduce yourself and your role and your current relationship or experience with Korn?"
    },
    {
      "speaker": "Speaker 1 2:26",
      "text": "Ferry, sure. So, Dr, Leslie fall, so, I'm a physician by training, but I'm a CEO and founder of an online learning company for medical student and Health Professions Education, primarily in the US, but we are, you know, a multinational company, and we're not for profit, actually software company. So it's an interesting combination of the two of them. And engage Korn Ferry this time around to help me find a chief success chief success officer, so somebody who I needed to help oversee our revenue, our marketing and our customer success. And so that's why we called it chief success officer, because it was really six, you know, revenue, success, marketing success and customer success. We're a 35 person company, fully remote company at this point, but in business, I founded the company 25 years ago, so we've been in business for a long time. Serve pretty much almost all of the US medical schools and many of the nurse practitioner health profession schools in the country. And as I said, you know, anglophile, can't you know Canadian schools. We do have some medical schools around the world as well. So really looking for somebody to lead, sort of that, that piece of the business, for me, a team that I've actually, I actually have been running then for probably about over a year, not wanting to be doing that, but, you know, like it as the, you know, as the founder and as the CEO, you end up, I know it well, yeah. So anyhow, we so in the past, when I was on faculty at Dartmouth Medical School here in Dartmouth Hitchcock Medical Center, I led a number of searches in the health professions, you know, higher education, academic world and Dartmouth uses Korn Ferry. So that's how I got to know you guys initially. Plus, obviously, you're just very well known. They're very well known, you know, in the academic world here. And so had worked a number of times with Korn Ferry in that regard. Then, how many years ago, three years ago now, I made a decision to hire a chief learning officer, and really wanted somebody who was like me, who was essentially an academic clinician, but really was ready to leave the academic world and head into the into more the entrepreneurial world there too. So in that instance, reached out to Korn Ferry, I'd use some other search firms for some other executive level searches for our organization, and we have a staff recruiter for our staff position. So this is really me looking, you know, at an executive level. And you know, we are a, you know, $8 million business, and so it's not like we have a ton of money, you know, to spend there. But really, when I needed these high level people, I needed them to be the right person, and I just don't have time, energy and money to spend getting it wrong. So hired Korn Ferry to find my chief learning officer. And, you know, while there was a hiccup here and there, you had a really good search, landed the person I have today, who's great. She was a perfect hire for the position, you know, and I really couldn't have had sort of, I think, the panel of, you know, of candidates, you know, come to me that, you know, I wouldn't have been able to really achieve that on my own. And really knew the Rolodex and processes that Korn Ferry use, that's exactly what I needed when I was in academics. Needed here, you know, for what I was doing. And it's weird. I mean, we are a bit of, like, a little bit of a weird company. We're a little unicorn in terms of, we're academics, but we're at entrepreneurial but we're at nonprofit, but we're a software platform. So it, like I said, it kind of ties together a whole bunch of interesting, you know, components, so that, you know, work well. And then about 18 months ago, I just kind of took my entire sales and marketing team down to the down to the ground, and really was rebuilding it back up again and needed someone to sort of oversee that I because it wasn't really, didn't really exist. This search wasn't consistent with what I'd done previously, and I really hadn't worked with Korn Ferry outside of that academic health professions realm, went with a couple of other search firms, you know, less expensive, more directed -- 1 of 6 -- to, you know, entrepreneurial businesses. And really had two failed experiences there. So that was why I was running this team for well over a year, because I had two, you know, not great experiences. One ended, okay, the other one was actually a complete fail. So I said, That's it. I'm done. I'm just, I'm going for the big guns, like, I don't have time any more time to waste. I just need the best person. I need this solved. And as one of my colleagues likes to say, if you have money to solve a problem, you don't have a problem. So I'm like, I'm just going to write a check. I'm going to people I know, and they're going to find my person so that really, you know, I think, is kind of the main background that led to this engagement."
    },
    {
      "speaker": "Interviewer 7:29",
      "text": "And why did you use them over the other search like some of the other search firms that you used previously?"
    },
    {
      "speaker": "Speaker 1 7:39",
      "text": "Well, I, like I said, the other previous search firms I had tried to engage for this position, yeah, it was a thing, okay?"
    },
    {
      "speaker": "Interviewer 7:47",
      "text": "And, I mean, you gave them a seven. So talk to me about the experience. What was what was good, what was not so good,"
    },
    {
      "speaker": "Speaker 1 7:56",
      "text": "yeah, I think that, you know, initially, I just was like, does Korn Ferry even do this? Like, are they? Would they be somebody that I could hire for this search? And so I re, I actually went to the database on the website, went to the database, and just started playing my way through, like, who are the principles, and plugging in the filters and plugging in the search features. And I came up with, with Matthew there initially. And so I just, like, cold called him. I just, like, reached out of our email said, here's who I am, here's what I'm looking for. And so we got on the phone, and, you know, you guys in the past, and blah, blah, blah, and he really had the background of exactly what I was looking for. It kind of only came down to one person when I did my search. And so we got on the phone, we talked, and he's like, you know, I this search. Essentially, he's up very nicely. Like, this search is a little under me, but I'm really intrigued by what you do. This is really cool. I want to help you. Let me talk to my team. And so he did, and then he brought the two principles that we work with, as well as the, you know, as far as person doing the sourcing and like, that worked, you know, really well. I was excited about that and really pleased that that that that happened. I like the people that we met everything then, you know, they were kind of, like, intrigued by the chief success officer. And so I said, you know, here's what I've done. Like, I'm I've done a fair amount of work on chat, GPT and Claude. And like, I, like, I put a whole bunch of stuff together, including, like, my letter to you guys about this. So I put a fair amount of energy into this, and this is kind of what I've come up with. But you guys are the experts, like, you know, the market, you know, the people. This is not really a position description. This is me just trying to explain what I'm looking for. So one of the initial things was, I said, Could you turn this into, like a like, a position description? Did you take this actually use your expertise now, because this isn't my area of expertise. Like, what should I be looking for in customer success? What should I be looking for marketing? What should I be looking for sales? So I gave that to them on the good side, like they jumped, dove right in, like, I was on vacation. They're like, let's get this done before you go on vacation, so we can start sourcing people that were great. I was like, awesome. So, like, I raced together, got the information, we had a couple of really quick meetings, and they really dove right into sourcing people. And when I came back from vacation, like, they had a list, you know? And I know how their processes work, and so it's like, they have their PowerPoint and other people and everything else. I was like, This is great. So we're going to get, you know, right off the bat, and get going. So I love that. And they really kind of jumped in and got going. I will say, though, as a little disappointed what they put together as the package as compared to what I had seen in the past. It's like, though I get to use AI. You're the experts. I could tell they had leveraged AI a lot too. It's like, No, I already did that part. I need you to actually be the human who knows what they're doing. Sure we all use AI at this point too. But like, I don't need you to repurpose it. I mean, they didn't say they did, but I could tell there was, like, just like, a lot of stuff in there. I'm like, I don't need you to focus down. Now, for what I need, like, bring your like that. I'm paying you a lot of money, bring your expertise to this. So it was fine. And, I mean, at the end of the day, I ended up redoing it. But So anyhow, we dove in. We got the search going. You know, we had some really great, you know, that initial set of like working, like, yep, yep. This is the, this is how this works. I'm, you know, I'm used to how these guys operate. -- 2 of 6 -- I'm back in my comfort zone with them. This is great. They had a great list of people, and we really worked our way through those. You know, pretty well. We had sort of, though we got down to there were two candidates who were actually out on the open market, and they were looking for jobs, as compared to everybody else, they were essentially, you know, passive searching. And so I said, yeah, good candidates. And so I said, Okay, we're going to jump on these, because, in case, one of these is, you know, is really the person great, right? Like, they're looking for a job, I'm looking for a person, you know, you guys are going to get off easy on the search. You know, let's get going. So we did that, and I ended up sort of negating two people who were passive searching. One of the people I brought for an interview who was active searching was not a good fit, but the other guy, I think, was, it was a pretty good fit. My team really liked him. I was a little less old, but I'm like, my team really likes him. We brought him out here, went through this entire process and literally made him an offer. He signed the offer, and we were starting his onboarding and getting ready to send him in his computer. And I got like a like a voicemail message from, you know, one of my search consultants, essentially saying, you know, he's taken another job. And I was like, We what, you know, I'm on I'm on vacation at this point, you know? And I, like, literally, just started my vacation thinking I had this guy. I had this nailed, I had this everything. And I'm, like, texting him now, going because I'm had bad cell service. I'm like, wait, tell me there's a joke. He's like, unfortunately, it's not a joke. I'm like, he signed a contract. Now I don't put that on, you know, Korn Ferry, per se, because I'm like, did you know he was like, I'm like, how, how. How could you not know? Is like, we're completely surprised too. I'm like, how, how could you be this surprise? Either down or this guy is just awful. I mean, you'll think, God, we, you know, we dodged that bullet, everything else. But still, I was, and then, like, yeah, sucks. Sometimes, like, no, like, you don't realize this was Yeah. So, you know, I could tell until they were kind of, you know, letting me vent a bit and understandable. But it wasn't like, oh my god, like we're so sorry, like we're so sorry, even though I knew it had nothing to do with, like, you can't you some things you just can't have no control over. I don't know. It's like, they're like, where is, where is feeling as bad as you are. I'm like, this isn't about you, it's about me, you know, and that theme kind of started to continue. So from there, then we had a couple of other real challenges. So we started getting down to the harder and harder, you know. Now, at this point, now we're weeding out candidates, and it's, you know, it's kind of Now, once I had said no to a bunch of people, because we had this dude, now we're going back into the pipeline. And the pipeline was kind of thin, and so I said to them, I said, like guys, I kind of like anybody in here. Now, I will say our source person, the person Stephanie was doing all the sourcing. Loved her. I would have, like, hired her out from underneath them. She was great. And you could tell she was kind of managing the boys a bit. You know, she was doing customer recovery, and I appreciated that. Like, every time she kind of, like, leaned in, like, said the right things, I was, like, rewarding her with, like, thank you. That's kind of just what I needed to hear right now, you"
    },
    {
      "speaker": "Interviewer 14:53",
      "text": "hear me, yeah"
    },
    {
      "speaker": "Speaker 1 14:54",
      "text": "and so. But I'll say then a couple of other things, like, really happened that I think, like I was, I was surprised, I have to say, like, the first one, okay, whatever. Then started becoming, like a real surprise. So we had another call. And, I mean, I'm talking, I'm bringing three of my executives to these calls myself. I've got a sales consultant, senior sales consultant, that I'm working with, frankly, who knows, one of the principals in Korn Ferry and and one of the other senior people my team, like, we're coming to interview one of these candidates, and so the three of us come on to the call and like, nobody shows up, and we're like, we what, like, what? Then now we're starting to like panic, because it's like, we like, did the person get the wrong zoom, but it's their zoom, Korn Ferry zoom, not ours. So like, we're guests in the zoom. And so like, how do we get a hold of this person? Did they get the wrong phone number so that it's like, we're trying to, like, get a hold of the Korn Ferry people and and everything else. And it's like, Well, it turns out the guy pulled out from the interview, like, 15 minutes before the Zoom call, and no one told us. So if three executives sitting on this call, we're panicking for this other guy. We're thinking he's trying to sign in. He can't get a hold of anybody. What's going on we can experience Yeah, right. So finally, this whole thing happens, and it turns out that like this, like, yes, the scheduler didn't tell us, but also one of the principals who it was his, you know, his client. It was like, Oh, well. Then I went into another meeting and I didn't see it for like an hour. Like, okay, but think about the situation I'm in. Like, not only was it, my three executives sitting there with no knowledge of what's going on, we're scrambling because we feel bad for the candidate who pulled out 15 minutes before this interview, and all you are off having your good day, and we're freaking out. So then we get back on the call again, and I was like, Guys, come on. And it was just always like, you -- 3 of 6 -- know, Oh, we're so sorry that happened. But I was in the meeting, and, well, I go into a meeting after that, I'm like, once again, I get it. I get it like I kept saying them. I understand. I run a business. I understand what the backstage looks like, but I'm your client. I don't need to hear any of that. None of that should be coming out of your mouth right now. None of it. What you should be saying is, oh, my God. We're so embarrassed. We're so sorry. This will never happen again. We've already fixed the problem, you know, like, what else can we do to make this better for you? Those were the words that should have come out of the map, and it says, like, well, but you have to understand, like, I was in a meeting when I'm with you, I'm just with you. I'm not with somebody else. And I'm like, I don't care, yeah. So then we get going. We're down to like our key candidates, and we're down to like interviewing two of like our finalist candidates. And my staff pulls up the zoom and goes, Why is one of the other candidates invited to this call with this candidate. My most important candidate, got invited to a zoom interview with the other leading candidate and my staff figured this out. I have to say, like, at that point now, I will give them, you know, the they our search consultant credit for you could tell like he was, like, horrified. They pulled the scheduler out, they brought the boss in, you know, everything else. But I was like, What? Are you guys doing? What is going here and so, and I would be like, have you talk with her and made sure she has no other offers out there? But they kind of began to make me feel like I was the one, kind of being like,"
    },
    {
      "speaker": "Interviewer 18:58",
      "text": "yep, right."
    },
    {
      "speaker": "Speaker 1 18:59",
      "text": "And it kind of kept being this when I would, like, be angry. And again, I run a company too, like, let's see what, let's see what you got in you when I'm angry as your client. And there was a lot of defensiveness and explanations and everything else, and not this client recovery. Of, like, I don't like, I said to you, like, I grew up in the shadow of the Nordstrom family. I mean, I tell people that like I grew up as Nordstrom grew up, I understand the customer is right, the customer is first. And I get, as a business owner, what that feels like the business owners when you have to be doing that with your clients. And I already told them I had two bad search experiences and I came to you, and I'm paying you a big ass check for me, because I know you guys are the top of the game, and you'll do it right, and I don't have to deal with this anymore, and now I'm like, what just happened? So that, for me is the seven. It's just like, I don't know what's going on, but it just feels like it's kind of gotten like, rookie league a bit, yeah, not that I used to work with. Do you think"
    },
    {
      "speaker": "Interviewer 20:06",
      "text": "it was a bad experience because of the individuals involved? Do you think is bigger than that? I mean, it's a hard question, right? Because you not sure. But"
    },
    {
      "speaker": "Speaker 1 20:17",
      "text": "it wasn't a specific this is the thing. It was like, kind of like the it was getting called the boys. It like I, neither one of them, I felt. And then Matt, the guy who I kind of pulled in initially, was not on all the calls, nor did I kind of get him diving. I had to email him to say, Matt, something really bad just happened he was on the next call, but I don't know, it just kind of kept feeling like I was doing all the things like a client shouldn't have to be doing at a company that level of professionalism. So I do then begin to worry about culture. Did I get the like rookie team here. I mean, I like Chaz. I liked him a lot. I almost feel like I want to say to him, I want to find you a better mentor, but Stephanie knew what to say. I think the other guy, I'm forgetting his name. I think I pissed him off enough he didn't come to I think I made him so angry he didn't come to the calls at the end, I really do, or they pull them right, you know, but it's almost like no one's taught them. And this is, this is the answer to your question. It feels to me like you have good people, like I don't think that they are bad at their job. I feel like they haven't been trained in customer recovery. It's not about them, it's about me, and my experience of Korn Ferry. And even if they're seen, they're just going, oh my god, well, she shut up already. That's not, you know? It's like their job is about me. I don't need to hear anything about what's going on the back end. And it was interesting, like, Stephanie got that, like, she brought the professionalism to the table, she brought the client recovery to the table. And it wasn't like she started to do that, and they're like, oh god, yeah. Like, yeah, oopsie on our part. Like, you know, let's switch out of the try and explain to you why it's happening. It's like they wanted me on their side that so is that. But also, I have to say, Interviewer this like scheduling thing like that. Now it's the systems and processes, right? It's the scheduler, it's the zooms, it's the until now I'm adding these things together, and I'm saying it's not just one person, it's not just one team. It's also this whole other aspect. And this team isn't double -- 4 of 6 -- checking. They're like, this is my client. These are the calls they're having. Let me make sure everything's right for them. Make sure they have a great experience. So it's kind of that client experience piece. And then I just begin. Then it makes you start to question everything else. Are they going to get the contract right? Are they That's right? Did they actually ask the clients these questions? If this questions? If this guy went took a job without them even knowing that he was interviewing? Like, were they not asking the right questions? And so everything came into play. Then, for me, is like, it just kept going. More and more questions emerge about, what do I not know that's not being done right?"
    },
    {
      "speaker": "Interviewer 23:18",
      "text": "The trust and confidence has gone and, and, and that makes you, yeah, that makes it a very uncomfortable place as a client, because you're having to then check everything which is not what you're"
    },
    {
      "speaker": "Speaker 1 23:30",
      "text": "paying for, well and right, not what I'm paying for. And, like, once we sign this person, they go away. I now have this as my employee. Now, what am I going to discover about this person after I sign them, you know, it's like this complete. I need complete trust that, because this is what you know, especially when you're running the search, not me. You're doing the you're, you know, you they are doing the background checks, not me. They're the one doing the references, not me. It's like, and if they're giving me kind of things that look like their AI does like, is this just, is this? Am I losing the level of like quality that I pay for in this company?"
    },
    {
      "speaker": "Interviewer 24:12",
      "text": "Yeah, yeah. Well, I mean, I can only apologize on their behalf of the experience that you had, you know. And I think I will, if you're right with it, I will candidly feed it back to them, because this is exactly the type of thing we don't want to hear, but the type of thing that they need to hear to improve on consistently."
    },
    {
      "speaker": "Speaker 1 24:32",
      "text": "So time, like I said, I run a company, I get it. If this is happening with my company, I want someone to come and tell me. And I'm, you know, I'm impressed, you know, that they have somebody who's not them, like, I gave the survey, and you guys got a hold of me, right? And, you know, and like, we set up a call. And so to me, that's like, okay, like, at least the, you know, the interest is there, the openness to hearing it, you know. And I will respect and respond to that, you know, in that regard. But I do think, like I said, I recognize, if these things were happening in my company and no one was telling me about them, I'd be upset about them. So I try and offer that same benefit to others. Because running a company is really hard."
    },
    {
      "speaker": "Interviewer 25:16",
      "text": "I know I run one, it's a juggle, yeah, all right. So I mean, you know, I think, I think there's, there's so much to dig into with them of what they can do better and start to put some proper, proper processes in place with that team. And what I will do is, I, so, you know our process, we write this up a full report, and then I will have a call with that team and their managers around it to to actually discuss what they can do and put in place. So so I'm clear, do you think the relationship is broken so much that you don't want him to interact with them again or or is it worth them trying to build bridges and make amends? Unknown Speaker 26:05 Tell me who the them is,"
    },
    {
      "speaker": "Interviewer 26:09",
      "text": "well to be discussed, right? So you know, there's that team, and I think there's obviously the senior people on that team should be the lead and the client need for you, but you talked about the boys and not necessarily having that connection with them, so them or somebody else, somebody else that can speak on their behalf, because as an external person, I don't feel like I'm the person to be. Then come and say, This is what we're going to do to rectify it. I'm the intermediary. But I also appreciate that sometimes you might just say, I've given you my feedback and I'm done so,"
    },
    {
      "speaker": "Speaker 1 26:46",
      "text": "-- 5 of 6 -- I mean, I wouldn't have a problem speaking with somebody like at a high level, because I do think some of what I saw was was not just these people, right? It's like it really is. I think these are good people who work hard, who are well intended, who were trying to do the right thing for us. It's not like I had a bad apple, you know, in there. I don't think so. This is my point. It feels to me again, running a company, it feels to me like it's a, it's an it's a higher order problem that I'm seeing. And it wasn't just one person. It is like, it feels like it's a systems thing. So I'm more comfortable, and I, you know, I don't want, like, the feedback necessarily, to go directly to those people like you did a bad job, because I do think they were trying to do, in some respects, a good job in the context of a system that failed them, like the Korn Ferry system failed my my guys too. You know that scheduling thing, everything else, but kind of like what their managers are doing to help them run the system. It was all systems that were problems, just systems that it feels like that's the place where people need to start looking at their systems. I think there's some degradation of the quality of the system and the training and the expectation, and these are our core values. Is how we expect you to live them, and because it was both of them kind of too. And so that tells me it's not just one person. So for me, I would be more comfortable talking to somebody at a high level about like the training and the expectation and the scheduling and things like that, to know like this trickled down to a customer, like we always talk about in medicine about systems errors getting all the way down to the patient. You know, it wasn't the actual doctor in the room with the patient, or even maybe the team caring for that patient. If these systems issues are trickling down, and then you have sort of what we call Swiss cheese event, like all things came together to this bad thing. It's actually not that team's fault. At the end of the day, it's a much higher problem that I'd be more happy to, you know, to connect with somebody about that. But like I said, I want to get my team in trouble. It was more I wanted to give Korn Ferry feedback about their"
    },
    {
      "speaker": "Interviewer 28:53",
      "text": "systems and and that's absolutely what we'll do. So so you know that this feeds up into the senior team at Korn Ferry, and we then collectively look at it to say, well, what can we do better at both the systems, process level and behaviors? So you know, and as you know, running this business, it's hard to get those consistent across the board, but there are definitely, there are definitely the consistent behaviors that we that we can do that that will hopefully kind of mitigate this in the future. So leave it with me. I will, I will talk to the team. I will talk to the initial team too, and it's not to get them into trouble, just so you're clear, they're really open to having these conversations. To to understand, kind of, from your point of view, exactly how you felt. It's not about pointing fingers. It's about making things better. And so that's, that's what we will try and do. That"
    },
    {
      "speaker": "Speaker 1 29:55",
      "text": "sounds good. And like I said, a male end, but I mean, they're hard working. I mean, I think, you know, and like, they really, like, you know, it's clear that they enjoy their jobs and are taking it seriously and they're hard working. And to me, that's, you know, those are the most important core values there. And so in that regard, like I said, you know, it it wasn't like I had a bad apple, or it wasn't like I had, like, an overarching, you know, bad experience with a person or something like that, you know, or they said anything you know, that was inappropriate? No, yes, it's"
    },
    {
      "speaker": "Interviewer 30:27",
      "text": "a series of a series of events that, as you said, kind of add up to the systems failure. So I hear you. Thank you. Thanks for taking the time and for being so kind of candid and honest. It's really helpful, so we will, we will get on it. We will try and fix it. And yeah, we will be in touch."
    },
    {
      "speaker": "Speaker 1 30:49",
      "text": "Great. Thank you so much. Interviewer. I really appreciate it."
    },
    {
      "speaker": "Interviewer 30:53",
      "text": "Yeah, thanks. Leslie, bye, bye. Transcribed by https://otter.ai -- 6 of 6 --"
    }
  ],
  "rawText": "Interviewer 1:42: so, just by way of quick introduction. So I'm the managing partner at a growth consultancy. We've been working with Korn Ferry for about five or six years, so we know their business really well, and they've asked us to conduct these interviews to encourage complete transparency so feedback as much as possible, so we can help them help you in the future. Are you all right if I record it, so my team could help me write up the notes. Not a problem. Okay, great. And so, yeah, I mean, if we could start with just if you could introduce yourself and your role and your current relationship or experience with Korn?\n\nSpeaker 1 2:26: Ferry, sure. So, Dr, Leslie fall, so, I'm a physician by training, but I'm a CEO and founder of an online learning company for medical student and Health Professions Education, primarily in the US, but we are, you know, a multinational company, and we're not for profit, actually software company. So it's an interesting combination of the two of them. And engage Korn Ferry this time around to help me find a chief success chief success officer, so somebody who I needed to help oversee our revenue, our marketing and our customer success. And so that's why we called it chief success officer, because it was really six, you know, revenue, success, marketing success and customer success. We're a 35 person company, fully remote company at this point, but in business, I founded the company 25 years ago, so we've been in business for a long time. Serve pretty much almost all of the US medical schools and many of the nurse practitioner health profession schools in the country. And as I said, you know, anglophile, can't you know Canadian schools. We do have some medical schools around the world as well. So really looking for somebody to lead, sort of that, that piece of the business, for me, a team that I've actually, I actually have been running then for probably about over a year, not wanting to be doing that, but, you know, like it as the, you know, as the founder and as the CEO, you end up, I know it well, yeah. So anyhow, we so in the past, when I was on faculty at Dartmouth Medical School here in Dartmouth Hitchcock Medical Center, I led a number of searches in the health professions, you know, higher education, academic world and Dartmouth uses Korn Ferry. So that's how I got to know you guys initially. Plus, obviously, you're just very well known. They're very well known, you know, in the academic world here. And so had worked a number of times with Korn Ferry in that regard. Then, how many years ago, three years ago now, I made a decision to hire a chief learning officer, and really wanted somebody who was like me, who was essentially an academic clinician, but really was ready to leave the academic world and head into the into more the entrepreneurial world there too. So in that instance, reached out to Korn Ferry, I'd use some other search firms for some other executive level searches for our organization, and we have a staff recruiter for our staff position. So this is really me looking, you know, at an executive level. And you know, we are a, you know, $8 million business, and so it's not like we have a ton of money, you know, to spend there. But really, when I needed these high level people, I needed them to be the right person, and I just don't have time, energy and money to spend getting it wrong. So hired Korn Ferry to find my chief learning officer. And, you know, while there was a hiccup here and there, you had a really good search, landed the person I have today, who's great. She was a perfect hire for the position, you know, and I really couldn't have had sort of, I think, the panel of, you know, of candidates, you know, come to me that, you know, I wouldn't have been able to really achieve that on my own. And really knew the Rolodex and processes that Korn Ferry use, that's exactly what I needed when I was in academics. Needed here, you know, for what I was doing. And it's weird. I mean, we are a bit of, like, a little bit of a weird company. We're a little unicorn in terms of, we're academics, but we're at entrepreneurial but we're at nonprofit, but we're a software platform. So it, like I said, it kind of ties together a whole bunch of interesting, you know, components, so that, you know, work well. And then about 18 months ago, I just kind of took my entire sales and marketing team down to the down to the ground, and really was rebuilding it back up again and needed someone to sort of oversee that I because it wasn't really, didn't really exist. This search wasn't consistent with what I'd done previously, and I really hadn't worked with Korn Ferry outside of that academic health professions realm, went with a couple of other search firms, you know, less expensive, more directed -- 1 of 6 -- to, you know, entrepreneurial businesses. And really had two failed experiences there. So that was why I was running this team for well over a year, because I had two, you know, not great experiences. One ended, okay, the other one was actually a complete fail. So I said, That's it. I'm done. I'm just, I'm going for the big guns, like, I don't have time any more time to waste. I just need the best person. I need this solved. And as one of my colleagues likes to say, if you have money to solve a problem, you don't have a problem. So I'm like, I'm just going to write a check. I'm going to people I know, and they're going to find my person so that really, you know, I think, is kind of the main background that led to this engagement.\n\nInterviewer 7:29: And why did you use them over the other search like some of the other search firms that you used previously?\n\nSpeaker 1 7:39: Well, I, like I said, the other previous search firms I had tried to engage for this position, yeah, it was a thing, okay?\n\nInterviewer 7:47: And, I mean, you gave them a seven. So talk to me about the experience. What was what was good, what was not so good,\n\nSpeaker 1 7:56: yeah, I think that, you know, initially, I just was like, does Korn Ferry even do this? Like, are they? Would they be somebody that I could hire for this search? And so I re, I actually went to the database on the website, went to the database, and just started playing my way through, like, who are the principles, and plugging in the filters and plugging in the search features. And I came up with, with Matthew there initially. And so I just, like, cold called him. I just, like, reached out of our email said, here's who I am, here's what I'm looking for. And so we got on the phone, and, you know, you guys in the past, and blah, blah, blah, and he really had the background of exactly what I was looking for. It kind of only came down to one person when I did my search. And so we got on the phone, we talked, and he's like, you know, I this search. Essentially, he's up very nicely. Like, this search is a little under me, but I'm really intrigued by what you do. This is really cool. I want to help you. Let me talk to my team. And so he did, and then he brought the two principles that we work with, as well as the, you know, as far as person doing the sourcing and like, that worked, you know, really well. I was excited about that and really pleased that that that that happened. I like the people that we met everything then, you know, they were kind of, like, intrigued by the chief success officer. And so I said, you know, here's what I've done. Like, I'm I've done a fair amount of work on chat, GPT and Claude. And like, I, like, I put a whole bunch of stuff together, including, like, my letter to you guys about this. So I put a fair amount of energy into this, and this is kind of what I've come up with. But you guys are the experts, like, you know, the market, you know, the people. This is not really a position description. This is me just trying to explain what I'm looking for. So one of the initial things was, I said, Could you turn this into, like a like, a position description? Did you take this actually use your expertise now, because this isn't my area of expertise. Like, what should I be looking for in customer success? What should I be looking for marketing? What should I be looking for sales? So I gave that to them on the good side, like they jumped, dove right in, like, I was on vacation. They're like, let's get this done before you go on vacation, so we can start sourcing people that were great. I was like, awesome. So, like, I raced together, got the information, we had a couple of really quick meetings, and they really dove right into sourcing people. And when I came back from vacation, like, they had a list, you know? And I know how their processes work, and so it's like, they have their PowerPoint and other people and everything else. I was like, This is great. So we're going to get, you know, right off the bat, and get going. So I love that. And they really kind of jumped in and got going. I will say, though, as a little disappointed what they put together as the package as compared to what I had seen in the past. It's like, though I get to use AI. You're the experts. I could tell they had leveraged AI a lot too. It's like, No, I already did that part. I need you to actually be the human who knows what they're doing. Sure we all use AI at this point too. But like, I don't need you to repurpose it. I mean, they didn't say they did, but I could tell there was, like, just like, a lot of stuff in there. I'm like, I don't need you to focus down. Now, for what I need, like, bring your like that. I'm paying you a lot of money, bring your expertise to this. So it was fine. And, I mean, at the end of the day, I ended up redoing it. But So anyhow, we dove in. We got the search going. You know, we had some really great, you know, that initial set of like working, like, yep, yep. This is the, this is how this works. I'm, you know, I'm used to how these guys operate. -- 2 of 6 -- I'm back in my comfort zone with them. This is great. They had a great list of people, and we really worked our way through those. You know, pretty well. We had sort of, though we got down to there were two candidates who were actually out on the open market, and they were looking for jobs, as compared to everybody else, they were essentially, you know, passive searching. And so I said, yeah, good candidates. And so I said, Okay, we're going to jump on these, because, in case, one of these is, you know, is really the person great, right? Like, they're looking for a job, I'm looking for a person, you know, you guys are going to get off easy on the search. You know, let's get going. So we did that, and I ended up sort of negating two people who were passive searching. One of the people I brought for an interview who was active searching was not a good fit, but the other guy, I think, was, it was a pretty good fit. My team really liked him. I was a little less old, but I'm like, my team really likes him. We brought him out here, went through this entire process and literally made him an offer. He signed the offer, and we were starting his onboarding and getting ready to send him in his computer. And I got like a like a voicemail message from, you know, one of my search consultants, essentially saying, you know, he's taken another job. And I was like, We what, you know, I'm on I'm on vacation at this point, you know? And I, like, literally, just started my vacation thinking I had this guy. I had this nailed, I had this everything. And I'm, like, texting him now, going because I'm had bad cell service. I'm like, wait, tell me there's a joke. He's like, unfortunately, it's not a joke. I'm like, he signed a contract. Now I don't put that on, you know, Korn Ferry, per se, because I'm like, did you know he was like, I'm like, how, how. How could you not know? Is like, we're completely surprised too. I'm like, how, how could you be this surprise? Either down or this guy is just awful. I mean, you'll think, God, we, you know, we dodged that bullet, everything else. But still, I was, and then, like, yeah, sucks. Sometimes, like, no, like, you don't realize this was Yeah. So, you know, I could tell until they were kind of, you know, letting me vent a bit and understandable. But it wasn't like, oh my god, like we're so sorry, like we're so sorry, even though I knew it had nothing to do with, like, you can't you some things you just can't have no control over. I don't know. It's like, they're like, where is, where is feeling as bad as you are. I'm like, this isn't about you, it's about me, you know, and that theme kind of started to continue. So from there, then we had a couple of other real challenges. So we started getting down to the harder and harder, you know. Now, at this point, now we're weeding out candidates, and it's, you know, it's kind of Now, once I had said no to a bunch of people, because we had this dude, now we're going back into the pipeline. And the pipeline was kind of thin, and so I said to them, I said, like guys, I kind of like anybody in here. Now, I will say our source person, the person Stephanie was doing all the sourcing. Loved her. I would have, like, hired her out from underneath them. She was great. And you could tell she was kind of managing the boys a bit. You know, she was doing customer recovery, and I appreciated that. Like, every time she kind of, like, leaned in, like, said the right things, I was, like, rewarding her with, like, thank you. That's kind of just what I needed to hear right now, you\n\nInterviewer 14:53: hear me, yeah\n\nSpeaker 1 14:54: and so. But I'll say then a couple of other things, like, really happened that I think, like I was, I was surprised, I have to say, like, the first one, okay, whatever. Then started becoming, like a real surprise. So we had another call. And, I mean, I'm talking, I'm bringing three of my executives to these calls myself. I've got a sales consultant, senior sales consultant, that I'm working with, frankly, who knows, one of the principals in Korn Ferry and and one of the other senior people my team, like, we're coming to interview one of these candidates, and so the three of us come on to the call and like, nobody shows up, and we're like, we what, like, what? Then now we're starting to like panic, because it's like, we like, did the person get the wrong zoom, but it's their zoom, Korn Ferry zoom, not ours. So like, we're guests in the zoom. And so like, how do we get a hold of this person? Did they get the wrong phone number so that it's like, we're trying to, like, get a hold of the Korn Ferry people and and everything else. And it's like, Well, it turns out the guy pulled out from the interview, like, 15 minutes before the Zoom call, and no one told us. So if three executives sitting on this call, we're panicking for this other guy. We're thinking he's trying to sign in. He can't get a hold of anybody. What's going on we can experience Yeah, right. So finally, this whole thing happens, and it turns out that like this, like, yes, the scheduler didn't tell us, but also one of the principals who it was his, you know, his client. It was like, Oh, well. Then I went into another meeting and I didn't see it for like an hour. Like, okay, but think about the situation I'm in. Like, not only was it, my three executives sitting there with no knowledge of what's going on, we're scrambling because we feel bad for the candidate who pulled out 15 minutes before this interview, and all you are off having your good day, and we're freaking out. So then we get back on the call again, and I was like, Guys, come on. And it was just always like, you -- 3 of 6 -- know, Oh, we're so sorry that happened. But I was in the meeting, and, well, I go into a meeting after that, I'm like, once again, I get it. I get it like I kept saying them. I understand. I run a business. I understand what the backstage looks like, but I'm your client. I don't need to hear any of that. None of that should be coming out of your mouth right now. None of it. What you should be saying is, oh, my God. We're so embarrassed. We're so sorry. This will never happen again. We've already fixed the problem, you know, like, what else can we do to make this better for you? Those were the words that should have come out of the map, and it says, like, well, but you have to understand, like, I was in a meeting when I'm with you, I'm just with you. I'm not with somebody else. And I'm like, I don't care, yeah. So then we get going. We're down to like our key candidates, and we're down to like interviewing two of like our finalist candidates. And my staff pulls up the zoom and goes, Why is one of the other candidates invited to this call with this candidate. My most important candidate, got invited to a zoom interview with the other leading candidate and my staff figured this out. I have to say, like, at that point now, I will give them, you know, the they our search consultant credit for you could tell like he was, like, horrified. They pulled the scheduler out, they brought the boss in, you know, everything else. But I was like, What? Are you guys doing? What is going here and so, and I would be like, have you talk with her and made sure she has no other offers out there? But they kind of began to make me feel like I was the one, kind of being like,\n\nInterviewer 18:58: yep, right.\n\nSpeaker 1 18:59: And it kind of kept being this when I would, like, be angry. And again, I run a company too, like, let's see what, let's see what you got in you when I'm angry as your client. And there was a lot of defensiveness and explanations and everything else, and not this client recovery. Of, like, I don't like, I said to you, like, I grew up in the shadow of the Nordstrom family. I mean, I tell people that like I grew up as Nordstrom grew up, I understand the customer is right, the customer is first. And I get, as a business owner, what that feels like the business owners when you have to be doing that with your clients. And I already told them I had two bad search experiences and I came to you, and I'm paying you a big ass check for me, because I know you guys are the top of the game, and you'll do it right, and I don't have to deal with this anymore, and now I'm like, what just happened? So that, for me is the seven. It's just like, I don't know what's going on, but it just feels like it's kind of gotten like, rookie league a bit, yeah, not that I used to work with. Do you think\n\nInterviewer 20:06: it was a bad experience because of the individuals involved? Do you think is bigger than that? I mean, it's a hard question, right? Because you not sure. But\n\nSpeaker 1 20:17: it wasn't a specific this is the thing. It was like, kind of like the it was getting called the boys. It like I, neither one of them, I felt. And then Matt, the guy who I kind of pulled in initially, was not on all the calls, nor did I kind of get him diving. I had to email him to say, Matt, something really bad just happened he was on the next call, but I don't know, it just kind of kept feeling like I was doing all the things like a client shouldn't have to be doing at a company that level of professionalism. So I do then begin to worry about culture. Did I get the like rookie team here. I mean, I like Chaz. I liked him a lot. I almost feel like I want to say to him, I want to find you a better mentor, but Stephanie knew what to say. I think the other guy, I'm forgetting his name. I think I pissed him off enough he didn't come to I think I made him so angry he didn't come to the calls at the end, I really do, or they pull them right, you know, but it's almost like no one's taught them. And this is, this is the answer to your question. It feels to me like you have good people, like I don't think that they are bad at their job. I feel like they haven't been trained in customer recovery. It's not about them, it's about me, and my experience of Korn Ferry. And even if they're seen, they're just going, oh my god, well, she shut up already. That's not, you know? It's like their job is about me. I don't need to hear anything about what's going on the back end. And it was interesting, like, Stephanie got that, like, she brought the professionalism to the table, she brought the client recovery to the table. And it wasn't like she started to do that, and they're like, oh god, yeah. Like, yeah, oopsie on our part. Like, you know, let's switch out of the try and explain to you why it's happening. It's like they wanted me on their side that so is that. But also, I have to say, Interviewer this like scheduling thing like that. Now it's the systems and processes, right? It's the scheduler, it's the zooms, it's the until now I'm adding these things together, and I'm saying it's not just one person, it's not just one team. It's also this whole other aspect. And this team isn't double -- 4 of 6 -- checking. They're like, this is my client. These are the calls they're having. Let me make sure everything's right for them. Make sure they have a great experience. So it's kind of that client experience piece. And then I just begin. Then it makes you start to question everything else. Are they going to get the contract right? Are they That's right? Did they actually ask the clients these questions? If this questions? If this guy went took a job without them even knowing that he was interviewing? Like, were they not asking the right questions? And so everything came into play. Then, for me, is like, it just kept going. More and more questions emerge about, what do I not know that's not being done right?\n\nInterviewer 23:18: The trust and confidence has gone and, and, and that makes you, yeah, that makes it a very uncomfortable place as a client, because you're having to then check everything which is not what you're\n\nSpeaker 1 23:30: paying for, well and right, not what I'm paying for. And, like, once we sign this person, they go away. I now have this as my employee. Now, what am I going to discover about this person after I sign them, you know, it's like this complete. I need complete trust that, because this is what you know, especially when you're running the search, not me. You're doing the you're, you know, you they are doing the background checks, not me. They're the one doing the references, not me. It's like, and if they're giving me kind of things that look like their AI does like, is this just, is this? Am I losing the level of like quality that I pay for in this company?\n\nInterviewer 24:12: Yeah, yeah. Well, I mean, I can only apologize on their behalf of the experience that you had, you know. And I think I will, if you're right with it, I will candidly feed it back to them, because this is exactly the type of thing we don't want to hear, but the type of thing that they need to hear to improve on consistently.\n\nSpeaker 1 24:32: So time, like I said, I run a company, I get it. If this is happening with my company, I want someone to come and tell me. And I'm, you know, I'm impressed, you know, that they have somebody who's not them, like, I gave the survey, and you guys got a hold of me, right? And, you know, and like, we set up a call. And so to me, that's like, okay, like, at least the, you know, the interest is there, the openness to hearing it, you know. And I will respect and respond to that, you know, in that regard. But I do think, like I said, I recognize, if these things were happening in my company and no one was telling me about them, I'd be upset about them. So I try and offer that same benefit to others. Because running a company is really hard.\n\nInterviewer 25:16: I know I run one, it's a juggle, yeah, all right. So I mean, you know, I think, I think there's, there's so much to dig into with them of what they can do better and start to put some proper, proper processes in place with that team. And what I will do is, I, so, you know our process, we write this up a full report, and then I will have a call with that team and their managers around it to to actually discuss what they can do and put in place. So so I'm clear, do you think the relationship is broken so much that you don't want him to interact with them again or or is it worth them trying to build bridges and make amends? Unknown Speaker 26:05 Tell me who the them is,\n\nInterviewer 26:09: well to be discussed, right? So you know, there's that team, and I think there's obviously the senior people on that team should be the lead and the client need for you, but you talked about the boys and not necessarily having that connection with them, so them or somebody else, somebody else that can speak on their behalf, because as an external person, I don't feel like I'm the person to be. Then come and say, This is what we're going to do to rectify it. I'm the intermediary. But I also appreciate that sometimes you might just say, I've given you my feedback and I'm done so,\n\nSpeaker 1 26:46: -- 5 of 6 -- I mean, I wouldn't have a problem speaking with somebody like at a high level, because I do think some of what I saw was was not just these people, right? It's like it really is. I think these are good people who work hard, who are well intended, who were trying to do the right thing for us. It's not like I had a bad apple, you know, in there. I don't think so. This is my point. It feels to me again, running a company, it feels to me like it's a, it's an it's a higher order problem that I'm seeing. And it wasn't just one person. It is like, it feels like it's a systems thing. So I'm more comfortable, and I, you know, I don't want, like, the feedback necessarily, to go directly to those people like you did a bad job, because I do think they were trying to do, in some respects, a good job in the context of a system that failed them, like the Korn Ferry system failed my my guys too. You know that scheduling thing, everything else, but kind of like what their managers are doing to help them run the system. It was all systems that were problems, just systems that it feels like that's the place where people need to start looking at their systems. I think there's some degradation of the quality of the system and the training and the expectation, and these are our core values. Is how we expect you to live them, and because it was both of them kind of too. And so that tells me it's not just one person. So for me, I would be more comfortable talking to somebody at a high level about like the training and the expectation and the scheduling and things like that, to know like this trickled down to a customer, like we always talk about in medicine about systems errors getting all the way down to the patient. You know, it wasn't the actual doctor in the room with the patient, or even maybe the team caring for that patient. If these systems issues are trickling down, and then you have sort of what we call Swiss cheese event, like all things came together to this bad thing. It's actually not that team's fault. At the end of the day, it's a much higher problem that I'd be more happy to, you know, to connect with somebody about that. But like I said, I want to get my team in trouble. It was more I wanted to give Korn Ferry feedback about their\n\nInterviewer 28:53: systems and and that's absolutely what we'll do. So so you know that this feeds up into the senior team at Korn Ferry, and we then collectively look at it to say, well, what can we do better at both the systems, process level and behaviors? So you know, and as you know, running this business, it's hard to get those consistent across the board, but there are definitely, there are definitely the consistent behaviors that we that we can do that that will hopefully kind of mitigate this in the future. So leave it with me. I will, I will talk to the team. I will talk to the initial team too, and it's not to get them into trouble, just so you're clear, they're really open to having these conversations. To to understand, kind of, from your point of view, exactly how you felt. It's not about pointing fingers. It's about making things better. And so that's, that's what we will try and do. That\n\nSpeaker 1 29:55: sounds good. And like I said, a male end, but I mean, they're hard working. I mean, I think, you know, and like, they really, like, you know, it's clear that they enjoy their jobs and are taking it seriously and they're hard working. And to me, that's, you know, those are the most important core values there. And so in that regard, like I said, you know, it it wasn't like I had a bad apple, or it wasn't like I had, like, an overarching, you know, bad experience with a person or something like that, you know, or they said anything you know, that was inappropriate? No, yes, it's\n\nInterviewer 30:27: a series of a series of events that, as you said, kind of add up to the systems failure. So I hear you. Thank you. Thanks for taking the time and for being so kind of candid and honest. It's really helpful, so we will, we will get on it. We will try and fix it. And yeah, we will be in touch.\n\nSpeaker 1 30:49: Great. Thank you so much. Interviewer. I really appreciate it.\n\nInterviewer 30:53: Yeah, thanks. Leslie, bye, bye. Transcribed by https://otter.ai -- 6 of 6 --"
}