{
  "id": "t-021",
  "sourceFile": "T16_NPS9_EMEA_ES_MARQUEE_OCT25.pdf",
  "client": "Fiona Motley",
  "interviewDate": "2025-10-15",
  "project": "Executive Search",
  "score": 9,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Interviewer 0:09",
      "text": "Great, brilliant. Well, if we can just kick off with if you could just explain to me your role and the relationship or engagement you've had with Korn Ferry to date?"
    },
    {
      "speaker": "Speaker 1 0:22",
      "text": "Yes, so my role so I am a member of the executive search team here at NatWest group, and I've been here for 17 months and joined after a very long career in executive search myself, including having at one point or one stage, worked at Korn Ferry. Okay, so, so Korn Ferry was and is a supplier, or is an existing supplier of NatWest group, and they've had a relationship with NatWest for a number of years, and this particular project is one of the number that I've managed or partnered with Korn Ferry on since joining 17 months ago. Great."
    },
    {
      "speaker": "Interviewer 1:12",
      "text": "And can I ask, do you use a selection of different recruitment consultancies?"
    },
    {
      "speaker": "Speaker 1 1:20",
      "text": "We do, we have, we have a PSL, and there are 26 different exact search suppliers on that PSL, I would say, though, that typically for search, we probably use regularly seven weight of those. A number of them are very specialist, sort of niche or market orientated firms, yeah."
    },
    {
      "speaker": "Interviewer 1:55",
      "text": "Oh, I think I lost you for a second. Fiona, can you hear me? Yes, I can. So what, what would be the circumstance in which you would select Korn Ferry, and is it a selection process or, so is it an RFP, or do you say actually they're the right fit specific search? So it's, it's the real mix. So sometimes within the Accept search team, we have the the"
    },
    {
      "speaker": "Speaker 1 2:22",
      "text": "bandwidth to actually just recommend that it's Korn Ferry and there will be no pitch or or beauty parade. It's purely Okay. We will give this to Korn Ferry sometimes, actually it might be the hiring manager that says, oh, you know, I've used x at Korn Ferry previously, they did a really good job. They know the market, so can we engage with them again? I would say that probably this year, more than any other year, there are possibly more pitch situations that Korn Ferry would be in, and I think that's really that we've been under pressure as a team to actually make sure that we assess and make the right judgment call in terms of supplier. And to be perfectly honest, Interviewer, there was, there was maybe a slight concern that we were overly reliant upon Korn Ferry, okay?"
    },
    {
      "speaker": "Interviewer 3:19",
      "text": "And is that? I mean, I suppose, if we then look at the relationship that you have and the service that they give, can you how has the experience been? Obviously, you know, looking at it from a point of view, if you've been there and done that job, but in terms of the people that you worked with, can you expand on the experience?"
    },
    {
      "speaker": "Speaker 1 3:39",
      "text": "I can indeed, and you know, to be perfectly honest, I've got nothing but pray for all of the individuals and teams. Because it hasn't just been one or two individuals, it has been a number of people, number of partners and consultants from Korn Ferry that I've partnered with, and it really has felt a true partnership. It's it's always very apparent how important a client we are to Korn Ferry. They've always proven to be a incredibly thorough really knowing the market. You know, communication is always absolutely stand out. They're always available, and they're agile enough to sort of pivot to whatever we need. You know, sometimes to very short deadlines."
    },
    {
      "speaker": "Interviewer 4:36",
      "text": "-- 1 of 5 -- Do you find that there is a consistency of approach? You say you've had obviously different people working on different searches. Do they show up as a, you know, as you would expect, as one? Yes."
    },
    {
      "speaker": "Speaker 1 4:48",
      "text": "The only, the only, the only exception is that we, we've recently been doing some work within the HR function, and both Hillary and Samira are obviously financial services partners consultants, and they were, we've had a lot of exposure and experience with working and partnering with them, but because it was an HR, or there were a number of HR role, the head of the HR practice was involved in the project, and I would say that, you know, that there was nothing negative about her engagement and interaction, but, but we just felt that Hilary and Samira got what we were looking for, more than the Head of the HR practice, okay? And actually they ended up, they ended up being more involved and taking the lead, which I know is not really the model at Korn Ferry. It would be, you know, if you have a functional partner, they would typically lead on that. And, you know, Sally did, but I think we gained, we felt that we gained a better service when Samira and Hilary were involved."
    },
    {
      "speaker": "Interviewer 6:12",
      "text": "And do you think that that's because that they've worked with you and your business, so they really know the ins and outs of you know, the culture of your business, the type of people that"
    },
    {
      "speaker": "Speaker 1 6:20",
      "text": "you're looking for? Yes, I do. I mean, you know, it was almost, you know, they have a shorthand in terms of totally to your point, totally understanding our culture, that, you know, they know the key stakeholders. And so, yes, it and so I think it's probably somewhat unfair in terms of what I'm saying, but I'm just giving you, you know, candidly, feedback in terms of how it felt for us. Yeah, and I think you know what, what would be great going forward is, yes, of course, to have the involvement of the head of the functional area, but actually still maintaining the involvement of the, I guess, the key relationships and consultants,"
    },
    {
      "speaker": "Interviewer 7:06",
      "text": "yeah, yeah, that makes sense. And in terms of stakeholder management, how? I mean, how does it work? Do you have a regular check in in terms of a live project? Do you feel like they are responsive to your needs? Do they did they ask you how you preferred to be communicated with? How does it? How did it play out?"
    },
    {
      "speaker": "Speaker 1 7:27",
      "text": "Yes, so again, not just myself, but others in the team, have regular catch ups with Hillary and the team at Korn Ferry, and these are well, with the head of exec search. They're weekly with me. They're every two weeks, but also in between times, we are in regular communication with Hillary and the team on the project. So we never feel blindsided. We always feel that, you know, even if they're having discussions and meetings with key stakeholders that we're not privy to, that they will always update us and keep us in the loop."
    },
    {
      "speaker": "Interviewer 8:10",
      "text": "Okay, great. And in terms of the quality and quantity of candidates, did they meet your expectations?"
    },
    {
      "speaker": "Speaker 1 8:19",
      "text": "Yes, again, all of the projects that I've partnered with them on to date, they have absolutely presented impressive long lists and then short lists. And also, typically, they've been good in terms of diversity on those long lists and shortlists, which is, you know, an important factor for us here."
    },
    {
      "speaker": "Interviewer 8:44",
      "text": "Yeah, and in terms of, I suppose, managing the end to end process, how involved did they get from the beginning of, I suppose, building out the job description, identifying the skills that were needed and the type of person through to, you know, kind of compensation and negotiation at the end."
    },
    {
      "speaker": "Speaker 1 9:03",
      "text": "Yeah, I would say that they, yeah, they, they partner very well with us on that, you know, and I don't, I wouldn't necessarily say that all search firms are as adept and thorough in doing, doing all of those aspects that you've talked about there, but it has felt a true partnership. I mean, we generally have quite a sorry, we generally will have quite a detailed job spec and requirements to share with them, -- 2 of 5 -- but they certainly always helped refine that and play back to us to ensure that, you know, they have totally understood what our requirements are. And then also, when it comes to Office day, well, then going to market, they've always advised in terms of comp levels and what we should expect to pay given the talent we're needing. And then when it comes to the office stage, again, I would say it's a true partnership in that we very much share with them the art of the possible, and they then work very, very hard in terms of getting all of the detail compromise that we need from the successful plan to date to ensure that we get to an offer, successful offer. I think that because they've worked with us a lot, they also understand our sometimes quite long winded approvals process and what that entails. And they also, again, because they've worked with us a lot, understand all of the different elements of the Comp of the candidate that we need to understand."
    },
    {
      "speaker": "Interviewer 10:43",
      "text": "Did you especially interesting to kind of dig into this, because you've obviously been on their side. So how much did they utilize and would you and do you expect them to use things like their assessment tools and their pay benchmarks through a typical search."
    },
    {
      "speaker": "Speaker 1 11:06",
      "text": "Yes, so less so on the pay side, but certainly on the assessment side. I mean all of our successful and sometimes the final two candidates are assessed by Korn Ferry. So yes, that's always utilized, and utilized very well. And I think, you know, as an organization, we get a great richness of data from that, and that sometimes used, not necessarily to determine whether or not the person will be offered the role, but quite often it's actually we're going to offer this is more as a development tool for when they land."
    },
    {
      "speaker": "Interviewer 11:46",
      "text": "And is that something that everyone or the other competitors offer as well as it, and is it part of the overall proposal, or is it an"
    },
    {
      "speaker": "Speaker 1 11:56",
      "text": "add on? It's typically an add on, but I would say that over the last 345, years, more and more exec search firms have been offering their own assessment services as well. But you know, to date, we have stayed contractually with Korn Ferry,"
    },
    {
      "speaker": "Interviewer 12:19",
      "text": "great and just going back to that first point of what you know when to call them, and obviously people have their individual preferences. Is there any, is there any other kind of, I suppose, trigger point that where you would say that they were more distinctive to than the competitors,"
    },
    {
      "speaker": "Speaker 1 12:42",
      "text": "I think typically that, you know, certainly, if it's it comes to an exact search team decision and choice, there are very few instances where we wouldn't include them because they know us so well, and so that always gives them an advantage, you know, there is no other supplier to date that has the track record with us that they have, right? And the only reason that they wouldn't be necessarily included any any pitch situation would be if it was a very niche role, or sometimes where we felt that, okay, we've given Korn Ferry a lot of roles recently. You know, we can't given, you know, clearly, from a risk perspective, we can't give Korn Ferry everything. So we would look to partner with someone else."
    },
    {
      "speaker": "Interviewer 13:35",
      "text": "Okay, how important is it? I mean, you've obviously talked about individuals, and then knowing your business and culture, but also, you know, is it their Is it their network? What's What do you think it holds more value? Is it the individual in the network, or is it the pull of the Korn Ferry brand that gets the people through the door?"
    },
    {
      "speaker": "Speaker 1 13:58",
      "text": "It's the individuals in the network. Absolutely, it's not the Korn Ferry brand, quite frankly, through I mean, clearly that helps them get on the PSL. But you know, if, if the team, particularly Hillary, Samira, Meda, if they went to another search firm, there would be a strong pull for us to want to continue to partner with them."
    },
    {
      "speaker": "Interviewer 14:24",
      "text": "-- 3 of 5 -- Okay, that's really helpful. And I mean, you know, what could they do better if one or two things that that you would love to see from them,"
    },
    {
      "speaker": "Speaker 1 14:39",
      "text": "I think it's hard to pinpoint anything. I think the you know, I've only had one occasion where I talked about, you know, not being blindsided. I've just had one occasion where, where I was blindsided. But Hillary picked up the phone straight away and was so hugely apologetic that I almost don't feel I need to call it out, because it was a truly, was a one off. And as I said earlier, you know, they truly do keep the loop. They check things with us before they move forward. It's almost the model of what that partnership between the internal exec search team and a search firm should be, you know, if they have meetings, you know, with stakeholders outside of any specific project mandate, again, they will always let us know. So it's a constant flow of communication. And always, always dialog going on."
    },
    {
      "speaker": "Interviewer 15:43",
      "text": "And what about, I suppose, value add stuff. So, you know, thinking about your biggest challenges, whether it's kind of shortage of specialist skills or the rise of AI, how much do they kind of get involved as an advisor in the in those spaces?"
    },
    {
      "speaker": "Speaker 1 16:00",
      "text": "They they do. I mean, I think because we are in such regular communication with them, you know, they will sometimes, yeah, we might be as a team asked to find insights on something specific, or, yeah, either comp levels or other things. And they, they will always, always go out and come back with information for us. You know, for example, earlier this year, I was asked to get them fee information for non UK subsidiary board and MDE called a whole array of information together for me, which was incredibly helpful. She did that as well. There was something else I needed some information on in terms of, I think it was salary levels, but for very small tech businesses and the different stages of scale up and again, she, you know, went above and beyond and came back to me with information. Samira, more recently, needed some information on specific HR, I guess, bench, benchmark in terms of skills and experience. And again, she came back to us with that really quickly."
    },
    {
      "speaker": "Interviewer 17:30",
      "text": "That's great in terms of using Korn Ferry beyond search. Do you know if that happens within the wider business?"
    },
    {
      "speaker": "Speaker 1 17:39",
      "text": "Well, it does, as I talked about, you know, we are fully signed up for the assessment side of things, and so, yeah, and you know, we've got 50,000 people here at NatWest, clearly, obviously, not all of them would be going through the Korn Ferry assessment. But you know, it is contractually, a significant amount of work that is given to NatWest outside of YT set search, great."
    },
    {
      "speaker": "Interviewer 18:06",
      "text": "I think that's it. I mean, that's been really helpful. Is there anything else that you think would be useful to share at this stage? No."
    },
    {
      "speaker": "Speaker 1 18:14",
      "text": "I mean, I think the, you know, the other individuals to call out would be Toby, Toby danos, who I've partnered with on a couple of projects. And again, you know, very, very consistent in terms of, in terms of, you know, all those positive things, yes, so, yeah, very, very, very impressive."
    },
    {
      "speaker": "Interviewer 18:39",
      "text": "Great, brilliant. Well, it's interesting to get your perspective, especially having having been there on that side, to give you a fairly unique one that was really"
    },
    {
      "speaker": "Speaker 1 18:48",
      "text": "well it does, and it probably means that I'm potentially going to be more critical search firm before, but, but no, I think you know that there are, clearly, you know, the market saturated with individual out there. And definitely, I've been, yeah, incredibly, incredibly impressed. There's one other person I should call out as well, actually, and I'm sorry forgotten his name, which is"
    },
    {
      "speaker": "Speaker 1 19:23",
      "text": "-- 4 of 5 -- MDE, Anthony Byrne yt, yes, did a finance role with him, a very high profile finance role with them, quite tricky, two quite tricky stakeholders. And again, he was brilliant to partner with amazing that's really helpful. Thank you. It won't"
    },
    {
      "speaker": "Interviewer 19:47",
      "text": "show up in the report. Brilliant. Thanks. Fiona, it's lovely to meet you."
    },
    {
      "speaker": "Speaker 1 19:54",
      "text": "No pleasure. Nice. Likewise. Nice to meet you as well. Interviewer, okay, thanks. Have a good day. Bye. Bye. Transcribed by https://otter.ai -- 5 of 5 --"
    }
  ],
  "rawText": "Interviewer 0:09: Great, brilliant. Well, if we can just kick off with if you could just explain to me your role and the relationship or engagement you've had with Korn Ferry to date?\n\nSpeaker 1 0:22: Yes, so my role so I am a member of the executive search team here at NatWest group, and I've been here for 17 months and joined after a very long career in executive search myself, including having at one point or one stage, worked at Korn Ferry. Okay, so, so Korn Ferry was and is a supplier, or is an existing supplier of NatWest group, and they've had a relationship with NatWest for a number of years, and this particular project is one of the number that I've managed or partnered with Korn Ferry on since joining 17 months ago. Great.\n\nInterviewer 1:12: And can I ask, do you use a selection of different recruitment consultancies?\n\nSpeaker 1 1:20: We do, we have, we have a PSL, and there are 26 different exact search suppliers on that PSL, I would say, though, that typically for search, we probably use regularly seven weight of those. A number of them are very specialist, sort of niche or market orientated firms, yeah.\n\nInterviewer 1:55: Oh, I think I lost you for a second. Fiona, can you hear me? Yes, I can. So what, what would be the circumstance in which you would select Korn Ferry, and is it a selection process or, so is it an RFP, or do you say actually they're the right fit specific search? So it's, it's the real mix. So sometimes within the Accept search team, we have the the\n\nSpeaker 1 2:22: bandwidth to actually just recommend that it's Korn Ferry and there will be no pitch or or beauty parade. It's purely Okay. We will give this to Korn Ferry sometimes, actually it might be the hiring manager that says, oh, you know, I've used x at Korn Ferry previously, they did a really good job. They know the market, so can we engage with them again? I would say that probably this year, more than any other year, there are possibly more pitch situations that Korn Ferry would be in, and I think that's really that we've been under pressure as a team to actually make sure that we assess and make the right judgment call in terms of supplier. And to be perfectly honest, Interviewer, there was, there was maybe a slight concern that we were overly reliant upon Korn Ferry, okay?\n\nInterviewer 3:19: And is that? I mean, I suppose, if we then look at the relationship that you have and the service that they give, can you how has the experience been? Obviously, you know, looking at it from a point of view, if you've been there and done that job, but in terms of the people that you worked with, can you expand on the experience?\n\nSpeaker 1 3:39: I can indeed, and you know, to be perfectly honest, I've got nothing but pray for all of the individuals and teams. Because it hasn't just been one or two individuals, it has been a number of people, number of partners and consultants from Korn Ferry that I've partnered with, and it really has felt a true partnership. It's it's always very apparent how important a client we are to Korn Ferry. They've always proven to be a incredibly thorough really knowing the market. You know, communication is always absolutely stand out. They're always available, and they're agile enough to sort of pivot to whatever we need. You know, sometimes to very short deadlines.\n\nInterviewer 4:36: -- 1 of 5 -- Do you find that there is a consistency of approach? You say you've had obviously different people working on different searches. Do they show up as a, you know, as you would expect, as one? Yes.\n\nSpeaker 1 4:48: The only, the only, the only exception is that we, we've recently been doing some work within the HR function, and both Hillary and Samira are obviously financial services partners consultants, and they were, we've had a lot of exposure and experience with working and partnering with them, but because it was an HR, or there were a number of HR role, the head of the HR practice was involved in the project, and I would say that, you know, that there was nothing negative about her engagement and interaction, but, but we just felt that Hilary and Samira got what we were looking for, more than the Head of the HR practice, okay? And actually they ended up, they ended up being more involved and taking the lead, which I know is not really the model at Korn Ferry. It would be, you know, if you have a functional partner, they would typically lead on that. And, you know, Sally did, but I think we gained, we felt that we gained a better service when Samira and Hilary were involved.\n\nInterviewer 6:12: And do you think that that's because that they've worked with you and your business, so they really know the ins and outs of you know, the culture of your business, the type of people that\n\nSpeaker 1 6:20: you're looking for? Yes, I do. I mean, you know, it was almost, you know, they have a shorthand in terms of totally to your point, totally understanding our culture, that, you know, they know the key stakeholders. And so, yes, it and so I think it's probably somewhat unfair in terms of what I'm saying, but I'm just giving you, you know, candidly, feedback in terms of how it felt for us. Yeah, and I think you know what, what would be great going forward is, yes, of course, to have the involvement of the head of the functional area, but actually still maintaining the involvement of the, I guess, the key relationships and consultants,\n\nInterviewer 7:06: yeah, yeah, that makes sense. And in terms of stakeholder management, how? I mean, how does it work? Do you have a regular check in in terms of a live project? Do you feel like they are responsive to your needs? Do they did they ask you how you preferred to be communicated with? How does it? How did it play out?\n\nSpeaker 1 7:27: Yes, so again, not just myself, but others in the team, have regular catch ups with Hillary and the team at Korn Ferry, and these are well, with the head of exec search. They're weekly with me. They're every two weeks, but also in between times, we are in regular communication with Hillary and the team on the project. So we never feel blindsided. We always feel that, you know, even if they're having discussions and meetings with key stakeholders that we're not privy to, that they will always update us and keep us in the loop.\n\nInterviewer 8:10: Okay, great. And in terms of the quality and quantity of candidates, did they meet your expectations?\n\nSpeaker 1 8:19: Yes, again, all of the projects that I've partnered with them on to date, they have absolutely presented impressive long lists and then short lists. And also, typically, they've been good in terms of diversity on those long lists and shortlists, which is, you know, an important factor for us here.\n\nInterviewer 8:44: Yeah, and in terms of, I suppose, managing the end to end process, how involved did they get from the beginning of, I suppose, building out the job description, identifying the skills that were needed and the type of person through to, you know, kind of compensation and negotiation at the end.\n\nSpeaker 1 9:03: Yeah, I would say that they, yeah, they, they partner very well with us on that, you know, and I don't, I wouldn't necessarily say that all search firms are as adept and thorough in doing, doing all of those aspects that you've talked about there, but it has felt a true partnership. I mean, we generally have quite a sorry, we generally will have quite a detailed job spec and requirements to share with them, -- 2 of 5 -- but they certainly always helped refine that and play back to us to ensure that, you know, they have totally understood what our requirements are. And then also, when it comes to Office day, well, then going to market, they've always advised in terms of comp levels and what we should expect to pay given the talent we're needing. And then when it comes to the office stage, again, I would say it's a true partnership in that we very much share with them the art of the possible, and they then work very, very hard in terms of getting all of the detail compromise that we need from the successful plan to date to ensure that we get to an offer, successful offer. I think that because they've worked with us a lot, they also understand our sometimes quite long winded approvals process and what that entails. And they also, again, because they've worked with us a lot, understand all of the different elements of the Comp of the candidate that we need to understand.\n\nInterviewer 10:43: Did you especially interesting to kind of dig into this, because you've obviously been on their side. So how much did they utilize and would you and do you expect them to use things like their assessment tools and their pay benchmarks through a typical search.\n\nSpeaker 1 11:06: Yes, so less so on the pay side, but certainly on the assessment side. I mean all of our successful and sometimes the final two candidates are assessed by Korn Ferry. So yes, that's always utilized, and utilized very well. And I think, you know, as an organization, we get a great richness of data from that, and that sometimes used, not necessarily to determine whether or not the person will be offered the role, but quite often it's actually we're going to offer this is more as a development tool for when they land.\n\nInterviewer 11:46: And is that something that everyone or the other competitors offer as well as it, and is it part of the overall proposal, or is it an\n\nSpeaker 1 11:56: add on? It's typically an add on, but I would say that over the last 345, years, more and more exec search firms have been offering their own assessment services as well. But you know, to date, we have stayed contractually with Korn Ferry,\n\nInterviewer 12:19: great and just going back to that first point of what you know when to call them, and obviously people have their individual preferences. Is there any, is there any other kind of, I suppose, trigger point that where you would say that they were more distinctive to than the competitors,\n\nSpeaker 1 12:42: I think typically that, you know, certainly, if it's it comes to an exact search team decision and choice, there are very few instances where we wouldn't include them because they know us so well, and so that always gives them an advantage, you know, there is no other supplier to date that has the track record with us that they have, right? And the only reason that they wouldn't be necessarily included any any pitch situation would be if it was a very niche role, or sometimes where we felt that, okay, we've given Korn Ferry a lot of roles recently. You know, we can't given, you know, clearly, from a risk perspective, we can't give Korn Ferry everything. So we would look to partner with someone else.\n\nInterviewer 13:35: Okay, how important is it? I mean, you've obviously talked about individuals, and then knowing your business and culture, but also, you know, is it their Is it their network? What's What do you think it holds more value? Is it the individual in the network, or is it the pull of the Korn Ferry brand that gets the people through the door?\n\nSpeaker 1 13:58: It's the individuals in the network. Absolutely, it's not the Korn Ferry brand, quite frankly, through I mean, clearly that helps them get on the PSL. But you know, if, if the team, particularly Hillary, Samira, Meda, if they went to another search firm, there would be a strong pull for us to want to continue to partner with them.\n\nInterviewer 14:24: -- 3 of 5 -- Okay, that's really helpful. And I mean, you know, what could they do better if one or two things that that you would love to see from them,\n\nSpeaker 1 14:39: I think it's hard to pinpoint anything. I think the you know, I've only had one occasion where I talked about, you know, not being blindsided. I've just had one occasion where, where I was blindsided. But Hillary picked up the phone straight away and was so hugely apologetic that I almost don't feel I need to call it out, because it was a truly, was a one off. And as I said earlier, you know, they truly do keep the loop. They check things with us before they move forward. It's almost the model of what that partnership between the internal exec search team and a search firm should be, you know, if they have meetings, you know, with stakeholders outside of any specific project mandate, again, they will always let us know. So it's a constant flow of communication. And always, always dialog going on.\n\nInterviewer 15:43: And what about, I suppose, value add stuff. So, you know, thinking about your biggest challenges, whether it's kind of shortage of specialist skills or the rise of AI, how much do they kind of get involved as an advisor in the in those spaces?\n\nSpeaker 1 16:00: They they do. I mean, I think because we are in such regular communication with them, you know, they will sometimes, yeah, we might be as a team asked to find insights on something specific, or, yeah, either comp levels or other things. And they, they will always, always go out and come back with information for us. You know, for example, earlier this year, I was asked to get them fee information for non UK subsidiary board and MDE called a whole array of information together for me, which was incredibly helpful. She did that as well. There was something else I needed some information on in terms of, I think it was salary levels, but for very small tech businesses and the different stages of scale up and again, she, you know, went above and beyond and came back to me with information. Samira, more recently, needed some information on specific HR, I guess, bench, benchmark in terms of skills and experience. And again, she came back to us with that really quickly.\n\nInterviewer 17:30: That's great in terms of using Korn Ferry beyond search. Do you know if that happens within the wider business?\n\nSpeaker 1 17:39: Well, it does, as I talked about, you know, we are fully signed up for the assessment side of things, and so, yeah, and you know, we've got 50,000 people here at NatWest, clearly, obviously, not all of them would be going through the Korn Ferry assessment. But you know, it is contractually, a significant amount of work that is given to NatWest outside of YT set search, great.\n\nInterviewer 18:06: I think that's it. I mean, that's been really helpful. Is there anything else that you think would be useful to share at this stage? No.\n\nSpeaker 1 18:14: I mean, I think the, you know, the other individuals to call out would be Toby, Toby danos, who I've partnered with on a couple of projects. And again, you know, very, very consistent in terms of, in terms of, you know, all those positive things, yes, so, yeah, very, very, very impressive.\n\nInterviewer 18:39: Great, brilliant. Well, it's interesting to get your perspective, especially having having been there on that side, to give you a fairly unique one that was really\n\nSpeaker 1 18:48: well it does, and it probably means that I'm potentially going to be more critical search firm before, but, but no, I think you know that there are, clearly, you know, the market saturated with individual out there. And definitely, I've been, yeah, incredibly, incredibly impressed. There's one other person I should call out as well, actually, and I'm sorry forgotten his name, which is\n\nSpeaker 1 19:23: -- 4 of 5 -- MDE, Anthony Byrne yt, yes, did a finance role with him, a very high profile finance role with them, quite tricky, two quite tricky stakeholders. And again, he was brilliant to partner with amazing that's really helpful. Thank you. It won't\n\nInterviewer 19:47: show up in the report. Brilliant. Thanks. Fiona, it's lovely to meet you.\n\nSpeaker 1 19:54: No pleasure. Nice. Likewise. Nice to meet you as well. Interviewer, okay, thanks. Have a good day. Bye. Bye. Transcribed by https://otter.ai -- 5 of 5 --"
}