{
  "id": "t-020",
  "sourceFile": "T15_NPS10_EMEA_ES_HOUSE_OCT25.pdf",
  "client": "Kristin Skogen Lund",
  "interviewDate": "2025-10-15",
  "project": "Executive Search",
  "score": 10,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Interviewer 0:00",
      "text": "To run these interviews, so with the hope that actually, you guys can speak more clearly and freely, and ultimately, we can, you know, get to the bottom of is there any potential issues, and they can improve their service to you guys. So I won't, hopefully I won't need the whole of the time, but we'll just kick off with, if you could just explain your role in business and your engagement with Korn Ferry."
    },
    {
      "speaker": "Speaker 1 0:32",
      "text": "Yeah, I'm chair of the Supervisory Board of delivery hero, and they have helped us recruit new board members."
    },
    {
      "speaker": "Interviewer 0:40",
      "text": "And is this a one off, or are they, as you said, members? So they've done several"
    },
    {
      "speaker": "Speaker 1 0:45",
      "text": "places. It's the first time that they're working for us now, but it's a search that involves two different roles, at least potentially,"
    },
    {
      "speaker": "Interviewer 0:54",
      "text": "okay, and if it's the first time, why did you select them? Was there an RFP? What was the selection process?"
    },
    {
      "speaker": "Speaker 1 1:04",
      "text": "Well, we have worked with others before, and I wasn't entirely happy the last time with a competitor. And then I, I know Korn Ferry from before, and in particular, I know matter, because I have worked with her before. They were also part of the previous competition, but then the administration in the company was quite keen on trying the competitor that I wasn't too happy with, and this time I got my way, so we did Korn Ferry this"
    },
    {
      "speaker": "Interviewer 1:36",
      "text": "time around. And how's the experience been compared to the competitor."
    },
    {
      "speaker": "Speaker 1 1:41",
      "text": "Yeah, I've been very happy, as I wrote, I've been very happy with it. The it's Swift, no bullshit. Just sort of come up with a very good list of candidates and and I was actually surprised by the long list. It was very, good with, you know, basically six, seven candidates that we all could have hired in the end, and in the end that our top choice agreed to join, and has now joined, and seems to be very good hire. So that worked really well. And now we're in the process of a of a second role, which hasn't come that far, but I had a meeting with them as late as yesterday, and it looks very promising the long list as well. But we it's a bit early days, great."
    },
    {
      "speaker": "Interviewer 2:26",
      "text": "And thinking about, I suppose, the end to end process did, how much did they get involved in helping define the the role and the type of person that you need?"
    },
    {
      "speaker": "Speaker 1 2:36",
      "text": "Maybe not so much, but that was because it was a replacement, and he was a chair of Oid, and, you know, I knew exactly what we needed and what we were looking for. So that wasn't we, you know, we didn't really need much help in defining that"
    },
    {
      "speaker": "Interviewer 2:53",
      "text": "and in terms of things like communication so, you know, and keeping you and other key stakeholders up to date. How was that experience? -- 1 of 4 --"
    },
    {
      "speaker": "Speaker 1 3:03",
      "text": "That was fine. I mean, we had meetings, not too many meetings. They, you know, they provided the deck with a list and faced people in or out as they declared an interest or not. And, yeah, it was just Swift, efficient, clear,"
    },
    {
      "speaker": "Interviewer 3:20",
      "text": "great problem. Did they use any of their assessment tools?"
    },
    {
      "speaker": "Speaker 1 3:33",
      "text": "I don't think so. I think it was based on references, but these are pretty high level known profiles. Okay?"
    },
    {
      "speaker": "Interviewer 3:44",
      "text": "And in terms of then seeing it through to the end, how much do they get involved in negotiation and contracting?"
    },
    {
      "speaker": "Speaker 1 3:51",
      "text": "Yeah, no, that was fine too, because there was a few issues, like some questions in terms of tax and things like that. And so I would say that they, I mean, obviously the company had to do the work, but they were sort of the ones making sure that it was done and kept, you know, they stayed the liaison, let's say, between the company and the candidate."
    },
    {
      "speaker": "Interviewer 4:16",
      "text": "Going back to, I suppose, the previous experience you had, what was it that didn't meet your expectations that made you move to Korn Ferry?"
    },
    {
      "speaker": "Speaker 1 4:29",
      "text": "Yeah. I mean, I wasn't entirely happy with a candidate base. Some of the best candidates, we actually came up with ourselves. Unknown Speaker 4:39 So it was,"
    },
    {
      "speaker": "Speaker 1 4:42",
      "text": "and it was a bit more messy in terms of just being having reliable meetings, and suddenly it wasn't ready, and we needed to do it later, and it was just more flimsy process. Somehow, I didn't, I didn't experience it as sharp. I felt that the list of candidates wasn't bad, but it wasn't that impressive, either. And actually, some of the, you know, the ones we ended up choosing were our own,"
    },
    {
      "speaker": "Speaker 2 5:11",
      "text": "you know, network. And also, I think also we had a No, I'm just trying. I was going to say that one of the candidates didn't accept, but that was actually, I'm mixing it now with something else. No, that. So that wasn't that one. That was something else. But yeah."
    },
    {
      "speaker": "Interviewer 5:35",
      "text": "And so in terms of the experience with Korn Ferry, you know, you obviously spoke that the communication and project management was good in terms of, I suppose, and and the quality of candidates, how much did you select? Because I know you said you knew the individual who was running the project, then, based on their network, and you know, their their black book versus the Korn Ferry poll,"
    },
    {
      "speaker": "Speaker 1 6:09",
      "text": "it has quite a lot to do with the individual that I know her and that i She knows me. She knows exactly, you know, what I would be looking for. So that I, you know, I shall be honest that that's quite important, and but, you know, I have, I've known Korn Ferry my whole life, and I have a good impression. So, I mean, if she started to work for an absolutely crap firm, I mean, maybe I wouldn't use her, but, but it's, I think she's important. I have"
    },
    {
      "speaker": "Interviewer 6:42",
      "text": "-- 2 of 4 -- to admit that. Yeah, okay, that's great. And going to, I suppose you know Korn Ferry your whole life. Have you used them for anything other, anything other than search?"
    },
    {
      "speaker": "Speaker 1 6:54",
      "text": "I've been assessed by them a couple of times myself, when I was in when I was an executive, but that's it. But I've used them for several searches, in several other roles I've had, and also other people, and just this method that I that was the key factor for me. Now she hasn't always been with them, either. So I have also used Korn Ferry independently of her, just to have said that."
    },
    {
      "speaker": "Interviewer 7:25",
      "text": "And has the experience been similar?"
    },
    {
      "speaker": "Speaker 1 7:29",
      "text": "Yeah, it's been really good, but those were much more national searches. So, you know, I'm Norwegian, and you so she has a colleague called Stieg Benson. I used him quite a few times, and I knew him well and trusted him quite well, but that was he, you know, I I just see him as a much more of a Norwegian market type of person. He's really good there. I think Mehta has more of the international connections and is able to put together a team that is now doing a very global job for us. Right?"
    },
    {
      "speaker": "Interviewer 8:01",
      "text": "Makes sense. Is there anything that you would think that they could do better?"
    },
    {
      "speaker": "Speaker 1 8:09",
      "text": "No, for this search, really, nothing. I mean, it's been superb. I'm very happy with the candidates. I also know that the company they admit, you know, the HR director, who was actually then quite affiliated with this competitor, she's been incredibly happy. She wrote me, you know, I can't believe you know how well this went, this candidate that ended up with us, Warren, she says he's just brilliant. And so I it's been a very good it's been a very good experience. And I think that's felt by more than me, more people than me. Everyone has been everyone involved, the rest of the nomination committee, including the person who was replaced, who also helped in the search and the and the the administration, meaning, like the HR people at the Libra hero have been very happy."
    },
    {
      "speaker": "Interviewer 8:57",
      "text": "Okay, fantastic. And then in terms of, I suppose, thinking more broadly, is your role on the board, what, what would be your biggest priorities like right now, in terms of, you know, people, skill set and organizational design? Is there anything that's reoccurringly, you know, a pressing issue?"
    },
    {
      "speaker": "Speaker 1 9:27",
      "text": "I mean, it's all that's those are always important issues. But, I mean, I do think we have a very well composed board, and the management board, the executive team, is very small, but super good and specialized. And so it's, you know, right now, I don't feel this other search that I wasn't happy about was for the CFF, and we ended up taking an internal candidate. And I just think the ones who did that job, I mean, I'm happy we ended up with an internal candidate, by the way, but, you know, there should have been much better competition than what they were able to produce, yeah, but she's good, so that's working out fine. And so right now, I don't think we have sort of any gaps or openings or any pressing issues, actually, but it doesn't mean it's not important. It's always important to keep an eye on that."
    },
    {
      "speaker": "Interviewer 10:23",
      "text": "And in terms of thinking about, I suppose, technology and AI, you know, especially around people in the workplace, is, is that a conversation that comes up a lot of board level, or is it more at the management team level,"
    },
    {
      "speaker": "Speaker 1 10:38",
      "text": "a bit of both, but maybe more at the management level, and maybe in my one on ones with them, because I obviously engage a lot with them outside of the board, formal board context, very it's a tech company, so it's obviously very much on the agenda. But then also the board. This is a company that's been through a lot of structural things and portfolio changes and NPS and whatnot, so legal issues, so we end up having a lot of those discussions at the board level, because that's where you -- 3 of 4 -- need to deal with that. So we haven't been so let's say, operationally involved, but that also has to do with the nature of what's happening around the company."
    },
    {
      "speaker": "Interviewer 11:24",
      "text": "Okay, that's great. I think that's it. Kristin, you've been very helpful. And to the point is there. I mean, unless there's anything else that you think would be valid to share to me that would be useful to feedback to Korn, Ferry,"
    },
    {
      "speaker": "Speaker 1 11:39",
      "text": "no, I mean, just that I'm very happy with the team. I mean, meta that I've mentioned many, many times, but also Phoebe, the one that she and I think it's it's good that meta puts on others like so Phoebe is actually more or less leading the process. And I think that's good, since I know meta, we want to also make sure that we have, you know, the professional distance, whatever it No, I'm just very happy with it. It's an old female team, but I think that's more of a coincidence, but it's very easy for me to is very, just very comfortable for me to relate to them. I can be perfectly transparent and all. There's like just no filter in that regard, and I trust them and really feel that they're stretching to make me happy and make us satisfied. You always get, you know, you always you get the impression that they always go that extra mile for you. And I really think they do, and I don't, I don't know if that's just because they're me and she knows me, or whether they're always like that, I would know, but at least it's the impression I'm left with."
    },
    {
      "speaker": "Interviewer 12:39",
      "text": "It's pretty consistent feedback to, I mean, I've done quite a few of these now, so yeah, I think it's obviously very much down to the individual, but it does feel to be fairly consistent across the board. I suppose. One last question on that, did they bring in any of their benchmark data? So things like pay benchmarks? Were they relevant? Thinking, kind of beyond the, you know,"
    },
    {
      "speaker": "Speaker 1 13:03",
      "text": "the search, yeah, we kind of well, in a way, and I'm sure we could have done more of that, but, but the thing is that, you know, this, this war, and that they ended up recruiting, he's coming into an existing board role. All of that is decided by the General Assembly. You know, it's not like we can just start paying him something else. It's all, you know. So, you know, there wasn't really a need for that. There was, obviously, he's American, so it was a new thing that there was no equity involved, which it isn't. None of the board actually holds any equity, and they don't want us to have equity, because they want us to be totally independent. So that was a bit of a new thing, but the board fee is pretty healthy, at least by European standards. This was an American who was very eager to get a European position, so I think that also helped, because, as you know, you know, Americans have totally different pay structures. So that wasn't really much of a that wasn't much of a discussion, actually, but I'm sure if we had asked for it, they would have had all kinds of, you know, benchmarks and whatnot. But it, it was pretty simple. It was all predefined. This is it, take it or leave it. Pretty much,"
    },
    {
      "speaker": "Interviewer 14:14",
      "text": "great. Okay, that's brilliant. Well, thank you very much for your time. I really appreciate it. That was really helpful, Unknown Speaker 14:21 sure, okay, bye, bye. Transcribed by https://otter.ai -- 4 of 4 --"
    }
  ],
  "rawText": "Interviewer 0:00: To run these interviews, so with the hope that actually, you guys can speak more clearly and freely, and ultimately, we can, you know, get to the bottom of is there any potential issues, and they can improve their service to you guys. So I won't, hopefully I won't need the whole of the time, but we'll just kick off with, if you could just explain your role in business and your engagement with Korn Ferry.\n\nSpeaker 1 0:32: Yeah, I'm chair of the Supervisory Board of delivery hero, and they have helped us recruit new board members.\n\nInterviewer 0:40: And is this a one off, or are they, as you said, members? So they've done several\n\nSpeaker 1 0:45: places. It's the first time that they're working for us now, but it's a search that involves two different roles, at least potentially,\n\nInterviewer 0:54: okay, and if it's the first time, why did you select them? Was there an RFP? What was the selection process?\n\nSpeaker 1 1:04: Well, we have worked with others before, and I wasn't entirely happy the last time with a competitor. And then I, I know Korn Ferry from before, and in particular, I know matter, because I have worked with her before. They were also part of the previous competition, but then the administration in the company was quite keen on trying the competitor that I wasn't too happy with, and this time I got my way, so we did Korn Ferry this\n\nInterviewer 1:36: time around. And how's the experience been compared to the competitor.\n\nSpeaker 1 1:41: Yeah, I've been very happy, as I wrote, I've been very happy with it. The it's Swift, no bullshit. Just sort of come up with a very good list of candidates and and I was actually surprised by the long list. It was very, good with, you know, basically six, seven candidates that we all could have hired in the end, and in the end that our top choice agreed to join, and has now joined, and seems to be very good hire. So that worked really well. And now we're in the process of a of a second role, which hasn't come that far, but I had a meeting with them as late as yesterday, and it looks very promising the long list as well. But we it's a bit early days, great.\n\nInterviewer 2:26: And thinking about, I suppose, the end to end process did, how much did they get involved in helping define the the role and the type of person that you need?\n\nSpeaker 1 2:36: Maybe not so much, but that was because it was a replacement, and he was a chair of Oid, and, you know, I knew exactly what we needed and what we were looking for. So that wasn't we, you know, we didn't really need much help in defining that\n\nInterviewer 2:53: and in terms of things like communication so, you know, and keeping you and other key stakeholders up to date. How was that experience? -- 1 of 4 --\n\nSpeaker 1 3:03: That was fine. I mean, we had meetings, not too many meetings. They, you know, they provided the deck with a list and faced people in or out as they declared an interest or not. And, yeah, it was just Swift, efficient, clear,\n\nInterviewer 3:20: great problem. Did they use any of their assessment tools?\n\nSpeaker 1 3:33: I don't think so. I think it was based on references, but these are pretty high level known profiles. Okay?\n\nInterviewer 3:44: And in terms of then seeing it through to the end, how much do they get involved in negotiation and contracting?\n\nSpeaker 1 3:51: Yeah, no, that was fine too, because there was a few issues, like some questions in terms of tax and things like that. And so I would say that they, I mean, obviously the company had to do the work, but they were sort of the ones making sure that it was done and kept, you know, they stayed the liaison, let's say, between the company and the candidate.\n\nInterviewer 4:16: Going back to, I suppose, the previous experience you had, what was it that didn't meet your expectations that made you move to Korn Ferry?\n\nSpeaker 1 4:29: Yeah. I mean, I wasn't entirely happy with a candidate base. Some of the best candidates, we actually came up with ourselves. Unknown Speaker 4:39 So it was,\n\nSpeaker 1 4:42: and it was a bit more messy in terms of just being having reliable meetings, and suddenly it wasn't ready, and we needed to do it later, and it was just more flimsy process. Somehow, I didn't, I didn't experience it as sharp. I felt that the list of candidates wasn't bad, but it wasn't that impressive, either. And actually, some of the, you know, the ones we ended up choosing were our own,\n\nSpeaker 2 5:11: you know, network. And also, I think also we had a No, I'm just trying. I was going to say that one of the candidates didn't accept, but that was actually, I'm mixing it now with something else. No, that. So that wasn't that one. That was something else. But yeah.\n\nInterviewer 5:35: And so in terms of the experience with Korn Ferry, you know, you obviously spoke that the communication and project management was good in terms of, I suppose, and and the quality of candidates, how much did you select? Because I know you said you knew the individual who was running the project, then, based on their network, and you know, their their black book versus the Korn Ferry poll,\n\nSpeaker 1 6:09: it has quite a lot to do with the individual that I know her and that i She knows me. She knows exactly, you know, what I would be looking for. So that I, you know, I shall be honest that that's quite important, and but, you know, I have, I've known Korn Ferry my whole life, and I have a good impression. So, I mean, if she started to work for an absolutely crap firm, I mean, maybe I wouldn't use her, but, but it's, I think she's important. I have\n\nInterviewer 6:42: -- 2 of 4 -- to admit that. Yeah, okay, that's great. And going to, I suppose you know Korn Ferry your whole life. Have you used them for anything other, anything other than search?\n\nSpeaker 1 6:54: I've been assessed by them a couple of times myself, when I was in when I was an executive, but that's it. But I've used them for several searches, in several other roles I've had, and also other people, and just this method that I that was the key factor for me. Now she hasn't always been with them, either. So I have also used Korn Ferry independently of her, just to have said that.\n\nInterviewer 7:25: And has the experience been similar?\n\nSpeaker 1 7:29: Yeah, it's been really good, but those were much more national searches. So, you know, I'm Norwegian, and you so she has a colleague called Stieg Benson. I used him quite a few times, and I knew him well and trusted him quite well, but that was he, you know, I I just see him as a much more of a Norwegian market type of person. He's really good there. I think Mehta has more of the international connections and is able to put together a team that is now doing a very global job for us. Right?\n\nInterviewer 8:01: Makes sense. Is there anything that you would think that they could do better?\n\nSpeaker 1 8:09: No, for this search, really, nothing. I mean, it's been superb. I'm very happy with the candidates. I also know that the company they admit, you know, the HR director, who was actually then quite affiliated with this competitor, she's been incredibly happy. She wrote me, you know, I can't believe you know how well this went, this candidate that ended up with us, Warren, she says he's just brilliant. And so I it's been a very good it's been a very good experience. And I think that's felt by more than me, more people than me. Everyone has been everyone involved, the rest of the nomination committee, including the person who was replaced, who also helped in the search and the and the the administration, meaning, like the HR people at the Libra hero have been very happy.\n\nInterviewer 8:57: Okay, fantastic. And then in terms of, I suppose, thinking more broadly, is your role on the board, what, what would be your biggest priorities like right now, in terms of, you know, people, skill set and organizational design? Is there anything that's reoccurringly, you know, a pressing issue?\n\nSpeaker 1 9:27: I mean, it's all that's those are always important issues. But, I mean, I do think we have a very well composed board, and the management board, the executive team, is very small, but super good and specialized. And so it's, you know, right now, I don't feel this other search that I wasn't happy about was for the CFF, and we ended up taking an internal candidate. And I just think the ones who did that job, I mean, I'm happy we ended up with an internal candidate, by the way, but, you know, there should have been much better competition than what they were able to produce, yeah, but she's good, so that's working out fine. And so right now, I don't think we have sort of any gaps or openings or any pressing issues, actually, but it doesn't mean it's not important. It's always important to keep an eye on that.\n\nInterviewer 10:23: And in terms of thinking about, I suppose, technology and AI, you know, especially around people in the workplace, is, is that a conversation that comes up a lot of board level, or is it more at the management team level,\n\nSpeaker 1 10:38: a bit of both, but maybe more at the management level, and maybe in my one on ones with them, because I obviously engage a lot with them outside of the board, formal board context, very it's a tech company, so it's obviously very much on the agenda. But then also the board. This is a company that's been through a lot of structural things and portfolio changes and NPS and whatnot, so legal issues, so we end up having a lot of those discussions at the board level, because that's where you -- 3 of 4 -- need to deal with that. So we haven't been so let's say, operationally involved, but that also has to do with the nature of what's happening around the company.\n\nInterviewer 11:24: Okay, that's great. I think that's it. Kristin, you've been very helpful. And to the point is there. I mean, unless there's anything else that you think would be valid to share to me that would be useful to feedback to Korn, Ferry,\n\nSpeaker 1 11:39: no, I mean, just that I'm very happy with the team. I mean, meta that I've mentioned many, many times, but also Phoebe, the one that she and I think it's it's good that meta puts on others like so Phoebe is actually more or less leading the process. And I think that's good, since I know meta, we want to also make sure that we have, you know, the professional distance, whatever it No, I'm just very happy with it. It's an old female team, but I think that's more of a coincidence, but it's very easy for me to is very, just very comfortable for me to relate to them. I can be perfectly transparent and all. There's like just no filter in that regard, and I trust them and really feel that they're stretching to make me happy and make us satisfied. You always get, you know, you always you get the impression that they always go that extra mile for you. And I really think they do, and I don't, I don't know if that's just because they're me and she knows me, or whether they're always like that, I would know, but at least it's the impression I'm left with.\n\nInterviewer 12:39: It's pretty consistent feedback to, I mean, I've done quite a few of these now, so yeah, I think it's obviously very much down to the individual, but it does feel to be fairly consistent across the board. I suppose. One last question on that, did they bring in any of their benchmark data? So things like pay benchmarks? Were they relevant? Thinking, kind of beyond the, you know,\n\nSpeaker 1 13:03: the search, yeah, we kind of well, in a way, and I'm sure we could have done more of that, but, but the thing is that, you know, this, this war, and that they ended up recruiting, he's coming into an existing board role. All of that is decided by the General Assembly. You know, it's not like we can just start paying him something else. It's all, you know. So, you know, there wasn't really a need for that. There was, obviously, he's American, so it was a new thing that there was no equity involved, which it isn't. None of the board actually holds any equity, and they don't want us to have equity, because they want us to be totally independent. So that was a bit of a new thing, but the board fee is pretty healthy, at least by European standards. This was an American who was very eager to get a European position, so I think that also helped, because, as you know, you know, Americans have totally different pay structures. So that wasn't really much of a that wasn't much of a discussion, actually, but I'm sure if we had asked for it, they would have had all kinds of, you know, benchmarks and whatnot. But it, it was pretty simple. It was all predefined. This is it, take it or leave it. Pretty much,\n\nInterviewer 14:14: great. Okay, that's brilliant. Well, thank you very much for your time. I really appreciate it. That was really helpful, Unknown Speaker 14:21 sure, okay, bye, bye. Transcribed by https://otter.ai -- 4 of 4 --"
}