{
  "id": "t-031",
  "sourceFile": "T26_NPS10_EMEA_ES_HOUSE_OCT25.pdf",
  "client": "Philippe Brands",
  "interviewDate": "2025-10-31",
  "project": "Executive Search",
  "score": 10,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Speaker 1 0:00",
      "text": "Hi, so my name is Philippe brands. I'm HR manager responsible for EMEA within Avanos. Avanos is a US listed company specialized in medical devices. We do produce our own devices. However, in EMEA, we are decentralized entity. We do not produce, we distribute, sell and distribute throughout the region. Our headquarters are based in Belgium. That's also where back office is based. That's where I'm based as well. And the idea is, indeed that you I had a silent search to set up for finance role quite high level, and knowing Olivier top from my network made completely sense, knowing his level of ethics and professionalism, I was quite confident that we could find common grounds to go forward on this on this role, and find a suitable candidate,"
    },
    {
      "speaker": "Interviewer 1:12",
      "text": "right? And knowing Olivier before, was that through him working at Korn Ferry or or through a different path."
    },
    {
      "speaker": "Speaker 1 1:24",
      "text": "Look, we've been police. I've been working several years at page executive within the Michael Page group. He learned me a lot in the executive search market, because it's slightly different than contingent recruit in any way. And yeah, we, we keep, we kept in touch. But frankly, I had no doubt about his, yeah, as I said, work ethics, professionalism and his ability to fill in a tricky position, knowing it was a complete silent search,"
    },
    {
      "speaker": "Interviewer 2:06",
      "text": "great, and it was this your first experience of working with Korn Ferry. Yes, great. And how was the overall experience? How? How? How did it go for you?"
    },
    {
      "speaker": "Speaker 1 2:20",
      "text": "Well, the advantage we both have, Olivia and myself is indeed that we know each other, meaning that we speak the same language, being at that side of the table myself. So it was quite easy to pass through a clear briefing expectations, answering the questions that he asked me because I was prepared for it. What I what I did appreciate is, indeed that Olivier is some, someone quite, quite open and transparent. So he involved his researchers straight away, which I do appreciate, because otherwise, when you need to pass through a message, you always lose some essence about it. And he's not cocky like in I'm the partner. I'm taking the lead here. It was like really an easy way of interacting, just finding the right setup to be efficient and to go forward, yeah, in a qualitative way, right?"
    },
    {
      "speaker": "Interviewer 3:34",
      "text": "So if we break it down, I mean, given it's the first time, I suppose he's worked with you in your role, -- 1 of 8 -- Unknown Speaker 3:43 how well"
    },
    {
      "speaker": "Interviewer 3:44",
      "text": "did they understand, I suppose, the organization, and you know, the culture behind it, in which, obviously, is critical to search,"
    },
    {
      "speaker": "Speaker 1 3:53",
      "text": "brilliant, perfect. Why? Because the results that came out of it in quite, quite a short amount of time. So the urgency linked to the search was also respected. Was brilliant, because the long list of candidates they presented for, I would say 60 to 70% was spot on. But again, when you start working together on a position, they not really knowing us as a company, you always need to find common ground, and it's always easier. It's also my approach. It's always easier to have tangible CVS just to give tangible feedback. Why? Yes or No? In regards of the acid tests that we implemented, I'm quite sure you know about acid test. So just the mandatory skills, both either hard skills, soft skills that were requested for this role. And yeah, they did. They did a very, very good job. However, I need to also be transparent about the fact that it wasn't a walk in the park, meaning that I had first contacts with ODI to launch the job, and then in the US, because this is a position that was reporting directly into the US. The US gave me green light, and then, after a few weeks, we drew and then came back. So Olivier was also quite resilient, properly, following up, just to be sure that as soon as we had green lights signed contract and whatsoever we could go forward, and I did appreciate that. So there was no pushy follow up, no stalking. I can't have that. I've been at that side of the table. I know how tricky it is, because it's always the pressure of getting new mandates in, and the pressure of the KPIs and and the sales figures, but I never felt that with ody here, and that's also what I always appreciate. I've been in touch with other exact executive recruitment agencies, and I hated their approach. I really hated it, and that made me proud back in the days when I was doing my job in executive search within page executive page executive being more an underdog and a challenger on the executive search market, I was quite proud, because I thought that what what I was doing was quite qualitative still, Compared to that those other agencies. However, with the boutique approach of Korn Ferry, it was completely aligned with my expectations,"
    },
    {
      "speaker": "Interviewer 6:47",
      "text": "fantastic, and in terms of crafting the role you obviously there was a silent search. Did Olivier get involved in in that too, or was that fairly set before you approached him. Unknown Speaker 7:01 I didn't get that. Well, maybe, could you rephrase that?"
    },
    {
      "speaker": "Interviewer 7:05",
      "text": "Yeah, so in terms of feeding into the job spec and, you know, and actually making some suggestions, making sure it's the right fit, looking at the skill sets, was that something you collaborated on, or was that something you'd already"
    },
    {
      "speaker": "Speaker 1 7:18",
      "text": "-- 2 of 8 -- done there? Again, it was always an open discussion finding common grounds. I knew that the perfect candidate never exists again being there. So it was all about being clear about the expectations in regards of the role the background, track records, specific skills requested with the international exposure and so on. And always advising sharing the right market insights spot on, because it's always Yeah. What I mean with finding common ground is we as a company always want the best candidates for the lowest salary. But there again, it was always an open discussion to Yeah, to find common ground about okay, which skills are you about? Okay, to be more flexible about, because if you want all of this, it's going to cost you salary wise, way more than what you have on the table here. Also, the setup is quite specific, because we were pitching for an international finance director overseeing LATAM EMEA and APAC, so we needed someone who already had that exposure. However, we're not speaking about CFO or regional CFO role. So we also needed to align about how we gonna approach candidates, making the role itself appealing to people quite experienced with quite interesting track records, but knowing that they would not have like a full finance scope, because within our company, fpna, I don't know if you acquainted with finance jobs, but fpna is not in scope of this finance director role. It's more accounting treasury and controlling part of finance. So he, he and his researcher quite quickly identified which kind of candidates we needed. And with the broad, with Korn Ferry, broad network and database, managed to identify, and they were quite, not quite completely transparent about these candidates came from our network, these candidates we approached directly. And of course, I do understand the difference that you have in drive about candidates that you hunt versus candidates that you already have in your network, or that were sometimes also recycled from previous searches, which is not an issue to me, because we need to be pragmatic about it. Everything went smoothly, definitely."
    },
    {
      "speaker": "Interviewer 10:01",
      "text": "Yeah, fantastic. And, I mean in terms of your, you know, your comments on compensation, did they, did they utilize their benchmarks that they have at Korn Ferry? Or was it just the knowledge that Olivier had in the it"
    },
    {
      "speaker": "Speaker 1 10:18",
      "text": "wasn't, or, I do not clearly remember, to be honest, but my expectations towards them was also clear. If I reach out to an external agency, it's also to make my life easier alone in TA and talent acquisition, so I have the gentleman's agreement with my boss, to still being able to work with external agencies and being having that track record being at the other side of the table, I'm crystal clear about what I need and what I want in a short list of candidates. So it was crystal clear regarding salary, that I wanted to know what they earning today, what their salary expectations were, and I'm experienced enough to to identify if that gap is too big, and then dig a bit further about Why. Why do they expect like 15, 15% more than their current salary? And they were also crystal clear, because they did it straight away, about a complete drill down about the salary package. It's not just like earning 200k a year. No, it's 200k plus STI plus LTI plus benefits. And when you're on executive level, we know that those benefits, especially in Belgium, aren't quite extensive. So I always had, like, a clear and extensive view on expectations, just to avoid any frustrations, and at last stage interview coming to the conclusion that will eventually we can't afford the services of that specific candidate. -- 3 of 8 --"
    },
    {
      "speaker": "Interviewer 12:06",
      "text": "Yeah, understand in terms of the number of candidates and the quality, did that meet your expectations?"
    },
    {
      "speaker": "Speaker 1 12:13",
      "text": "Yes. Why? Because having that understanding, knowing that we were speaking the same language, I said, like, Listen early, we need to find the right balance. So I would be more than happy, instead of waiting for you to directly present a short list, a polished shortlist of candidates, let's start with having like a touch base after two three weeks, and they respected that timing, frankly, even went faster than foreseen, just to have, like, a quick touch base on a long list of candidates and going through each and every resume and executive summary just to be sure that we are going in the right direction, and to Drill down why this candidate, yes or no, giving them the insights, giving Korn Ferry the insights about what's going to be important to me or not, and it's way easier to do that on a tangible CFF than just giving a briefing. And that won't ferry well, because upon that first touch base, they straight away corrected where it was needed, and they kept track to be transparent. As of the first official meeting we had together with the hiring manager, who is based in the US, just to do a drill down about these are the shortlisted candidates we would like to go forward with. But didn't push away all the other candidates from the long list. So they kept like, I think it's a PowerPoint. It was built quite, quite, quite well with that executive summary. But as I asked for, it was a one pager, which, why should we know better? Said, what are the matching points in regards of the briefing? What are the attention points? Because no candidate is perfect. And then I also had, like, a brief How could I put this a brief box with the main elements about notice periods, non compete, salary points, just to be sure that we had, like, a clear view per candidate and on that each and every status meeting we had each and every two weeks, we could go forward and drill down to the right candidates that would go forward."
    },
    {
      "speaker": "Interviewer 14:49",
      "text": "Great. And in terms of, I suppose, your experience beyond Olivier, more around the space the Korn Ferry experience, I mean, did did that come into play? Or was it very much more about the one to one relationship Unknown Speaker 15:06 at first that made the difference. Then I'm not going to hide. But then, of course,"
    },
    {
      "speaker": "Speaker 1 15:14",
      "text": "yes, we know each other, but again, his clients and I have KPIs on my side, so I expect impeccable work, and I have nothing to complain about. I was always transparent in my communication. He was my single point of contact, but in all my communications always put his researcher in copy. And sometimes if Olivier was off or sick or at a client meeting, I know his researcher was quite reactive, and that enabled us to be to be quite efficient. As soon as we started setting up like the interviews, that was a impeccable follow up. I was in contact with a third person. I think it was Rebecca, if I do remember well, and that was all set perfectly. Again, I come that across quite often with other agencies, most of the time based in the UK, to be honest, but they messed it up with the agenda, not paying attention to UK time, cet time and but I, I tackled that meanwhile, but with Korn Ferry, it was impeccable, fantastic. It was always transparent. There was never a breach of information that I -- 4 of 8 -- passed through to Olivier, that he forgot to pass through to to his researcher or to the planner? No, really, really, again. I kind of think that the final question you're going to ask me is, would you refer or would you work again? Definitely no brainer. If, if I have the opportunity to set up like a new executive search. I wouldn't even benchmark. I would go directly to Olivier, because he managed to prove me that, next to the fact that we know each other, and I know how professional he is, he managed to prove that. He took that also to Korn Ferry and even polished it more. But again, that's That's why Korn Ferry so so well recognized out there. Fantastic."
    },
    {
      "speaker": "Interviewer 17:30",
      "text": "That's good to hear. I mean, was there anything that they could improve on, that that could be made better? Unknown Speaker 17:36 Frankly,"
    },
    {
      "speaker": "Speaker 1 17:39",
      "text": "no. Frankly, no, no, definitely. But again, that's, that's maybe the advantage. But I know Olivier, because when we were at page executive together, we sometimes also did joint research searches, because he had to lead about the client and had some network in specific roles, because my major was finance, but he also had other roles at the same time. He was more specialized on so we had to work alongside each other. And I know how we how we functions, and we are quite lookalikes at that end, so it's so easy to and that's a real advantage just to say a few words, and he could finish my sentences, and always in the right way. So yeah, I missed him a lot when he when he joined Korn Ferry. I was pissed at him, but so happy at the same time, of course. And I do understand where it comes from, and we still have contacts. He follows that up in a very professional way still, and no, really, pretty much aligned on everything. But that's also what I wanted to buy."
    },
    {
      "speaker": "Interviewer 18:59",
      "text": "Fantastic working with and in terms of, I suppose you know, you moving to client side, as it were, what are your what are the biggest challenges that you're facing from a people's perspective?"
    },
    {
      "speaker": "Speaker 1 19:16",
      "text": "Are you speaking about the recruitment, the candidates that recruits or the interaction with agencies,"
    },
    {
      "speaker": "Interviewer 19:23",
      "text": "more internal, so less about the agencies. We'll come back to that in a second, but more around, yeah, I suppose the you know trying to find the right workforce, whether it comes to Is it a shortage of skills or the changing of skills? What's top priority or your top challenge right now?"
    },
    {
      "speaker": "Speaker 1 19:43",
      "text": "Okay, to be completely transparent, my two main KPIs is cost of recruitment and time to hire. Okay, so my commitment to my boss, is to drive internally the business, my internal clients, to keep track and to make it happen. With my track records. I know how to deal with that, to drive a bit and apologies for the words, but I'm a pain -- 5 of 8 -- in the YS to my internal clients, but at the end, they're always happy because they never have time. But I made crystal clear that they're going to make time, and that is also my commitment when I negotiate new contracts with external agencies, is I'm going to negotiate like hell on the rates, on what we are going to calculate, it on and so on. But my commitment to you is to give you feedback within 24 hours, because I had those frustrations at the other side of the table. I'm going to give you tangible feedback because it's not because the hiring manager tells me, like, Nah, it's not a click. We can't do anything with that. We can't We can't adapt to search with that kind of feedback. So I drive the business, and I tend to think I'm quite good at that, because everyone seems to be happy after two and a half years in this position, and it goes in a lot of different directions. And that is what thrills me in my role, is indeed that I have a lot of internal stakeholders, but from different countries, different cultures, different expectations, and different employment market situations, fantastic."
    },
    {
      "speaker": "Interviewer 21:40",
      "text": "And going back to that kind of speed to hire, how important is it to you working with an external agency, that's that they have the kind of the latest tech and tools that can essentially, you know, improve that speed to hire, the whole experience. Unknown Speaker 21:58 I don't mind again, Unknown Speaker 22:03 I always try to build partnerships. What I mean with building partnerships"
    },
    {
      "speaker": "Speaker 1 22:11",
      "text": "is less time in an agency I am and building that partnership also means that the agency will more and more understand who we are as a company, and quicker know which type of candidate would match our company culture, and I managed, in quite A short amount of time to identify top tier partners in different countries I need to operate in. However, I always need a backup plan, but I'm completely transparent, and I have my first tier partner, and they work exclusively, even though I work in Nokia, no pay for most of our of my sales jobs or specifically related industry related jobs, quality, regulatory, customer service, standard and pricing, these kind of things within medical devices or broader healthcare and life science. But again, it was also tricky to me when I started to identify that when we speak about healthcare and life science, medical devices is quite specific. A salesperson in pharma is not going to be of interest for me, because medtech is hospital sales. So it's the sales cycle is completely different. So I always challenged the agencies. I wanted to start working with, and as soon as they convinced me, I give I try them out, and my way of working is setting up these kind of partnerships. And even though I'm quite harsh in negotiation, having a lot of partners working with me at 15% recruitment fee only calculated on salary. I have two agencies by now that did such a good job that, through the YS, each and every year, I raised the fee. Second year 16% now, since this year, we're at 17% probably go up maximum to 18% but just I want to set up like Win Win partnerships, and that needs to go in both directions. And that is a strength I tend to think I have, because I've been at that side of the table, so I know the frustrations I had to live with, and I want to align that. So yes, I'm going to be a pain in the ass in regards of negotiation, but I'm going to give you something back, and I -- 6 of 8 -- know that if they have to wait weeks you have because before having feedback for the second stage interview and so on, or offering and so on, we're going to lose candidates. So that's my commitment. That's where I try to be disruptive. So I don't mind where they find their candidates. I just want agencies that provide me quality, not quantity. I'm not going to chase an agency because for two weeks time, they didn't provide me any CV. We have quick WhatsApp feedbacks, and they give me tangible insights, and I know when they start. And there again, apologies for the words when they start bullshitting me about YS. So so many candidates interview, you know, those ratios. So it's all about, yeah, only palm two, one of those might be suitable. But I want to be sure that the reasons for considering are the right ones, and I want quantity. That's why I want to work with agencies, because I can't afford to spend time in screening CFF and so on. So I came to a situation with a few agencies that when they send me a CV, I don't even look at the CV. I just give feedback with slots to set up an interview, and in 95% of the cases, I'm not disappointed. That is how efficient I try to make my work. I tend to think pragmatic approach, yeah."
    },
    {
      "speaker": "Interviewer 26:23",
      "text": "So partnerships, priority, priority. And then obviously the quality of the candidates, of the network that they have, which ties into partnership, yes. And then it's the what sits behind that. So,"
    },
    {
      "speaker": "Speaker 1 26:39",
      "text": "exactly, so to give an example on the Belgian market, I work a lot with my ex colleagues, but not for each and every job, because I know what which consultant I'm going to work, and I know out of experience, what's the quality the ethics of that consultant will be, because behind a brands? Is it Korn, Ferry? Is it page, Rubble off, and we could go on like that for hours. It's all about the commitments and the drive of the consultants going to take care of the of the role. If, if I go in other countries, I wasn't so keen about that prior to having this job. But more and more I go to very specific niche players who are only specialized in medtech, for example. And they they know about our vocabulary. When I speak about KOLs, HePS, about our AQ, way about these kind of things. They get it straight away when I speak and there again, building that portfolio, speaking that partnership, speaking about our products. When I speak about SLS, those are feeding tubes, specialty nutrition systems, or RFA, radio frequency nerve ablation, which is our pain division. They know about it. And for some of them, they even recruited the national sales managers so they know who these specific roles are going to report into, and that makes it so convenient. I always call them my partners in Korn, but that is definitely the setup, and that is where I want to go for, and I have full freedom from my boss doing this my way, because she sees this working, fantastic, Unknown Speaker 28:32 brilliant. I think"
    },
    {
      "speaker": "Interviewer 28:34",
      "text": "that's all the questions from my side. It's been really helpful and insightful. So appreciate you being so so candid with this, but I'm glad that you've had a really good experience as well of your first time with Korn Ferry. So yeah, hopefully more to come. -- 7 of 8 --"
    },
    {
      "speaker": "Speaker 1 28:51",
      "text": "Yes, I'm hoping as well, because I'm feeling the most at ease with executive search. Also do my experience, just because when you start speaking with these kinds, these level of candidates, if they want to go for a process, they will go the whole way when you go for mid level management or sales people before you know, yeah, I don't, I'm not really sure I want to go for it, stuff like that. And that's quite frustrating. That makes it pisses me off"
    },
    {
      "speaker": "Interviewer 29:23",
      "text": "a waste of time."
    },
    {
      "speaker": "Speaker 1 29:25",
      "text": "Yeah, exactly. And again, that's all about it. I always look for the shortest way between a job intake and an offer or a signed offer. Let's put it that way. And that's that works, pretty much. But I know as an HR manager, I'm really disruptive, because you have 25 YS sales experience, most of it in the HR business, but that's an advantage when you need to interact with sales leaders, because I speak the same language, and it's also convenient to interview salespeople because, yeah, you quite, quite quickly identify those who try to bullshit you, or those who are really straightforward about their statement."
    },
    {
      "speaker": "Interviewer 30:12",
      "text": "Yeah, brilliant. I get it. Thank you. I thank you. That's been really helpful, and it's been really a pleasure meeting you. Likewise,"
    },
    {
      "speaker": "Speaker 1 30:20",
      "text": "if there's any additional input you you need, with pleasure, I would recommend Olivier to a lot of people. I already send him through people from my network when I was an executive search, because he's the only one I trust to follow up properly with people that trust me, brilliant."
    },
    {
      "speaker": "Interviewer 30:43",
      "text": "That's great to hear. Fantastic. Thank you very much. And have a lovely weekend when it"
    },
    {
      "speaker": "Speaker 1 30:49",
      "text": "comes. Same for you, and take care. Thank you. Thanks. Bye,"
    },
    {
      "speaker": "Speaker 2 30:54",
      "text": "bye, bye. Transcribed by https://otter.ai -- 8 of 8 --"
    }
  ],
  "rawText": "Speaker 1 0:00: Hi, so my name is Philippe brands. I'm HR manager responsible for EMEA within Avanos. Avanos is a US listed company specialized in medical devices. We do produce our own devices. However, in EMEA, we are decentralized entity. We do not produce, we distribute, sell and distribute throughout the region. Our headquarters are based in Belgium. That's also where back office is based. That's where I'm based as well. And the idea is, indeed that you I had a silent search to set up for finance role quite high level, and knowing Olivier top from my network made completely sense, knowing his level of ethics and professionalism, I was quite confident that we could find common grounds to go forward on this on this role, and find a suitable candidate,\n\nInterviewer 1:12: right? And knowing Olivier before, was that through him working at Korn Ferry or or through a different path.\n\nSpeaker 1 1:24: Look, we've been police. I've been working several years at page executive within the Michael Page group. He learned me a lot in the executive search market, because it's slightly different than contingent recruit in any way. And yeah, we, we keep, we kept in touch. But frankly, I had no doubt about his, yeah, as I said, work ethics, professionalism and his ability to fill in a tricky position, knowing it was a complete silent search,\n\nInterviewer 2:06: great, and it was this your first experience of working with Korn Ferry. Yes, great. And how was the overall experience? How? How? How did it go for you?\n\nSpeaker 1 2:20: Well, the advantage we both have, Olivia and myself is indeed that we know each other, meaning that we speak the same language, being at that side of the table myself. So it was quite easy to pass through a clear briefing expectations, answering the questions that he asked me because I was prepared for it. What I what I did appreciate is, indeed that Olivier is some, someone quite, quite open and transparent. So he involved his researchers straight away, which I do appreciate, because otherwise, when you need to pass through a message, you always lose some essence about it. And he's not cocky like in I'm the partner. I'm taking the lead here. It was like really an easy way of interacting, just finding the right setup to be efficient and to go forward, yeah, in a qualitative way, right?\n\nInterviewer 3:34: So if we break it down, I mean, given it's the first time, I suppose he's worked with you in your role, -- 1 of 8 -- Unknown Speaker 3:43 how well\n\nInterviewer 3:44: did they understand, I suppose, the organization, and you know, the culture behind it, in which, obviously, is critical to search,\n\nSpeaker 1 3:53: brilliant, perfect. Why? Because the results that came out of it in quite, quite a short amount of time. So the urgency linked to the search was also respected. Was brilliant, because the long list of candidates they presented for, I would say 60 to 70% was spot on. But again, when you start working together on a position, they not really knowing us as a company, you always need to find common ground, and it's always easier. It's also my approach. It's always easier to have tangible CVS just to give tangible feedback. Why? Yes or No? In regards of the acid tests that we implemented, I'm quite sure you know about acid test. So just the mandatory skills, both either hard skills, soft skills that were requested for this role. And yeah, they did. They did a very, very good job. However, I need to also be transparent about the fact that it wasn't a walk in the park, meaning that I had first contacts with ODI to launch the job, and then in the US, because this is a position that was reporting directly into the US. The US gave me green light, and then, after a few weeks, we drew and then came back. So Olivier was also quite resilient, properly, following up, just to be sure that as soon as we had green lights signed contract and whatsoever we could go forward, and I did appreciate that. So there was no pushy follow up, no stalking. I can't have that. I've been at that side of the table. I know how tricky it is, because it's always the pressure of getting new mandates in, and the pressure of the KPIs and and the sales figures, but I never felt that with ody here, and that's also what I always appreciate. I've been in touch with other exact executive recruitment agencies, and I hated their approach. I really hated it, and that made me proud back in the days when I was doing my job in executive search within page executive page executive being more an underdog and a challenger on the executive search market, I was quite proud, because I thought that what what I was doing was quite qualitative still, Compared to that those other agencies. However, with the boutique approach of Korn Ferry, it was completely aligned with my expectations,\n\nInterviewer 6:47: fantastic, and in terms of crafting the role you obviously there was a silent search. Did Olivier get involved in in that too, or was that fairly set before you approached him. Unknown Speaker 7:01 I didn't get that. Well, maybe, could you rephrase that?\n\nInterviewer 7:05: Yeah, so in terms of feeding into the job spec and, you know, and actually making some suggestions, making sure it's the right fit, looking at the skill sets, was that something you collaborated on, or was that something you'd already\n\nSpeaker 1 7:18: -- 2 of 8 -- done there? Again, it was always an open discussion finding common grounds. I knew that the perfect candidate never exists again being there. So it was all about being clear about the expectations in regards of the role the background, track records, specific skills requested with the international exposure and so on. And always advising sharing the right market insights spot on, because it's always Yeah. What I mean with finding common ground is we as a company always want the best candidates for the lowest salary. But there again, it was always an open discussion to Yeah, to find common ground about okay, which skills are you about? Okay, to be more flexible about, because if you want all of this, it's going to cost you salary wise, way more than what you have on the table here. Also, the setup is quite specific, because we were pitching for an international finance director overseeing LATAM EMEA and APAC, so we needed someone who already had that exposure. However, we're not speaking about CFO or regional CFO role. So we also needed to align about how we gonna approach candidates, making the role itself appealing to people quite experienced with quite interesting track records, but knowing that they would not have like a full finance scope, because within our company, fpna, I don't know if you acquainted with finance jobs, but fpna is not in scope of this finance director role. It's more accounting treasury and controlling part of finance. So he, he and his researcher quite quickly identified which kind of candidates we needed. And with the broad, with Korn Ferry, broad network and database, managed to identify, and they were quite, not quite completely transparent about these candidates came from our network, these candidates we approached directly. And of course, I do understand the difference that you have in drive about candidates that you hunt versus candidates that you already have in your network, or that were sometimes also recycled from previous searches, which is not an issue to me, because we need to be pragmatic about it. Everything went smoothly, definitely.\n\nInterviewer 10:01: Yeah, fantastic. And, I mean in terms of your, you know, your comments on compensation, did they, did they utilize their benchmarks that they have at Korn Ferry? Or was it just the knowledge that Olivier had in the it\n\nSpeaker 1 10:18: wasn't, or, I do not clearly remember, to be honest, but my expectations towards them was also clear. If I reach out to an external agency, it's also to make my life easier alone in TA and talent acquisition, so I have the gentleman's agreement with my boss, to still being able to work with external agencies and being having that track record being at the other side of the table, I'm crystal clear about what I need and what I want in a short list of candidates. So it was crystal clear regarding salary, that I wanted to know what they earning today, what their salary expectations were, and I'm experienced enough to to identify if that gap is too big, and then dig a bit further about Why. Why do they expect like 15, 15% more than their current salary? And they were also crystal clear, because they did it straight away, about a complete drill down about the salary package. It's not just like earning 200k a year. No, it's 200k plus STI plus LTI plus benefits. And when you're on executive level, we know that those benefits, especially in Belgium, aren't quite extensive. So I always had, like, a clear and extensive view on expectations, just to avoid any frustrations, and at last stage interview coming to the conclusion that will eventually we can't afford the services of that specific candidate. -- 3 of 8 --\n\nInterviewer 12:06: Yeah, understand in terms of the number of candidates and the quality, did that meet your expectations?\n\nSpeaker 1 12:13: Yes. Why? Because having that understanding, knowing that we were speaking the same language, I said, like, Listen early, we need to find the right balance. So I would be more than happy, instead of waiting for you to directly present a short list, a polished shortlist of candidates, let's start with having like a touch base after two three weeks, and they respected that timing, frankly, even went faster than foreseen, just to have, like, a quick touch base on a long list of candidates and going through each and every resume and executive summary just to be sure that we are going in the right direction, and to Drill down why this candidate, yes or no, giving them the insights, giving Korn Ferry the insights about what's going to be important to me or not, and it's way easier to do that on a tangible CFF than just giving a briefing. And that won't ferry well, because upon that first touch base, they straight away corrected where it was needed, and they kept track to be transparent. As of the first official meeting we had together with the hiring manager, who is based in the US, just to do a drill down about these are the shortlisted candidates we would like to go forward with. But didn't push away all the other candidates from the long list. So they kept like, I think it's a PowerPoint. It was built quite, quite, quite well with that executive summary. But as I asked for, it was a one pager, which, why should we know better? Said, what are the matching points in regards of the briefing? What are the attention points? Because no candidate is perfect. And then I also had, like, a brief How could I put this a brief box with the main elements about notice periods, non compete, salary points, just to be sure that we had, like, a clear view per candidate and on that each and every status meeting we had each and every two weeks, we could go forward and drill down to the right candidates that would go forward.\n\nInterviewer 14:49: Great. And in terms of, I suppose, your experience beyond Olivier, more around the space the Korn Ferry experience, I mean, did did that come into play? Or was it very much more about the one to one relationship Unknown Speaker 15:06 at first that made the difference. Then I'm not going to hide. But then, of course,\n\nSpeaker 1 15:14: yes, we know each other, but again, his clients and I have KPIs on my side, so I expect impeccable work, and I have nothing to complain about. I was always transparent in my communication. He was my single point of contact, but in all my communications always put his researcher in copy. And sometimes if Olivier was off or sick or at a client meeting, I know his researcher was quite reactive, and that enabled us to be to be quite efficient. As soon as we started setting up like the interviews, that was a impeccable follow up. I was in contact with a third person. I think it was Rebecca, if I do remember well, and that was all set perfectly. Again, I come that across quite often with other agencies, most of the time based in the UK, to be honest, but they messed it up with the agenda, not paying attention to UK time, cet time and but I, I tackled that meanwhile, but with Korn Ferry, it was impeccable, fantastic. It was always transparent. There was never a breach of information that I -- 4 of 8 -- passed through to Olivier, that he forgot to pass through to to his researcher or to the planner? No, really, really, again. I kind of think that the final question you're going to ask me is, would you refer or would you work again? Definitely no brainer. If, if I have the opportunity to set up like a new executive search. I wouldn't even benchmark. I would go directly to Olivier, because he managed to prove me that, next to the fact that we know each other, and I know how professional he is, he managed to prove that. He took that also to Korn Ferry and even polished it more. But again, that's That's why Korn Ferry so so well recognized out there. Fantastic.\n\nInterviewer 17:30: That's good to hear. I mean, was there anything that they could improve on, that that could be made better? Unknown Speaker 17:36 Frankly,\n\nSpeaker 1 17:39: no. Frankly, no, no, definitely. But again, that's, that's maybe the advantage. But I know Olivier, because when we were at page executive together, we sometimes also did joint research searches, because he had to lead about the client and had some network in specific roles, because my major was finance, but he also had other roles at the same time. He was more specialized on so we had to work alongside each other. And I know how we how we functions, and we are quite lookalikes at that end, so it's so easy to and that's a real advantage just to say a few words, and he could finish my sentences, and always in the right way. So yeah, I missed him a lot when he when he joined Korn Ferry. I was pissed at him, but so happy at the same time, of course. And I do understand where it comes from, and we still have contacts. He follows that up in a very professional way still, and no, really, pretty much aligned on everything. But that's also what I wanted to buy.\n\nInterviewer 18:59: Fantastic working with and in terms of, I suppose you know, you moving to client side, as it were, what are your what are the biggest challenges that you're facing from a people's perspective?\n\nSpeaker 1 19:16: Are you speaking about the recruitment, the candidates that recruits or the interaction with agencies,\n\nInterviewer 19:23: more internal, so less about the agencies. We'll come back to that in a second, but more around, yeah, I suppose the you know trying to find the right workforce, whether it comes to Is it a shortage of skills or the changing of skills? What's top priority or your top challenge right now?\n\nSpeaker 1 19:43: Okay, to be completely transparent, my two main KPIs is cost of recruitment and time to hire. Okay, so my commitment to my boss, is to drive internally the business, my internal clients, to keep track and to make it happen. With my track records. I know how to deal with that, to drive a bit and apologies for the words, but I'm a pain -- 5 of 8 -- in the YS to my internal clients, but at the end, they're always happy because they never have time. But I made crystal clear that they're going to make time, and that is also my commitment when I negotiate new contracts with external agencies, is I'm going to negotiate like hell on the rates, on what we are going to calculate, it on and so on. But my commitment to you is to give you feedback within 24 hours, because I had those frustrations at the other side of the table. I'm going to give you tangible feedback because it's not because the hiring manager tells me, like, Nah, it's not a click. We can't do anything with that. We can't We can't adapt to search with that kind of feedback. So I drive the business, and I tend to think I'm quite good at that, because everyone seems to be happy after two and a half years in this position, and it goes in a lot of different directions. And that is what thrills me in my role, is indeed that I have a lot of internal stakeholders, but from different countries, different cultures, different expectations, and different employment market situations, fantastic.\n\nInterviewer 21:40: And going back to that kind of speed to hire, how important is it to you working with an external agency, that's that they have the kind of the latest tech and tools that can essentially, you know, improve that speed to hire, the whole experience. Unknown Speaker 21:58 I don't mind again, Unknown Speaker 22:03 I always try to build partnerships. What I mean with building partnerships\n\nSpeaker 1 22:11: is less time in an agency I am and building that partnership also means that the agency will more and more understand who we are as a company, and quicker know which type of candidate would match our company culture, and I managed, in quite A short amount of time to identify top tier partners in different countries I need to operate in. However, I always need a backup plan, but I'm completely transparent, and I have my first tier partner, and they work exclusively, even though I work in Nokia, no pay for most of our of my sales jobs or specifically related industry related jobs, quality, regulatory, customer service, standard and pricing, these kind of things within medical devices or broader healthcare and life science. But again, it was also tricky to me when I started to identify that when we speak about healthcare and life science, medical devices is quite specific. A salesperson in pharma is not going to be of interest for me, because medtech is hospital sales. So it's the sales cycle is completely different. So I always challenged the agencies. I wanted to start working with, and as soon as they convinced me, I give I try them out, and my way of working is setting up these kind of partnerships. And even though I'm quite harsh in negotiation, having a lot of partners working with me at 15% recruitment fee only calculated on salary. I have two agencies by now that did such a good job that, through the YS, each and every year, I raised the fee. Second year 16% now, since this year, we're at 17% probably go up maximum to 18% but just I want to set up like Win Win partnerships, and that needs to go in both directions. And that is a strength I tend to think I have, because I've been at that side of the table, so I know the frustrations I had to live with, and I want to align that. So yes, I'm going to be a pain in the ass in regards of negotiation, but I'm going to give you something back, and I -- 6 of 8 -- know that if they have to wait weeks you have because before having feedback for the second stage interview and so on, or offering and so on, we're going to lose candidates. So that's my commitment. That's where I try to be disruptive. So I don't mind where they find their candidates. I just want agencies that provide me quality, not quantity. I'm not going to chase an agency because for two weeks time, they didn't provide me any CV. We have quick WhatsApp feedbacks, and they give me tangible insights, and I know when they start. And there again, apologies for the words when they start bullshitting me about YS. So so many candidates interview, you know, those ratios. So it's all about, yeah, only palm two, one of those might be suitable. But I want to be sure that the reasons for considering are the right ones, and I want quantity. That's why I want to work with agencies, because I can't afford to spend time in screening CFF and so on. So I came to a situation with a few agencies that when they send me a CV, I don't even look at the CV. I just give feedback with slots to set up an interview, and in 95% of the cases, I'm not disappointed. That is how efficient I try to make my work. I tend to think pragmatic approach, yeah.\n\nInterviewer 26:23: So partnerships, priority, priority. And then obviously the quality of the candidates, of the network that they have, which ties into partnership, yes. And then it's the what sits behind that. So,\n\nSpeaker 1 26:39: exactly, so to give an example on the Belgian market, I work a lot with my ex colleagues, but not for each and every job, because I know what which consultant I'm going to work, and I know out of experience, what's the quality the ethics of that consultant will be, because behind a brands? Is it Korn, Ferry? Is it page, Rubble off, and we could go on like that for hours. It's all about the commitments and the drive of the consultants going to take care of the of the role. If, if I go in other countries, I wasn't so keen about that prior to having this job. But more and more I go to very specific niche players who are only specialized in medtech, for example. And they they know about our vocabulary. When I speak about KOLs, HePS, about our AQ, way about these kind of things. They get it straight away when I speak and there again, building that portfolio, speaking that partnership, speaking about our products. When I speak about SLS, those are feeding tubes, specialty nutrition systems, or RFA, radio frequency nerve ablation, which is our pain division. They know about it. And for some of them, they even recruited the national sales managers so they know who these specific roles are going to report into, and that makes it so convenient. I always call them my partners in Korn, but that is definitely the setup, and that is where I want to go for, and I have full freedom from my boss doing this my way, because she sees this working, fantastic, Unknown Speaker 28:32 brilliant. I think\n\nInterviewer 28:34: that's all the questions from my side. It's been really helpful and insightful. So appreciate you being so so candid with this, but I'm glad that you've had a really good experience as well of your first time with Korn Ferry. So yeah, hopefully more to come. -- 7 of 8 --\n\nSpeaker 1 28:51: Yes, I'm hoping as well, because I'm feeling the most at ease with executive search. Also do my experience, just because when you start speaking with these kinds, these level of candidates, if they want to go for a process, they will go the whole way when you go for mid level management or sales people before you know, yeah, I don't, I'm not really sure I want to go for it, stuff like that. And that's quite frustrating. That makes it pisses me off\n\nInterviewer 29:23: a waste of time.\n\nSpeaker 1 29:25: Yeah, exactly. And again, that's all about it. I always look for the shortest way between a job intake and an offer or a signed offer. Let's put it that way. And that's that works, pretty much. But I know as an HR manager, I'm really disruptive, because you have 25 YS sales experience, most of it in the HR business, but that's an advantage when you need to interact with sales leaders, because I speak the same language, and it's also convenient to interview salespeople because, yeah, you quite, quite quickly identify those who try to bullshit you, or those who are really straightforward about their statement.\n\nInterviewer 30:12: Yeah, brilliant. I get it. Thank you. I thank you. That's been really helpful, and it's been really a pleasure meeting you. Likewise,\n\nSpeaker 1 30:20: if there's any additional input you you need, with pleasure, I would recommend Olivier to a lot of people. I already send him through people from my network when I was an executive search, because he's the only one I trust to follow up properly with people that trust me, brilliant.\n\nInterviewer 30:43: That's great to hear. Fantastic. Thank you very much. And have a lovely weekend when it\n\nSpeaker 1 30:49: comes. Same for you, and take care. Thank you. Thanks. Bye,\n\nSpeaker 2 30:54: bye, bye. Transcribed by https://otter.ai -- 8 of 8 --"
}