{
  "id": "t-033",
  "sourceFile": "T28_NPS9_EMEA_ES_HOUSE_NOV25.pdf",
  "client": "Paul Lester",
  "interviewDate": "2025-11-13",
  "project": "ES",
  "score": 9,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Interviewer 0:00",
      "text": "Both. Nice to meet you. Yeah, I'm good. Thank you. Oh, can you hear me? There's a bit of feedback. I can hear it. Oh, okay. Must be my end. I'll carry on and hope it goes away. Nice to meet you. Thank you for agreeing to take the call. Just a couple of things before I kick off. Are you okay if I record this, I have a broken arm, so it's hard to write notes. Paul Lester 0:25 Well, you've got two arms, so I don't see what the problem is."
    },
    {
      "speaker": "Interviewer 0:29",
      "text": "Well, I do. It just makes it a lot Paul Lester 0:33 harder. Yes, of course, it's not a problem."
    },
    {
      "speaker": "Interviewer 0:35",
      "text": "Thank you. Yeah, it's also my team can help me write them up as well. Paul Lester 0:40 You sure you've broke you've not broke it on purpose,"
    },
    {
      "speaker": "Interviewer 0:43",
      "text": "believe me, that is not something I would do. No. And netball incident Paul Lester 0:51 always a very quiet, gentle game."
    },
    {
      "speaker": "Interviewer 0:54",
      "text": "No, not. If you ask the people in A and E, I think you'll find they'll tell you otherwise, yeah, never mind. These things happen, yeah. Just to introduce myself, so I'm the managing partner at a growth consultancy. We've been working with Korn Ferry now for five years, so we know their business well, and they've asked us to conduct these interviews in the spirit that having an external person doing them, you can speak more freely. That's true. So, yeah, I'll jump straight in. If you could start by just explaining your role in the business and your relationship with Korn Ferry. To date, Paul Lester 1:39 I'm chairman of quite a few different companies in the past, both public companies and private equity. The one I think you're going to talk about was probably McCarthy and Stone, and we went to Korn Ferry to recruit a new chair. But in terms of my relationship with Korn Ferry, it goes back many years. I use them myself to hire people, and they've put me forward and to be hired by other organizations. So it's bit of a two way street, really. For a long time, great."
    },
    {
      "speaker": "Interviewer 2:17",
      "text": "And do you always go to the same person, or does it differ depending Paul Lester 2:21 on the need? It depends if, if somebody's got a chair role, and in the old days it used to be CEO roles who thought I might be interested or appropriate fit, then it could be quite a wide range. It could it could be Giles or Simon on the public company. But then if it's private equity, it's more likely Neil, or, more recently, Eleanor. So it depends on the business, whether it's public company, private equity, and then it's, I'd say, sometimes, the same person, but it's quite spread, right? And in finance, person, Rebecca, okay, very specialized, -- 1 of 6 --"
    },
    {
      "speaker": "Interviewer 3:09",
      "text": "yeah, for specific searches in your suppose your most recent engagements with with them. Why did you choose them over, as opposed to working with a different search firm Paul Lester 3:25 when I turned up as chairman in this last particular business called presidiad. Don't ask me to spell it, but anyway, presid and they used the Korn Ferry to hire me. We then needed a CEO, so that had already just started. So I inherited that the shareholders have kicked that off, and then we've since gone down the route of CFF as well, which I use Korn Ferry, mainly because one of you can pass very good. But also they were already, they already understood the business, and they understood the shareholders. Great. It wasn't, it wasn't, oh, let's have a beauty parade. Yeah, I don't think I've ever had a beauty parade. I mean, I've used Korn Ferry, I've used Russell Reynolds, I've used orches, I would say, if you added it up, I've probably used Korn Ferry 50% of the time when I've ever gone out to search for a senior person."
    },
    {
      "speaker": "Interviewer 4:32",
      "text": "And why is that? Why do you why do you use them? Paul Lester 4:39 And we won't like the answer this, I'd put them all in a similar bracket. If I went to Hodges or Russell Reynolds, they will end up, you know, with a pretty good list of candidates and probably the same. I tend to go to Korn Ferry because I actually like the people, and I get on with them, and I just find they know me, yeah, I haven't got to, you know, be on my best behavior when I talk to but"
    },
    {
      "speaker": "Interviewer 5:09",
      "text": "it's important that that relationship. And Paul Lester 5:13 of course, they've contacted me about positions as well. So and so the others, Russell Reynolds, have placed me at least two, if not three times, and Korn Ferry probably three or four times. So yeah, I think you tend to favor the people that have placed you. You can't help it. It's in the back of your head somewhere. I would still pick whoever I thought was the best person for the job."
    },
    {
      "speaker": "Interviewer 5:36",
      "text": "Yeah, and having been through that experience, both on a candidate side and obviously on the client side, How was the experience for you? So I'm thinking specifically, well, let's start at the client, because that's where we were talking about in the first place. But in terms of them helping build out the scope or the need of the person, how much do they get involved at that kind of first end, or is it pretty much Tid up before you engage with them? Paul Lester 6:04 No, though, I'd say it's 5050, you're, you know, you tell them, I want a new CEO, just get on with it. No, you usually go through what, what the business needs, and then they, I'd say they do 75% of it, and they ask you enough questions to build up that 75% I would say that's pretty typical, because I know I need a new, let's say CEO or LED sitting on the board. You explain what you would like, the type of background that person would be ideal. All the qualities that you'd expect from that person. You have to put it in the bit, in the context of, where is the business? Is it struggling? Is it doing well? Is it ticking along? You know, you got to spell all that out, obviously. And and then they fill connect all the dots up and end up with a pretty good description of the type of person that hopefully you're going to find. I mean, you never find the perfect person where they do like a matrix of boxes. On the right, they've got everything you've ever wished for, and on the left, they've got nothing that you wish for. So the dots tend to be a little bit all over the place, preferably obviously to the right hand side, which they they do, because there's never such a thing as the perfect person that you've specified. And then, of course, the real test is when you meet them and get into referencing as well. So that's really important as well."
    },
    {
      "speaker": "Interviewer 7:44",
      "text": "Yeah, absolutely. I mean in terms of quality and and both quantities. So choice. Have they met your expectations in the previous engagements you've had? -- 2 of 6 -- Paul Lester 7:56 Yeah, I'd say the last one's the toughest one they've had, which took quite many months, mainly because it was a very specific market house building. And it's a bit of a group of people that actually don't change jobs that often. This is actually not that many house builders in terms of the size of the ones. There's hundreds that build two or three houses. But we're talking a few 1000 plus. So yeah, that's limited, and they were asked to think outside the box and not just stay as pure house builders, which they did. We ended up with a house builder and a good one, I hope. And they've got quite good knowledge of the people. They've got some specialists in that market. So, you know, you can bounce names around. You can you can give them ideas. They can come up with plenty of thoughts about different people. I'm not necessarily host builder, so it's quite a difficult task. Where's the"
    },
    {
      "speaker": "Interviewer 9:04",
      "text": "where's the biggest value to you in terms of going through this process, given you know how sometimes niche the task can be, is it around the power of the individual black book? Is it about their ability to work in partnership with you and kind of really dig into the problem and think laterally about how to solve it. What's, what's the most important thing for you? Paul Lester 9:24 It depends on the assignment. If it's, I want somebody from this industry that makes it easy. But as you can say, this is quite a narrow industry, but we've been looking in, I think it's, I think it's more where they continue to ask you questions about the type of person, because there's they're building in their heads on pieces of paper that the sort of profile, and that profile can change slightly depending on, you know, you see a couple of candidates, and that sets you off to say, well, they were great, but what they Haven't got is this, this and this, and, you know, it builds up a much more accurate picture of the type of person you want. But I think they do have, yeah, obviously they have a black book so, so to speak. But their researchers can come up with people none of us know as well. I mean, I do know most of the people in the house building industry so but I know 85 90% are going to be available. So it's good, it's a good exercise. But if it's general industry, which I'm involved in as well, you haven't got a hope of knowing a fraction of so many companies, industrial companies. And then if it's international, you've got the whole new Europe or the states or wherever. So you know you do rely on the fact that they might know people, because, of course they do, but it's their researchers finding you know good candidates as well. You need both Absolutely."
    },
    {
      "speaker": "Interviewer 11:00",
      "text": "Is there any part of the process when working on a live project with them that you feel I could do better on? Paul Lester 11:08 Yeah, the only thing I would say is they, we used to have weekly updates, bi weekly, but I think it ended up weekly for various reasons, and they would always send the book out, usually in the morning, two hours before the meeting, and we've got time to look at it. You just haven't got time to look at it, not if you're busy, you know. And so I'd say that's the only thing that used to go, Well, I haven't got the information for this meeting, then suddenly the email would go and, I mean, even 10 minutes before. Now did it matter? Because they tend to go through it on the screen, but it'd be really good to get that, I'd say the night before, because you can then leaf through it, read it, or it speeds up the meeting. You can cancel a couple of the guys or females that you don't think would do a good job, and I think it would just be a better way of doing it. Otherwise, you're seeing it on the screen for the first time, and it's just just Labour's out the meeting. So I think that that would be my biggest criticism of them, but merchant bankers do it as well. A lot of people do it. I think having it the night before, where you can actually send your way through it on the screen, makes it a better meeting the next day."
    },
    {
      "speaker": "Interviewer 12:32",
      "text": "Yeah, absolutely. In terms of kind of I suppose their communication style, you said that it was a bi weekly. It moved to weekly. Did were they accessible when you needed them? Did they communicate clearly, kind of where they're at in their process? Paul Lester 12:48 -- 3 of 6 -- Yeah, yeah. Allan in particular is very good to send taxes little updates in Texas all the way through early but they were definitely accessible. Yeah, no, no, don't"
    },
    {
      "speaker": "Interviewer 13:03",
      "text": "great in in terms of Korn Ferry is kind of wider offering, but staying within search. Did you use any of their other tools, like the assess tool or pay benchmarks to help with this? With these searches, Paul Lester 13:21 definitely pay we we do ask them to make sure we're not smoking something on salaries. In fact, you know, they want to know what the existing salary is, or, very rare, is a brand new job. It's usually taking somebody else's job. So they always ask for that and about bonuses and l tips and management incentive plans, when they ask you all that, and they will give an opinion on it, if is that, is that attractive enough to get the type of person you've described you want? So definitely on the search side, haven't done any assessment stuff with I don't know why, but we didn't okay? Is that I wasn't that Sure. I didn't know they had an assessment. Or there"
    },
    {
      "speaker": "Interviewer 14:12",
      "text": "we go. That's helpful. Okay, great. In terms of how they compare to the likes of Russell Reynolds, What? What? What's the biggest difference, if any? Paul Lester 14:25 That's a good question. I always feel with Korn Ferry sounds a bit old. There's more people on the job. You know, when we had a meeting, there's like three or four people all involved, searching, giving information. Russell Reynolds, chiefly, one, two, Max, so you feel like there's a team working for you, I'd say not. Doesn't mean to say that guarantees success. It just is more input."
    },
    {
      "speaker": "Interviewer 14:56",
      "text": "Yeah, more likely. Paul Lester 14:58 Well, it's more likely, you know, you're going to get more information about what's going on in your particular market, if you're searching in the market or if you're searching outside, yeah, but there's always about four people on our core rentals. I guarantee it's two Max,"
    },
    {
      "speaker": "Interviewer 15:15",
      "text": "okay, and in terms of, I suppose you know how search and general business is changing in terms of the use of tech and tools and platforms. How important is that for you in in this type of world? So in search, Paul Lester 15:36 I think that senior level and or chair level, it's a bit different. Having said that, it will improve. I mean, AI should be able to come up and give you 20 names for a particular task at some point, and they'll have their own in house. Ai, just, why wouldn't you that will happen? So that will cut out everything. A lot of the boring stuff, and I was gonna say should make it cheaper, but that's unlikely, but it might speed up the process. Is speed important that's coming down the path? There's no doubt about it. Yeah, but the thing is, what I like about Korn Ferry and Russell Reynolds. They tend to know the people, so they've got an opinion on them, you know. And it's not, it's a sensible opinion, you know, warts and all, the type of person they are, you know, which is quite important, you get a bit of a sense for the what that person is all about. But obviously you could go the whole hog and do full assessments to see if their personality fit. And I know some headhunters do that. But I think if you go down in your organization the level that sits below the CEO, I've used it for that,"
    },
    {
      "speaker": "Interviewer 17:02",
      "text": "just touching on your point on price. How do they fare on price? What's your view on their price structure? Paul Lester 17:10 I think the CMA should investigate it, because they're all pretty similar. They all are. You could throw a small blanket over Russell renalson, she comes under and Rogers and, yeah, they've all got the same Spencer. So they've all got the same formula based on center to the salary and stuff. So, you know, -- 4 of 6 -- you just got to accept that. That's That's it. I would say the money on this last one, because it got dragged out for quite a long time. So they certainly put the effort in. Sometimes you can get very lucky quickly, and you go, bloody hell. Paid them all this money and and it was somebody I knew."
    },
    {
      "speaker": "Interviewer 17:57",
      "text": "And in terms of your, I suppose your whole brand experience. Have Korn Ferry. What's your your view on them in with a wider view, thinking about every engagement that you've had? Paul Lester 18:12 Well, I think, I think this is quite important. They are big, and everybody's heard of them, so that when they're making contact with somebody, that person is going to answer the phone, answer the email, answer the text. If you go into a boutique key, I'd still say send for Russell Reynolds or something like that. But if you go into a boutique key, one, which you do occasionally because they're very specialized in something. Then you go, I wonder if the right, you know, I mean, I've, I've had calls from strange people where my EA said, got so and so wouldn't say what it is. And I'd never crossed my mind that it might have been a headhunter, just a company never heard of. Trying to get hold of you isn't something I'm gonna answer if they won't tell you what it's about? Yeah, won't tell your office what it's about because you just, you know it happens all the time. People trying to sell you six tickets for a cricket match and all that stuff. Okay, so I think, I think it's a powerful it's a powerful brand that you know you're going to respond to it. And they've got good reach. I mean, they're very international."
    },
    {
      "speaker": "Interviewer 19:25",
      "text": "Is there anything you'd like to see from them more or that would be beneficial to you? Yeah, more jobs. Okay. Paul Lester 19:40 No, I don't they're very good at tracking people like myself, because if you're chairing four or five businesses, they do drop off the wagon where you sell the seller business. Usually sell a business or your time timed out, and they've got a good system where they pick that up, and then they usually contact you and say, by the way, we've got so and so coming up. Are you interested? You know, I mean, they're good at that, which is quite nice,"
    },
    {
      "speaker": "Interviewer 20:11",
      "text": "but, yeah, would you be interested any in I suppose, any more. I mean, it feels like you've had a lot of engagement with them. So it was kind of like a peer to peer network events or anything like that. Would that be of interest? Paul Lester 20:26 Yeah, I put myself as a pretty good networker. I do go into one of their events. I think it's next week or the week after a cocktail evening. So, you know, I quite like going to those events and meeting people and meeting your peers. They're good at that, so, but they do it about right? Because you spend your life doing it, yeah, it's good to dip into those things from time to time, as you meet people you haven't seen for a while, basically,"
    },
    {
      "speaker": "Interviewer 20:54",
      "text": "yeah, and then taking a broader step of back on Korn Ferry, you know they're beyond search. Have you ever used them or considered using them for for a more organization, consultancy, support, across any of your your Paul Lester 21:08 business, they wouldn't register in my head, because they've never pushed it. You know, perhaps that's something they should do. They don't particularly talk about that side of the business. Their practices need a bit more joined up thinking, Yeah, okay,"
    },
    {
      "speaker": "Interviewer 21:24",
      "text": "that's really helpful. I think that's it, unless there's anything else specifically you wanted to call out on, on any specific job, or more generically, I think probably we've got everything we need. Paul Lester 21:37 Yeah, yeah. I mean, good, yeah, right. Yeah. -- 5 of 6 --"
    },
    {
      "speaker": "Interviewer 21:42",
      "text": "Excellent. Well, I'll feed that back to them. Thank you very much for your time. Really appreciate. It Nice to meet you. Yeah, really lovely to meet you, too. Thanks, Paul. Take care, bye, and you bye, bye. Transcribed by https://otter.ai -- 6 of 6 --"
    }
  ],
  "rawText": "Interviewer 0:00: Both. Nice to meet you. Yeah, I'm good. Thank you. Oh, can you hear me? There's a bit of feedback. I can hear it. Oh, okay. Must be my end. I'll carry on and hope it goes away. Nice to meet you. Thank you for agreeing to take the call. Just a couple of things before I kick off. Are you okay if I record this, I have a broken arm, so it's hard to write notes. Paul Lester 0:25 Well, you've got two arms, so I don't see what the problem is.\n\nInterviewer 0:29: Well, I do. It just makes it a lot Paul Lester 0:33 harder. Yes, of course, it's not a problem.\n\nInterviewer 0:35: Thank you. Yeah, it's also my team can help me write them up as well. Paul Lester 0:40 You sure you've broke you've not broke it on purpose,\n\nInterviewer 0:43: believe me, that is not something I would do. No. And netball incident Paul Lester 0:51 always a very quiet, gentle game.\n\nInterviewer 0:54: No, not. If you ask the people in A and E, I think you'll find they'll tell you otherwise, yeah, never mind. These things happen, yeah. Just to introduce myself, so I'm the managing partner at a growth consultancy. We've been working with Korn Ferry now for five years, so we know their business well, and they've asked us to conduct these interviews in the spirit that having an external person doing them, you can speak more freely. That's true. So, yeah, I'll jump straight in. If you could start by just explaining your role in the business and your relationship with Korn Ferry. To date, Paul Lester 1:39 I'm chairman of quite a few different companies in the past, both public companies and private equity. The one I think you're going to talk about was probably McCarthy and Stone, and we went to Korn Ferry to recruit a new chair. But in terms of my relationship with Korn Ferry, it goes back many years. I use them myself to hire people, and they've put me forward and to be hired by other organizations. So it's bit of a two way street, really. For a long time, great.\n\nInterviewer 2:17: And do you always go to the same person, or does it differ depending Paul Lester 2:21 on the need? It depends if, if somebody's got a chair role, and in the old days it used to be CEO roles who thought I might be interested or appropriate fit, then it could be quite a wide range. It could it could be Giles or Simon on the public company. But then if it's private equity, it's more likely Neil, or, more recently, Eleanor. So it depends on the business, whether it's public company, private equity, and then it's, I'd say, sometimes, the same person, but it's quite spread, right? And in finance, person, Rebecca, okay, very specialized, -- 1 of 6 --\n\nInterviewer 3:09: yeah, for specific searches in your suppose your most recent engagements with with them. Why did you choose them over, as opposed to working with a different search firm Paul Lester 3:25 when I turned up as chairman in this last particular business called presidiad. Don't ask me to spell it, but anyway, presid and they used the Korn Ferry to hire me. We then needed a CEO, so that had already just started. So I inherited that the shareholders have kicked that off, and then we've since gone down the route of CFF as well, which I use Korn Ferry, mainly because one of you can pass very good. But also they were already, they already understood the business, and they understood the shareholders. Great. It wasn't, it wasn't, oh, let's have a beauty parade. Yeah, I don't think I've ever had a beauty parade. I mean, I've used Korn Ferry, I've used Russell Reynolds, I've used orches, I would say, if you added it up, I've probably used Korn Ferry 50% of the time when I've ever gone out to search for a senior person.\n\nInterviewer 4:32: And why is that? Why do you why do you use them? Paul Lester 4:39 And we won't like the answer this, I'd put them all in a similar bracket. If I went to Hodges or Russell Reynolds, they will end up, you know, with a pretty good list of candidates and probably the same. I tend to go to Korn Ferry because I actually like the people, and I get on with them, and I just find they know me, yeah, I haven't got to, you know, be on my best behavior when I talk to but\n\nInterviewer 5:09: it's important that that relationship. And Paul Lester 5:13 of course, they've contacted me about positions as well. So and so the others, Russell Reynolds, have placed me at least two, if not three times, and Korn Ferry probably three or four times. So yeah, I think you tend to favor the people that have placed you. You can't help it. It's in the back of your head somewhere. I would still pick whoever I thought was the best person for the job.\n\nInterviewer 5:36: Yeah, and having been through that experience, both on a candidate side and obviously on the client side, How was the experience for you? So I'm thinking specifically, well, let's start at the client, because that's where we were talking about in the first place. But in terms of them helping build out the scope or the need of the person, how much do they get involved at that kind of first end, or is it pretty much Tid up before you engage with them? Paul Lester 6:04 No, though, I'd say it's 5050, you're, you know, you tell them, I want a new CEO, just get on with it. No, you usually go through what, what the business needs, and then they, I'd say they do 75% of it, and they ask you enough questions to build up that 75% I would say that's pretty typical, because I know I need a new, let's say CEO or LED sitting on the board. You explain what you would like, the type of background that person would be ideal. All the qualities that you'd expect from that person. You have to put it in the bit, in the context of, where is the business? Is it struggling? Is it doing well? Is it ticking along? You know, you got to spell all that out, obviously. And and then they fill connect all the dots up and end up with a pretty good description of the type of person that hopefully you're going to find. I mean, you never find the perfect person where they do like a matrix of boxes. On the right, they've got everything you've ever wished for, and on the left, they've got nothing that you wish for. So the dots tend to be a little bit all over the place, preferably obviously to the right hand side, which they they do, because there's never such a thing as the perfect person that you've specified. And then, of course, the real test is when you meet them and get into referencing as well. So that's really important as well.\n\nInterviewer 7:44: Yeah, absolutely. I mean in terms of quality and and both quantities. So choice. Have they met your expectations in the previous engagements you've had? -- 2 of 6 -- Paul Lester 7:56 Yeah, I'd say the last one's the toughest one they've had, which took quite many months, mainly because it was a very specific market house building. And it's a bit of a group of people that actually don't change jobs that often. This is actually not that many house builders in terms of the size of the ones. There's hundreds that build two or three houses. But we're talking a few 1000 plus. So yeah, that's limited, and they were asked to think outside the box and not just stay as pure house builders, which they did. We ended up with a house builder and a good one, I hope. And they've got quite good knowledge of the people. They've got some specialists in that market. So, you know, you can bounce names around. You can you can give them ideas. They can come up with plenty of thoughts about different people. I'm not necessarily host builder, so it's quite a difficult task. Where's the\n\nInterviewer 9:04: where's the biggest value to you in terms of going through this process, given you know how sometimes niche the task can be, is it around the power of the individual black book? Is it about their ability to work in partnership with you and kind of really dig into the problem and think laterally about how to solve it. What's, what's the most important thing for you? Paul Lester 9:24 It depends on the assignment. If it's, I want somebody from this industry that makes it easy. But as you can say, this is quite a narrow industry, but we've been looking in, I think it's, I think it's more where they continue to ask you questions about the type of person, because there's they're building in their heads on pieces of paper that the sort of profile, and that profile can change slightly depending on, you know, you see a couple of candidates, and that sets you off to say, well, they were great, but what they Haven't got is this, this and this, and, you know, it builds up a much more accurate picture of the type of person you want. But I think they do have, yeah, obviously they have a black book so, so to speak. But their researchers can come up with people none of us know as well. I mean, I do know most of the people in the house building industry so but I know 85 90% are going to be available. So it's good, it's a good exercise. But if it's general industry, which I'm involved in as well, you haven't got a hope of knowing a fraction of so many companies, industrial companies. And then if it's international, you've got the whole new Europe or the states or wherever. So you know you do rely on the fact that they might know people, because, of course they do, but it's their researchers finding you know good candidates as well. You need both Absolutely.\n\nInterviewer 11:00: Is there any part of the process when working on a live project with them that you feel I could do better on? Paul Lester 11:08 Yeah, the only thing I would say is they, we used to have weekly updates, bi weekly, but I think it ended up weekly for various reasons, and they would always send the book out, usually in the morning, two hours before the meeting, and we've got time to look at it. You just haven't got time to look at it, not if you're busy, you know. And so I'd say that's the only thing that used to go, Well, I haven't got the information for this meeting, then suddenly the email would go and, I mean, even 10 minutes before. Now did it matter? Because they tend to go through it on the screen, but it'd be really good to get that, I'd say the night before, because you can then leaf through it, read it, or it speeds up the meeting. You can cancel a couple of the guys or females that you don't think would do a good job, and I think it would just be a better way of doing it. Otherwise, you're seeing it on the screen for the first time, and it's just just Labour's out the meeting. So I think that that would be my biggest criticism of them, but merchant bankers do it as well. A lot of people do it. I think having it the night before, where you can actually send your way through it on the screen, makes it a better meeting the next day.\n\nInterviewer 12:32: Yeah, absolutely. In terms of kind of I suppose their communication style, you said that it was a bi weekly. It moved to weekly. Did were they accessible when you needed them? Did they communicate clearly, kind of where they're at in their process? Paul Lester 12:48 -- 3 of 6 -- Yeah, yeah. Allan in particular is very good to send taxes little updates in Texas all the way through early but they were definitely accessible. Yeah, no, no, don't\n\nInterviewer 13:03: great in in terms of Korn Ferry is kind of wider offering, but staying within search. Did you use any of their other tools, like the assess tool or pay benchmarks to help with this? With these searches, Paul Lester 13:21 definitely pay we we do ask them to make sure we're not smoking something on salaries. In fact, you know, they want to know what the existing salary is, or, very rare, is a brand new job. It's usually taking somebody else's job. So they always ask for that and about bonuses and l tips and management incentive plans, when they ask you all that, and they will give an opinion on it, if is that, is that attractive enough to get the type of person you've described you want? So definitely on the search side, haven't done any assessment stuff with I don't know why, but we didn't okay? Is that I wasn't that Sure. I didn't know they had an assessment. Or there\n\nInterviewer 14:12: we go. That's helpful. Okay, great. In terms of how they compare to the likes of Russell Reynolds, What? What? What's the biggest difference, if any? Paul Lester 14:25 That's a good question. I always feel with Korn Ferry sounds a bit old. There's more people on the job. You know, when we had a meeting, there's like three or four people all involved, searching, giving information. Russell Reynolds, chiefly, one, two, Max, so you feel like there's a team working for you, I'd say not. Doesn't mean to say that guarantees success. It just is more input.\n\nInterviewer 14:56: Yeah, more likely. Paul Lester 14:58 Well, it's more likely, you know, you're going to get more information about what's going on in your particular market, if you're searching in the market or if you're searching outside, yeah, but there's always about four people on our core rentals. I guarantee it's two Max,\n\nInterviewer 15:15: okay, and in terms of, I suppose you know how search and general business is changing in terms of the use of tech and tools and platforms. How important is that for you in in this type of world? So in search, Paul Lester 15:36 I think that senior level and or chair level, it's a bit different. Having said that, it will improve. I mean, AI should be able to come up and give you 20 names for a particular task at some point, and they'll have their own in house. Ai, just, why wouldn't you that will happen? So that will cut out everything. A lot of the boring stuff, and I was gonna say should make it cheaper, but that's unlikely, but it might speed up the process. Is speed important that's coming down the path? There's no doubt about it. Yeah, but the thing is, what I like about Korn Ferry and Russell Reynolds. They tend to know the people, so they've got an opinion on them, you know. And it's not, it's a sensible opinion, you know, warts and all, the type of person they are, you know, which is quite important, you get a bit of a sense for the what that person is all about. But obviously you could go the whole hog and do full assessments to see if their personality fit. And I know some headhunters do that. But I think if you go down in your organization the level that sits below the CEO, I've used it for that,\n\nInterviewer 17:02: just touching on your point on price. How do they fare on price? What's your view on their price structure? Paul Lester 17:10 I think the CMA should investigate it, because they're all pretty similar. They all are. You could throw a small blanket over Russell renalson, she comes under and Rogers and, yeah, they've all got the same Spencer. So they've all got the same formula based on center to the salary and stuff. So, you know, -- 4 of 6 -- you just got to accept that. That's That's it. I would say the money on this last one, because it got dragged out for quite a long time. So they certainly put the effort in. Sometimes you can get very lucky quickly, and you go, bloody hell. Paid them all this money and and it was somebody I knew.\n\nInterviewer 17:57: And in terms of your, I suppose your whole brand experience. Have Korn Ferry. What's your your view on them in with a wider view, thinking about every engagement that you've had? Paul Lester 18:12 Well, I think, I think this is quite important. They are big, and everybody's heard of them, so that when they're making contact with somebody, that person is going to answer the phone, answer the email, answer the text. If you go into a boutique key, I'd still say send for Russell Reynolds or something like that. But if you go into a boutique key, one, which you do occasionally because they're very specialized in something. Then you go, I wonder if the right, you know, I mean, I've, I've had calls from strange people where my EA said, got so and so wouldn't say what it is. And I'd never crossed my mind that it might have been a headhunter, just a company never heard of. Trying to get hold of you isn't something I'm gonna answer if they won't tell you what it's about? Yeah, won't tell your office what it's about because you just, you know it happens all the time. People trying to sell you six tickets for a cricket match and all that stuff. Okay, so I think, I think it's a powerful it's a powerful brand that you know you're going to respond to it. And they've got good reach. I mean, they're very international.\n\nInterviewer 19:25: Is there anything you'd like to see from them more or that would be beneficial to you? Yeah, more jobs. Okay. Paul Lester 19:40 No, I don't they're very good at tracking people like myself, because if you're chairing four or five businesses, they do drop off the wagon where you sell the seller business. Usually sell a business or your time timed out, and they've got a good system where they pick that up, and then they usually contact you and say, by the way, we've got so and so coming up. Are you interested? You know, I mean, they're good at that, which is quite nice,\n\nInterviewer 20:11: but, yeah, would you be interested any in I suppose, any more. I mean, it feels like you've had a lot of engagement with them. So it was kind of like a peer to peer network events or anything like that. Would that be of interest? Paul Lester 20:26 Yeah, I put myself as a pretty good networker. I do go into one of their events. I think it's next week or the week after a cocktail evening. So, you know, I quite like going to those events and meeting people and meeting your peers. They're good at that, so, but they do it about right? Because you spend your life doing it, yeah, it's good to dip into those things from time to time, as you meet people you haven't seen for a while, basically,\n\nInterviewer 20:54: yeah, and then taking a broader step of back on Korn Ferry, you know they're beyond search. Have you ever used them or considered using them for for a more organization, consultancy, support, across any of your your Paul Lester 21:08 business, they wouldn't register in my head, because they've never pushed it. You know, perhaps that's something they should do. They don't particularly talk about that side of the business. Their practices need a bit more joined up thinking, Yeah, okay,\n\nInterviewer 21:24: that's really helpful. I think that's it, unless there's anything else specifically you wanted to call out on, on any specific job, or more generically, I think probably we've got everything we need. Paul Lester 21:37 Yeah, yeah. I mean, good, yeah, right. Yeah. -- 5 of 6 --\n\nInterviewer 21:42: Excellent. Well, I'll feed that back to them. Thank you very much for your time. Really appreciate. It Nice to meet you. Yeah, really lovely to meet you, too. Thanks, Paul. Take care, bye, and you bye, bye. Transcribed by https://otter.ai -- 6 of 6 --"
}