{
  "id": "t-034",
  "sourceFile": "T29_NPS10_NA_CONSULTING_HOUSE_DEC25.pdf",
  "client": "Joanne DeSantis",
  "interviewDate": "2025-12-08",
  "project": "Consulting",
  "score": 10,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Interviewer 2:29",
      "text": "so I I'm the managing partner of a management consultancy we work with Korn Ferry. Okay? We have done for the last five years. So we know their business world, and they've asked us to conduct these interviews as an impartial third party to encourage a more free conversation. Joanne DeSantis 2:50 That's great. That's great. Good. That's good that they're doing that."
    },
    {
      "speaker": "Interviewer 2:54",
      "text": "Yeah, great. And so just a couple of things before we start to Are you okay if I record this so my team can help write it up. It gets deleted straight afterwards. Brilliant. So that's admin out the way. I'll try not to keep you too long, but if we can kick off with just an introduction to so your role and the relationship that you have with Korn Ferry, Joanne DeSantis 3:20 okay, okay, so my role, I am a PMI, what they call director of community support systems, which essentially is a I have four groups, and We support all aspects of community engagement, I would consider what my teams do almost as a HR type of department for our volunteer engagement activities. And we've got roughly 18,000 volunteers around the world and a lot of staff that supports them. So we provide all of the training, the recruitment for volunteers, governance for our volunteers, recognition, programs, platforms that support their engagement. And that's the area that I head up great."
    },
    {
      "speaker": "Interviewer 4:19",
      "text": "And what were you engaged? What did you engage Korn Ferry to do? Joanne DeSantis 4:26 So I have been personally engaged with Korn Ferry, first as my in my role as man, as the manager of volunteer engagement, and now as the director of community support systems, we brought in Korn Ferry specifically Marion Michaels. She is our Korn Ferry contact to help us revamp, revamp our board of directors election process. She is partner part of our charter for our nominating committee. It's a board committee is to have a independent, third party, talent advisor, consultant as part of the nominating committee. We had worked with some folks in the past, and when I took over the role, I'm going to say, God, I've lost track of time. It's probably six, seven years ago, I looked to bring in a different type of partner to help us, one that could really help us grow in this area. PMI definitely has experienced a lot of growth transformation in terms of who we are and what we serve and our regional activities, and this definitely challenges us to make sure that we bring in the right talent as our board of directors, and that we really improved our recruitment processes for our -- 1 of 6 -- board of directors. How we work with the nomination process, how we assess our the volunteers that are applying or they're answering the nomination the call for nominations, so everything from the board profile to the criteria for selection, how we interview, how we assess, Miriam has been key in helping us build out that program. Since then, that was where we first introduced her, and she is now been an ongoing partner for us, working with different like helping lead whatever Korn Ferry, because we even do the Korn Ferry assessment of our candidates. So we have others at Korn Ferry who support in that candidate assessment process, because we maintain that third party connection to them, and kind of like you are keeping us out of it. So since my my role from manager to Director, I have also then connected her Korn Ferry and two other areas, temporary areas. And the help has been enormously impactful, where she helped us revamp our PMI Fellows Program. It's a very prestigious award, and there are some similarities in how we need to assess candidates, the criteria for selection, the team of volunteers that we put together to do this very thorough assessment in a very fair and transparent way, because it's all up for the, you know, the viewing pleasure of our members, and they're very vocal. So she recently, just finished that project, and it was very, very successful, the changes that we made to that program that was really floundering, and we just had the awards where we saw the results of the first pass of all the changes that were implemented to that program. And it was really, really excellent. The other area where it's just been consultation, just very limited consultation, but they are nonetheless, and which has been very helpful, is in our board volunteer advisory committee. So I have a team that's responsible for the election process for our board of directors, but then I also have another team, supported by a staff member, but with 11 volunteers, and they do all of the assessment of candidates to be appointed to our board committees. So we have the board of directors, and then we have five different board committees, and the be back is what we call them. They are assigned that task where they work through the couple of 100 candidates that come through that process to then do the assessment, the candidate criteria, what we need, working with the committees on what we need for future leadership, to the point where then they do the, you know, the applications and the interviews, and we get it to the point where we then make that appointments or recommendation to our board for approval of our candidate appointments. Miriam, again, helped us with that process. The process was really tight because we had just done a lot of work with it before I actually engaged Korn Ferry, but she gave it a quick review, and then she helped us really, kind of a just improve our line of questioning for the candidates, from both the application to the questions that were done in the interviews. And she just, God bless her. She just did that of the goodness of our heart. She just, you know, she does a lot of work with us. She had known that there was a lot of work that had already been done on that process, but we had some questions, and she just jumped right in. And was like, yep, let me just take a quick look and give you some feedback. And yeah, she helped us with that as well. So, right, it's been good."
    },
    {
      "speaker": "Interviewer 10:28",
      "text": "Did you when you selected Korn Ferry? Did you look at other firms that could do the same thing? What was it that made you choose them? Joanne DeSantis 10:36 Actually, I did, but not a lot, because Korn Ferry came highly recommended from somebody who is in a different Association. They had worked with us at PMI. They -- 2 of 6 -- had since left, gone to a different Association, and they didn't. They weren't referring Korn Ferry, per se, they were referring what was it hey group at the time? Yeah, yes, that's right, yeah. So they had their contact with Hay Group, and they were they raved about their contact with Hey group and just how that process went. I connected with that contact, and she made the introduction to Korn Ferry. And you know, she did a thorough assessment of what we needed. She made the connection, and then I reached out and started just talking through what PMI needed, what my long term goals were, what was written on our charter was really very minimal. It was just like we needed a third party to just kind of make sure that we follow the rules. And that wasn't all I was looking for. I really wanted a kind of a strategic partner in this space to help us move that level of leadership along. And it was a long road getting us to have our board kind of step back and listen to, you know, some of the, you know, from from the board, like, like, what we needed in the board in terms of leadership, and then how that translated to the candidates that we Were selecting. It was, it was a lot of education that she needed to do when we first came on, and we had to take it in small pieces. But little by little, over the past, like five years, we've increased the scope a bit, not a lot, but we've certainly have increased the impact that it has had. But that's how I landed with Korn Ferry. It was really through that introduction and they and as soon as I met with them and heard what they were doing with other organizations in this space, I immediately felt very comfortable and didn't really have to do too much else than other like desktop research, and I knew I was I was in the right place."
    },
    {
      "speaker": "Interviewer 13:01",
      "text": "So had you heard of them beforehand? I mean, would you, would you have, if you hadn't have been recommended? Joanne DeSantis 13:07 Yeah, would you definitely, I would have. I mean, I had definitely heard of Korn Ferry. We have a leadership program, and there was an assessment that was one of the assessments that were considered. We also, I also connected with our HR team. And our HR team had mentioned Korn Ferry, but honestly they thought at the time that this is how far PMI has gotten. I kind of thought at the time that it was a little overkill, because we had been using a very small, very small mom and pop, like they considered themselves an executive recruiter, and they really did just sit in on our nominating process just to make sure that we followed Our charter. Yeah, so when I went to our talent team and said what I was looking for, because I try to keep them in the loop, they do a lot of executive recruitment and and they thought that was a little bit overkill at the time. But now fast forward, I don't think there is anybody, including because I work directly with our CEO in support of our NomCom we, we 100% rely on that partnership with Miriam with Korn Ferry to help us really step up in the way we are. We are moving through the nominating process of our board of directors."
    },
    {
      "speaker": "Interviewer 14:43",
      "text": "What's been the real value? I mean, in terms of, it sounds like you had a very positive experience, and I saw the results you gave. But can you summarize, I suppose, the experience that you've had with with Miriam and the team? Joanne DeSantis 14:56 -- 3 of 6 -- Yeah, well, first of all, on just like a working level, it's just very, very professional. It's very easy, it's very responsive. So in all those ways that you expect to work with a partner, a consultant, you know, she's she, she and her team, they just completely, you know, hit the ball out of the ballpark. But what I would say is even as important as just that type of working relationship, it's that level of expertise that I don't have. That's why I wanted to bring in somebody who has it, somebody who's working with organizations that are similar in some cases, but very different in other cases. That helps us. You know, she's able to bring, bring different ways of doing what we're doing, like, she's able to bring things to the conversation, to get us to think differently for and that's what I'm sort of paying her for, yeah, you know I'm paying that's what we're paying for, is like, broaden our view here, challenge what we're doing and how we're thinking, and come in with the trends and the data points in this space that I better be paying attention to, because, you know, I've got a team of, like, four teams, around 25 people. This is one stream of work that one of these teams does, and it lasts for about six months out of the year, and it's very, very important, but I definitely will lie on Korn Ferry to be poking holes and helping us be the best we can be, and to help teach us like you know, This is what you should be doing, like AI. So AI was really interesting. You know, it's really, it definitely is making an impact on the recruitment of candidates. So everything from just kind of talking us through some of the pitfalls that other organizations are seeing in this space, how we're using the tools, how we should use the tools, where some of the tools are risky, where it's showing up with candidates, how we might want to combat some of that in the future and better tool up our volunteers that are dealing with this. I mean, that's just one example, but I would say it's definitely, it's what the Korn Ferry team is able to bring to the conversation that helps teach us."
    },
    {
      "speaker": "Interviewer 17:36",
      "text": "And has that been always done through Miriam or she brought in other members of the team to lean into different areas. Joanne DeSantis 17:43 Well, it's I, there are other members of the team that but she's, she's the face. She is definitely the face. I hear her refer to other members of her team that do different parts of it, my team member, Maria, she's the one that really does the day to day work. And Aya as well, they have had some connections with other members of her team, especially in the area of the candidate assessments, those are conducted by other members of her team. She had to bring in one of her other experts from Korn Ferry, when we had a situation with somebody needed some support due to like disability that they had. And yeah, she had to bring somebody else in from her team. But for me, it's mostly Miriam. It is all Miriam."
    },
    {
      "speaker": "Interviewer 18:43",
      "text": "And I mean, is there anything that they could do better, both as, I suppose, as an individual, but also as an organization, Joanne DeSantis 18:52 as an organization, you know, like, I don't think I can, I can fairly answer that what we've needed. Korn Ferry has been very responsive to and has been very helpful in what we needed, even when their work. So through the NomCom, our board got a lot of visibility into the work that we were doing as a committee, and then made the -- 4 of 6 -- connection directly to Korn Ferry to talk more about how they they I mean, again, the conversation started with Miriam. I don't know who else Miriam might have brought into those conversations, but they were separate from the conversations with me, and I was I was happy to see that. I was happy to see that our board of directors thought enough of the work that was happening at the committee level that they tapped in for some expertise from Korn Ferry and some specific areas, who they dealt with there. I don't know. My gut tells me it started with Miriam, and then from there, it may have led to some other folks. But so, you know, could do anything differently, not that I right now, they're very responsive when I have a need. I mean, they're not trying. What I do appreciate is they're not trying to push services. They see a need, they'll recommend some different options. Very fair in terms of the approach. This is what we can do. This is how we can help. But it's all really done in a very, very easy to manage partnership that has developed over the years. Yeah, I don't, I don't know if I can really give you any more than that in terms of how they can, they can do better. I mean, their Invoicing is easy. You know, working through the contract is easy."
    },
    {
      "speaker": "Interviewer 21:13",
      "text": "Would you like, what about things like, kind of value add stuff. So, I mean, would you like to see from them, or would you, I mean, would you get involved in if they invited you to any kind of peer to peer network events? Or did would that be useful? Joanne DeSantis 21:29 Or actually, that would be, I mean, I would welcome that. I mean, right now, one thing that just started, I'm going to say, probably in the last six months or so, I started receiving the newsletter. I love it. I don't get a chance to read it every time, but I save them. Yeah, I save them, I flag them. And, you know, when I have time, I go back and I read them. So I definitely appreciate that peer to peer kind of networking that would always be, because right now, whatever I learn is through Korn Ferry. It's through but I'm not learning from others that are that are facilitating a nominating process or a candidate assessment process like I'm not. I'm not getting out there and networking with people about that. And I don't know if I necessarily would. I mean, it's, it's one of many responsibilities I have, so having Korn Ferry kind of synthesize it and help me take everything that's happening in that kind of space and consolidate it to like, Okay, this is how we should probably apply it to PMI. This is what you should think about. These are some of the trends that are impacting, you know, executive candidate recruitment, blah, blah, blah, how you know, other organizations are dealing with developing their board and their kind of leadership pipeline. It's like, that's what I that's what I'm paying for and but sure, I mean being connected a bit more industry that they have access to definitely would be great training. I mean, they have some of those. They'll have links to some different trainings. That is in the newsletter that's really helpful, trying to think of anything else, nothing, nothing's coming to mind. I mean, I feel like whenever I have a different type of need. I mean, I think one thing is probably better understanding the breadth of what they offer that would be helpful and not to sell it to me, but to make me help me be aware I have a very specific need that Korn Ferry is is serving. And while I am a decision maker in this space, I am oftentimes tapped into for recommendations, and I probably besides for this space, like I really wouldn't know, yeah, where else to point them to? Yeah, where else to point them to? And, I mean, I don't have any authority in those areas -- 5 of 6 -- other than this is the kind of relationship we have. This is how they have been able to help us."
    },
    {
      "speaker": "Interviewer 24:37",
      "text": "Here you have influence. Yeah, right. Okay, that's really helpful. I think that kind of, yeah, okay, fabulous. I mean, I don't, I mean, it's great. You've got a such positive experience. I mean, I don't think there is anything more from my side. It's been really, absolutely helpful. Joanne DeSantis 24:56 So, and, you know, we run about 20 but by the time we get to the interview process, we are interviewing about 25 people. We'll start with about 200 and we'll work our way through the process to these 25 and that's maybe not 25 but maybe it's like 18 or so candidates. All of those candidates go through the Korn Ferry assessment process, yeah, and they meet with a member of the Korn Ferry team to work through what that feedback was, what the test results were, and we do a survey to those candidates that make it to that process, where they they provide feedback directly on the assessment and on Korn Ferry's kind of management of it, and it's been very positive, from a growth opportunity that the assessment provides them to the actual like 45 minutes to an hour meeting that they have With Korn Ferry. We've had board members that go through it and appreciate it, and it's all been good. It's all been good. I think we had one situation where, you know, we had a candidate who couldn't seem to connect with the Korn Ferry representative, and it was like phone tag and email tag and that kind of stuff. And I think that over the, over the five, six years, that was the only escalation I ever had. That was Korn Ferry related. Is this candidate was getting aggravated that they couldn't connect. But it was, I think they were like, I don't know, in Singapore, so time zone issues definitely were, yeah, well, I know that one, yeah, yep. But otherwise, I mean in that Korn Ferry is dealing with all the time with us, and there's only been one instance where we've had a noisy candidate who didn't like the fact that they had to play telephone tag and more than they would have liked, yeah. Otherwise, no, it's been good. All good, brilliant."
    },
    {
      "speaker": "Interviewer 27:03",
      "text": "Well, thank you. That was real, yeah, really helpful, and it was a real pleasure Joanne DeSantis 27:07 to meet you. It was a pleasure meeting you, too. Enjoy the rest of your night. Yeah, thank"
    },
    {
      "speaker": "Interviewer 27:11",
      "text": "you. Have a good day. Okay, bye. Transcribed by https://otter.ai -- 6 of 6 --"
    }
  ],
  "rawText": "Interviewer 2:29: so I I'm the managing partner of a management consultancy we work with Korn Ferry. Okay? We have done for the last five years. So we know their business world, and they've asked us to conduct these interviews as an impartial third party to encourage a more free conversation. Joanne DeSantis 2:50 That's great. That's great. Good. That's good that they're doing that.\n\nInterviewer 2:54: Yeah, great. And so just a couple of things before we start to Are you okay if I record this so my team can help write it up. It gets deleted straight afterwards. Brilliant. So that's admin out the way. I'll try not to keep you too long, but if we can kick off with just an introduction to so your role and the relationship that you have with Korn Ferry, Joanne DeSantis 3:20 okay, okay, so my role, I am a PMI, what they call director of community support systems, which essentially is a I have four groups, and We support all aspects of community engagement, I would consider what my teams do almost as a HR type of department for our volunteer engagement activities. And we've got roughly 18,000 volunteers around the world and a lot of staff that supports them. So we provide all of the training, the recruitment for volunteers, governance for our volunteers, recognition, programs, platforms that support their engagement. And that's the area that I head up great.\n\nInterviewer 4:19: And what were you engaged? What did you engage Korn Ferry to do? Joanne DeSantis 4:26 So I have been personally engaged with Korn Ferry, first as my in my role as man, as the manager of volunteer engagement, and now as the director of community support systems, we brought in Korn Ferry specifically Marion Michaels. She is our Korn Ferry contact to help us revamp, revamp our board of directors election process. She is partner part of our charter for our nominating committee. It's a board committee is to have a independent, third party, talent advisor, consultant as part of the nominating committee. We had worked with some folks in the past, and when I took over the role, I'm going to say, God, I've lost track of time. It's probably six, seven years ago, I looked to bring in a different type of partner to help us, one that could really help us grow in this area. PMI definitely has experienced a lot of growth transformation in terms of who we are and what we serve and our regional activities, and this definitely challenges us to make sure that we bring in the right talent as our board of directors, and that we really improved our recruitment processes for our -- 1 of 6 -- board of directors. How we work with the nomination process, how we assess our the volunteers that are applying or they're answering the nomination the call for nominations, so everything from the board profile to the criteria for selection, how we interview, how we assess, Miriam has been key in helping us build out that program. Since then, that was where we first introduced her, and she is now been an ongoing partner for us, working with different like helping lead whatever Korn Ferry, because we even do the Korn Ferry assessment of our candidates. So we have others at Korn Ferry who support in that candidate assessment process, because we maintain that third party connection to them, and kind of like you are keeping us out of it. So since my my role from manager to Director, I have also then connected her Korn Ferry and two other areas, temporary areas. And the help has been enormously impactful, where she helped us revamp our PMI Fellows Program. It's a very prestigious award, and there are some similarities in how we need to assess candidates, the criteria for selection, the team of volunteers that we put together to do this very thorough assessment in a very fair and transparent way, because it's all up for the, you know, the viewing pleasure of our members, and they're very vocal. So she recently, just finished that project, and it was very, very successful, the changes that we made to that program that was really floundering, and we just had the awards where we saw the results of the first pass of all the changes that were implemented to that program. And it was really, really excellent. The other area where it's just been consultation, just very limited consultation, but they are nonetheless, and which has been very helpful, is in our board volunteer advisory committee. So I have a team that's responsible for the election process for our board of directors, but then I also have another team, supported by a staff member, but with 11 volunteers, and they do all of the assessment of candidates to be appointed to our board committees. So we have the board of directors, and then we have five different board committees, and the be back is what we call them. They are assigned that task where they work through the couple of 100 candidates that come through that process to then do the assessment, the candidate criteria, what we need, working with the committees on what we need for future leadership, to the point where then they do the, you know, the applications and the interviews, and we get it to the point where we then make that appointments or recommendation to our board for approval of our candidate appointments. Miriam, again, helped us with that process. The process was really tight because we had just done a lot of work with it before I actually engaged Korn Ferry, but she gave it a quick review, and then she helped us really, kind of a just improve our line of questioning for the candidates, from both the application to the questions that were done in the interviews. And she just, God bless her. She just did that of the goodness of our heart. She just, you know, she does a lot of work with us. She had known that there was a lot of work that had already been done on that process, but we had some questions, and she just jumped right in. And was like, yep, let me just take a quick look and give you some feedback. And yeah, she helped us with that as well. So, right, it's been good.\n\nInterviewer 10:28: Did you when you selected Korn Ferry? Did you look at other firms that could do the same thing? What was it that made you choose them? Joanne DeSantis 10:36 Actually, I did, but not a lot, because Korn Ferry came highly recommended from somebody who is in a different Association. They had worked with us at PMI. They -- 2 of 6 -- had since left, gone to a different Association, and they didn't. They weren't referring Korn Ferry, per se, they were referring what was it hey group at the time? Yeah, yes, that's right, yeah. So they had their contact with Hay Group, and they were they raved about their contact with Hey group and just how that process went. I connected with that contact, and she made the introduction to Korn Ferry. And you know, she did a thorough assessment of what we needed. She made the connection, and then I reached out and started just talking through what PMI needed, what my long term goals were, what was written on our charter was really very minimal. It was just like we needed a third party to just kind of make sure that we follow the rules. And that wasn't all I was looking for. I really wanted a kind of a strategic partner in this space to help us move that level of leadership along. And it was a long road getting us to have our board kind of step back and listen to, you know, some of the, you know, from from the board, like, like, what we needed in the board in terms of leadership, and then how that translated to the candidates that we Were selecting. It was, it was a lot of education that she needed to do when we first came on, and we had to take it in small pieces. But little by little, over the past, like five years, we've increased the scope a bit, not a lot, but we've certainly have increased the impact that it has had. But that's how I landed with Korn Ferry. It was really through that introduction and they and as soon as I met with them and heard what they were doing with other organizations in this space, I immediately felt very comfortable and didn't really have to do too much else than other like desktop research, and I knew I was I was in the right place.\n\nInterviewer 13:01: So had you heard of them beforehand? I mean, would you, would you have, if you hadn't have been recommended? Joanne DeSantis 13:07 Yeah, would you definitely, I would have. I mean, I had definitely heard of Korn Ferry. We have a leadership program, and there was an assessment that was one of the assessments that were considered. We also, I also connected with our HR team. And our HR team had mentioned Korn Ferry, but honestly they thought at the time that this is how far PMI has gotten. I kind of thought at the time that it was a little overkill, because we had been using a very small, very small mom and pop, like they considered themselves an executive recruiter, and they really did just sit in on our nominating process just to make sure that we followed Our charter. Yeah, so when I went to our talent team and said what I was looking for, because I try to keep them in the loop, they do a lot of executive recruitment and and they thought that was a little bit overkill at the time. But now fast forward, I don't think there is anybody, including because I work directly with our CEO in support of our NomCom we, we 100% rely on that partnership with Miriam with Korn Ferry to help us really step up in the way we are. We are moving through the nominating process of our board of directors.\n\nInterviewer 14:43: What's been the real value? I mean, in terms of, it sounds like you had a very positive experience, and I saw the results you gave. But can you summarize, I suppose, the experience that you've had with with Miriam and the team? Joanne DeSantis 14:56 -- 3 of 6 -- Yeah, well, first of all, on just like a working level, it's just very, very professional. It's very easy, it's very responsive. So in all those ways that you expect to work with a partner, a consultant, you know, she's she, she and her team, they just completely, you know, hit the ball out of the ballpark. But what I would say is even as important as just that type of working relationship, it's that level of expertise that I don't have. That's why I wanted to bring in somebody who has it, somebody who's working with organizations that are similar in some cases, but very different in other cases. That helps us. You know, she's able to bring, bring different ways of doing what we're doing, like, she's able to bring things to the conversation, to get us to think differently for and that's what I'm sort of paying her for, yeah, you know I'm paying that's what we're paying for, is like, broaden our view here, challenge what we're doing and how we're thinking, and come in with the trends and the data points in this space that I better be paying attention to, because, you know, I've got a team of, like, four teams, around 25 people. This is one stream of work that one of these teams does, and it lasts for about six months out of the year, and it's very, very important, but I definitely will lie on Korn Ferry to be poking holes and helping us be the best we can be, and to help teach us like you know, This is what you should be doing, like AI. So AI was really interesting. You know, it's really, it definitely is making an impact on the recruitment of candidates. So everything from just kind of talking us through some of the pitfalls that other organizations are seeing in this space, how we're using the tools, how we should use the tools, where some of the tools are risky, where it's showing up with candidates, how we might want to combat some of that in the future and better tool up our volunteers that are dealing with this. I mean, that's just one example, but I would say it's definitely, it's what the Korn Ferry team is able to bring to the conversation that helps teach us.\n\nInterviewer 17:36: And has that been always done through Miriam or she brought in other members of the team to lean into different areas. Joanne DeSantis 17:43 Well, it's I, there are other members of the team that but she's, she's the face. She is definitely the face. I hear her refer to other members of her team that do different parts of it, my team member, Maria, she's the one that really does the day to day work. And Aya as well, they have had some connections with other members of her team, especially in the area of the candidate assessments, those are conducted by other members of her team. She had to bring in one of her other experts from Korn Ferry, when we had a situation with somebody needed some support due to like disability that they had. And yeah, she had to bring somebody else in from her team. But for me, it's mostly Miriam. It is all Miriam.\n\nInterviewer 18:43: And I mean, is there anything that they could do better, both as, I suppose, as an individual, but also as an organization, Joanne DeSantis 18:52 as an organization, you know, like, I don't think I can, I can fairly answer that what we've needed. Korn Ferry has been very responsive to and has been very helpful in what we needed, even when their work. So through the NomCom, our board got a lot of visibility into the work that we were doing as a committee, and then made the -- 4 of 6 -- connection directly to Korn Ferry to talk more about how they they I mean, again, the conversation started with Miriam. I don't know who else Miriam might have brought into those conversations, but they were separate from the conversations with me, and I was I was happy to see that. I was happy to see that our board of directors thought enough of the work that was happening at the committee level that they tapped in for some expertise from Korn Ferry and some specific areas, who they dealt with there. I don't know. My gut tells me it started with Miriam, and then from there, it may have led to some other folks. But so, you know, could do anything differently, not that I right now, they're very responsive when I have a need. I mean, they're not trying. What I do appreciate is they're not trying to push services. They see a need, they'll recommend some different options. Very fair in terms of the approach. This is what we can do. This is how we can help. But it's all really done in a very, very easy to manage partnership that has developed over the years. Yeah, I don't, I don't know if I can really give you any more than that in terms of how they can, they can do better. I mean, their Invoicing is easy. You know, working through the contract is easy.\n\nInterviewer 21:13: Would you like, what about things like, kind of value add stuff. So, I mean, would you like to see from them, or would you, I mean, would you get involved in if they invited you to any kind of peer to peer network events? Or did would that be useful? Joanne DeSantis 21:29 Or actually, that would be, I mean, I would welcome that. I mean, right now, one thing that just started, I'm going to say, probably in the last six months or so, I started receiving the newsletter. I love it. I don't get a chance to read it every time, but I save them. Yeah, I save them, I flag them. And, you know, when I have time, I go back and I read them. So I definitely appreciate that peer to peer kind of networking that would always be, because right now, whatever I learn is through Korn Ferry. It's through but I'm not learning from others that are that are facilitating a nominating process or a candidate assessment process like I'm not. I'm not getting out there and networking with people about that. And I don't know if I necessarily would. I mean, it's, it's one of many responsibilities I have, so having Korn Ferry kind of synthesize it and help me take everything that's happening in that kind of space and consolidate it to like, Okay, this is how we should probably apply it to PMI. This is what you should think about. These are some of the trends that are impacting, you know, executive candidate recruitment, blah, blah, blah, how you know, other organizations are dealing with developing their board and their kind of leadership pipeline. It's like, that's what I that's what I'm paying for and but sure, I mean being connected a bit more industry that they have access to definitely would be great training. I mean, they have some of those. They'll have links to some different trainings. That is in the newsletter that's really helpful, trying to think of anything else, nothing, nothing's coming to mind. I mean, I feel like whenever I have a different type of need. I mean, I think one thing is probably better understanding the breadth of what they offer that would be helpful and not to sell it to me, but to make me help me be aware I have a very specific need that Korn Ferry is is serving. And while I am a decision maker in this space, I am oftentimes tapped into for recommendations, and I probably besides for this space, like I really wouldn't know, yeah, where else to point them to? Yeah, where else to point them to? And, I mean, I don't have any authority in those areas -- 5 of 6 -- other than this is the kind of relationship we have. This is how they have been able to help us.\n\nInterviewer 24:37: Here you have influence. Yeah, right. Okay, that's really helpful. I think that kind of, yeah, okay, fabulous. I mean, I don't, I mean, it's great. You've got a such positive experience. I mean, I don't think there is anything more from my side. It's been really, absolutely helpful. Joanne DeSantis 24:56 So, and, you know, we run about 20 but by the time we get to the interview process, we are interviewing about 25 people. We'll start with about 200 and we'll work our way through the process to these 25 and that's maybe not 25 but maybe it's like 18 or so candidates. All of those candidates go through the Korn Ferry assessment process, yeah, and they meet with a member of the Korn Ferry team to work through what that feedback was, what the test results were, and we do a survey to those candidates that make it to that process, where they they provide feedback directly on the assessment and on Korn Ferry's kind of management of it, and it's been very positive, from a growth opportunity that the assessment provides them to the actual like 45 minutes to an hour meeting that they have With Korn Ferry. We've had board members that go through it and appreciate it, and it's all been good. It's all been good. I think we had one situation where, you know, we had a candidate who couldn't seem to connect with the Korn Ferry representative, and it was like phone tag and email tag and that kind of stuff. And I think that over the, over the five, six years, that was the only escalation I ever had. That was Korn Ferry related. Is this candidate was getting aggravated that they couldn't connect. But it was, I think they were like, I don't know, in Singapore, so time zone issues definitely were, yeah, well, I know that one, yeah, yep. But otherwise, I mean in that Korn Ferry is dealing with all the time with us, and there's only been one instance where we've had a noisy candidate who didn't like the fact that they had to play telephone tag and more than they would have liked, yeah. Otherwise, no, it's been good. All good, brilliant.\n\nInterviewer 27:03: Well, thank you. That was real, yeah, really helpful, and it was a real pleasure Joanne DeSantis 27:07 to meet you. It was a pleasure meeting you, too. Enjoy the rest of your night. Yeah, thank\n\nInterviewer 27:11: you. Have a good day. Okay, bye. Transcribed by https://otter.ai -- 6 of 6 --"
}