{
  "id": "t-032",
  "sourceFile": "T27_NPS10_NA_ES_HOUSE_NOV25.pdf",
  "client": "Keith VanOrden",
  "interviewDate": "2025-11-13",
  "project": "ES",
  "score": 10,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Interviewer 5:01",
      "text": "No problem at all. All good happens to all of us. Nice to meet you. Nice to meet you as well. Couple of things before we get started. Are you alright? If I record this, it's so my team can help me write it up and also have a wrist so it's bit tricky. It's not bad. It's just annoying. And by way of instruction, I'm Interviewer, so I'm the managing partner at a growth consultancy. We've been working with Korn Ferry for the last five years, so we know their business well, and they've asked us to do these interviews in the spirit of hopefully having a more free and open list conversation, and that's it, really so I'm hoping we won't need our the whole time, but we'll jump straight in if you could, if you could start by explaining your role in the business and your relationship With Korn Ferry to date. VanOrden, Keith 6:00 So I run our retail distribution. Sorry, one second. Very much. That's how late I was. I actually somebody got to bring me coffee, which is very nice. The head of our ETF business, by the way. So we're full service here. I run our retail distribution here at TCW, for the US. Sorry, that was part one. Part two was, what's my relationship with Korn Ferry? So I use, or I partner with Korn Ferry when I need to hire sales people or a sales manager or something where I don't have like a natural network of folks."
    },
    {
      "speaker": "Interviewer 6:55",
      "text": "Oh, sorry, Keith, I lost you for a second there. Can you hear me? I can yes, okay, I think we're back. Great. So I mean, do you use any other search firms alongside Korn Ferry? Are they your go to? I don't they're my go to. And when did that start? What was your first interaction with them? VanOrden, Keith 7:18 My first interaction was with Chris when he was he had a search for Vanguard. This is years at five, seven years ago. I don't remember when, and I actually was a one of the refers, or references, for somebody that they were hiring. And I struck up a conversation with Chris, part of the reason why I was such a big believer in that particular person, the candidate that they were hiring, we just hit it off based on shared beliefs around talent culture. I love the thoroughness from which and the way that he approached the conversation with me, which is something small, right? Like checking the references is like, the like, I don't want to say the least important. It's important. But man, that the detail and the care that he put into that, and he was making it the call himself, it wasn't and maybe that was because of my role. I don't know why, but, like, I've had bad experiences with recruiters in the past, and I was just so impressed that we've continued that conversation. I was at a firm that didn't use recruiters. I was at Blackrock for a while, and so when I came to TCW, I was excited to get to partner with him, and I was in massive growth phase. And so to be able to go and, like, push my attention in one direction, and then know what that Chris and Priya and like, the Korn Ferry team was going to with care and understanding who I was, and like, that's the type of talent we were looking for in the culture, and they operated as an extension of that. It was easy to want to work with them. So the I came to TCW two years ago. I've known Chris maybe for four or five years, I guess. And yeah, just that's the history,"
    },
    {
      "speaker": "Interviewer 9:09",
      "text": "great. And do you always go straight to Chris when you've got a need, or does it vary? No, Chris. Okay, and so it feels like the partnership is important, the relationship between you and Chris and him understanding you in the business is, is that like your your I suppose your primary reason of using -- 1 of 5 -- Korn Ferry is, and I suppose where I'm trying to go to is, How important is other factors, like Chris's network, but also the Korn Ferry brand, and what that brings with it as well. VanOrden, Keith 9:48 It's hard to separate the two meaning, like, Chris is awesome. His network is incredible. I trust him with my business, which is why, like, why I trust him with my business, but the fact that he's with Korn Ferry means that they people pick up the phone and talk to them. I mean, I have trouble. I have a great network of my own. It's been very easy to recruit people to TCW. We affirm that many of them hadn't heard of before I came here, and they've been excited and engaged. But where I don't have a network, when I I'll call somebody, cold call somebody and they're like a sales manager from this firm. Call, that's weird, but when Korn Ferry calls them and tells them about this thing, it's like that extra layer of of authenticity and like importance, and they're honored, and they want to talk to recruiters, because it's good for their career. So Korn Ferry, the brand is important. The nobody wants to piss off Korn Ferry, right? So, like that helps. And then on top of that, I mean, anywhere Chris went, I would go, but, but the fact that he's with Korn Ferry makes it that much better, right?"
    },
    {
      "speaker": "Interviewer 10:56",
      "text": "And in terms of, I suppose, how they compare when it comes to things like, price. Do you have a view on that? VanOrden, Keith 11:03 Yeah, they're crazy expensive, but they're worth it. I mean, there are bargain wholesaler engagements that we could partake in, but like, it's just, yeah, I want great talent."
    },
    {
      "speaker": "Interviewer 11:27",
      "text": "So yeah, they're worth it. Okay, brilliant. And in terms of the experience, you know, end to end, Chris and the team, how does it mean? Obviously, it meets your expectations, because you're speaking very highly of Chris. But is there anything that they can do better in terms of communication, style or cadence of meetings or just project management? I VanOrden, Keith 11:58 don't know. I've been pretty satisfied with it. I mean, I also, I don't know how this would be for everybody else, but, like, I've Chris's line. So if we don't have a regular call set up, I just reach out and we connect almost immediately. So there, if I need more, I kind of get more. And then if I and then if I'm ignoring it, because that's the beauty of hiring a recruiter. And then we'll, I'll find that we'll have, like, a regularly scheduled call where they'll keep me on track, and I can kind of go through everything. So the cadence has been really good, great."
    },
    {
      "speaker": "Interviewer 12:36",
      "text": "And in terms of the quality and also the quantity of candidates, how has that met your expectations? VanOrden, Keith 12:45 Yeah, yeah. I mean, it's hard. I got very lucky with the three, I would say that we've worked with, but, like, I had no idea how to I've never hired a sales desk manager. I don't know how to do it. I don't know. I kind of think I know what they look like, but I don't really you know. And that was my first engagement, and with him, and I ended up with this great person that I never would have uncovered. I never and but then the quality of the folks that we got to look at, it was an impressive slate, and they were all so very different. From a wholesaling perspective, my probably number one wholesaler, I say probably because the year is not over, is somebody that came from Korn Ferry, not these people that I was, like, pulled from Black Rock. The second person that we just hired just came to my event. Like fitting culturally and you know, it's a weird world where I don't know how often Korn Ferry has been in the market in California for an RIA salesperson in the past two years, but I think it the number is more than five, three for sure, right? Talking to my friends that are wholesalers in California on the RA side, the ones that I know that are worthless all have great jobs, and the ones that I know that are incredible have even better jobs. And so it's hard to like, filter through and find that next, like, incredible. And we just got this incredible, talented person, and we had a slate of other folks, like, other potential candidates, and we in LA specifically, had some, like, really hard requirements, because nobody wants to live in Los Angeles, everybody wants to live in San Francisco, or they live in Arizona, and they cover or whatever, or they live two hours south in San Diego. And so being able to get somebody that, like, wants to come into the office, has traveled with Jenny Johnson, the CEO of -- 2 of 5 -- Franklin, so that they'll travel with Katie. They've already traveled with our CEO, but that at the same time, like, rolls up their sleeves and wants to run and can, like, that's not a heart. It's not an easy thing to identify. And it was awesome. And I threw in, like, in both the internal sales desk and the LA one, like, these ridiculous referrals from other people that they then vetted, and they were either good or they weren't. And they're like, they're like, when, when it comes from my side, they're really excited about engaging with them. And when they come and they're not so good, they're like, very nice about, hey, really, is that really, you know? So sorry, that's a long winded answer. I've been very satisfied with the quality of candidates, the diversity of the candidates from an experience perspective, as well as, you know, in whatever fashion you want that to mean. So, yeah, no, I'm very satisfied."
    },
    {
      "speaker": "Interviewer 15:29",
      "text": "Great. Go picking on your point of, you know, what good looks like from, for example, the sales role, how instrumental were the team in helping shape that, that job description and the skills that were needed to succeed. VanOrden, Keith 15:46 So they pushed me on a conversation right like, one of the bad things about being in this business for a long time, I've been managing salespeople since 2004 is I have natural bias about what good looks like, and I have to fight that all the time, because you meet somebody that looks and sounds and shapes like what you think a great salesperson is, and so they force you into this like, what's really important conversation. It just allows you to slow down and think through what the priorities are. So I think I get better candidates as a result of some of that early conversation about what we're looking for, but they also listen like they know what we're trying to build at TCW. They know what's important to me. So they find people that that fit that that kind of jointly agreed upon profile,"
    },
    {
      "speaker": "Interviewer 16:37",
      "text": "great in terms of, in terms of accessing, or you using, kind of, any of the additional tools that Korn Ferry have, especially kind of the, you know, support search, so the the assessment tools, for example, KF or the bench, the payment the pay benchmarking, do you? Did you use any of those? VanOrden, Keith 17:00 I don't use the pay benchmarking. I mean, I look at all of it, but I look at it from every place, and I keep my air to the ground in a lot of ways. And I kind of know, I mean, should we pay what we pay? And we have to understand where we are competitively. But like, once we're there, then then, like that, it is what it is. I like the, is it the KF, whatever the thing is at the end, because everybody's different. And so, you know, like the guy here in Connecticut, or He lives down in Connecticut, you know, these are all like, incredible athletes from what they do, and sometimes they don't want the extra praise, sometimes they need it, sometimes. And so being able to understand, like my newest hire in LA, I wouldn't have said that he needs a massive amount of direction, and that, like, clear measurements are the most important thing to him, but they came out of that, and it's like, Okay, I better make sure that, as I so he was just here in LA, I made sure that I follow, or, sorry, I'm in Boston. He was just here from LA with with the sales team. I made sure that I followed up with him first after thanked him culturally, want him to be aligned, but then reminded him of what the what kind of we're all being measured upon, so that it so it's, I mean, every, no matter where you come from or how gracious we try to be on any entrance, there's always that culture shock. And so like organ acceptance versus rejection is incredibly important to me, and I feel like that smooths that, so I use that, that's, that's actually all you asked is, do I use it? Yes, I use that tool. I find it very helpful."
    },
    {
      "speaker": "Interviewer 18:46",
      "text": "Okay, great. And kind of going beyond search. Have you ever used Korn Ferry for anything other than search? So it, you know, they're an organization consultancy. They do org design development. No. VanOrden, Keith 19:02 Know we talk about it every once in a while, this is one of those areas that like, I don't know if it's just because I'm, like, a needs based person, like, when I need something, I go looking, but I don't often pick my head up and look around. I mean, again, I get great emails, and I should, probably should click them more often than I do, but if I'm not in the middle of something, I It's hard for me to find the time or attention. Even this was probably annoying for you to schedule. And I care about Korn Ferry, and I care about Chris, so I wanted to spend the time, but it took the third one where I was like, Oh shoot. I really got to get that done. So I would love to figure out a way to find time, to spend more time -- 3 of 5 -- thinking about the industry and consulting it, and like helping having other people's insights, but I just don't ever find the time."
    },
    {
      "speaker": "Interviewer 19:53",
      "text": "And if I suppose, reverse that, you know to that point of that finding the time, but the relationship that you have with Chris and the team, would it be useful to you, to fit for them, to offer more of a network, opportunity for you to kind of have that peer to peer group, so it's not selling piece of like, hey, we do this, but just, you know, just to open up kind of different angles of conversation. VanOrden, Keith 20:20 Yes, yeah, I think that would, I mean, I am. It's gonna sound weird, but like, I'm a paying customer of Korn Ferry's, and would like to continue to be. And if networking, and Chris and I have talked about this a little bit, but if networking became a part of that, you know, like, MMI, I don't know how familiar you are with them. I don't know if you're a big fan of them, but it's like the Money Management Institute is, I think, what it stands for. It's this weird group. Weird is a terrible way for me to put this. I'm sorry, sometimes I talk in absolutes or ad adjectives that are inappropriate. It is a group of very impressive investment firms that have decided to come together on a regular basis and just meet amongst ourselves. I find that exhausting. Like it's mostly job interviews, it's mostly people pretending for stuff, and it costs, like, $50,000 just to go hang out with people that I could go see for a cup of coffee for free. But if there was, and, like, they don't talk about anything new and but if it was part of the being a client, we got together with three or four people and had a conversation the next time where you're in New York or the next like, and it started to facilitate some of that stuff. I think it'd be great like Tony. I know all spring is a client of Chris's Tony spots, who I worked with at BlackRock. You know, Tony and I are really good friends. Tom Kylie, who's the same role as Tony and I at Calamos, great guy. Love him. Tom Burt also came from Black Rock. These are all of us have, like spread out. He's at Gollum. We catch up every but man, if there was a forced engagement amongst this peer group that where we could, instead of, like, slowly falling out of touch, which is just what normally happens, yeah, there was some sort of, like, regularly forced but thoughtful engagement. I think that would be helpful."
    },
    {
      "speaker": "Interviewer 22:15",
      "text": "And do you think that would have to be in person, or do you think it can be virtual to given locations in Unknown Speaker 22:21 person. Okay, great,"
    },
    {
      "speaker": "Interviewer 22:23",
      "text": "that's really helpful. Um, I mean, I think that's pretty much it is, I suppose, last question on just things like kind of future tech and how much Korn Ferry lean into that from a search perspective, but also broader, how important is it that they have the latest? Tech available to them on things like search. Yeah, I don't care. It's more about the network and the people. Yeah. I mean, VanOrden, Keith 22:55 yeah, I don't. I mean I, I don't. Not only do I not care. I would hate it if, I mean, I'm trying to send a thank you note to all of my clients. I did it last year. I'm going to do one around Thanksgiving. Sales people tell me who they want me to send it to. I try to keep it super short, and it's just a note of gratitude. I tried to use AI to write it three times, copilot. It's terrible, it's awful, it's long winded, it's superfluous and flowery, or like, it just sounds like nobody wrote it and, and I don't know when AI catches up with the way that I want to talk. I'm from Philadelphia. Maybe I'm a jerk. No, I'm not. But like, maybe I just want to be like to the point sometimes, and it just doesn't get there. And so if, all of a sudden, instead of Priya reaching out and engaging and doing this great search, and she knows the business, and she's got all this experience, there's, like, weird AI searches, and I actually think it would be a disadvantage. There's there are massive advantages to AI. That's real. But like, the reason why we're in the people business is to for people to talk to people. I think that the slower Korn Ferry is to adopt some of the AI stuff at their expense. By the way, probably the better."
    },
    {
      "speaker": "Interviewer 24:15",
      "text": "Okay, that's really interesting. Have it just on the side note for your letter. Have you tried talking to it as opposed to asking it to write it? -- 4 of 5 -- VanOrden, Keith 24:24 Yeah, because I was in my car, I tried talking to it. I just don't like the drafts. I don't and it doesn't ever remember what it wrote before. Every time it's a new thing."
    },
    {
      "speaker": "Interviewer 24:40",
      "text": "If you have a paid for, sorry, we're going slightly off on a tangent. If you have Yeah, so you can say, save this to memory so and your feedback, and it will save it all to then carry on the conversation. I don't know why it doesn't do it automatically, VanOrden, Keith 24:54 but it's out loud. It's so exhausting. Well, I"
    },
    {
      "speaker": "Interviewer 24:57",
      "text": "know it's frustrating, but it's something we learn. We have a we have a whole AI team, and that's something that they told us the other day. I was like, Oh, fair enough. VanOrden, Keith 25:05 That makes perfect sense. Because they're like, it'll learn over time. And I'm like, is it like my is it? Does it learn just from me? Because I want it to learn just from me, so I'll, I'll start telling it to save and learn."
    },
    {
      "speaker": "Interviewer 25:16",
      "text": "Okay, yeah. I mean, not with everything, but if you're carrying on a longer thing, it's a it's useful. Brilliant. Well, okay, slight, hopefully that helps. Lovely to meet you and thanks for taking the time. Do really appreciate it, and we will feed that back to Chris and the team and and other people to know that you're a happy customer. So very much. Thank you. Thanks, Keith, nice to meet you. Bye, bye. Transcribed by https://otter.ai -- 5 of 5 --"
    }
  ],
  "rawText": "Interviewer 5:01: No problem at all. All good happens to all of us. Nice to meet you. Nice to meet you as well. Couple of things before we get started. Are you alright? If I record this, it's so my team can help me write it up and also have a wrist so it's bit tricky. It's not bad. It's just annoying. And by way of instruction, I'm Interviewer, so I'm the managing partner at a growth consultancy. We've been working with Korn Ferry for the last five years, so we know their business well, and they've asked us to do these interviews in the spirit of hopefully having a more free and open list conversation, and that's it, really so I'm hoping we won't need our the whole time, but we'll jump straight in if you could, if you could start by explaining your role in the business and your relationship With Korn Ferry to date. VanOrden, Keith 6:00 So I run our retail distribution. Sorry, one second. Very much. That's how late I was. I actually somebody got to bring me coffee, which is very nice. The head of our ETF business, by the way. So we're full service here. I run our retail distribution here at TCW, for the US. Sorry, that was part one. Part two was, what's my relationship with Korn Ferry? So I use, or I partner with Korn Ferry when I need to hire sales people or a sales manager or something where I don't have like a natural network of folks.\n\nInterviewer 6:55: Oh, sorry, Keith, I lost you for a second there. Can you hear me? I can yes, okay, I think we're back. Great. So I mean, do you use any other search firms alongside Korn Ferry? Are they your go to? I don't they're my go to. And when did that start? What was your first interaction with them? VanOrden, Keith 7:18 My first interaction was with Chris when he was he had a search for Vanguard. This is years at five, seven years ago. I don't remember when, and I actually was a one of the refers, or references, for somebody that they were hiring. And I struck up a conversation with Chris, part of the reason why I was such a big believer in that particular person, the candidate that they were hiring, we just hit it off based on shared beliefs around talent culture. I love the thoroughness from which and the way that he approached the conversation with me, which is something small, right? Like checking the references is like, the like, I don't want to say the least important. It's important. But man, that the detail and the care that he put into that, and he was making it the call himself, it wasn't and maybe that was because of my role. I don't know why, but, like, I've had bad experiences with recruiters in the past, and I was just so impressed that we've continued that conversation. I was at a firm that didn't use recruiters. I was at Blackrock for a while, and so when I came to TCW, I was excited to get to partner with him, and I was in massive growth phase. And so to be able to go and, like, push my attention in one direction, and then know what that Chris and Priya and like, the Korn Ferry team was going to with care and understanding who I was, and like, that's the type of talent we were looking for in the culture, and they operated as an extension of that. It was easy to want to work with them. So the I came to TCW two years ago. I've known Chris maybe for four or five years, I guess. And yeah, just that's the history,\n\nInterviewer 9:09: great. And do you always go straight to Chris when you've got a need, or does it vary? No, Chris. Okay, and so it feels like the partnership is important, the relationship between you and Chris and him understanding you in the business is, is that like your your I suppose your primary reason of using -- 1 of 5 -- Korn Ferry is, and I suppose where I'm trying to go to is, How important is other factors, like Chris's network, but also the Korn Ferry brand, and what that brings with it as well. VanOrden, Keith 9:48 It's hard to separate the two meaning, like, Chris is awesome. His network is incredible. I trust him with my business, which is why, like, why I trust him with my business, but the fact that he's with Korn Ferry means that they people pick up the phone and talk to them. I mean, I have trouble. I have a great network of my own. It's been very easy to recruit people to TCW. We affirm that many of them hadn't heard of before I came here, and they've been excited and engaged. But where I don't have a network, when I I'll call somebody, cold call somebody and they're like a sales manager from this firm. Call, that's weird, but when Korn Ferry calls them and tells them about this thing, it's like that extra layer of of authenticity and like importance, and they're honored, and they want to talk to recruiters, because it's good for their career. So Korn Ferry, the brand is important. The nobody wants to piss off Korn Ferry, right? So, like that helps. And then on top of that, I mean, anywhere Chris went, I would go, but, but the fact that he's with Korn Ferry makes it that much better, right?\n\nInterviewer 10:56: And in terms of, I suppose, how they compare when it comes to things like, price. Do you have a view on that? VanOrden, Keith 11:03 Yeah, they're crazy expensive, but they're worth it. I mean, there are bargain wholesaler engagements that we could partake in, but like, it's just, yeah, I want great talent.\n\nInterviewer 11:27: So yeah, they're worth it. Okay, brilliant. And in terms of the experience, you know, end to end, Chris and the team, how does it mean? Obviously, it meets your expectations, because you're speaking very highly of Chris. But is there anything that they can do better in terms of communication, style or cadence of meetings or just project management? I VanOrden, Keith 11:58 don't know. I've been pretty satisfied with it. I mean, I also, I don't know how this would be for everybody else, but, like, I've Chris's line. So if we don't have a regular call set up, I just reach out and we connect almost immediately. So there, if I need more, I kind of get more. And then if I and then if I'm ignoring it, because that's the beauty of hiring a recruiter. And then we'll, I'll find that we'll have, like, a regularly scheduled call where they'll keep me on track, and I can kind of go through everything. So the cadence has been really good, great.\n\nInterviewer 12:36: And in terms of the quality and also the quantity of candidates, how has that met your expectations? VanOrden, Keith 12:45 Yeah, yeah. I mean, it's hard. I got very lucky with the three, I would say that we've worked with, but, like, I had no idea how to I've never hired a sales desk manager. I don't know how to do it. I don't know. I kind of think I know what they look like, but I don't really you know. And that was my first engagement, and with him, and I ended up with this great person that I never would have uncovered. I never and but then the quality of the folks that we got to look at, it was an impressive slate, and they were all so very different. From a wholesaling perspective, my probably number one wholesaler, I say probably because the year is not over, is somebody that came from Korn Ferry, not these people that I was, like, pulled from Black Rock. The second person that we just hired just came to my event. Like fitting culturally and you know, it's a weird world where I don't know how often Korn Ferry has been in the market in California for an RIA salesperson in the past two years, but I think it the number is more than five, three for sure, right? Talking to my friends that are wholesalers in California on the RA side, the ones that I know that are worthless all have great jobs, and the ones that I know that are incredible have even better jobs. And so it's hard to like, filter through and find that next, like, incredible. And we just got this incredible, talented person, and we had a slate of other folks, like, other potential candidates, and we in LA specifically, had some, like, really hard requirements, because nobody wants to live in Los Angeles, everybody wants to live in San Francisco, or they live in Arizona, and they cover or whatever, or they live two hours south in San Diego. And so being able to get somebody that, like, wants to come into the office, has traveled with Jenny Johnson, the CEO of -- 2 of 5 -- Franklin, so that they'll travel with Katie. They've already traveled with our CEO, but that at the same time, like, rolls up their sleeves and wants to run and can, like, that's not a heart. It's not an easy thing to identify. And it was awesome. And I threw in, like, in both the internal sales desk and the LA one, like, these ridiculous referrals from other people that they then vetted, and they were either good or they weren't. And they're like, they're like, when, when it comes from my side, they're really excited about engaging with them. And when they come and they're not so good, they're like, very nice about, hey, really, is that really, you know? So sorry, that's a long winded answer. I've been very satisfied with the quality of candidates, the diversity of the candidates from an experience perspective, as well as, you know, in whatever fashion you want that to mean. So, yeah, no, I'm very satisfied.\n\nInterviewer 15:29: Great. Go picking on your point of, you know, what good looks like from, for example, the sales role, how instrumental were the team in helping shape that, that job description and the skills that were needed to succeed. VanOrden, Keith 15:46 So they pushed me on a conversation right like, one of the bad things about being in this business for a long time, I've been managing salespeople since 2004 is I have natural bias about what good looks like, and I have to fight that all the time, because you meet somebody that looks and sounds and shapes like what you think a great salesperson is, and so they force you into this like, what's really important conversation. It just allows you to slow down and think through what the priorities are. So I think I get better candidates as a result of some of that early conversation about what we're looking for, but they also listen like they know what we're trying to build at TCW. They know what's important to me. So they find people that that fit that that kind of jointly agreed upon profile,\n\nInterviewer 16:37: great in terms of, in terms of accessing, or you using, kind of, any of the additional tools that Korn Ferry have, especially kind of the, you know, support search, so the the assessment tools, for example, KF or the bench, the payment the pay benchmarking, do you? Did you use any of those? VanOrden, Keith 17:00 I don't use the pay benchmarking. I mean, I look at all of it, but I look at it from every place, and I keep my air to the ground in a lot of ways. And I kind of know, I mean, should we pay what we pay? And we have to understand where we are competitively. But like, once we're there, then then, like that, it is what it is. I like the, is it the KF, whatever the thing is at the end, because everybody's different. And so, you know, like the guy here in Connecticut, or He lives down in Connecticut, you know, these are all like, incredible athletes from what they do, and sometimes they don't want the extra praise, sometimes they need it, sometimes. And so being able to understand, like my newest hire in LA, I wouldn't have said that he needs a massive amount of direction, and that, like, clear measurements are the most important thing to him, but they came out of that, and it's like, Okay, I better make sure that, as I so he was just here in LA, I made sure that I follow, or, sorry, I'm in Boston. He was just here from LA with with the sales team. I made sure that I followed up with him first after thanked him culturally, want him to be aligned, but then reminded him of what the what kind of we're all being measured upon, so that it so it's, I mean, every, no matter where you come from or how gracious we try to be on any entrance, there's always that culture shock. And so like organ acceptance versus rejection is incredibly important to me, and I feel like that smooths that, so I use that, that's, that's actually all you asked is, do I use it? Yes, I use that tool. I find it very helpful.\n\nInterviewer 18:46: Okay, great. And kind of going beyond search. Have you ever used Korn Ferry for anything other than search? So it, you know, they're an organization consultancy. They do org design development. No. VanOrden, Keith 19:02 Know we talk about it every once in a while, this is one of those areas that like, I don't know if it's just because I'm, like, a needs based person, like, when I need something, I go looking, but I don't often pick my head up and look around. I mean, again, I get great emails, and I should, probably should click them more often than I do, but if I'm not in the middle of something, I It's hard for me to find the time or attention. Even this was probably annoying for you to schedule. And I care about Korn Ferry, and I care about Chris, so I wanted to spend the time, but it took the third one where I was like, Oh shoot. I really got to get that done. So I would love to figure out a way to find time, to spend more time -- 3 of 5 -- thinking about the industry and consulting it, and like helping having other people's insights, but I just don't ever find the time.\n\nInterviewer 19:53: And if I suppose, reverse that, you know to that point of that finding the time, but the relationship that you have with Chris and the team, would it be useful to you, to fit for them, to offer more of a network, opportunity for you to kind of have that peer to peer group, so it's not selling piece of like, hey, we do this, but just, you know, just to open up kind of different angles of conversation. VanOrden, Keith 20:20 Yes, yeah, I think that would, I mean, I am. It's gonna sound weird, but like, I'm a paying customer of Korn Ferry's, and would like to continue to be. And if networking, and Chris and I have talked about this a little bit, but if networking became a part of that, you know, like, MMI, I don't know how familiar you are with them. I don't know if you're a big fan of them, but it's like the Money Management Institute is, I think, what it stands for. It's this weird group. Weird is a terrible way for me to put this. I'm sorry, sometimes I talk in absolutes or ad adjectives that are inappropriate. It is a group of very impressive investment firms that have decided to come together on a regular basis and just meet amongst ourselves. I find that exhausting. Like it's mostly job interviews, it's mostly people pretending for stuff, and it costs, like, $50,000 just to go hang out with people that I could go see for a cup of coffee for free. But if there was, and, like, they don't talk about anything new and but if it was part of the being a client, we got together with three or four people and had a conversation the next time where you're in New York or the next like, and it started to facilitate some of that stuff. I think it'd be great like Tony. I know all spring is a client of Chris's Tony spots, who I worked with at BlackRock. You know, Tony and I are really good friends. Tom Kylie, who's the same role as Tony and I at Calamos, great guy. Love him. Tom Burt also came from Black Rock. These are all of us have, like spread out. He's at Gollum. We catch up every but man, if there was a forced engagement amongst this peer group that where we could, instead of, like, slowly falling out of touch, which is just what normally happens, yeah, there was some sort of, like, regularly forced but thoughtful engagement. I think that would be helpful.\n\nInterviewer 22:15: And do you think that would have to be in person, or do you think it can be virtual to given locations in Unknown Speaker 22:21 person. Okay, great,\n\nInterviewer 22:23: that's really helpful. Um, I mean, I think that's pretty much it is, I suppose, last question on just things like kind of future tech and how much Korn Ferry lean into that from a search perspective, but also broader, how important is it that they have the latest? Tech available to them on things like search. Yeah, I don't care. It's more about the network and the people. Yeah. I mean, VanOrden, Keith 22:55 yeah, I don't. I mean I, I don't. Not only do I not care. I would hate it if, I mean, I'm trying to send a thank you note to all of my clients. I did it last year. I'm going to do one around Thanksgiving. Sales people tell me who they want me to send it to. I try to keep it super short, and it's just a note of gratitude. I tried to use AI to write it three times, copilot. It's terrible, it's awful, it's long winded, it's superfluous and flowery, or like, it just sounds like nobody wrote it and, and I don't know when AI catches up with the way that I want to talk. I'm from Philadelphia. Maybe I'm a jerk. No, I'm not. But like, maybe I just want to be like to the point sometimes, and it just doesn't get there. And so if, all of a sudden, instead of Priya reaching out and engaging and doing this great search, and she knows the business, and she's got all this experience, there's, like, weird AI searches, and I actually think it would be a disadvantage. There's there are massive advantages to AI. That's real. But like, the reason why we're in the people business is to for people to talk to people. I think that the slower Korn Ferry is to adopt some of the AI stuff at their expense. By the way, probably the better.\n\nInterviewer 24:15: Okay, that's really interesting. Have it just on the side note for your letter. Have you tried talking to it as opposed to asking it to write it? -- 4 of 5 -- VanOrden, Keith 24:24 Yeah, because I was in my car, I tried talking to it. I just don't like the drafts. I don't and it doesn't ever remember what it wrote before. Every time it's a new thing.\n\nInterviewer 24:40: If you have a paid for, sorry, we're going slightly off on a tangent. If you have Yeah, so you can say, save this to memory so and your feedback, and it will save it all to then carry on the conversation. I don't know why it doesn't do it automatically, VanOrden, Keith 24:54 but it's out loud. It's so exhausting. Well, I\n\nInterviewer 24:57: know it's frustrating, but it's something we learn. We have a we have a whole AI team, and that's something that they told us the other day. I was like, Oh, fair enough. VanOrden, Keith 25:05 That makes perfect sense. Because they're like, it'll learn over time. And I'm like, is it like my is it? Does it learn just from me? Because I want it to learn just from me, so I'll, I'll start telling it to save and learn.\n\nInterviewer 25:16: Okay, yeah. I mean, not with everything, but if you're carrying on a longer thing, it's a it's useful. Brilliant. Well, okay, slight, hopefully that helps. Lovely to meet you and thanks for taking the time. Do really appreciate it, and we will feed that back to Chris and the team and and other people to know that you're a happy customer. So very much. Thank you. Thanks, Keith, nice to meet you. Bye, bye. Transcribed by https://otter.ai -- 5 of 5 --"
}