{
  "id": "t-030",
  "sourceFile": "T25_NPS10_EMEA_PS_HOUSE_OCT25.pdf",
  "client": "Matthias Hug",
  "interviewDate": "2025-10-30",
  "project": "Professional Search",
  "score": 10,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Interviewer 0:00",
      "text": "And as a third party to just encourage you to speak more freely. You know they've got a commitment to improving their client service, so the more honest feedback you can give us, the more hopefully we can improve your experience with them in the future. Any questions before we jump in? No, that's, Unknown Speaker 0:20 that's pretty clear."
    },
    {
      "speaker": "Interviewer 0:21",
      "text": "Great, fantastic. So, yeah, if you could start by just introducing yourself and your role and your relationship with Korn, Ferry,"
    },
    {
      "speaker": "Speaker 1 0:31",
      "text": "sure, yes, I'm, I'm a managing partner of format. Format is a smaller asset manager in Switzerland specialized on Swiss equities. We had our first assignment with Korn Ferry with Sasha savage. The assignment was to essentially find a person who is suitable to build up our business in the central part of Switzerland. Great."
    },
    {
      "speaker": "Interviewer 1:05",
      "text": "And had you worked with Korn Ferry before? Or was this your first experience? Very first experience. And what? What made you choose them?"
    },
    {
      "speaker": "Speaker 1 1:15",
      "text": "A one of our board members actually knew Sasha Savitch, and he recommended him based on his personal interaction with him, which was obviously before he joined Korn Ferry."
    },
    {
      "speaker": "Interviewer 1:29",
      "text": "Okay, so it was more based on the individual, less about Korn Ferry as an organization, that's correct. Okay, fantastic. And if you could just outline kind of, I suppose your your experience. How did you find the project?"
    },
    {
      "speaker": "Speaker 1 1:50",
      "text": "We knew that it's not going to be easy, because the the number of candidates is limited. It's not such a huge industry in central Switzerland, and our requirements were not easy to meet. So actually, we did ask three search firms whether they would be interested, and the two others declined. They said, look, it's it's a tough mandate. We don't have sufficient contacts in the in the area. Sasha Savage, obviously was willing to go for the challenge. It it proved to be not easy, but he came up with good candidates, some of them very good candidates. We decided for one, and then to win that candidate was not easy, either. She had alternatives, but at the end, he signed with us, -- 1 of 5 --"
    },
    {
      "speaker": "Interviewer 2:53",
      "text": "fantastic. And Did, did Sasha? And I'm assuming Sasha had a team? Did they help you craft the role, or were you quite clear on what you wanted from the beginning?"
    },
    {
      "speaker": "Speaker 1 3:08",
      "text": "Well, we know our business, obviously, it's not the first time that we recruit someone, so we had a pretty clear understanding, which we discussed with him, and I'm I'm not sure whether there were smaller things that were changed based on his input. Could be that I can't recall, but by him that the most important points we had prepared"
    },
    {
      "speaker": "Interviewer 3:36",
      "text": "great and in terms of your interactions with Sasha and the team, did that meet your expectations in terms of keeping abreast of the progress made? Was it a weekly call? Did they use emails and did it suit your style?"
    },
    {
      "speaker": "Speaker 1 3:56",
      "text": "Yes, absolutely, that was perfectly fine for us. We didn't want to have too frequent updates, as we have to run our business, and there are many other things we need to do, this is just one of our jobs. So we typically had, I think it was roughly bi weekly calls with updates, and in between, obviously there were interactions with candidates, phone calls, interviews, etc. So that was, was perfectly fine."
    },
    {
      "speaker": "Interviewer 4:25",
      "text": "Was there anything that didn't meet your expectations that they could improve on?"
    },
    {
      "speaker": "Speaker 1 4:33",
      "text": "I mean, obviously there, there is always, as a client, you would always to go as fast as possible and to have as many good candidates as possible. That's clear. But being realistic about this assignment, I would say that was it was a good number of candidates presented as I mentioned. Some of them very good. Some good, some. He even said, Look, this is not the strongest. I want to show you the candidate, and you decide which was fine as well, in terms of the speed, that was absolutely also, I would say, a realistic timeline. We had no time pressure, and that was transparent. We didn't have a deadline that had to be met. And we've said from the beginning, our focus is on the quality we want the right person rather a bit later than a less suitable person faster. And what he did was he, essentially, he acted accordingly, right?"
    },
    {
      "speaker": "Interviewer 5:40",
      "text": "And did they? Did they use their assessment tool to compare their candidates?"
    },
    {
      "speaker": "Speaker 1 5:48",
      "text": "Now you need to tell me what kind of tool you're talking about to make sure that I answer your question correctly."
    },
    {
      "speaker": "Interviewer 5:54",
      "text": "Their assessment survey, the so the for the assessment tool. They sometimes use it and they sometimes don't. So it's like a psychometric test. -- 2 of 5 --"
    },
    {
      "speaker": "Speaker 1 6:09",
      "text": "I would not be aware of the use of that tool. I think at some point he offered that they could do additional tests. But we, or assessments, as he called it, but we've, we felt that the situation was quite clear. You know, the difference between the very good candidates and the good candidates was significant. And we had two very good candidates, of which one, after a call with me, decided that it was too early for him. So at the end, we were left with one very good candidate. And would you have changed our mind if such a test would have come out, somewhat mediocre, probably not, probably not, because the candidate essentially had everything we were looking for."
    },
    {
      "speaker": "Interviewer 7:03",
      "text": "Okay, great. And in terms of things like compensation planning and securing the contract, is that something that the team helped with, or was that something that you"
    },
    {
      "speaker": "Speaker 1 7:13",
      "text": "did with? Yes, absolutely. Our compensation strategy is that we pay base salaries on the low end that we do across the firm, including for the managing partners, and that we then pay bonuses that are based on performance. And of course, we know there are competitors out there who pay somewhat higher base but then also a lower bonus, in particular when it goes to really strong performance, and that is somewhat frustrating for the best candidates, they have no problem with the lower base, but they want a substantial upset. So we think that our our compensation model actually fits the profile of our target candidates well, but it's not so easy to sell it in the first place, because in the the initial thing you compare is the base salary. That's where we don't score very high in comparison to others. So he had to clearly sell ourselves in an appropriate way. And obviously we had to do that and subsequently as well. But I have no indication that he didn't do that in a very appropriate manner, right?"
    },
    {
      "speaker": "Speaker 2 8:31",
      "text": "And would you use them? I mean, would you use them again? Would you recommend them?"
    },
    {
      "speaker": "Speaker 1 8:38",
      "text": "Well, he already got the next mandate, right? Unknown Speaker 8:40 Okay, so yes, yes, Unknown Speaker 8:44 absolutely. And,"
    },
    {
      "speaker": "Interviewer 8:47",
      "text": "I mean, Korn Ferry, obviously, is more than just an exec search firm. Do I mean, are you aware of other things that they do in terms of the broader organization? Consultancy offer,"
    },
    {
      "speaker": "Speaker 1 9:01",
      "text": "-- 3 of 5 -- to be honest, I haven't studied that yet. We are rather small company, and I have been at the Boston Consulting Group myself. So certain things I can do in the organization. So far, we had not a need for other consulting services. But I must admit, I haven't really inquired in detail."
    },
    {
      "speaker": "Interviewer 9:26",
      "text": "Okay, that's interesting, I mean. And in terms of, I suppose Korn, Korn Ferry as a brand, obviously you said you were recommended them from the from a board member before that. Had you heard of them? Are you aware of them?"
    },
    {
      "speaker": "Speaker 3 9:44",
      "text": "Yes, absolutely. Korn Ferry has a great reputation here."
    },
    {
      "speaker": "Interviewer 9:47",
      "text": "Okay, fantastic. So I mean, is there anything else that you'd like to feed back to the team that would be useful for them to know or as a wider feedback from the organization of what they could improve on"
    },
    {
      "speaker": "Speaker 1 10:06",
      "text": "would be anything that, where I would say they could have done better, not really, besides, of course, what we just touched on. But as I said, I think it was a tough assignment. So we were really we were very happy, also with the interaction was fast, whenever news or when we were then in the final phase, fighting for the candidate, returned calls immediately was well, accessible. So no, I mean, I think it would be somewhat unfair if I would try to find something to criticize"
    },
    {
      "speaker": "Interviewer 10:48",
      "text": "brilliant well. I mean, you know, we also like to share the good news as well. So it sounds like both in terms of the network, the quality and the quantity, but also the experience from your side or met your expectations."
    },
    {
      "speaker": "Speaker 1 11:04",
      "text": "Absolutely, Tid meet the expectations. What I obviously don't know is how he split the work with was primarily one person in the team. So probably the team did a did a very good job as well. I can assume, in any case, at no point in time, we had the impression that he was not aware of the progress of the team, or that the team did to do something else than what we really wanted. So so in that respect, was a very good experience,"
    },
    {
      "speaker": "Interviewer 11:38",
      "text": "great, I suppose, just finally, I think you probably you've probably answered this directly, but just as a broader question, when you're going through this process again, what's the most important thing for you in terms of choosing a search partner?"
    },
    {
      "speaker": "Speaker 1 11:56",
      "text": "Well, there are a number of points that are very important. I mean, what's the most important? The most important is, of course, that you end up in a reasonable period of time with a suitable candidate that proves then also to be what you thought he or she will be. That we don't know as the person just started a week ago, but first impressions are good. That's certainly the most important. But beyond that, there are -- 4 of 5 -- a couple of other points that we consider important. We consider it very important that the team that helps us, in particular, also the senior partner who is in charge of the mandate, gives us a fully honest view. We don't want that certain weaknesses are hidden, just to make sure that one of the candidates is accepted. We want the full picture as detailed and as honest as possible. And we also had the impression that that was the case. That's certainly also possible. I rather prefer that the search firm tells us, Look, this is a candidate who looks good, but we have doubts here and there, and that happened with some of the candidates that he brought up weaknesses or potential weaknesses that we then looked at in detail during the interviews. That's, that's, of course, in terms of the process, also of relevance. And it goes without saying that you want a search firm who produces a reasonable shortlist of candidates, that's, that's, that's obvious, right?"
    },
    {
      "speaker": "Interviewer 13:39",
      "text": "Okay, that I think, I think we can keep it short and sweet. I appreciate you. You're busy, so I won't take any more of your time, but really do appreciate you jumping on and giving me more detail. Unknown Speaker 13:51 Sure, it's my pleasure. So"
    },
    {
      "speaker": "Speaker 2 13:54",
      "text": "all the best. Yeah, likewise. Thanks. Matthias, bye, thank you. Bye. Bye. Transcribed by https://otter.ai -- 5 of 5 --"
    }
  ],
  "rawText": "Interviewer 0:00: And as a third party to just encourage you to speak more freely. You know they've got a commitment to improving their client service, so the more honest feedback you can give us, the more hopefully we can improve your experience with them in the future. Any questions before we jump in? No, that's, Unknown Speaker 0:20 that's pretty clear.\n\nInterviewer 0:21: Great, fantastic. So, yeah, if you could start by just introducing yourself and your role and your relationship with Korn, Ferry,\n\nSpeaker 1 0:31: sure, yes, I'm, I'm a managing partner of format. Format is a smaller asset manager in Switzerland specialized on Swiss equities. We had our first assignment with Korn Ferry with Sasha savage. The assignment was to essentially find a person who is suitable to build up our business in the central part of Switzerland. Great.\n\nInterviewer 1:05: And had you worked with Korn Ferry before? Or was this your first experience? Very first experience. And what? What made you choose them?\n\nSpeaker 1 1:15: A one of our board members actually knew Sasha Savitch, and he recommended him based on his personal interaction with him, which was obviously before he joined Korn Ferry.\n\nInterviewer 1:29: Okay, so it was more based on the individual, less about Korn Ferry as an organization, that's correct. Okay, fantastic. And if you could just outline kind of, I suppose your your experience. How did you find the project?\n\nSpeaker 1 1:50: We knew that it's not going to be easy, because the the number of candidates is limited. It's not such a huge industry in central Switzerland, and our requirements were not easy to meet. So actually, we did ask three search firms whether they would be interested, and the two others declined. They said, look, it's it's a tough mandate. We don't have sufficient contacts in the in the area. Sasha Savage, obviously was willing to go for the challenge. It it proved to be not easy, but he came up with good candidates, some of them very good candidates. We decided for one, and then to win that candidate was not easy, either. She had alternatives, but at the end, he signed with us, -- 1 of 5 --\n\nInterviewer 2:53: fantastic. And Did, did Sasha? And I'm assuming Sasha had a team? Did they help you craft the role, or were you quite clear on what you wanted from the beginning?\n\nSpeaker 1 3:08: Well, we know our business, obviously, it's not the first time that we recruit someone, so we had a pretty clear understanding, which we discussed with him, and I'm I'm not sure whether there were smaller things that were changed based on his input. Could be that I can't recall, but by him that the most important points we had prepared\n\nInterviewer 3:36: great and in terms of your interactions with Sasha and the team, did that meet your expectations in terms of keeping abreast of the progress made? Was it a weekly call? Did they use emails and did it suit your style?\n\nSpeaker 1 3:56: Yes, absolutely, that was perfectly fine for us. We didn't want to have too frequent updates, as we have to run our business, and there are many other things we need to do, this is just one of our jobs. So we typically had, I think it was roughly bi weekly calls with updates, and in between, obviously there were interactions with candidates, phone calls, interviews, etc. So that was, was perfectly fine.\n\nInterviewer 4:25: Was there anything that didn't meet your expectations that they could improve on?\n\nSpeaker 1 4:33: I mean, obviously there, there is always, as a client, you would always to go as fast as possible and to have as many good candidates as possible. That's clear. But being realistic about this assignment, I would say that was it was a good number of candidates presented as I mentioned. Some of them very good. Some good, some. He even said, Look, this is not the strongest. I want to show you the candidate, and you decide which was fine as well, in terms of the speed, that was absolutely also, I would say, a realistic timeline. We had no time pressure, and that was transparent. We didn't have a deadline that had to be met. And we've said from the beginning, our focus is on the quality we want the right person rather a bit later than a less suitable person faster. And what he did was he, essentially, he acted accordingly, right?\n\nInterviewer 5:40: And did they? Did they use their assessment tool to compare their candidates?\n\nSpeaker 1 5:48: Now you need to tell me what kind of tool you're talking about to make sure that I answer your question correctly.\n\nInterviewer 5:54: Their assessment survey, the so the for the assessment tool. They sometimes use it and they sometimes don't. So it's like a psychometric test. -- 2 of 5 --\n\nSpeaker 1 6:09: I would not be aware of the use of that tool. I think at some point he offered that they could do additional tests. But we, or assessments, as he called it, but we've, we felt that the situation was quite clear. You know, the difference between the very good candidates and the good candidates was significant. And we had two very good candidates, of which one, after a call with me, decided that it was too early for him. So at the end, we were left with one very good candidate. And would you have changed our mind if such a test would have come out, somewhat mediocre, probably not, probably not, because the candidate essentially had everything we were looking for.\n\nInterviewer 7:03: Okay, great. And in terms of things like compensation planning and securing the contract, is that something that the team helped with, or was that something that you\n\nSpeaker 1 7:13: did with? Yes, absolutely. Our compensation strategy is that we pay base salaries on the low end that we do across the firm, including for the managing partners, and that we then pay bonuses that are based on performance. And of course, we know there are competitors out there who pay somewhat higher base but then also a lower bonus, in particular when it goes to really strong performance, and that is somewhat frustrating for the best candidates, they have no problem with the lower base, but they want a substantial upset. So we think that our our compensation model actually fits the profile of our target candidates well, but it's not so easy to sell it in the first place, because in the the initial thing you compare is the base salary. That's where we don't score very high in comparison to others. So he had to clearly sell ourselves in an appropriate way. And obviously we had to do that and subsequently as well. But I have no indication that he didn't do that in a very appropriate manner, right?\n\nSpeaker 2 8:31: And would you use them? I mean, would you use them again? Would you recommend them?\n\nSpeaker 1 8:38: Well, he already got the next mandate, right? Unknown Speaker 8:40 Okay, so yes, yes, Unknown Speaker 8:44 absolutely. And,\n\nInterviewer 8:47: I mean, Korn Ferry, obviously, is more than just an exec search firm. Do I mean, are you aware of other things that they do in terms of the broader organization? Consultancy offer,\n\nSpeaker 1 9:01: -- 3 of 5 -- to be honest, I haven't studied that yet. We are rather small company, and I have been at the Boston Consulting Group myself. So certain things I can do in the organization. So far, we had not a need for other consulting services. But I must admit, I haven't really inquired in detail.\n\nInterviewer 9:26: Okay, that's interesting, I mean. And in terms of, I suppose Korn, Korn Ferry as a brand, obviously you said you were recommended them from the from a board member before that. Had you heard of them? Are you aware of them?\n\nSpeaker 3 9:44: Yes, absolutely. Korn Ferry has a great reputation here.\n\nInterviewer 9:47: Okay, fantastic. So I mean, is there anything else that you'd like to feed back to the team that would be useful for them to know or as a wider feedback from the organization of what they could improve on\n\nSpeaker 1 10:06: would be anything that, where I would say they could have done better, not really, besides, of course, what we just touched on. But as I said, I think it was a tough assignment. So we were really we were very happy, also with the interaction was fast, whenever news or when we were then in the final phase, fighting for the candidate, returned calls immediately was well, accessible. So no, I mean, I think it would be somewhat unfair if I would try to find something to criticize\n\nInterviewer 10:48: brilliant well. I mean, you know, we also like to share the good news as well. So it sounds like both in terms of the network, the quality and the quantity, but also the experience from your side or met your expectations.\n\nSpeaker 1 11:04: Absolutely, Tid meet the expectations. What I obviously don't know is how he split the work with was primarily one person in the team. So probably the team did a did a very good job as well. I can assume, in any case, at no point in time, we had the impression that he was not aware of the progress of the team, or that the team did to do something else than what we really wanted. So so in that respect, was a very good experience,\n\nInterviewer 11:38: great, I suppose, just finally, I think you probably you've probably answered this directly, but just as a broader question, when you're going through this process again, what's the most important thing for you in terms of choosing a search partner?\n\nSpeaker 1 11:56: Well, there are a number of points that are very important. I mean, what's the most important? The most important is, of course, that you end up in a reasonable period of time with a suitable candidate that proves then also to be what you thought he or she will be. That we don't know as the person just started a week ago, but first impressions are good. That's certainly the most important. But beyond that, there are -- 4 of 5 -- a couple of other points that we consider important. We consider it very important that the team that helps us, in particular, also the senior partner who is in charge of the mandate, gives us a fully honest view. We don't want that certain weaknesses are hidden, just to make sure that one of the candidates is accepted. We want the full picture as detailed and as honest as possible. And we also had the impression that that was the case. That's certainly also possible. I rather prefer that the search firm tells us, Look, this is a candidate who looks good, but we have doubts here and there, and that happened with some of the candidates that he brought up weaknesses or potential weaknesses that we then looked at in detail during the interviews. That's, that's, of course, in terms of the process, also of relevance. And it goes without saying that you want a search firm who produces a reasonable shortlist of candidates, that's, that's, that's obvious, right?\n\nInterviewer 13:39: Okay, that I think, I think we can keep it short and sweet. I appreciate you. You're busy, so I won't take any more of your time, but really do appreciate you jumping on and giving me more detail. Unknown Speaker 13:51 Sure, it's my pleasure. So\n\nSpeaker 2 13:54: all the best. Yeah, likewise. Thanks. Matthias, bye, thank you. Bye. Bye. Transcribed by https://otter.ai -- 5 of 5 --"
}