{
  "id": "t-039",
  "sourceFile": "T34_NPS10_EMEA_ES_HOUSE_DEC25.pdf",
  "client": "Francis Kint",
  "interviewDate": "2025-12-02",
  "project": "ES",
  "score": 10,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Interviewer 1:02",
      "text": "Yeah, so thanks for taking part in this follow up interview. I'll try not to keep you too long just to introduce myself. So I'm the managing partner at a consultancy. We've been working with Korn Ferry for the last five years, so we know their business as well, and they've asked us to run these interviews to encourage a more open and honest conversation before we start. Are you okay if I record this, it's so my team can help me write notes. Yes. No problem. Great. So if we could just kick off, if you can just explain your role in the organization and the relationship that you have with Korn. Francis Kint 1:39 Ferry, yes. So I'm the CEO of green yard. We're a company that's active in fruit and vegetables in all its forms, so fresh, frozen and canning also. And we've just been delisted. So we were quoted on the Euronext Brussels. We've been taken private by a founding family, the pre family, together with solemn partners, which is a an investment fund related to the Harvard management company who will be the majority shareholder, we had to fill in two positions. The first one had been vacant since a year, which is not good of CHRO, but I kind of covered it for a year, which is not good, of course, can't cumulate these things. And the second one was at the request of solar partners to engage a chief transformation officer. We are currently, you know, working with Bain, who's kind of reviewing all the operations. And out of that, I think there will be discussion in December on how to transform the company, because right now, the profitability is really insufficient, so we need to do something about it. And as they told me, people from solo, and I completely agreed with that, you need somebody who beats the drum, who's going to follow up on these transformation efforts. And so these were the two positions that we that we were looking for, what is our relationship with Korn Ferry? I do not recall that we had worked with with Korn Ferry in the past. In all fairness, I know the managing partner of Belgium, Christopher, he's now, I think he has a Benelux role. And also no Danny van acht. In fact, when Danny, you know, these things happen like that, you have to have the trust to work with someone, and Danny, when I knew Danny from when he worked for Spencer Stuart. So he came from Spencer Stuart, and so I knew the boss, I knew the consultant that I wanted to work with, because I have a deep trust in in Danny's, let's say a human touch. You know, sometimes say Tony sometimes looks a little bit like, like laughing, etc, but behind it, you know, there's a big depth, and he hides very well the fact that he knows people very well. So these are the type of people that I'd like to work with. And as you probably seen on the reports, I was very happy with the work that we've done together. And the two -- 1 of 8 -- people that are now on board from CHRO took a little bit longer, but, but the CFF is now on board also. So one is on board since the first of November, the second one since the 23rd of November."
    },
    {
      "speaker": "Interviewer 4:13",
      "text": "Okay, so really recent. So did you consider any other firm, or was it purely because you had those relationships, Francis Kint 4:25 Korn Ferry, in fairness, no, we didn't put firms in competition. I needed to go fast. I knew it for you know, for solar partners, it was really important. They wanted speed in it. And when I talked to them about possibly using Korn Ferry, they immediately reacted by saying, Oh, we work a lot, but this is the main firm we also work with, so that kind of matched. And, no, I didn't put them in competition."
    },
    {
      "speaker": "Interviewer 4:50",
      "text": "Okay, great. And in terms of helping design the roles, was that something that they helped you do, or were you already really care on the skills that you needed for both of them. Francis Kint 5:04 Well, I'm a bit of a writer. I always say I write better than I than I speak. So I'd written a job description I knew relatively well what I wanted, and of course, I discussed it with Donnie. And obviously in these discussions, you always, you know, you always adapt a little bit. You think, okay, like this, like that, but the role was fairly clear in my head. Maybe mentioned, I'm going a little bit too much in detail, but, you know, we work through four divisions. These four divisions do not have that much overlap. The four division managers are, of course, together in the in the leadership team, but two of these divisions do not have a an HR person overlooking or coordinating the HR function within the division, because that wouldn't be, I think, a full time job. So immediately I thought, if I'm going to hire a chro, he's also going to have to do that coordination work within two of the divisions, we've got a very big division based out of the Netherlands with three business units, which, frankly, do care of themselves. Well, then we've got a division that's a mono business units. They've got a strong HR person too. But these two other divisions, one has eight, nine business units, the other one has four business units. The frozen division had had a coordinator, but frankly, didn't turn down to be to be very useful. So I asked him something very, very specific to help me at corporate level, but also to be able to deep dive into the divisions, which is a lot of work, but it's, I think it's perfectly combinable. So from that point of view, you know, if you, if you describe, also all of these things, you very quickly come to a a position which is very well defined for the chief transformation officer. Look, I would say that this is a role that stands for itself. People kind of immediately understand what it is. It's follow up, execution. We all know that this is not there to last for five years, I would say, if we're still transforming after two years, then we're not doing a good job. So there, I think it's more but that's an unset thing. You know? What's the next step for that person? And that's, you know, I kind of remain vague, because it will depend a little bit on the person we find a person that is now that had worked nine and a half year from McKinsey. So it's a she, she -- 2 of 8 -- definitely wanted to to to be in a more active role, but it's understood that if she's doing a good job, she's going to enter in the line position. And as I said, we don't have enough good people, so there will be plenty of opportunities for, let's say, PNL leadership, right?"
    },
    {
      "speaker": "Interviewer 8:05",
      "text": "And in terms of the the number of like, the quality and the quantity of candidates, did they meet your expectations? Yes, absolutely, yeah. And and timing wise, like, how did they go fast enough? I mean, you said one of them took longer than the other? Francis Kint 8:24 No, no, I think that the interviews went well. When we had I agreed with solemn partners that I would present them to candidates without telling them who was one of my favorites. And for the CHRO that we had the same favorites for the for the CTO, I was open between two candidates. They were very different from profile. I could have been happy with either one of them. Now, what has lasted long is the better negotiation, in fact, with the CHRO also the fact that he couldn't leave his current company as quickly as I as I wished. So yes, that took longer. And yes, you know, as you know, some people negotiate well and long about their salaries and their package. Others are saying, Look, I'll try to do good job and then we'll evolve for myself, it happened to be that the person that took the CHRO Job was a guy that negotiated well, and it took some time, because you don't want to do that all by yourself. You want to, you want to CFF to be on board. Also that he's not surprised. So yes, that took much longer than I would have wished for."
    },
    {
      "speaker": "Interviewer 9:35",
      "text": "And did Korn Ferry? Did they negotiate for you on your behalf? Their compensation? Francis Kint 9:41 Yes, kind of I like that to be a little bit in the middle, because if you're saying something and that, or also like the candidate to say what he thinks, what he wants, without being afraid to say it in my face. So yes, they were always slightly in between, maybe the last last step, the last little steps or so, but no, in principle, they they have been negotiating the package on the basis, of course of what we told them, right,"
    },
    {
      "speaker": "Interviewer 10:08",
      "text": "and in terms of the the the experience, so the end to end process. How did you find that there was good communication? Did you feel in the loop at all times? Did you have a regular catch up. How was, how? What was the communication style like? Francis Kint 10:25 No, it was ongoing, I would say, with Don Ian and his assistant. So, no, I never felt like, Hey, I don't know what's going on. No, I would say everything went very fast, the finding of the candidates in both role. I also was impressed that it was fast. You know, we had a list, I think, for both of 10, the interviewing phase. I also thought went was quite efficient. It's after that that, that it lasts a bit, of course. Again, you want, I also wanted people on board, like, like the CFF, which I work very close with, solo partners, you have to find the dates, etc, for them to interview. So that that phase one a little bit longer, but -- 3 of 8 -- not for the CTO that that went relatively fast. I had two candidates. Because the question is, always, I find, you know, are these people really looking for a job, or are they listening? In all fairness, in my career, I've also done that, you know, you know what, why not listen and then to try to find out whether the person will jump or not for the CTO, I had immediately a relatively good feeling that that the two main, two best candidates, really, you know, wanted to step out of their current role. And I knew what the reason was for the CHRO. Let's say I went for my preferred candidate. You know, had a good job, so we had to move him out of out of a job. Also, he's living in the Netherlands, so we're not that close by. So there I have. There has been a moment in the negotiation where I thought, Look, you know, Is he, is he really going to jump or not?"
    },
    {
      "speaker": "Interviewer 12:06",
      "text": "Yeah. And did you use their assessment tools? Did you? Did you get candidates assessed using they Francis Kint 12:16 were assessed, and I read the documents. I read the documents. Who? Um, I'm going to say something which might be a little bit unfair. You know, the documents are are long and very nuanced, and you might sometimes maybe have wished them to be a little bit more black and white, saying, well, he's like this. He's like that. The documents are a little bit yeah, yeah."
    },
    {
      "speaker": "Interviewer 12:49",
      "text": "So would if you, if you ran the project again, would you run the assessments again? Francis Kint 12:56 Yes, now that you, now that you made me think about them. Yeah, I might have said, Look, why don't you try to summarize this? And I had to look, maybe there is a summary, but you know, to be a little bit sharper to say, look, you know, this person is, is more, can stand conflict or cannot stand conflict on the very concrete things, how things will will work, because there is a component, and you're sure you've understood it with your experience behind the two roles that we're going to have to restructure in certain business units. So definitely you want somebody who can stand it, and some people are not very good at it, others can stand it with a smile. And so that was definitely a quality that I was looking for. And my preferences within choosing between these candidates have been a little bit not biased, but focused on making sure that we've got that quality for some for this, for the CHRO, I was influenced, I will not hide this by the fact, so by looking at the company that the cjo was currently looking at while I knew the previous CEO there, and in agreement with Korn Ferry, I did give him a call. And of course, yeah, I don't know if these things should happen or not, but of course, if you know the guy's previous boss, and you know that boss very well, then it's logic that you call him and say, hey, you know this is the type of guy that I'm looking for, and the description he made was exactly what I was looking for. So that, so that comforts a little bit to say, look, you know, he, he might not be the guy of the super HR schemes, etc, but it's a guy that you can send to a country and just get the restructuring ring done. And I can't do it all by myself. So that was clearly something that was looking for. I did not have the same with the CTO, because, well, I knew, I know people in McKinsey, but I -- 4 of 8 -- was not going to call them. So no, there was based on my own. And there for the CTO, there was a clear, clear preference of solar partners, which, you know, I fully respect, and certainly want them to be comfortable with the job,"
    },
    {
      "speaker": "Interviewer 15:18",
      "text": "given that there were multiple stakeholders, I suppose, you know, making, helping make it the decision. How did the Korn Ferry team help just manage, I suppose you know the different voices in the room. Did that work? Francis Kint 15:32 Well, if they did, it was maybe behind the scenes. I wouldn't be surprised, because they've got a great relationship in the US. So I'm definitely certain that also, there must have been a bridge there between Solomon and Korn Ferry to ask for more information. But that's fine for me. You know, that's fine for me, just as the CTO right now, I have no problem that she develops a relationship with with Solomon. I don't have to be in the middle of all these conversations. I've got nothing to hide. So, yeah, it's these people have invested quite a bit in our company, and I fully respect that sometimes they need to build bridges and they don't need to do it all through myself,"
    },
    {
      "speaker": "Interviewer 16:12",
      "text": "right? Is there anything they could have done better? Francis Kint 16:16 I said smilingly, you know, I'd wish that parking spaces in their own office, because you always have to go to another building, which I find, which I can't understand. Because, you know, frankly, if you want to receive your customers, well, why don't you have some sparking space, at least for your customers, especially because they, you know, it's a lot of people, I think, do their interviews. And I always went to their offices for interviews, because I don't want people here in my office to say, you know, he was really busy, but I was only, I was only the only customer, practically. So I thought, Look, why not? And it's in the center of Ghent, so in the center of Brussels. So, you know, it's a bit annoying. So, no, I've said that. No, frankly, of course, the fact that I knew Danny quite well, that kind of helps. I didn't know his, the person that works with him is a lady called Sarah, and I also think that she did a good job in terms of always making sure everything was taken care of. The reports were sent to me, everything was was well organized. That kind of, for me, that's also important, you know. So the I interviewed, I was able to interview efficiently, because they, you know, in two three visits, I interviewed maybe for each of the jobs, at least 10 people so. And I'm relatively structured, so in the sense that I write everything a little Excel sheet to remember exactly what it was. And yeah, but as you said, CFF also interviewed two or three candidates and so on the last two, right"
    },
    {
      "speaker": "Interviewer 17:44",
      "text": "in terms of, now, you obviously knew Danny from census, Stuart. How do they compare? Obviously, kind of people aside, but is there anything else that's like sets them apart in terms of the experience from one firm to the other? -- 5 of 8 -- Francis Kint 17:59 I've been thinking about that, because I used Egon Zander quite a bit in the past also, but Egon Zander, I think I've given more difficult because in my role, I've been a CEO or general manager since a long time. Very often I look for country managers, or call them that way, or country general managers. So people in other countries, for instance, even Sander did what I considered as a very difficult search in a region of we have a factory in Brittany in France, and I needed a very good general manager was going to take something really complicated on his shoulders. And I think they did a great job too. But you develop a I find that different type of search. And there you hope you don't, don't need seven candidates you but you need maybe two or three that are in the neighborhoods there will be happy living there, that live there, that are ready to take on difficult jobs and so so with Eagle Xander, I'm, if I think about my work over the last many years, they've always been in these type of positions for that. So it's difficult for me to compare. I think, frankly, that DD searches that now Korn Ferry that were a little bit easier to find candidates. You know, it's we have our offices close to Brussels. So everybody living in Brussels, we are a big group with, you know, 5.3 billion turnover with the decision Center here in Belgium. So even though the first one is Dutch guy, the circuit is Belgium. But let's say, for these people, that's something that comes back all the time, why you're interested in green yards. Maybe one of the first criteria is, well, the decision center is in Belgium, and for that, some people do just not want to travel around all their careers, and so they find it important. So I think that the search was easier I'm going to have to compare with maybe some other things, because other you know, I didn't tell you my story, but I became CEO here in 2024 I had been a CEO before in other companies, but before, when I rejoined this company, I left for six years. I was first the managing director of a division, and I worked there with search firms that are not in the top five. You know that that were, I didn't, I didn't think that top five would be good for the functions that was looking for, like a supply chain director, etc. They are preferred to have more concrete and I would say, for me, if I almost want to say a bit less expensive, firms that that can, that can also find people that are not necessarily in the in in the capital of the country,"
    },
    {
      "speaker": "Interviewer 20:47",
      "text": "on price. I mean, how do they compare to, to, I suppose, their, you know, their peers. Francis Kint 20:53 I think they're slightly cheaper than Egon Zander, if I compare it to the if I can, if I consider the ratio with, with the salary my I did not make it, but I remember seeing it, I thought, hey, you know, again, the ratio, for instance, with the eagle, the last one I worked with was, was this, with this candidate in France, that's a candidate that makes 250,000 or something. I more expensive that might have to do with maybe the assessment of the difficulty to find someone. And by the way, I was also very happy with Eagle Center to come up, and I find a fantastic candidate that's doing a great job right now in very difficult circumstances."
    },
    {
      "speaker": "Interviewer 21:38",
      "text": "-- 6 of 8 -- And in terms of now the brand you know, you having not used Korn Ferry before. I mean, how important is it for you that, when you're making a senior search, that there is a brand that sits behind them? Or is it, is it purely about the individual in their network? Francis Kint 21:55 No, that. My first criterion is the brands. You know what? When I explained it to people saying, well, it's going to be expensive, I said, like, you know, I'm a manager myself with a long career behind him. You know, if you get a call from Korn Ferry of vegan center, you take notice. If it's some there's plenty of firms that still call me today, by the way, you know that are working for private equities and are specialized on these. And it for me, it's, it's not the same appeal in all honesty. So no, the brand is important, right? But they're all kind of all equally. Rate them. Father Spencer Stewart, Heidrick and struggles, Korn Ferry. So yes, the top five, what they call the shreks, when you don't, don't want to, when you then want to choose within the Shrek in Belgium, then obviously you look a little bit about the quality of the local management. And for some reason, there's one of them that I don't rate very high, because they've lost it, and they've been a lot of people, lot of turnover at Spencer Stuart, I also believe that they've got a very good personal consumer products. And at Egon Xander, the person that I know well is kind of retiring, so that plays a role in all fantasy."
    },
    {
      "speaker": "Interviewer 23:13",
      "text": "Yeah, absolutely would you. I mean, these obviously are all kind of like for, like, search firms, but Korn Ferry been broader in its offer around or organization consulting. Would you ever consider using them for, especially if you're doing transformation for things like restructuring, like people development, leadership training? Francis Kint 23:34 Yeah, I really consider now the CHRO to have to, he's going to have to put that in place again. I did both of the jobs for a year badly, I'm sure. And I'm really glad to think, hey, now Rob is that's his name. You're going to take care of this. And it goes Broadway. It goes in terms of development. It's terms of, you know, do we offer some of our top guys? I've got a request now to to fund the training, and I'm, you know, he's gonna have to deal with that. But you're right. It may be something that we need to to consider. Since I use these words often, sounds pretty bad, but you know, again, I worked for this firm between 2009 2015 I left six years and I came back and I said, there's more good people that left than good people that came in in the same time, has to do with the fact that we're in a tough industry with very small margins working for these retailers. You know that that press you down all the time, and you have a little bit of a tendency to say, okay, somebody good, somebody good leaves, you know, well, let's try to save his cost. Blah, blah. And for the long term, this is not good."
    },
    {
      "speaker": "Interviewer 24:42",
      "text": "I mean, how often do you the management team level spend talking around kind of you know, people or and skills and future skills needed in the business? Is it a priority of yours? Francis Kint 24:55 -- 7 of 8 -- Well, informally, an awful lot, in the sense that, oh, we know this guy, Pepe, from Spain. We know how he is. You know, he's good at that, bad at that. So informally, you know, with the CFF, we talk about it all the time, but we talk about it to resolve things I said, because I'm in a bit difficult position, which is also, you will not say it's good, but when did, one of the four divisions became the CFO, and I, at the request of Solomon, said, you know, fill in for his role. So I do the CEO job, and I do the managing director of one of the divisions. That's much. I can't even dare to say how much the reports I have, but I when they said, how are you going to do that? I said, first, we've got some extremely big customers. I need to spend time with these customers. Sounds stupid, but it's really important, and that's it. Secondly is these managing directors, the or the general managers of the business units. That's really, really important. I once flew to Italy because I had a bad feeling after a meeting. That's that are one of our best guys would leave. And I wanted to, he was going to go on vacation say, You know what? I'm flying to Italy just to come to see you. Oh, it's never, never been a CEO that did, came to to flew into, just had a dinner with me. I'm saying, Yeah, but you know, you're one of our key guys. I wanted to tell you that. So I do spend quite a bit of time, all the time calling them and being being really close to them, being with them in the battle, and that's the way I do it. But that does not mean that we're working on what you just said, and we're going to have to start doing this, because we've got quite a few business units where you have the same guy doing it, that for some reason of quality. You know, we did not ask him to leave, but are clearly short in their jobs. So, yeah. So my answer is, I do spend quite a bit of my own adrenaline, and, you know, to manage these guys. But that does not mean I manage the quality of the guys, great."
    },
    {
      "speaker": "Interviewer 27:02",
      "text": "I'm conscious we're nearly at time, and I said it wasn't going to take a whole half an hour. Is there anything else that you think would be useful to share with with me? Francis Kint 27:12 No, frankly, if you're working for Korn Ferry, I think they're doing good job here in Belgium. They're definitely doing the firm that is coming up, while others, I believe, are a little bit in retreat. So no, that would be my final say, great."
    },
    {
      "speaker": "Interviewer 27:29",
      "text": "Well, okay, appreciate your time, and really lovely to meet you. Thank you, Interviewer, see you soon. Bye, bye. Transcribed by https://otter.ai -- 8 of 8 --"
    }
  ],
  "rawText": "Interviewer 1:02: Yeah, so thanks for taking part in this follow up interview. I'll try not to keep you too long just to introduce myself. So I'm the managing partner at a consultancy. We've been working with Korn Ferry for the last five years, so we know their business as well, and they've asked us to run these interviews to encourage a more open and honest conversation before we start. Are you okay if I record this, it's so my team can help me write notes. Yes. No problem. Great. So if we could just kick off, if you can just explain your role in the organization and the relationship that you have with Korn. Francis Kint 1:39 Ferry, yes. So I'm the CEO of green yard. We're a company that's active in fruit and vegetables in all its forms, so fresh, frozen and canning also. And we've just been delisted. So we were quoted on the Euronext Brussels. We've been taken private by a founding family, the pre family, together with solemn partners, which is a an investment fund related to the Harvard management company who will be the majority shareholder, we had to fill in two positions. The first one had been vacant since a year, which is not good of CHRO, but I kind of covered it for a year, which is not good, of course, can't cumulate these things. And the second one was at the request of solar partners to engage a chief transformation officer. We are currently, you know, working with Bain, who's kind of reviewing all the operations. And out of that, I think there will be discussion in December on how to transform the company, because right now, the profitability is really insufficient, so we need to do something about it. And as they told me, people from solo, and I completely agreed with that, you need somebody who beats the drum, who's going to follow up on these transformation efforts. And so these were the two positions that we that we were looking for, what is our relationship with Korn Ferry? I do not recall that we had worked with with Korn Ferry in the past. In all fairness, I know the managing partner of Belgium, Christopher, he's now, I think he has a Benelux role. And also no Danny van acht. In fact, when Danny, you know, these things happen like that, you have to have the trust to work with someone, and Danny, when I knew Danny from when he worked for Spencer Stuart. So he came from Spencer Stuart, and so I knew the boss, I knew the consultant that I wanted to work with, because I have a deep trust in in Danny's, let's say a human touch. You know, sometimes say Tony sometimes looks a little bit like, like laughing, etc, but behind it, you know, there's a big depth, and he hides very well the fact that he knows people very well. So these are the type of people that I'd like to work with. And as you probably seen on the reports, I was very happy with the work that we've done together. And the two -- 1 of 8 -- people that are now on board from CHRO took a little bit longer, but, but the CFF is now on board also. So one is on board since the first of November, the second one since the 23rd of November.\n\nInterviewer 4:13: Okay, so really recent. So did you consider any other firm, or was it purely because you had those relationships, Francis Kint 4:25 Korn Ferry, in fairness, no, we didn't put firms in competition. I needed to go fast. I knew it for you know, for solar partners, it was really important. They wanted speed in it. And when I talked to them about possibly using Korn Ferry, they immediately reacted by saying, Oh, we work a lot, but this is the main firm we also work with, so that kind of matched. And, no, I didn't put them in competition.\n\nInterviewer 4:50: Okay, great. And in terms of helping design the roles, was that something that they helped you do, or were you already really care on the skills that you needed for both of them. Francis Kint 5:04 Well, I'm a bit of a writer. I always say I write better than I than I speak. So I'd written a job description I knew relatively well what I wanted, and of course, I discussed it with Donnie. And obviously in these discussions, you always, you know, you always adapt a little bit. You think, okay, like this, like that, but the role was fairly clear in my head. Maybe mentioned, I'm going a little bit too much in detail, but, you know, we work through four divisions. These four divisions do not have that much overlap. The four division managers are, of course, together in the in the leadership team, but two of these divisions do not have a an HR person overlooking or coordinating the HR function within the division, because that wouldn't be, I think, a full time job. So immediately I thought, if I'm going to hire a chro, he's also going to have to do that coordination work within two of the divisions, we've got a very big division based out of the Netherlands with three business units, which, frankly, do care of themselves. Well, then we've got a division that's a mono business units. They've got a strong HR person too. But these two other divisions, one has eight, nine business units, the other one has four business units. The frozen division had had a coordinator, but frankly, didn't turn down to be to be very useful. So I asked him something very, very specific to help me at corporate level, but also to be able to deep dive into the divisions, which is a lot of work, but it's, I think it's perfectly combinable. So from that point of view, you know, if you, if you describe, also all of these things, you very quickly come to a a position which is very well defined for the chief transformation officer. Look, I would say that this is a role that stands for itself. People kind of immediately understand what it is. It's follow up, execution. We all know that this is not there to last for five years, I would say, if we're still transforming after two years, then we're not doing a good job. So there, I think it's more but that's an unset thing. You know? What's the next step for that person? And that's, you know, I kind of remain vague, because it will depend a little bit on the person we find a person that is now that had worked nine and a half year from McKinsey. So it's a she, she -- 2 of 8 -- definitely wanted to to to be in a more active role, but it's understood that if she's doing a good job, she's going to enter in the line position. And as I said, we don't have enough good people, so there will be plenty of opportunities for, let's say, PNL leadership, right?\n\nInterviewer 8:05: And in terms of the the number of like, the quality and the quantity of candidates, did they meet your expectations? Yes, absolutely, yeah. And and timing wise, like, how did they go fast enough? I mean, you said one of them took longer than the other? Francis Kint 8:24 No, no, I think that the interviews went well. When we had I agreed with solemn partners that I would present them to candidates without telling them who was one of my favorites. And for the CHRO that we had the same favorites for the for the CTO, I was open between two candidates. They were very different from profile. I could have been happy with either one of them. Now, what has lasted long is the better negotiation, in fact, with the CHRO also the fact that he couldn't leave his current company as quickly as I as I wished. So yes, that took longer. And yes, you know, as you know, some people negotiate well and long about their salaries and their package. Others are saying, Look, I'll try to do good job and then we'll evolve for myself, it happened to be that the person that took the CHRO Job was a guy that negotiated well, and it took some time, because you don't want to do that all by yourself. You want to, you want to CFF to be on board. Also that he's not surprised. So yes, that took much longer than I would have wished for.\n\nInterviewer 9:35: And did Korn Ferry? Did they negotiate for you on your behalf? Their compensation? Francis Kint 9:41 Yes, kind of I like that to be a little bit in the middle, because if you're saying something and that, or also like the candidate to say what he thinks, what he wants, without being afraid to say it in my face. So yes, they were always slightly in between, maybe the last last step, the last little steps or so, but no, in principle, they they have been negotiating the package on the basis, of course of what we told them, right,\n\nInterviewer 10:08: and in terms of the the the experience, so the end to end process. How did you find that there was good communication? Did you feel in the loop at all times? Did you have a regular catch up. How was, how? What was the communication style like? Francis Kint 10:25 No, it was ongoing, I would say, with Don Ian and his assistant. So, no, I never felt like, Hey, I don't know what's going on. No, I would say everything went very fast, the finding of the candidates in both role. I also was impressed that it was fast. You know, we had a list, I think, for both of 10, the interviewing phase. I also thought went was quite efficient. It's after that that, that it lasts a bit, of course. Again, you want, I also wanted people on board, like, like the CFF, which I work very close with, solo partners, you have to find the dates, etc, for them to interview. So that that phase one a little bit longer, but -- 3 of 8 -- not for the CTO that that went relatively fast. I had two candidates. Because the question is, always, I find, you know, are these people really looking for a job, or are they listening? In all fairness, in my career, I've also done that, you know, you know what, why not listen and then to try to find out whether the person will jump or not for the CTO, I had immediately a relatively good feeling that that the two main, two best candidates, really, you know, wanted to step out of their current role. And I knew what the reason was for the CHRO. Let's say I went for my preferred candidate. You know, had a good job, so we had to move him out of out of a job. Also, he's living in the Netherlands, so we're not that close by. So there I have. There has been a moment in the negotiation where I thought, Look, you know, Is he, is he really going to jump or not?\n\nInterviewer 12:06: Yeah. And did you use their assessment tools? Did you? Did you get candidates assessed using they Francis Kint 12:16 were assessed, and I read the documents. I read the documents. Who? Um, I'm going to say something which might be a little bit unfair. You know, the documents are are long and very nuanced, and you might sometimes maybe have wished them to be a little bit more black and white, saying, well, he's like this. He's like that. The documents are a little bit yeah, yeah.\n\nInterviewer 12:49: So would if you, if you ran the project again, would you run the assessments again? Francis Kint 12:56 Yes, now that you, now that you made me think about them. Yeah, I might have said, Look, why don't you try to summarize this? And I had to look, maybe there is a summary, but you know, to be a little bit sharper to say, look, you know, this person is, is more, can stand conflict or cannot stand conflict on the very concrete things, how things will will work, because there is a component, and you're sure you've understood it with your experience behind the two roles that we're going to have to restructure in certain business units. So definitely you want somebody who can stand it, and some people are not very good at it, others can stand it with a smile. And so that was definitely a quality that I was looking for. And my preferences within choosing between these candidates have been a little bit not biased, but focused on making sure that we've got that quality for some for this, for the CHRO, I was influenced, I will not hide this by the fact, so by looking at the company that the cjo was currently looking at while I knew the previous CEO there, and in agreement with Korn Ferry, I did give him a call. And of course, yeah, I don't know if these things should happen or not, but of course, if you know the guy's previous boss, and you know that boss very well, then it's logic that you call him and say, hey, you know this is the type of guy that I'm looking for, and the description he made was exactly what I was looking for. So that, so that comforts a little bit to say, look, you know, he, he might not be the guy of the super HR schemes, etc, but it's a guy that you can send to a country and just get the restructuring ring done. And I can't do it all by myself. So that was clearly something that was looking for. I did not have the same with the CTO, because, well, I knew, I know people in McKinsey, but I -- 4 of 8 -- was not going to call them. So no, there was based on my own. And there for the CTO, there was a clear, clear preference of solar partners, which, you know, I fully respect, and certainly want them to be comfortable with the job,\n\nInterviewer 15:18: given that there were multiple stakeholders, I suppose, you know, making, helping make it the decision. How did the Korn Ferry team help just manage, I suppose you know the different voices in the room. Did that work? Francis Kint 15:32 Well, if they did, it was maybe behind the scenes. I wouldn't be surprised, because they've got a great relationship in the US. So I'm definitely certain that also, there must have been a bridge there between Solomon and Korn Ferry to ask for more information. But that's fine for me. You know, that's fine for me, just as the CTO right now, I have no problem that she develops a relationship with with Solomon. I don't have to be in the middle of all these conversations. I've got nothing to hide. So, yeah, it's these people have invested quite a bit in our company, and I fully respect that sometimes they need to build bridges and they don't need to do it all through myself,\n\nInterviewer 16:12: right? Is there anything they could have done better? Francis Kint 16:16 I said smilingly, you know, I'd wish that parking spaces in their own office, because you always have to go to another building, which I find, which I can't understand. Because, you know, frankly, if you want to receive your customers, well, why don't you have some sparking space, at least for your customers, especially because they, you know, it's a lot of people, I think, do their interviews. And I always went to their offices for interviews, because I don't want people here in my office to say, you know, he was really busy, but I was only, I was only the only customer, practically. So I thought, Look, why not? And it's in the center of Ghent, so in the center of Brussels. So, you know, it's a bit annoying. So, no, I've said that. No, frankly, of course, the fact that I knew Danny quite well, that kind of helps. I didn't know his, the person that works with him is a lady called Sarah, and I also think that she did a good job in terms of always making sure everything was taken care of. The reports were sent to me, everything was was well organized. That kind of, for me, that's also important, you know. So the I interviewed, I was able to interview efficiently, because they, you know, in two three visits, I interviewed maybe for each of the jobs, at least 10 people so. And I'm relatively structured, so in the sense that I write everything a little Excel sheet to remember exactly what it was. And yeah, but as you said, CFF also interviewed two or three candidates and so on the last two, right\n\nInterviewer 17:44: in terms of, now, you obviously knew Danny from census, Stuart. How do they compare? Obviously, kind of people aside, but is there anything else that's like sets them apart in terms of the experience from one firm to the other? -- 5 of 8 -- Francis Kint 17:59 I've been thinking about that, because I used Egon Zander quite a bit in the past also, but Egon Zander, I think I've given more difficult because in my role, I've been a CEO or general manager since a long time. Very often I look for country managers, or call them that way, or country general managers. So people in other countries, for instance, even Sander did what I considered as a very difficult search in a region of we have a factory in Brittany in France, and I needed a very good general manager was going to take something really complicated on his shoulders. And I think they did a great job too. But you develop a I find that different type of search. And there you hope you don't, don't need seven candidates you but you need maybe two or three that are in the neighborhoods there will be happy living there, that live there, that are ready to take on difficult jobs and so so with Eagle Xander, I'm, if I think about my work over the last many years, they've always been in these type of positions for that. So it's difficult for me to compare. I think, frankly, that DD searches that now Korn Ferry that were a little bit easier to find candidates. You know, it's we have our offices close to Brussels. So everybody living in Brussels, we are a big group with, you know, 5.3 billion turnover with the decision Center here in Belgium. So even though the first one is Dutch guy, the circuit is Belgium. But let's say, for these people, that's something that comes back all the time, why you're interested in green yards. Maybe one of the first criteria is, well, the decision center is in Belgium, and for that, some people do just not want to travel around all their careers, and so they find it important. So I think that the search was easier I'm going to have to compare with maybe some other things, because other you know, I didn't tell you my story, but I became CEO here in 2024 I had been a CEO before in other companies, but before, when I rejoined this company, I left for six years. I was first the managing director of a division, and I worked there with search firms that are not in the top five. You know that that were, I didn't, I didn't think that top five would be good for the functions that was looking for, like a supply chain director, etc. They are preferred to have more concrete and I would say, for me, if I almost want to say a bit less expensive, firms that that can, that can also find people that are not necessarily in the in in the capital of the country,\n\nInterviewer 20:47: on price. I mean, how do they compare to, to, I suppose, their, you know, their peers. Francis Kint 20:53 I think they're slightly cheaper than Egon Zander, if I compare it to the if I can, if I consider the ratio with, with the salary my I did not make it, but I remember seeing it, I thought, hey, you know, again, the ratio, for instance, with the eagle, the last one I worked with was, was this, with this candidate in France, that's a candidate that makes 250,000 or something. I more expensive that might have to do with maybe the assessment of the difficulty to find someone. And by the way, I was also very happy with Eagle Center to come up, and I find a fantastic candidate that's doing a great job right now in very difficult circumstances.\n\nInterviewer 21:38: -- 6 of 8 -- And in terms of now the brand you know, you having not used Korn Ferry before. I mean, how important is it for you that, when you're making a senior search, that there is a brand that sits behind them? Or is it, is it purely about the individual in their network? Francis Kint 21:55 No, that. My first criterion is the brands. You know what? When I explained it to people saying, well, it's going to be expensive, I said, like, you know, I'm a manager myself with a long career behind him. You know, if you get a call from Korn Ferry of vegan center, you take notice. If it's some there's plenty of firms that still call me today, by the way, you know that are working for private equities and are specialized on these. And it for me, it's, it's not the same appeal in all honesty. So no, the brand is important, right? But they're all kind of all equally. Rate them. Father Spencer Stewart, Heidrick and struggles, Korn Ferry. So yes, the top five, what they call the shreks, when you don't, don't want to, when you then want to choose within the Shrek in Belgium, then obviously you look a little bit about the quality of the local management. And for some reason, there's one of them that I don't rate very high, because they've lost it, and they've been a lot of people, lot of turnover at Spencer Stuart, I also believe that they've got a very good personal consumer products. And at Egon Xander, the person that I know well is kind of retiring, so that plays a role in all fantasy.\n\nInterviewer 23:13: Yeah, absolutely would you. I mean, these obviously are all kind of like for, like, search firms, but Korn Ferry been broader in its offer around or organization consulting. Would you ever consider using them for, especially if you're doing transformation for things like restructuring, like people development, leadership training? Francis Kint 23:34 Yeah, I really consider now the CHRO to have to, he's going to have to put that in place again. I did both of the jobs for a year badly, I'm sure. And I'm really glad to think, hey, now Rob is that's his name. You're going to take care of this. And it goes Broadway. It goes in terms of development. It's terms of, you know, do we offer some of our top guys? I've got a request now to to fund the training, and I'm, you know, he's gonna have to deal with that. But you're right. It may be something that we need to to consider. Since I use these words often, sounds pretty bad, but you know, again, I worked for this firm between 2009 2015 I left six years and I came back and I said, there's more good people that left than good people that came in in the same time, has to do with the fact that we're in a tough industry with very small margins working for these retailers. You know that that press you down all the time, and you have a little bit of a tendency to say, okay, somebody good, somebody good leaves, you know, well, let's try to save his cost. Blah, blah. And for the long term, this is not good.\n\nInterviewer 24:42: I mean, how often do you the management team level spend talking around kind of you know, people or and skills and future skills needed in the business? Is it a priority of yours? Francis Kint 24:55 -- 7 of 8 -- Well, informally, an awful lot, in the sense that, oh, we know this guy, Pepe, from Spain. We know how he is. You know, he's good at that, bad at that. So informally, you know, with the CFF, we talk about it all the time, but we talk about it to resolve things I said, because I'm in a bit difficult position, which is also, you will not say it's good, but when did, one of the four divisions became the CFO, and I, at the request of Solomon, said, you know, fill in for his role. So I do the CEO job, and I do the managing director of one of the divisions. That's much. I can't even dare to say how much the reports I have, but I when they said, how are you going to do that? I said, first, we've got some extremely big customers. I need to spend time with these customers. Sounds stupid, but it's really important, and that's it. Secondly is these managing directors, the or the general managers of the business units. That's really, really important. I once flew to Italy because I had a bad feeling after a meeting. That's that are one of our best guys would leave. And I wanted to, he was going to go on vacation say, You know what? I'm flying to Italy just to come to see you. Oh, it's never, never been a CEO that did, came to to flew into, just had a dinner with me. I'm saying, Yeah, but you know, you're one of our key guys. I wanted to tell you that. So I do spend quite a bit of time, all the time calling them and being being really close to them, being with them in the battle, and that's the way I do it. But that does not mean that we're working on what you just said, and we're going to have to start doing this, because we've got quite a few business units where you have the same guy doing it, that for some reason of quality. You know, we did not ask him to leave, but are clearly short in their jobs. So, yeah. So my answer is, I do spend quite a bit of my own adrenaline, and, you know, to manage these guys. But that does not mean I manage the quality of the guys, great.\n\nInterviewer 27:02: I'm conscious we're nearly at time, and I said it wasn't going to take a whole half an hour. Is there anything else that you think would be useful to share with with me? Francis Kint 27:12 No, frankly, if you're working for Korn Ferry, I think they're doing good job here in Belgium. They're definitely doing the firm that is coming up, while others, I believe, are a little bit in retreat. So no, that would be my final say, great.\n\nInterviewer 27:29: Well, okay, appreciate your time, and really lovely to meet you. Thank you, Interviewer, see you soon. Bye, bye. Transcribed by https://otter.ai -- 8 of 8 --"
}