{
  "id": "t-045",
  "sourceFile": "T40_NPS10_NA_ES_HOUSE_DEC25.pdf",
  "client": "",
  "interviewDate": "2025-12-15",
  "project": "ES",
  "score": 10,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Interviewer 2:00",
      "text": "So thank you for taking part, thanks for agreeing to the call. So just to introduce myself, I'm the managing partner at a growth consultancy. We've worked with Korn Ferry for five or six years now, so they've asked us to do these interviews for them, to have a third party to encourage transparency and you can speak more freely. And , before I start, I've got my Notetaker in here. Are you comfortable with keeping that in here so I can help me write up my notes? Alexander 2:46 Sure, absolutely."
    },
    {
      "speaker": "Interviewer 2:49",
      "text": "Great, we'll kick off. If you could start by just explaining your role in the organization and the relationship that you've had with Korn Ferry to date. Alexander 3:00 So my role is, I'm a HR or recruiting partner, senior recruiting partner here at Franklin Templeton. I've been here since 2017, my role is, I focus on recruitment for the investment management teams here in the Americas, so Canada, US and South America. And whenever we have a position that requires external search services, my job is to reach out to the different search partners, arrange meetings with the hiring leaders and make the introductions and then help the hiring manager, you know, engage with the search firm that they select. We usually have at least three firms meet with each hiring manager, and they interview them, they meet with them, and they select the one that they feel the most comfortable with and able to have the confidence that they can conduct a search in a timely manner and effectively as what they might be looking for."
    },
    {
      "speaker": "Interviewer 3:59",
      "text": "Great and what I mean, how long have you had Korn Ferry on that list? How long have you essentially been working with them? Alexander 4:05 Sure, so I've been working with Korn Ferry. Let me look at my notes here. Let's see. Started working with them for a search up in Canada. I believe it's back in 2022, so not, not too long, three years. And I started with a gentleman there, Andrew Brown. He worked on equity, senior equity research analyst for a position up in Calgary, Canada. The reason why we used Korn Ferry for that level of position, which is more junior than we would normally use on a search firm for is the location is very challenging. Calgary is middle of Canada in the mountains. Most people with the equity research background are in the large cities like Toronto, so it was challenging to find someone, but they were very successful in finding the right candidate to meet our needs. So we hired someone in Canada thereafter, maybe about a year after, we leveraged Korn Ferry in 2024 to work on a head of investment risk position with one of our US equity teams. And they were very successful with that endeavor. You know, received positive feedback from the hiring leader on the experience and post hire of the of the employee placed with us. The feedback has been very positive. And then, most recently, we engaged Korn Ferry for a search with an equities team for a portfolio manager. We did not use Korn Ferry or we discontinued the search. There were some business changes, just with some combining of some teams so but they were able to provide, you know, the level of service and the applicants, you know, the suitable pool of candidates for the hiring manager to look at. And they met the needs of what we were looking for. But unfortunately, the position was closed and we did not fill it."
    },
    {
      "speaker": "Interviewer 6:17",
      "text": "-- 1 of 4 -- Okay, great. What is it that I mean that you're looking for that you prioritize in a search partner? Alexander 6:26 I think it's, to a degree, is flexibility. So I guess the priority be with someone who understands the specific type of role that we're looking for, that has that in depth experience in depth, for example, investment risk, we're looking for someone who's conducted multiple searches in the past couple of years for investment risk, who has that depth of knowledge and investment risk. What that requires the person that we partnered with for that search, her name was Tracy, and she actually has an investment risk background. She understood the role, the needs, and was able to find someone with that type of background. So she, I think it's subject matter expertise, okay, for each role that we're looking for, that's the key part, you know, what we're trying to find, and this is one of the reasons why we have hiring leaders interview three different firms, is we're looking for someone with that, that subject matter, expertise in that particular area. That's important. Number two, I'd probably say, is flexibility. Someone who is flexible in their approach, flexible with the terms you know, here at Franklin Templeton, we have a master service agreement with a search firm, okay, with each of the search firms that we work with, but the budget and who pays for each search is assigned directly to the investment team. So they have their own company, their own entity, their own budget. So what they may be looking for may vary from hiring leader to hiring leader, right in terms of the terms, things like that. So someone who has flexibility, slight flexibility is helpful, because at the end of the day, let's say a chief investment officer has a particular budget. They have to stick with it. And, you know, we just have to make sure that we align the terms with, you know, the budget. And I think Korn Ferry has been very good about working with us on those and you know, I'm also mindful that, you know, the team that I work with at Korn Ferry, you know it has to be worth their effort, right to conduct a search, and that they get paid for the service and work that they do and paid fairly. So it's that fine, that fine balance. And so Korn Ferry has been very good about providing the flexibility that we need. And then I'd probably say, just the relationship, you know, we've had, from my experience, good success with Korn Ferry, at least for the three searches that I've worked on with them. And everyone I worked with have been, you know, good partners to work with. You know, easy to work with, in terms of the style, flexibility, the delivery has been good, the communications. So overall, it's been a very positive experience."
    },
    {
      "speaker": "Interviewer 9:29",
      "text": "How do they compare to their you know, their competitors, right? Alexander 9:37 I would probably rate them in the top, top two or three absolutely, you know, it's for me, we work with different firms, and just like a particular candidate, if a hiring leader, you know, is interviewing, I think some of it comes down to chemistry, but I think with Korn Ferry, the chemistry of the partners that we've been working with have been very good and I think it's been very consistent with the other firms you know that I think they're capable, but sometimes the personalities don't always fit particularly well with the hiring manager style, but I would say Korn Ferry, I would rate very high."
    },
    {
      "speaker": "Interviewer 10:27",
      "text": "And do you use, and if so, do you value, things like their assessment tools or their pay benchmarking data? Alexander 10:39 Yeah, the paid benchmarking data is something that we do look at and that we do look for their expertise. For example, I actually introduced Korn Ferry to another hiring leader for a current search that we're conducting that we have open. It's for a portfolio manager, and we're asking Korn Ferry for market data on pay and what does that entail, in particular, total compensation. We're also looking for carried interest right? You know, the hiring leader that's hiring for this particular role doesn't necessarily have experience working with a carry interest plan. So they're looking for guidance on if they're to offer carry what would that look like? You know, what are what's the typical carry plan for people in this particular area of portfolio management? What does that entail? What would they be looking for if they were to leave, trying to get some ballpark estimates that can help them budget for if we were to go to search externally. So we do leverage that, and also to make sure that what we're offering is competitive in terms of the pay and that, you know, it's helpful for us, because when we have a pay package for a particular role that may be higher than what their team was actually -- 2 of 4 -- budgeted for, it's helpful for had that information so that the hiring leader can go back to their senior leader and present that and make a case for requesting additional funding, you know, for the position, for the hire. So it's very important. And then, if you can maybe remind me again, the first point that you asked?"
    },
    {
      "speaker": "Interviewer 12:26",
      "text": "Around their assessment tools. So you can compare and contrast candidates on specific skills. Alexander 12:33 Yeah, you know, for the past several searches, we haven't really leveraged those assessment tools. I think it's gone from just initial overviews of the candidates backgrounds, all right, the hiring leader, they always like to look at the CVs of the candidates and then select the ones that you know, they have interest in. But they're not necessarily looking at any assessment tools for them. So the hiring leaders are usually, you know, CIOs, and they like to just have a conversation with the particular candidate and assess it, you know, assess them from those interviews."
    },
    {
      "speaker": "Interviewer 13:10",
      "text": "Okay, great. And then in terms of, we've talked about the importance of the chemistry of the individual and of their skill set, or understanding of the sector. How important is the brand itself for you? So, in terms of the credibility or the reputation that it brings? Alexander 13:31 Okay, so how important is it for leveraging Korn Ferry's brand in the marketplace? I would say it is important, but we've had success with other firms that are small boutique firms that may not necessarily have the brand name, but maybe are just as effective in finding the candidates. So it may be more of a localized search firm that has the experience in a particular marketplace, for example, a particular city, like New York City. And so they may be just as effective as Korn Ferry however, you know as because Franklin Templeton is a global firm, right, there is a preference to leverage search partners who have a global presence, so a localized, boutique search firm may not always be ideal from a contractual standpoint. So, whenever we can, we try to leverage these global firms like a Korn Ferry or Heidrick right, those two top names that come to mind. But you know, sometimes there are previous relationships that a hiring leader may have with a localized firm, and they may have a preference for that particular firm because they've used them in the past, and they have an experience they know the hiring leader well and what they might be looking for. So sometimes it does default to those so it could be relationship driven as well. But I'd probably say it is important for me, from my perspective, to have a firm that has the reputation to be able to go out and reach potential candidates that may not otherwise take the call of another firm."
    },
    {
      "speaker": "Interviewer 15:21",
      "text": "And that's very helpful. Thank you. How important is it that, I suppose, if you look at how work is evolving, how they bring in new technology, or maybe AI tools to help advance that search, or is it more around the individual network and knowledge of the business? Alexander 15:44 Yeah, you know, to be honest, I'm not quite familiar what happens behind the scenes with Korn Ferry and, how they reach out to applicants. But I do know from my experience going to industry conferences, I do know that there are other firms, you know, global firms, that are leveraging AI to identify candidates for their candidate pool, but it's a tool, and it's a tool I know that is necessary. And if it helps the search firm identify and be able to build us a bench of candidates to look at a candidate slate that's meaningful and meets the needs of what the hiring leader is looking for. I definitely am a proponent of firms leveraging AI, but what I look to the search firm for is their guidance based on having a conversation with those people. So it's one thing to use AI to identify potential candidates, but what I'm looking for is the search firm's expertise in relationship and being able to have a conversation with the candidates, the prospective candidates, to understand what they're looking for, what their motivations are, what their skill sets are, so by the time that They introduce this particular individual or individuals to us. They're able to provide some commentary feedback on, you know why this particular person may be a good fit What's motivating them? You know, what would they be looking for? Here's their experience, and quickly highlight areas that align well with what the hiring manager is looking for. So we're looking for that, that part of it. So I think, you know, it goes hand in -- 3 of 4 -- hand. AI to identify the applicants, but we need to human the loop, to conduct those conversations and then be able to share that with the hiring manager and then make recommendations. You know, out of these 10 people, these three people, based on our conversations, I feel would be the best match for what you're looking for, based on, you know, the criteria"
    },
    {
      "speaker": "Interviewer 17:54",
      "text": "in terms of kind of Korn Ferry's broader offer. have you ever, or would you ever, consider using Korn Ferry for anything beyond search? Alexander 18:08 I would, but I'm not aware of what other products or services they offer."
    },
    {
      "speaker": "Interviewer 18:13",
      "text": "Okay, so I mean, as an example, as an organization, consultancy, they do a lot of succession planning, board level coaching. They do a lot around ESG and D and I. They also do organizational design. So we're looking at restructuring and planning in that way, for example. So, but it's your answer actually tells me quite a lot, so that's quite interesting in itself. Alexander 18:52 Yeah, I would probably say yes, but at my level, I'm probably not the best person for that conversation to happen. So for introduction, I probably would recommend it to our head of HR as something to you know, for a future presentation right on Korn Ferry, there are other products and services that they could offer. You know, I'm sure that we have existing relationships with firms that we're using now for those types of services. But certainly for the future, it could be, you know, something warranted, right with Korn Ferry, as Korn Ferry has greater success with a firm like us, with the searches, right? It would be a natural evolution in terms of introducing other service lines that we could benefit from"
    },
    {
      "speaker": "Interviewer 19:44",
      "text": "great, great, I think that's it. I mean, unless anything else specifically that you think would be good to share at this stage. Alexander 19:51 overall, it's been a very positive experience. Everyone I've worked with has been an excellent partner, and I would continue to leverage their services whenever I can. So, yeah, it's been, it's been a good partnership, but I appreciate your time. Hopefully you can get a quick bite to eat. but thank you, Interviewer, Feel free to reach out if you need anything else."
    },
    {
      "speaker": "Interviewer 20:20",
      "text": "will do and pleasure to meet you and have a happy holidays. Alexander 20:23 Thank you. Thank you. Bye, bye. -- 4 of 4 --"
    }
  ],
  "rawText": "Interviewer 2:00: So thank you for taking part, thanks for agreeing to the call. So just to introduce myself, I'm the managing partner at a growth consultancy. We've worked with Korn Ferry for five or six years now, so they've asked us to do these interviews for them, to have a third party to encourage transparency and you can speak more freely. And , before I start, I've got my Notetaker in here. Are you comfortable with keeping that in here so I can help me write up my notes? Alexander 2:46 Sure, absolutely.\n\nInterviewer 2:49: Great, we'll kick off. If you could start by just explaining your role in the organization and the relationship that you've had with Korn Ferry to date. Alexander 3:00 So my role is, I'm a HR or recruiting partner, senior recruiting partner here at Franklin Templeton. I've been here since 2017, my role is, I focus on recruitment for the investment management teams here in the Americas, so Canada, US and South America. And whenever we have a position that requires external search services, my job is to reach out to the different search partners, arrange meetings with the hiring leaders and make the introductions and then help the hiring manager, you know, engage with the search firm that they select. We usually have at least three firms meet with each hiring manager, and they interview them, they meet with them, and they select the one that they feel the most comfortable with and able to have the confidence that they can conduct a search in a timely manner and effectively as what they might be looking for.\n\nInterviewer 3:59: Great and what I mean, how long have you had Korn Ferry on that list? How long have you essentially been working with them? Alexander 4:05 Sure, so I've been working with Korn Ferry. Let me look at my notes here. Let's see. Started working with them for a search up in Canada. I believe it's back in 2022, so not, not too long, three years. And I started with a gentleman there, Andrew Brown. He worked on equity, senior equity research analyst for a position up in Calgary, Canada. The reason why we used Korn Ferry for that level of position, which is more junior than we would normally use on a search firm for is the location is very challenging. Calgary is middle of Canada in the mountains. Most people with the equity research background are in the large cities like Toronto, so it was challenging to find someone, but they were very successful in finding the right candidate to meet our needs. So we hired someone in Canada thereafter, maybe about a year after, we leveraged Korn Ferry in 2024 to work on a head of investment risk position with one of our US equity teams. And they were very successful with that endeavor. You know, received positive feedback from the hiring leader on the experience and post hire of the of the employee placed with us. The feedback has been very positive. And then, most recently, we engaged Korn Ferry for a search with an equities team for a portfolio manager. We did not use Korn Ferry or we discontinued the search. There were some business changes, just with some combining of some teams so but they were able to provide, you know, the level of service and the applicants, you know, the suitable pool of candidates for the hiring manager to look at. And they met the needs of what we were looking for. But unfortunately, the position was closed and we did not fill it.\n\nInterviewer 6:17: -- 1 of 4 -- Okay, great. What is it that I mean that you're looking for that you prioritize in a search partner? Alexander 6:26 I think it's, to a degree, is flexibility. So I guess the priority be with someone who understands the specific type of role that we're looking for, that has that in depth experience in depth, for example, investment risk, we're looking for someone who's conducted multiple searches in the past couple of years for investment risk, who has that depth of knowledge and investment risk. What that requires the person that we partnered with for that search, her name was Tracy, and she actually has an investment risk background. She understood the role, the needs, and was able to find someone with that type of background. So she, I think it's subject matter expertise, okay, for each role that we're looking for, that's the key part, you know, what we're trying to find, and this is one of the reasons why we have hiring leaders interview three different firms, is we're looking for someone with that, that subject matter, expertise in that particular area. That's important. Number two, I'd probably say, is flexibility. Someone who is flexible in their approach, flexible with the terms you know, here at Franklin Templeton, we have a master service agreement with a search firm, okay, with each of the search firms that we work with, but the budget and who pays for each search is assigned directly to the investment team. So they have their own company, their own entity, their own budget. So what they may be looking for may vary from hiring leader to hiring leader, right in terms of the terms, things like that. So someone who has flexibility, slight flexibility is helpful, because at the end of the day, let's say a chief investment officer has a particular budget. They have to stick with it. And, you know, we just have to make sure that we align the terms with, you know, the budget. And I think Korn Ferry has been very good about working with us on those and you know, I'm also mindful that, you know, the team that I work with at Korn Ferry, you know it has to be worth their effort, right to conduct a search, and that they get paid for the service and work that they do and paid fairly. So it's that fine, that fine balance. And so Korn Ferry has been very good about providing the flexibility that we need. And then I'd probably say, just the relationship, you know, we've had, from my experience, good success with Korn Ferry, at least for the three searches that I've worked on with them. And everyone I worked with have been, you know, good partners to work with. You know, easy to work with, in terms of the style, flexibility, the delivery has been good, the communications. So overall, it's been a very positive experience.\n\nInterviewer 9:29: How do they compare to their you know, their competitors, right? Alexander 9:37 I would probably rate them in the top, top two or three absolutely, you know, it's for me, we work with different firms, and just like a particular candidate, if a hiring leader, you know, is interviewing, I think some of it comes down to chemistry, but I think with Korn Ferry, the chemistry of the partners that we've been working with have been very good and I think it's been very consistent with the other firms you know that I think they're capable, but sometimes the personalities don't always fit particularly well with the hiring manager style, but I would say Korn Ferry, I would rate very high.\n\nInterviewer 10:27: And do you use, and if so, do you value, things like their assessment tools or their pay benchmarking data? Alexander 10:39 Yeah, the paid benchmarking data is something that we do look at and that we do look for their expertise. For example, I actually introduced Korn Ferry to another hiring leader for a current search that we're conducting that we have open. It's for a portfolio manager, and we're asking Korn Ferry for market data on pay and what does that entail, in particular, total compensation. We're also looking for carried interest right? You know, the hiring leader that's hiring for this particular role doesn't necessarily have experience working with a carry interest plan. So they're looking for guidance on if they're to offer carry what would that look like? You know, what are what's the typical carry plan for people in this particular area of portfolio management? What does that entail? What would they be looking for if they were to leave, trying to get some ballpark estimates that can help them budget for if we were to go to search externally. So we do leverage that, and also to make sure that what we're offering is competitive in terms of the pay and that, you know, it's helpful for us, because when we have a pay package for a particular role that may be higher than what their team was actually -- 2 of 4 -- budgeted for, it's helpful for had that information so that the hiring leader can go back to their senior leader and present that and make a case for requesting additional funding, you know, for the position, for the hire. So it's very important. And then, if you can maybe remind me again, the first point that you asked?\n\nInterviewer 12:26: Around their assessment tools. So you can compare and contrast candidates on specific skills. Alexander 12:33 Yeah, you know, for the past several searches, we haven't really leveraged those assessment tools. I think it's gone from just initial overviews of the candidates backgrounds, all right, the hiring leader, they always like to look at the CVs of the candidates and then select the ones that you know, they have interest in. But they're not necessarily looking at any assessment tools for them. So the hiring leaders are usually, you know, CIOs, and they like to just have a conversation with the particular candidate and assess it, you know, assess them from those interviews.\n\nInterviewer 13:10: Okay, great. And then in terms of, we've talked about the importance of the chemistry of the individual and of their skill set, or understanding of the sector. How important is the brand itself for you? So, in terms of the credibility or the reputation that it brings? Alexander 13:31 Okay, so how important is it for leveraging Korn Ferry's brand in the marketplace? I would say it is important, but we've had success with other firms that are small boutique firms that may not necessarily have the brand name, but maybe are just as effective in finding the candidates. So it may be more of a localized search firm that has the experience in a particular marketplace, for example, a particular city, like New York City. And so they may be just as effective as Korn Ferry however, you know as because Franklin Templeton is a global firm, right, there is a preference to leverage search partners who have a global presence, so a localized, boutique search firm may not always be ideal from a contractual standpoint. So, whenever we can, we try to leverage these global firms like a Korn Ferry or Heidrick right, those two top names that come to mind. But you know, sometimes there are previous relationships that a hiring leader may have with a localized firm, and they may have a preference for that particular firm because they've used them in the past, and they have an experience they know the hiring leader well and what they might be looking for. So sometimes it does default to those so it could be relationship driven as well. But I'd probably say it is important for me, from my perspective, to have a firm that has the reputation to be able to go out and reach potential candidates that may not otherwise take the call of another firm.\n\nInterviewer 15:21: And that's very helpful. Thank you. How important is it that, I suppose, if you look at how work is evolving, how they bring in new technology, or maybe AI tools to help advance that search, or is it more around the individual network and knowledge of the business? Alexander 15:44 Yeah, you know, to be honest, I'm not quite familiar what happens behind the scenes with Korn Ferry and, how they reach out to applicants. But I do know from my experience going to industry conferences, I do know that there are other firms, you know, global firms, that are leveraging AI to identify candidates for their candidate pool, but it's a tool, and it's a tool I know that is necessary. And if it helps the search firm identify and be able to build us a bench of candidates to look at a candidate slate that's meaningful and meets the needs of what the hiring leader is looking for. I definitely am a proponent of firms leveraging AI, but what I look to the search firm for is their guidance based on having a conversation with those people. So it's one thing to use AI to identify potential candidates, but what I'm looking for is the search firm's expertise in relationship and being able to have a conversation with the candidates, the prospective candidates, to understand what they're looking for, what their motivations are, what their skill sets are, so by the time that They introduce this particular individual or individuals to us. They're able to provide some commentary feedback on, you know why this particular person may be a good fit What's motivating them? You know, what would they be looking for? Here's their experience, and quickly highlight areas that align well with what the hiring manager is looking for. So we're looking for that, that part of it. So I think, you know, it goes hand in -- 3 of 4 -- hand. AI to identify the applicants, but we need to human the loop, to conduct those conversations and then be able to share that with the hiring manager and then make recommendations. You know, out of these 10 people, these three people, based on our conversations, I feel would be the best match for what you're looking for, based on, you know, the criteria\n\nInterviewer 17:54: in terms of kind of Korn Ferry's broader offer. have you ever, or would you ever, consider using Korn Ferry for anything beyond search? Alexander 18:08 I would, but I'm not aware of what other products or services they offer.\n\nInterviewer 18:13: Okay, so I mean, as an example, as an organization, consultancy, they do a lot of succession planning, board level coaching. They do a lot around ESG and D and I. They also do organizational design. So we're looking at restructuring and planning in that way, for example. So, but it's your answer actually tells me quite a lot, so that's quite interesting in itself. Alexander 18:52 Yeah, I would probably say yes, but at my level, I'm probably not the best person for that conversation to happen. So for introduction, I probably would recommend it to our head of HR as something to you know, for a future presentation right on Korn Ferry, there are other products and services that they could offer. You know, I'm sure that we have existing relationships with firms that we're using now for those types of services. But certainly for the future, it could be, you know, something warranted, right with Korn Ferry, as Korn Ferry has greater success with a firm like us, with the searches, right? It would be a natural evolution in terms of introducing other service lines that we could benefit from\n\nInterviewer 19:44: great, great, I think that's it. I mean, unless anything else specifically that you think would be good to share at this stage. Alexander 19:51 overall, it's been a very positive experience. Everyone I've worked with has been an excellent partner, and I would continue to leverage their services whenever I can. So, yeah, it's been, it's been a good partnership, but I appreciate your time. Hopefully you can get a quick bite to eat. but thank you, Interviewer, Feel free to reach out if you need anything else.\n\nInterviewer 20:20: will do and pleasure to meet you and have a happy holidays. Alexander 20:23 Thank you. Thank you. Bye, bye. -- 4 of 4 --"
}