{
  "id": "t-046",
  "sourceFile": "T41_NPS7_EMEA_ES_HOUSE_DEC25.pdf",
  "client": "Luke Dale",
  "interviewDate": "2025-12-18",
  "project": "Executive Search",
  "score": 7,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Interviewer 8:27",
      "text": "Firstly, you can see that I've got my Notetaker, checking that you're happy with that? So my team could help me write it up. The process will obviously kind of go into the experience that you had. They will get a report back with some recommendations of how they can make improvements, and then that gets them fed up upstream as well. So yeah, if we kick off by, if you can just explain your role, and then the relationship, engagement that you had with Korn Ferry, Luke Dale 8:57 yeah, absolutely. So I'll give the context to it. So my role is executive is Acquisition Manager Executive Recruitment. So I am basically the Luke Dale side project manager for executive recruitment within Kone internationally. There's myself, a colleague of mine, and for all roles that are of a certain level of seniority, so director level and upwards, we are the people that run the projects internally for Kone, and in fact, we're effectively an internal executive recruitment or executive search function. I joined in June 2025 and was introduced to this process with Korn Ferry, which had been running since December 2023 under my predecessor, who established the piece of work, alongside other colleagues in Kone. And so I took, I took on this particular project about halfway through. And I believe it was a, it was a challenging project when I took it on which, which we can perhaps go into, but I took it on from June, and it was quite advanced but it hadn't been successful at the time."
    },
    {
      "speaker": "Interviewer 10:33",
      "text": "Okay? And what were the, if you could just summarize, the objectives of the of the program. Luke Dale 10:40 The project, so as far as I understand, Korn Ferry were engaged to conduct a confidential executive search process to find a new person to run a major business unit in Kone in Europe, which was the French business unit, which is called FBL - which is France, Belgium and Luxembourg. It's a very, very big geographic and also, obviously turnover, part of Kone's business, and certainly in Europe. And it was being conducted confidentially because the incumbent of the role had been in the position for many years and was looking to transition into another position. The conversations obviously were very confidential and sensitive, and were going to take a long time. So we didn't want to disable the regional business by telling people about it, hence why it was conducted confidentially. This obviously created massive different challenges to the problems that you would have if it wasn't confidential, which would be probably the exact opposite problems that we actually had, which is obviously identifying and securing the right individual for the role in those circumstances, right?"
    },
    {
      "speaker": "Interviewer 12:24",
      "text": "And so talk me through the experience that you had with them then, I mean, obviously you inherited Korn Ferry, so I suppose we take a step back. Have you worked with them in previous roles, in other places? Luke Dale 12:35 I hadn't. No, obviously, I've been in this industry for 25 years, so my whole career internationally, I've worked in other companies. I've never worked for Korn Ferry. I've been interviewed a couple of times and hadn't got the job, but obviously, I was very, very aware of Korn Ferry, of course, widely perceived as being in the top three, at least, if not the top five, the top three internationally as executive search and leadership consulting organization. So very pleased to have the opportunity to actually work with the business and to be, you know, Luke Dale side, and work with them as well. So very pleased to start working with them. The circumstances were a little bit challenging, though, for all concerned. -- 1 of 5 --"
    },
    {
      "speaker": "Interviewer 13:29",
      "text": "Okay, and can you expand on that? Luke Dale 13:32 Absolutely so I wasn't involved, but from what I understand there had been a decision to be very precise about the type of person that the business wanted to appoint, and I think that made it more challenging in order to secure the right individuals in there was a very, very big focus on diversity in the process, which is, absolutely fine, but I think it's possible that the guidance from Kone at the time didn't give Korn Ferry the breadth of scope to actually find enough people to actually run the process. That's what I perceive to have been the case"
    },
    {
      "speaker": "Interviewer 14:38",
      "text": "And did, at any point, Korn Ferry flag this concern with you guys. Luke Dale 14:41 I believe so. I believe that it was flagged. I believe that it was flagged earlier. I believe that the process got to a point where the options had run out of going purely down that particular avenue, and it was flagged and discussed, and I believe there was a change of course, and that was pretty much as I sort of came in, and I positively reinforced the need to look again at the marketplace, you know, in order to be able to get the outcome that we want we wanted."
    },
    {
      "speaker": "Interviewer 15:17",
      "text": "So when you arrived, the brief broadened somewhat, and then what happened? Luke Dale 15:23 Well, from there, Korn Ferry did introduce two new candidates that were very high quality. We interviewed both of them, took them through the process, and one of them was successful, and he's a very high caliber candidate, very strong background, and he's going to be starting in, I would say, February or March time he'll be starting. So the end result has been pleasing, good conclusion in the end, and what I would say is the resilience of the business and the people that I was working with to keep going is greatly appreciated, because I've actually done processes very, very, very similar in the past that have taken multiple, you know, multiple calendar years from when you've started to when you conclude. And they are very challenging, and you do need a lot of resilience to keep going and to make sure that you get the outcome for your customer and your Luke Dale, no matter what, in the end."
    },
    {
      "speaker": "Interviewer 16:46",
      "text": "So in terms of the team you worked with, I mean, continuing, you know, to not give up, how was the, I suppose, the day to day experience? Did you feel informed of what was going on. How was the communication? Was it, you know, weekly status? Was it more informal? Did it work for you? Luke Dale 17:09 There were reasonable updates. Obviously, when you're working through a project, it's a lot of it's about how you establish it in the first place, how you establish the governance, and how it's going to work. It can be more difficult to change things later on, when it's already sort of happening. But the breadth of coverage that the business clearly, that the team did, clearly did, was appreciated, and there was regular reporting. The depth of the reports was good as well. The actual delivery model that the team has is the standard executive search delivery model, and it is greatly appreciated in that having there's three tiers of people that you're dealing with at all times, which means that there's always somebody that is able to actually respond. You don't have, if somebody's off for a day or whatever, you don't have information falling into a pit and nothing happening. So I was dealing with a lady called Carolyn, who's the head of industry for France, and her support team. So a researcher and an administrator as well, and the team setup works very well."
    },
    {
      "speaker": "Interviewer 18:38",
      "text": "Did you, I suppose, digging into that, what was more important for you or how did it play out in terms of the infrastructure that sits behind the team? So, Korn Ferry, and as you'd expect it to have multiple -- 2 of 5 -- people working on it, versus the individual leading it and their network and knowledge or were they both equally as important and valuable? Luke Dale 19:11 Well, that's the question at the heart of recruitment, really. Because to me, that question is, what's more important, the science or the art? and I wouldn't be able to give you an answer on that, because it's honestly both the infrastructure, the fact that there's the processes, procedures that they know how things should work, and it's set up is wonderful. Then on top of that, you actually want to have the people that know how to extract insights from data, create narratives, stories, and give you insights, and also influence people as well. So it's a combination of the two. There's no doubt. And I think that, in the best case, Korn Ferry can give that."
    },
    {
      "speaker": "Interviewer 19:59",
      "text": "and what could they have done differently? I mean, I think you gave them an okay score, what, where could they have made improvements? Luke Dale 20:18 I think the only thing would be that it was obvious to see that there was a bit of frustration, and that it was obvious to see, but maybe just to me, because I'm a recruiter and I'm actually, I've spent as much of my career doing the Korn Ferry bit as the other side of the table. So I don't see it like that. I see it very much as a kind of partnership, and I could tell that it was getting challenging and tiring, and there wasn't a lot left. Like when you conduct a thorough process and you do what you're asked to do, and you get to a certain point, it is natural to start to wonder, where else can we actually go? What else can we do? And I noticed that crept in a little bit understandably. Yeah, this isn't really answering your question. I'm just giving because I think it's important"
    },
    {
      "speaker": "Interviewer 21:19",
      "text": "I mean, what I'm hearing and to play back to you to see if I'm getting it right, is, is that actually, when it's got challenging, as a Luke Dale, there was a level of confidence slip that or resilience. I know we talked about, the resiliency coming through in the end, but you felt what they felt. Luke Dale 21:21 Yeah, I did because I'm attuned to it to a point, you know, and I also completely understand it. But I mean, what I would say is certainly there was a massive amount of change when I came on board, and so we were halfway through the project, there was a huge amount of change that occurred, plus the realization in the project that it wasn't quite hitting. They hadn't got the shortlist that, you know, the shortlist that we wanted. So we had to change angles, yeah, so, my mitigating circumstances would be, there was a lot of change, and there was a bit of a feeling of lagging, but my massive credit would be that actually picked up again and they pulled themselves back from that and it finished very strongly. So it would be overall, that it's a positive, it's not, it's not a negative,"
    },
    {
      "speaker": "Interviewer 23:23",
      "text": "Is there anything else that you would like to kind of really dig into in terms of the overall experience? how do they compare to some of the other big firms that you've worked with? Luke Dale 23:34 The only thing I would say, and this might be because of the situation that they were dealing with before, as in the people that they were dealing with before, the environment I don't know about, but it was a little bit challenging to build rapport with the lead person that I was dealing with, who's a lady called Carolyn, and I think that's a little bit natural in the sense of when you have your lead person from somewhere like Korn Ferry, and you have your lead person from a Kone or a Siemens or whoever. You obviously need to build that relationship. You need some sort of time to really build it, and you need to understand how each other sort of connects. And we didn't really have that."
    },
    {
      "speaker": "Interviewer 24:36",
      "text": "Especially given you inherited it, right? Luke Dale 24:38 -- 3 of 5 -- I inherited it, I sort of was parachuted into it halfway through. My contribution to it was reasonable, but certainly not as much as it would have been in the future, I would think that it would be a completely different situation. So it would be a case that I would be, I think, going to Carolyn, or whoever the representative would be, and starting to set it up, and we would establish it together. We would be on the whole journey together. I do think that my feedback to Carolyn, in this case would be in future, recognize that there's been a cut and that the new person is different, or that, you know, you've got a blank slate. Maybe it wasn't enough of a blank slate towards myself. Obviously, all the other stakeholders in the problems or the pressures of the project were still the same, so it's understandable that she was still in the same mentality overall, but that would be my little bit of feedback would be that if she could have perhaps, you know, we could have gone aside a bit more together as colleagues, we could have shaped it a bit better, a bit earlier between us, just a little bit more collaborative, like that. That would be my only thing."
    },
    {
      "speaker": "Interviewer 26:07",
      "text": "No, that's important, right? That's what partnership is Luke Dale 26:13 Yeah but it's positive feedback, rather than, you know, critical or whatever. Because it was a very challenging situation, so, and that's completely understood,"
    },
    {
      "speaker": "Interviewer 26:26",
      "text": "okay, great. And just finally, kind of looking at your role at the moment, where are your biggest challenges? What is the thing that you're struggling with the most, keeping you awake at night? Luke Dale 26:48 The killer question, well, fundamentally, we're in the process of building a best in class internal executive recruitment function. So, the answer is, all of the challenges of all the different pieces of trying to stand up and continuously improve a really effective internal executive recruitment function that delivers, that can help the business deliver its change strategy over the next five years. That's basically what I think about in my professional life all the time. And then you, then I break obviously, it into sub projects, etc."
    },
    {
      "speaker": "Interviewer 27:29",
      "text": "Did you, just out of interest, did you use their assessment tools for this? So for each candidate? Luke Dale 27:41 I don't believe we did. No, we've got others. We've got a partner that we utilize on an ongoing basis. So we use their leadership assessments,"
    },
    {
      "speaker": "Interviewer 27:51",
      "text": "okay, and pay benchmarking. Did you use that as well? Luke Dale 27:56 I, to be honest. I would need to check, I don't know how in depth they went with the compensation benchmarking, to be honest. I'm not sure, we've certainly got all of those functions, obviously internally as well. So I don't believe that we took advantage of other extended services. I think that it was actually the discrete executive search process, the mapping, the approaching, I think that was all"
    },
    {
      "speaker": "Interviewer 28:31",
      "text": "okay, great, yeah. And last question Luke Dale 28:36 I've got three minutes before I've got another call, Interviewer, yeah"
    },
    {
      "speaker": "Interviewer 28:40",
      "text": "would you, would you use them again? -- 4 of 5 -- Luke Dale 28:42 I would, I would do. I would, I would do. I would be very specific about circumstance and everything and all of that, just like I would with any organization that I was going to work with. But yes, overall, I would work with them again on a case by case basis."
    },
    {
      "speaker": "Interviewer 29:03",
      "text": "Yeah, right, that's it. Well, really appreciate it. Luke Dale 29:09 Yeah, because it's hard to, I wasn't trying to be cagey, but it's, I don't want to sort of tell you things that are completely irrelevant"
    },
    {
      "speaker": "Interviewer 29:17",
      "text": "no, absolutely no, there's some good feedback in there. I mean, we're looking for things that worked well as what's the stuff that they can absolutely reinforce behaviour, holistic. That was great. Well, look, enjoy your time in in Manchester, and thank you. And Happy Christmas, yeah. Luke Dale 30:01 Thank you so much, Interviewer, yeah, and have a lovely Christmas. Bye. -- 5 of 5 --"
    }
  ],
  "rawText": "Interviewer 8:27: Firstly, you can see that I've got my Notetaker, checking that you're happy with that? So my team could help me write it up. The process will obviously kind of go into the experience that you had. They will get a report back with some recommendations of how they can make improvements, and then that gets them fed up upstream as well. So yeah, if we kick off by, if you can just explain your role, and then the relationship, engagement that you had with Korn Ferry, Luke Dale 8:57 yeah, absolutely. So I'll give the context to it. So my role is executive is Acquisition Manager Executive Recruitment. So I am basically the Luke Dale side project manager for executive recruitment within Kone internationally. There's myself, a colleague of mine, and for all roles that are of a certain level of seniority, so director level and upwards, we are the people that run the projects internally for Kone, and in fact, we're effectively an internal executive recruitment or executive search function. I joined in June 2025 and was introduced to this process with Korn Ferry, which had been running since December 2023 under my predecessor, who established the piece of work, alongside other colleagues in Kone. And so I took, I took on this particular project about halfway through. And I believe it was a, it was a challenging project when I took it on which, which we can perhaps go into, but I took it on from June, and it was quite advanced but it hadn't been successful at the time.\n\nInterviewer 10:33: Okay? And what were the, if you could just summarize, the objectives of the of the program. Luke Dale 10:40 The project, so as far as I understand, Korn Ferry were engaged to conduct a confidential executive search process to find a new person to run a major business unit in Kone in Europe, which was the French business unit, which is called FBL - which is France, Belgium and Luxembourg. It's a very, very big geographic and also, obviously turnover, part of Kone's business, and certainly in Europe. And it was being conducted confidentially because the incumbent of the role had been in the position for many years and was looking to transition into another position. The conversations obviously were very confidential and sensitive, and were going to take a long time. So we didn't want to disable the regional business by telling people about it, hence why it was conducted confidentially. This obviously created massive different challenges to the problems that you would have if it wasn't confidential, which would be probably the exact opposite problems that we actually had, which is obviously identifying and securing the right individual for the role in those circumstances, right?\n\nInterviewer 12:24: And so talk me through the experience that you had with them then, I mean, obviously you inherited Korn Ferry, so I suppose we take a step back. Have you worked with them in previous roles, in other places? Luke Dale 12:35 I hadn't. No, obviously, I've been in this industry for 25 years, so my whole career internationally, I've worked in other companies. I've never worked for Korn Ferry. I've been interviewed a couple of times and hadn't got the job, but obviously, I was very, very aware of Korn Ferry, of course, widely perceived as being in the top three, at least, if not the top five, the top three internationally as executive search and leadership consulting organization. So very pleased to have the opportunity to actually work with the business and to be, you know, Luke Dale side, and work with them as well. So very pleased to start working with them. The circumstances were a little bit challenging, though, for all concerned. -- 1 of 5 --\n\nInterviewer 13:29: Okay, and can you expand on that? Luke Dale 13:32 Absolutely so I wasn't involved, but from what I understand there had been a decision to be very precise about the type of person that the business wanted to appoint, and I think that made it more challenging in order to secure the right individuals in there was a very, very big focus on diversity in the process, which is, absolutely fine, but I think it's possible that the guidance from Kone at the time didn't give Korn Ferry the breadth of scope to actually find enough people to actually run the process. That's what I perceive to have been the case\n\nInterviewer 14:38: And did, at any point, Korn Ferry flag this concern with you guys. Luke Dale 14:41 I believe so. I believe that it was flagged. I believe that it was flagged earlier. I believe that the process got to a point where the options had run out of going purely down that particular avenue, and it was flagged and discussed, and I believe there was a change of course, and that was pretty much as I sort of came in, and I positively reinforced the need to look again at the marketplace, you know, in order to be able to get the outcome that we want we wanted.\n\nInterviewer 15:17: So when you arrived, the brief broadened somewhat, and then what happened? Luke Dale 15:23 Well, from there, Korn Ferry did introduce two new candidates that were very high quality. We interviewed both of them, took them through the process, and one of them was successful, and he's a very high caliber candidate, very strong background, and he's going to be starting in, I would say, February or March time he'll be starting. So the end result has been pleasing, good conclusion in the end, and what I would say is the resilience of the business and the people that I was working with to keep going is greatly appreciated, because I've actually done processes very, very, very similar in the past that have taken multiple, you know, multiple calendar years from when you've started to when you conclude. And they are very challenging, and you do need a lot of resilience to keep going and to make sure that you get the outcome for your customer and your Luke Dale, no matter what, in the end.\n\nInterviewer 16:46: So in terms of the team you worked with, I mean, continuing, you know, to not give up, how was the, I suppose, the day to day experience? Did you feel informed of what was going on. How was the communication? Was it, you know, weekly status? Was it more informal? Did it work for you? Luke Dale 17:09 There were reasonable updates. Obviously, when you're working through a project, it's a lot of it's about how you establish it in the first place, how you establish the governance, and how it's going to work. It can be more difficult to change things later on, when it's already sort of happening. But the breadth of coverage that the business clearly, that the team did, clearly did, was appreciated, and there was regular reporting. The depth of the reports was good as well. The actual delivery model that the team has is the standard executive search delivery model, and it is greatly appreciated in that having there's three tiers of people that you're dealing with at all times, which means that there's always somebody that is able to actually respond. You don't have, if somebody's off for a day or whatever, you don't have information falling into a pit and nothing happening. So I was dealing with a lady called Carolyn, who's the head of industry for France, and her support team. So a researcher and an administrator as well, and the team setup works very well.\n\nInterviewer 18:38: Did you, I suppose, digging into that, what was more important for you or how did it play out in terms of the infrastructure that sits behind the team? So, Korn Ferry, and as you'd expect it to have multiple -- 2 of 5 -- people working on it, versus the individual leading it and their network and knowledge or were they both equally as important and valuable? Luke Dale 19:11 Well, that's the question at the heart of recruitment, really. Because to me, that question is, what's more important, the science or the art? and I wouldn't be able to give you an answer on that, because it's honestly both the infrastructure, the fact that there's the processes, procedures that they know how things should work, and it's set up is wonderful. Then on top of that, you actually want to have the people that know how to extract insights from data, create narratives, stories, and give you insights, and also influence people as well. So it's a combination of the two. There's no doubt. And I think that, in the best case, Korn Ferry can give that.\n\nInterviewer 19:59: and what could they have done differently? I mean, I think you gave them an okay score, what, where could they have made improvements? Luke Dale 20:18 I think the only thing would be that it was obvious to see that there was a bit of frustration, and that it was obvious to see, but maybe just to me, because I'm a recruiter and I'm actually, I've spent as much of my career doing the Korn Ferry bit as the other side of the table. So I don't see it like that. I see it very much as a kind of partnership, and I could tell that it was getting challenging and tiring, and there wasn't a lot left. Like when you conduct a thorough process and you do what you're asked to do, and you get to a certain point, it is natural to start to wonder, where else can we actually go? What else can we do? And I noticed that crept in a little bit understandably. Yeah, this isn't really answering your question. I'm just giving because I think it's important\n\nInterviewer 21:19: I mean, what I'm hearing and to play back to you to see if I'm getting it right, is, is that actually, when it's got challenging, as a Luke Dale, there was a level of confidence slip that or resilience. I know we talked about, the resiliency coming through in the end, but you felt what they felt. Luke Dale 21:21 Yeah, I did because I'm attuned to it to a point, you know, and I also completely understand it. But I mean, what I would say is certainly there was a massive amount of change when I came on board, and so we were halfway through the project, there was a huge amount of change that occurred, plus the realization in the project that it wasn't quite hitting. They hadn't got the shortlist that, you know, the shortlist that we wanted. So we had to change angles, yeah, so, my mitigating circumstances would be, there was a lot of change, and there was a bit of a feeling of lagging, but my massive credit would be that actually picked up again and they pulled themselves back from that and it finished very strongly. So it would be overall, that it's a positive, it's not, it's not a negative,\n\nInterviewer 23:23: Is there anything else that you would like to kind of really dig into in terms of the overall experience? how do they compare to some of the other big firms that you've worked with? Luke Dale 23:34 The only thing I would say, and this might be because of the situation that they were dealing with before, as in the people that they were dealing with before, the environment I don't know about, but it was a little bit challenging to build rapport with the lead person that I was dealing with, who's a lady called Carolyn, and I think that's a little bit natural in the sense of when you have your lead person from somewhere like Korn Ferry, and you have your lead person from a Kone or a Siemens or whoever. You obviously need to build that relationship. You need some sort of time to really build it, and you need to understand how each other sort of connects. And we didn't really have that.\n\nInterviewer 24:36: Especially given you inherited it, right? Luke Dale 24:38 -- 3 of 5 -- I inherited it, I sort of was parachuted into it halfway through. My contribution to it was reasonable, but certainly not as much as it would have been in the future, I would think that it would be a completely different situation. So it would be a case that I would be, I think, going to Carolyn, or whoever the representative would be, and starting to set it up, and we would establish it together. We would be on the whole journey together. I do think that my feedback to Carolyn, in this case would be in future, recognize that there's been a cut and that the new person is different, or that, you know, you've got a blank slate. Maybe it wasn't enough of a blank slate towards myself. Obviously, all the other stakeholders in the problems or the pressures of the project were still the same, so it's understandable that she was still in the same mentality overall, but that would be my little bit of feedback would be that if she could have perhaps, you know, we could have gone aside a bit more together as colleagues, we could have shaped it a bit better, a bit earlier between us, just a little bit more collaborative, like that. That would be my only thing.\n\nInterviewer 26:07: No, that's important, right? That's what partnership is Luke Dale 26:13 Yeah but it's positive feedback, rather than, you know, critical or whatever. Because it was a very challenging situation, so, and that's completely understood,\n\nInterviewer 26:26: okay, great. And just finally, kind of looking at your role at the moment, where are your biggest challenges? What is the thing that you're struggling with the most, keeping you awake at night? Luke Dale 26:48 The killer question, well, fundamentally, we're in the process of building a best in class internal executive recruitment function. So, the answer is, all of the challenges of all the different pieces of trying to stand up and continuously improve a really effective internal executive recruitment function that delivers, that can help the business deliver its change strategy over the next five years. That's basically what I think about in my professional life all the time. And then you, then I break obviously, it into sub projects, etc.\n\nInterviewer 27:29: Did you, just out of interest, did you use their assessment tools for this? So for each candidate? Luke Dale 27:41 I don't believe we did. No, we've got others. We've got a partner that we utilize on an ongoing basis. So we use their leadership assessments,\n\nInterviewer 27:51: okay, and pay benchmarking. Did you use that as well? Luke Dale 27:56 I, to be honest. I would need to check, I don't know how in depth they went with the compensation benchmarking, to be honest. I'm not sure, we've certainly got all of those functions, obviously internally as well. So I don't believe that we took advantage of other extended services. I think that it was actually the discrete executive search process, the mapping, the approaching, I think that was all\n\nInterviewer 28:31: okay, great, yeah. And last question Luke Dale 28:36 I've got three minutes before I've got another call, Interviewer, yeah\n\nInterviewer 28:40: would you, would you use them again? -- 4 of 5 -- Luke Dale 28:42 I would, I would do. I would, I would do. I would be very specific about circumstance and everything and all of that, just like I would with any organization that I was going to work with. But yes, overall, I would work with them again on a case by case basis.\n\nInterviewer 29:03: Yeah, right, that's it. Well, really appreciate it. Luke Dale 29:09 Yeah, because it's hard to, I wasn't trying to be cagey, but it's, I don't want to sort of tell you things that are completely irrelevant\n\nInterviewer 29:17: no, absolutely no, there's some good feedback in there. I mean, we're looking for things that worked well as what's the stuff that they can absolutely reinforce behaviour, holistic. That was great. Well, look, enjoy your time in in Manchester, and thank you. And Happy Christmas, yeah. Luke Dale 30:01 Thank you so much, Interviewer, yeah, and have a lovely Christmas. Bye. -- 5 of 5 --"
}