{
  "id": "t-047",
  "sourceFile": "T42_NPS9_EMEA_CONSULTING_HOUSE_JAN26.pdf",
  "client": "Lesley Dwyer",
  "interviewDate": "2026-01-05",
  "project": "Consulting",
  "score": 9,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Interviewer 2:23",
      "text": "So just to introduce myself, We are a partner with Korn Ferry, so they've asked us to run these interviews as a third party agnostic, it's to encourage you to speak as freely as you care to. You'll see that I've got a note taker in here. Are you all right with that? Yeah, my team can help us write up the report, and that's it really so, yeah, it's just to dig follow up, obviously, from the NPS score that you already gave. So thank you for that. Just to dig into a little bit further. So if we kick off by, if you can just explain your role and then the relationship that you've had with Korn Ferry, Lesley 3:19 okay, so my current role is that of the group, Chief Executive of the Norfolk and Norwich University Hospital. Our first, I think, assignment or contract with Korn Ferry, though it was when I was the chief executive of the Norfolk and Norwich University Hospital and however, we were rapidly starting to move into that of the group at the same time. So it probably has spanned two, two assignments, really. One was specifically for the Norfolk and Norwich University Hospital, and the other is for the group, designing a group HR model for us."
    },
    {
      "speaker": "Interviewer 3:56",
      "text": "And was this the first time you've worked with Korn Ferry, or have you had previous engagements with him in the past? Lesley 4:01 No, this was the first time I've worked with Korn Ferry."
    },
    {
      "speaker": "Interviewer 4:06",
      "text": "Okay, and how did you decide to work with them? Was it a pitch situation, or how did it come about? Lesley 4:14 No, look, I think it was really because I wanted the important advice, particularly of an individual who I happen to trust. I'd worked with him before. He'd recently moved to Korn Ferry, which probably Korn Ferry at that point, may not have flagged up as being somebody that certainly ferry of the East of England, that would have probably flagged up as a company that we would have approached and because I wanted to work with James only because I trust him, I know what his experience has been, I thought it was an opportunity for us to do that. So obviously it went through all of the usual procurement etc that we needed to but important for me that you know when you're particularly looking for advice on restructuring, that you have it from somebody that understands the NHS and the barriers that may be put forward as being a reason not to do things, but somebody who actually understands what it is that I Want to achieve. So I've worked with James before."
    },
    {
      "speaker": "Interviewer 5:21",
      "text": "where had you worked with James in his previous role? Lesley 5:27 James was our HRD, and then went on to and my deputy when I was the chief executive down at Medway. But then I went back, yeah, then I went back to Australia as James went into his new career, as I call it. And so I've been keeping a, you know, I suppose, just a bit of an eye out on what he was doing, etc. And as I say, having people who understand, not just the NHS, because any consultant company can understand that in all but it's actually about understanding what implementation looks like in our real world. So I wanted somebody who was able to: one - bring a team together to assist us, and two - to understand what would it take to implement any recommendation, -- 1 of 5 --"
    },
    {
      "speaker": "Interviewer 6:16",
      "text": "great and overall, and obviously you gave them a really positive score, can you just expand on the experience that you had? So I suppose, from meeting your expectations, from the project objectives through to the way that you were engaged as a project unfolded. Lesley 6:34 Okay, I think for me, knowing that somebody would give me honest feedback, one of the things I know is that many organizations make really dreadful Lesleys because they either think that the person's coming in or the group's coming in to do everything that I think I'm paying them to do, or they find all the reasons why that advice is wrong. And for me, having somebody trusted that was able to escalate when you know that did happen, it was anticipated that everybody would find the reasons why we can't do things, but also escalating when people aren't making themselves available meant that I could manage that in real time. That was really important to me, because I can't tell you the number of times we've had assistance across a whole range of things, and then they say, but, but, but. And I think if I'd only known that, then I could have done something. I wanted them particularly because, as I said, James and some of the team have worked both in provider land now in consulting land, to be able to talk to the teams about what good Lesleys look like, what they would do so almost that mutuality, and they did do that. Yes, we've gone a little bit longer. I think, if I had some reflection, is I gave this to two very senior people to manage, because I don't manage every project that would be unrealistic for the chief executive to do that, and probably should have just checked that it wasn't becoming a little diffused by a particular individual's view, or three individuals views. But at the same time, I think that, you know, again, James, you know, we didn't want to overuse it, because it was important that he had a trusted relationship, too. And they didn't think, well, we're always running to Lesley. But you know, we now have a framework by which we can move move forward with that. You know, I always look for consultants for added value, and for me, often it's about helping us start to become better Lesleys. Because by being better Lesleys, it means we understand the business through a different lens, not just the effort lens."
    },
    {
      "speaker": "Interviewer 8:42",
      "text": "And in terms of the team that came with James, obviously, you know, relatively new to you, how did, how did you find the team experience? Lesley 8:53 So the team was quite small, so it wasn't large team. I did know of two of them, which was good. So that was one of the reasons that we were happy to go forward with Korn Ferry, because, again, they had the backgrounds that meant that they would understand our context. So the team were fine. Yeah, the team was fine. I think if I did give them feedback, which was, you know, when I find that consultant groups at times, and this didn't happen with James, get captured by ourselves. I always said, you know, don't change your model, because, in actual fact, that's why we employed you. And so that we did have a couple of moments where I felt that that was happening a little bit to try and meet people where they are, whereas I would be a bit more hardnosed, which is no not going to that's not going to happen. But as James said, he used to follow me around, always saying what she really means is I actually meant what I said the first time."
    },
    {
      "speaker": "Interviewer 10:00",
      "text": "And I suppose, in terms of your first experience of working with Korn Ferry, I mean, did you see, did you see any kind of value beyond the relationship you have with James, from working with, you know, a tried and trusted brand, Lesley 10:18 yeah, so, as I said, I hadn't used Korn Ferry before. Obviously, I'm aware of them in the market, and so perhaps I've now got a greater appreciation of the breadth that Korn Ferry can bring to us, particularly, not necessarily so much, even just in the health space, but certainly the much more commercial aspects of it. Now we're not in a position at the moment to do anything with that right now. We need to complete what we're currently doing. But it certainly means that we would bring, you know, sort of consider Korn Ferry, which potentially we wouldn't have, and that probably just shows the very narrow lens that at times the NHS can bring, -- 2 of 5 --"
    },
    {
      "speaker": "Interviewer 11:03",
      "text": "yeah, well, I think it works on both sides, doesn't it? I mean, if I suppose, touching on something that you said about, you know, not being aware of the breadth of their offer, if James hadn't have been there, I mean, what would you have associated Korn Ferry with prior to, kind of your engagement with James? Lesley 11:20 I think I probably would have associated them much more around commercial type, private sector, rather than necessarily what we were doing. Though, I had become more interested in, potentially their workforce models as such that there's, you know, quite a bit around leadership from Korn Ferry, which, again, I probably hadn't appreciated that that would be part of their offer as well."
    },
    {
      "speaker": "Interviewer 11:46",
      "text": "Is there anything you would like to see more of now as a Lesley of theirs? Would you like to kind of feel more engaged with them moving forward? Like to, I suppose, offer thought leadership, that sort of things, is that valuable to you or not really? Lesley 12:03 No, it is valuable because I do think that that is important, because most of us actually just try and manage individual issues and I'm trying to balance this with it. I'm now in a system that between the three hospitals more so the two smaller ones, they are awash with consultants. And so for me, there is something around an offer of leadership capability, and I don't mean the soft leadership, you know, that's important, but we are not employing people with the skill set. We need to lead. And I need people to understand, you know, what roles are. And I have talked to James just a little bit about it, because we will have to restructure through this. And we really have not given people experience in this very closed system. And it is a very closed system, let me tell you, in the East of England, and I don't know how it's managed, to keep that way, I've been there 18 months now, and I continue to get surprised by it. But some of that leadership and what I call management development is something that I am interested in. But at the same time, you know, I always say to people, if anybody could come to me and make me one offer which is not based on it's this, and it's so painfully slow that I'll be voluntarily retired before it's done. I really would love to almost say, Let's totally restructure the entire place on every process that we have in place. You know, really building it to be productive. It's no surprise, not many consultants firms want to do that, because it's, you know, well, it is a big task, but there must be ones out there that can is to say, I actually want you to design me a new process using some tools now, Korn, Ferry did that for us, in the HR sense, saying that these are the tools you need to start using. However, without education for the staff, all of our clinical staff will say, Well, that's all well and good, but now I'm spending more time in front of a computer doing things. So from you know, it's true, you know, HR, want to be consultants. Great. I need some of you to be doers for them, or teaching their EAS how to do that safely. And so we have got some follow on work that we will need to go back to. I'll say to the market, because, you know, I'm bound by all the same procurement rules as anybody else. And you know, I can do some direct appointments, but I can't keep doing them."
    },
    {
      "speaker": "Interviewer 14:39",
      "text": "Yeah, would you say, then, which is your biggest challenge? Is it process and kind of outdated processes, or is it the people that that work the process and their skill set? Lesley 14:53 I think it's both in equal measure, because the process has meant people are actually working in really, you know, sort of non productive ways, the repetitiveness, if you don't mind, I'll give you a great example. Most of these hospitals brought in a booking system. Now that's not unusual in, you know, the NHS, they all tended to use a very similar one. Or, you know, AI generated all of these things, but unfortunately, wasn't implemented particularly well. So now I not only send you all of your digital reminders and appointments, but because I don't trust that, I'll send you all of them by post as well, and I'll send it by first class post because I don't trust the post office as well. Well, okay, so you're doubling up and and 5 million pounds later in one hospital. That's my postage charge. Yeah, And so it's both because, in fact, when we say that, you don't, you know, we've introduced something new process, yes, but I don't trust it. And so I keep saying, when we put that in, we've got, we've got to take away everything else, yeah, anyway, sorry, that's just been a bit trite, but it just is really irritated -- 3 of 5 -- me because, because it's tried and true everywhere, and so Korn Ferry has helped us, from a HR perspective, to standardize processes. That's helpful now in coming together as a group, and are they?"
    },
    {
      "speaker": "Interviewer 16:22",
      "text": "Are you finding, you know, there's that they have been implemented, Lesley 16:29 no, they haven't been implemented yet, and that's an internal issue, because I think we're trying to do so much at the moment, when you end up with what is a HR function with absolutely nobody that can drive anything. We now need to recruit to some key roles before we go again. We just do not have the capability if they're not all in their sick beds. The minute any pressure comes on people, everybody heads off to the sick bed, which is quite a new phenomena for me, right?"
    },
    {
      "speaker": "Interviewer 17:31",
      "text": "So going back to Korn Ferry in the experience, is there anything that they could have done better that you would feed back to them to say, actually, you know, you can make improvements. Lesley 17:46 I think I may have wanted to know a little bit earlier that they were getting stymied, you know, just held up a little bit. And at that point I probably would have given them a bit more authority and changed the scope a little bit we ended up doing that. So actually, no, you're not to water down what they do, etc. But at the same time, I needed ownership of it. I needed the people I would look to to implement, to actually own it. And I'm not too sure that that happened in the way that I wanted. I'm not putting that at Korn Ferry, but, you know, I'd say that to any consultant group, escalate the minute you feel that where that there's not enough alignment internally. Yeah, and could we have done it any earlier? I'm not sure that we could. It's taken us six months of just, you know, tedious but important work, just to get through, to get everybody to the same page. And now we've only really populated the group, so now we have to start delivering, you know, against a backdrop that's been quite messy."
    },
    {
      "speaker": "Interviewer 18:53",
      "text": "Yeah, absolutely great. I think that's it. I mean, unless there's anything else you think about the team at this stage. I think that's been really helpful for you. Lesley 19:06 So you know, I'm going to talk to James around, potentially acting as critical friend. It'll be a contractual critical friend to ensure that we implement in the way that the recommendations were intended. Because I'm quite experienced, and I often know that that will mean I'll be having to watch very closely, and I have got this happening across about a dozen different parts of the business. And so I do think it's really important that consultants see that their role is to ensure successful implementation, rather than just recommendation. And yeah, so that will be something that we'd do. But also, I am interested in understanding other offers, because this place is awash with consultants, you name them. The only ones we haven't been able to have are the ones they couldn't afford, like McKinsey's BCG through a project they have afforded, but we couldn't afford them across the breadth of the business. And there are more and more coming out of the market. I don't think they realize that trusts that get into trouble have very little ability to bring in help, because that help is usually help that NHS like to bring in most of these people I wouldn't employ. So I think there is a emerging business model, which is, how do these groups actually start to take the place and build capability within the NHS on leadership. I've talked to Jim about it, but telling me, oh, look, you can have these have have beens that, you know, we had to find a job for. They've had a bit of an interest in improvement. They don't help me. They do not help me. Yeah? They just tell me what I need to keep. Yeah, I need expertise. And I need expertise to show people what different looks like, and then to lead them through, helping change that and building capability as you go. So I don't, I always say, I don't think I'm asking for too much, but it's really interesting. You know, I'm always of a view that with any firms, you will always not have one that can do everything for you, but I do look for what I'll call strategic partners, who are happy to bring in the expertise, because organizations cannot manage multiple relationships and on that, I am absolutely clear. -- 4 of 5 --"
    },
    {
      "speaker": "Interviewer 21:14",
      "text": "Yeah, absolutely makes sense. Great. Brilliant. Lesley 21:39 All right, then, okay, Nice to have met you. You take care. Bye, bye, bye. -- 5 of 5 --"
    }
  ],
  "rawText": "Interviewer 2:23: So just to introduce myself, We are a partner with Korn Ferry, so they've asked us to run these interviews as a third party agnostic, it's to encourage you to speak as freely as you care to. You'll see that I've got a note taker in here. Are you all right with that? Yeah, my team can help us write up the report, and that's it really so, yeah, it's just to dig follow up, obviously, from the NPS score that you already gave. So thank you for that. Just to dig into a little bit further. So if we kick off by, if you can just explain your role and then the relationship that you've had with Korn Ferry, Lesley 3:19 okay, so my current role is that of the group, Chief Executive of the Norfolk and Norwich University Hospital. Our first, I think, assignment or contract with Korn Ferry, though it was when I was the chief executive of the Norfolk and Norwich University Hospital and however, we were rapidly starting to move into that of the group at the same time. So it probably has spanned two, two assignments, really. One was specifically for the Norfolk and Norwich University Hospital, and the other is for the group, designing a group HR model for us.\n\nInterviewer 3:56: And was this the first time you've worked with Korn Ferry, or have you had previous engagements with him in the past? Lesley 4:01 No, this was the first time I've worked with Korn Ferry.\n\nInterviewer 4:06: Okay, and how did you decide to work with them? Was it a pitch situation, or how did it come about? Lesley 4:14 No, look, I think it was really because I wanted the important advice, particularly of an individual who I happen to trust. I'd worked with him before. He'd recently moved to Korn Ferry, which probably Korn Ferry at that point, may not have flagged up as being somebody that certainly ferry of the East of England, that would have probably flagged up as a company that we would have approached and because I wanted to work with James only because I trust him, I know what his experience has been, I thought it was an opportunity for us to do that. So obviously it went through all of the usual procurement etc that we needed to but important for me that you know when you're particularly looking for advice on restructuring, that you have it from somebody that understands the NHS and the barriers that may be put forward as being a reason not to do things, but somebody who actually understands what it is that I Want to achieve. So I've worked with James before.\n\nInterviewer 5:21: where had you worked with James in his previous role? Lesley 5:27 James was our HRD, and then went on to and my deputy when I was the chief executive down at Medway. But then I went back, yeah, then I went back to Australia as James went into his new career, as I call it. And so I've been keeping a, you know, I suppose, just a bit of an eye out on what he was doing, etc. And as I say, having people who understand, not just the NHS, because any consultant company can understand that in all but it's actually about understanding what implementation looks like in our real world. So I wanted somebody who was able to: one - bring a team together to assist us, and two - to understand what would it take to implement any recommendation, -- 1 of 5 --\n\nInterviewer 6:16: great and overall, and obviously you gave them a really positive score, can you just expand on the experience that you had? So I suppose, from meeting your expectations, from the project objectives through to the way that you were engaged as a project unfolded. Lesley 6:34 Okay, I think for me, knowing that somebody would give me honest feedback, one of the things I know is that many organizations make really dreadful Lesleys because they either think that the person's coming in or the group's coming in to do everything that I think I'm paying them to do, or they find all the reasons why that advice is wrong. And for me, having somebody trusted that was able to escalate when you know that did happen, it was anticipated that everybody would find the reasons why we can't do things, but also escalating when people aren't making themselves available meant that I could manage that in real time. That was really important to me, because I can't tell you the number of times we've had assistance across a whole range of things, and then they say, but, but, but. And I think if I'd only known that, then I could have done something. I wanted them particularly because, as I said, James and some of the team have worked both in provider land now in consulting land, to be able to talk to the teams about what good Lesleys look like, what they would do so almost that mutuality, and they did do that. Yes, we've gone a little bit longer. I think, if I had some reflection, is I gave this to two very senior people to manage, because I don't manage every project that would be unrealistic for the chief executive to do that, and probably should have just checked that it wasn't becoming a little diffused by a particular individual's view, or three individuals views. But at the same time, I think that, you know, again, James, you know, we didn't want to overuse it, because it was important that he had a trusted relationship, too. And they didn't think, well, we're always running to Lesley. But you know, we now have a framework by which we can move move forward with that. You know, I always look for consultants for added value, and for me, often it's about helping us start to become better Lesleys. Because by being better Lesleys, it means we understand the business through a different lens, not just the effort lens.\n\nInterviewer 8:42: And in terms of the team that came with James, obviously, you know, relatively new to you, how did, how did you find the team experience? Lesley 8:53 So the team was quite small, so it wasn't large team. I did know of two of them, which was good. So that was one of the reasons that we were happy to go forward with Korn Ferry, because, again, they had the backgrounds that meant that they would understand our context. So the team were fine. Yeah, the team was fine. I think if I did give them feedback, which was, you know, when I find that consultant groups at times, and this didn't happen with James, get captured by ourselves. I always said, you know, don't change your model, because, in actual fact, that's why we employed you. And so that we did have a couple of moments where I felt that that was happening a little bit to try and meet people where they are, whereas I would be a bit more hardnosed, which is no not going to that's not going to happen. But as James said, he used to follow me around, always saying what she really means is I actually meant what I said the first time.\n\nInterviewer 10:00: And I suppose, in terms of your first experience of working with Korn Ferry, I mean, did you see, did you see any kind of value beyond the relationship you have with James, from working with, you know, a tried and trusted brand, Lesley 10:18 yeah, so, as I said, I hadn't used Korn Ferry before. Obviously, I'm aware of them in the market, and so perhaps I've now got a greater appreciation of the breadth that Korn Ferry can bring to us, particularly, not necessarily so much, even just in the health space, but certainly the much more commercial aspects of it. Now we're not in a position at the moment to do anything with that right now. We need to complete what we're currently doing. But it certainly means that we would bring, you know, sort of consider Korn Ferry, which potentially we wouldn't have, and that probably just shows the very narrow lens that at times the NHS can bring, -- 2 of 5 --\n\nInterviewer 11:03: yeah, well, I think it works on both sides, doesn't it? I mean, if I suppose, touching on something that you said about, you know, not being aware of the breadth of their offer, if James hadn't have been there, I mean, what would you have associated Korn Ferry with prior to, kind of your engagement with James? Lesley 11:20 I think I probably would have associated them much more around commercial type, private sector, rather than necessarily what we were doing. Though, I had become more interested in, potentially their workforce models as such that there's, you know, quite a bit around leadership from Korn Ferry, which, again, I probably hadn't appreciated that that would be part of their offer as well.\n\nInterviewer 11:46: Is there anything you would like to see more of now as a Lesley of theirs? Would you like to kind of feel more engaged with them moving forward? Like to, I suppose, offer thought leadership, that sort of things, is that valuable to you or not really? Lesley 12:03 No, it is valuable because I do think that that is important, because most of us actually just try and manage individual issues and I'm trying to balance this with it. I'm now in a system that between the three hospitals more so the two smaller ones, they are awash with consultants. And so for me, there is something around an offer of leadership capability, and I don't mean the soft leadership, you know, that's important, but we are not employing people with the skill set. We need to lead. And I need people to understand, you know, what roles are. And I have talked to James just a little bit about it, because we will have to restructure through this. And we really have not given people experience in this very closed system. And it is a very closed system, let me tell you, in the East of England, and I don't know how it's managed, to keep that way, I've been there 18 months now, and I continue to get surprised by it. But some of that leadership and what I call management development is something that I am interested in. But at the same time, you know, I always say to people, if anybody could come to me and make me one offer which is not based on it's this, and it's so painfully slow that I'll be voluntarily retired before it's done. I really would love to almost say, Let's totally restructure the entire place on every process that we have in place. You know, really building it to be productive. It's no surprise, not many consultants firms want to do that, because it's, you know, well, it is a big task, but there must be ones out there that can is to say, I actually want you to design me a new process using some tools now, Korn, Ferry did that for us, in the HR sense, saying that these are the tools you need to start using. However, without education for the staff, all of our clinical staff will say, Well, that's all well and good, but now I'm spending more time in front of a computer doing things. So from you know, it's true, you know, HR, want to be consultants. Great. I need some of you to be doers for them, or teaching their EAS how to do that safely. And so we have got some follow on work that we will need to go back to. I'll say to the market, because, you know, I'm bound by all the same procurement rules as anybody else. And you know, I can do some direct appointments, but I can't keep doing them.\n\nInterviewer 14:39: Yeah, would you say, then, which is your biggest challenge? Is it process and kind of outdated processes, or is it the people that that work the process and their skill set? Lesley 14:53 I think it's both in equal measure, because the process has meant people are actually working in really, you know, sort of non productive ways, the repetitiveness, if you don't mind, I'll give you a great example. Most of these hospitals brought in a booking system. Now that's not unusual in, you know, the NHS, they all tended to use a very similar one. Or, you know, AI generated all of these things, but unfortunately, wasn't implemented particularly well. So now I not only send you all of your digital reminders and appointments, but because I don't trust that, I'll send you all of them by post as well, and I'll send it by first class post because I don't trust the post office as well. Well, okay, so you're doubling up and and 5 million pounds later in one hospital. That's my postage charge. Yeah, And so it's both because, in fact, when we say that, you don't, you know, we've introduced something new process, yes, but I don't trust it. And so I keep saying, when we put that in, we've got, we've got to take away everything else, yeah, anyway, sorry, that's just been a bit trite, but it just is really irritated -- 3 of 5 -- me because, because it's tried and true everywhere, and so Korn Ferry has helped us, from a HR perspective, to standardize processes. That's helpful now in coming together as a group, and are they?\n\nInterviewer 16:22: Are you finding, you know, there's that they have been implemented, Lesley 16:29 no, they haven't been implemented yet, and that's an internal issue, because I think we're trying to do so much at the moment, when you end up with what is a HR function with absolutely nobody that can drive anything. We now need to recruit to some key roles before we go again. We just do not have the capability if they're not all in their sick beds. The minute any pressure comes on people, everybody heads off to the sick bed, which is quite a new phenomena for me, right?\n\nInterviewer 17:31: So going back to Korn Ferry in the experience, is there anything that they could have done better that you would feed back to them to say, actually, you know, you can make improvements. Lesley 17:46 I think I may have wanted to know a little bit earlier that they were getting stymied, you know, just held up a little bit. And at that point I probably would have given them a bit more authority and changed the scope a little bit we ended up doing that. So actually, no, you're not to water down what they do, etc. But at the same time, I needed ownership of it. I needed the people I would look to to implement, to actually own it. And I'm not too sure that that happened in the way that I wanted. I'm not putting that at Korn Ferry, but, you know, I'd say that to any consultant group, escalate the minute you feel that where that there's not enough alignment internally. Yeah, and could we have done it any earlier? I'm not sure that we could. It's taken us six months of just, you know, tedious but important work, just to get through, to get everybody to the same page. And now we've only really populated the group, so now we have to start delivering, you know, against a backdrop that's been quite messy.\n\nInterviewer 18:53: Yeah, absolutely great. I think that's it. I mean, unless there's anything else you think about the team at this stage. I think that's been really helpful for you. Lesley 19:06 So you know, I'm going to talk to James around, potentially acting as critical friend. It'll be a contractual critical friend to ensure that we implement in the way that the recommendations were intended. Because I'm quite experienced, and I often know that that will mean I'll be having to watch very closely, and I have got this happening across about a dozen different parts of the business. And so I do think it's really important that consultants see that their role is to ensure successful implementation, rather than just recommendation. And yeah, so that will be something that we'd do. But also, I am interested in understanding other offers, because this place is awash with consultants, you name them. The only ones we haven't been able to have are the ones they couldn't afford, like McKinsey's BCG through a project they have afforded, but we couldn't afford them across the breadth of the business. And there are more and more coming out of the market. I don't think they realize that trusts that get into trouble have very little ability to bring in help, because that help is usually help that NHS like to bring in most of these people I wouldn't employ. So I think there is a emerging business model, which is, how do these groups actually start to take the place and build capability within the NHS on leadership. I've talked to Jim about it, but telling me, oh, look, you can have these have have beens that, you know, we had to find a job for. They've had a bit of an interest in improvement. They don't help me. They do not help me. Yeah? They just tell me what I need to keep. Yeah, I need expertise. And I need expertise to show people what different looks like, and then to lead them through, helping change that and building capability as you go. So I don't, I always say, I don't think I'm asking for too much, but it's really interesting. You know, I'm always of a view that with any firms, you will always not have one that can do everything for you, but I do look for what I'll call strategic partners, who are happy to bring in the expertise, because organizations cannot manage multiple relationships and on that, I am absolutely clear. -- 4 of 5 --\n\nInterviewer 21:14: Yeah, absolutely makes sense. Great. Brilliant. Lesley 21:39 All right, then, okay, Nice to have met you. You take care. Bye, bye, bye. -- 5 of 5 --"
}