{
  "id": "t-043",
  "sourceFile": "T38_NPS10_EMEA_ES_HOUSE_DEC25.pdf",
  "client": "Tim Rolfe",
  "interviewDate": "2025-12-11",
  "project": "Executive Search",
  "score": 10,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Interviewer 0:00",
      "text": "So thanks for agreeing to take part in in the interview. I'm Interviewer, so I'm the managing partner at growth consultancy. We've been working with Korn Ferry to well for the last five years. So we know their business well, and they've asked us to conduct these interviews to encourage more open and honest conversation as an impartial third party. I do have a recording in here if you're happy with that, so I could help me take notes and then I delete it afterwards. Yeah, that's fine. Great. Okay, well, we'll jump straight in, and I'll try not to take all your time. I appreciate that everyone's pretty busy. So yeah, we can start by if you can just explain your bowl and the relationship that you've had with Korn Ferry to date. Tim 0:54 So I'm the HR director at Logistics UK, but I've worked with Korn Ferry fairly extensively in the past. Before I was here, I was the HR director of Prudential. So we used Korn Ferry as well as, you know, Spencer, Stewart, Egon Zender, so, so, you know, we sort of spread the spread the work around the big the big search consultancies. So I've used Korn Ferry's board practice before, when Oliver Poole was running it. I don't know if he's still there or if he's retired. I'm not sure. No, and some of their consulting services as well in the past."
    },
    {
      "speaker": "Interviewer 1:39",
      "text": "Great. What consulting services do you mind expanding on that? Tim 1:42 It was some remuneration consulting. It was when I was at Pru there was a guy there called Mark Quinn that did work, did some work with it wasn't a lot."
    },
    {
      "speaker": "Interviewer 1:50",
      "text": "Great. And what makes you choose them over any of their competitors at any engagement? Tim 1:58 Well, I wouldn't automatically just choose any one in particular. So it was a competitive process. We saw two other organizations, but we felt that the executive search, I mean, you spend a lot of time working with the search Logistics UK. It's about how comfortable you feel with them, I think, when you're when you're operating with the top players. So you know, the other two organizations were just as well known and scalable. It comes down to who you think you're going to enjoy working with the most over a sort of fairly extensive period of time. And we felt that, we felt the team at Korn Ferry were absolutely right for us."
    },
    {
      "speaker": "Interviewer 2:48",
      "text": "And kind of digging into that further Is it, is it mostly about the kind of the personal one to one relationship is about their network or a process that they bring what's, what's the kind of key defined processes Tim 3:00 The processes, I think, are all broadly similar. So it's the first two, it's it's the relationship you feel you can establish at that first meeting. You know, just the sense you get of the person, and also their network as well. That's really important, that they're fishing in the right markets. So, so So what the guys at Korn Ferry demonstrated very early on is they understood that we are a membership organization that lobbies on behalf of our members. We're not actually a logistics company. So, so -- 1 of 4 -- they bought their, you know, they had the right people in the room, whereas the other people we saw bought specialists in the logistics and supply chain world. Well, that's not us."
    },
    {
      "speaker": "Interviewer 3:48",
      "text": "Slightly different. Well, quite different. And how did it play out? I mean, did it meet your expectations? Did you did you make the right choice? Or did you feel you make the right choice? Oh, 100% Absolutely. Tim 4:00 Thoroughly enjoyed working with them, and it was just easy, you know, they absolutely understood the brief, really fully targeted exactly the right. People put a great long list together, managed the candidates really, really well, and we're delighted with the outcome, right?"
    },
    {
      "speaker": "Interviewer 4:25",
      "text": "And in terms of, kind of, just, you know, the project, communication, feeling in the loop, all of that was, was good, any anything to improve on there? Tim 4:35 No, not really. We had, at least what we had, one scheduled weekly call throughout the process, it was either led by Stephen, the partner that led the assignment, or his number two, Peter, and they were always available for other queries, you know, more ad hoc stuff,"
    },
    {
      "speaker": "Interviewer 4:58",
      "text": "and in terms of kind of helping you shape the role. Is that something that they did or had you already really kind of predefined it? Tim 5:06 Yeah, we had a very clear idea of what we were looking for. They were very helpful. I mean, we're unique as a sort of member representation organization, because we don't just do political lobbying and policy sort of public affairs work. We've also got a big commercial operation as well. So where they were helpful is helping us understand the type of candidates we should be looking for that could manage a big PNL and also be a public face, right? And what we've been knocking around beforehand was whether or not that person actually really existed, and whether we should go for one or the other and sort of have some sort of strong number two in the other area, yeah."
    },
    {
      "speaker": "Interviewer 5:58",
      "text": "So they're kind of in balancing the skills and the priority that helped in that. Did you use any of their kind of assessment tools to assess the candidates? Or benchmarking pay? Tim 6:09 Yeah, we so we touched on the pay benchmarking. I mean, the person at Korn Ferry that they put me in touch with there, and I agreed pretty quickly that there's not an awful lot of benchmarking that we could do, because there are very few organizations like us, and none that are really at our sort of scale in terms of commercial activity. But we use their psychometric tools for assessment, and they were very, very good, great."
    },
    {
      "speaker": "Interviewer 6:42",
      "text": "And do you continue to use those once the person's in place? Do you reflect back on it to kind of create a development plan, or is it kind of just purely for the recruitment process? Tim 6:51 It will be used for a development plan? Yeah, absolutely."
    },
    {
      "speaker": "Interviewer 6:55",
      "text": "And I suppose taking that step back onto when you've used them before in consulting. So, I mean, how, how was that experience, beyond search -- 2 of 4 -- Tim 7:11 the psychologists that they used for to explain and to talk about the assessment tools was absolutely first class, really good. Actually, it's complex stuff, and she was presenting it to non exec directors who do come from the logistics sector. So this sort of corporate stuff isn't necessarily their sort of thing. But she did it brilliantly, absolutely, really, clearly, understandable, and really brought it to life. So that was excellent. And in terms of the reward stuff, I can't remember the name of the lady that helped us, but, you know, she's she was very good, but we just didn't need to do a lot together."
    },
    {
      "speaker": "Interviewer 7:58",
      "text": "Would you ever use them for anything, like, kind of broader in all consulting, so, kind of, you know, Team design, succession planning, anything like that. Tim 8:09 Yeah, possibly, I think we'd need a bit more scale before we went to somebody of Korn Ferry size to do other work like that. I think, yeah. Is there anything they could do better? I've been trying to think about that, and I've got quite a lot of experience of executive search, and I know it's not really helpful when somebody says, Not really, but it was, it was one of the most seamless processes I've ever been through. No, there isn't a lot, you know. And you know, it wasn't just, it wasn't just Stephen and Peter, but, you know, their admin support was excellent, you know, the team that made all the logistical arrangements for the interviews and lunches and all the rest of it that, you know, use of their offices, it was just first class, all the way through"
    },
    {
      "speaker": "Interviewer 9:03",
      "text": "amazing in terms of the brand. So, you know, you say you use their competitors too. How important is the brand to you when selecting it? So in terms of having that credibility to open doors. But also, you know, the organizational support that maybe they get when taking on the project. Tim 9:28 the brand is important actually. And I think for a chief exec role, there's probably only four or five companies that I would think about using you've got to look like a serious player. I think if you want to attract the best candidates, and they're not necessarily going to be answering the phone, sort of a second or even a third tier, you know, search consultancy, but if Korn Ferry call up or Spencer Stewart or Rogers, you know, it just shows your intent. I think so. So brand is important. And what was the second part you asked there?"
    },
    {
      "speaker": "Interviewer 10:05",
      "text": "Well, I mean, there's obviously the it from the opening the doors perspective, but also in terms of when you select them, do you expect then a rigor in the background? Tim 10:16 Oh, 100% Yeah. Sorry, you're absolutely right. And, you know, organizations like Korn Ferry, and indeed, Korn Ferry, I mean, you know you're in safe hands, right? I mean, the people there are top quality and move forward."
    },
    {
      "speaker": "Interviewer 10:32",
      "text": "I mean, how involved do you get with them outside of a specific engagement. Do you, I mean, do you attend any events? Is that something you'd be interested in, or is it actually, now I just, I'll call them when I need and then I'm busy. Tim 10:50 It's more the latter, actually. I mean, if they were good events, I would, I would be interested. And if it's sort of ongoing stuff, I mean, one of the things I'm I do, sort of continue with is the Deloitte Academy. I don't know if you've come across that. So it's, it's, it's like, it's a networking platform, and it's for non exec directors. And you know, people that have used Deloitte in the past, and they do lots of thought leadership pieces, they do a lot of sort of webinars, seminars on effectively non exec work. And that's really good quality. So, so yeah, I mean, I'm not the kind of person that turns up for drinks at an art gallery that doesn't do it for me. But if they've got some good, you know, interesting stuff that they're, they're, they're talking about, absolutely, I'd be interested in, you know, in that and that peer to peer -- 3 of 4 -- group piece, which obviously, you know, people business, you kind of think that's something that they could make happen easily."
    },
    {
      "speaker": "Interviewer 11:50",
      "text": "Okay great. I think that's it. I mean, is there anything else that you think would be useful to share? Back to the team, I know you said there's not much they can improve on, but I suppose anything that's important to you right now that your biggest challenges is it around AI skills? Is it around kind of shortages? What's going on in in your world? Tim 12:26 I think for me, it's our commercial operation. You know, we rely on great people to make it happen. But it doesn't need a commercial Managing Director, right? These are well run businesses that I don't want to say, run themselves. The most important thing for us is that our outward facing activities are done by really high quality people, and in the CEO that we've hired, we've taken a really significant step forward in being able to promote ourselves as serious players with, you know, really senior politicians. It's that side that's most important to me, and I suspect when the new CEO, you know, really gets his feet under the table, we'll be looking to build out that part of our business quite rightly, right?"
    },
    {
      "speaker": "Interviewer 13:30",
      "text": "That's really helpful. That's it lovely to meet you. Thanks, Tim, yeah, no problem at all. Tim 13:37 You too. Take care. Bye. Bye. -- 4 of 4 --"
    }
  ],
  "rawText": "Interviewer 0:00: So thanks for agreeing to take part in in the interview. I'm Interviewer, so I'm the managing partner at growth consultancy. We've been working with Korn Ferry to well for the last five years. So we know their business well, and they've asked us to conduct these interviews to encourage more open and honest conversation as an impartial third party. I do have a recording in here if you're happy with that, so I could help me take notes and then I delete it afterwards. Yeah, that's fine. Great. Okay, well, we'll jump straight in, and I'll try not to take all your time. I appreciate that everyone's pretty busy. So yeah, we can start by if you can just explain your bowl and the relationship that you've had with Korn Ferry to date. Tim 0:54 So I'm the HR director at Logistics UK, but I've worked with Korn Ferry fairly extensively in the past. Before I was here, I was the HR director of Prudential. So we used Korn Ferry as well as, you know, Spencer, Stewart, Egon Zender, so, so, you know, we sort of spread the spread the work around the big the big search consultancies. So I've used Korn Ferry's board practice before, when Oliver Poole was running it. I don't know if he's still there or if he's retired. I'm not sure. No, and some of their consulting services as well in the past.\n\nInterviewer 1:39: Great. What consulting services do you mind expanding on that? Tim 1:42 It was some remuneration consulting. It was when I was at Pru there was a guy there called Mark Quinn that did work, did some work with it wasn't a lot.\n\nInterviewer 1:50: Great. And what makes you choose them over any of their competitors at any engagement? Tim 1:58 Well, I wouldn't automatically just choose any one in particular. So it was a competitive process. We saw two other organizations, but we felt that the executive search, I mean, you spend a lot of time working with the search Logistics UK. It's about how comfortable you feel with them, I think, when you're when you're operating with the top players. So you know, the other two organizations were just as well known and scalable. It comes down to who you think you're going to enjoy working with the most over a sort of fairly extensive period of time. And we felt that, we felt the team at Korn Ferry were absolutely right for us.\n\nInterviewer 2:48: And kind of digging into that further Is it, is it mostly about the kind of the personal one to one relationship is about their network or a process that they bring what's, what's the kind of key defined processes Tim 3:00 The processes, I think, are all broadly similar. So it's the first two, it's it's the relationship you feel you can establish at that first meeting. You know, just the sense you get of the person, and also their network as well. That's really important, that they're fishing in the right markets. So, so So what the guys at Korn Ferry demonstrated very early on is they understood that we are a membership organization that lobbies on behalf of our members. We're not actually a logistics company. So, so -- 1 of 4 -- they bought their, you know, they had the right people in the room, whereas the other people we saw bought specialists in the logistics and supply chain world. Well, that's not us.\n\nInterviewer 3:48: Slightly different. Well, quite different. And how did it play out? I mean, did it meet your expectations? Did you did you make the right choice? Or did you feel you make the right choice? Oh, 100% Absolutely. Tim 4:00 Thoroughly enjoyed working with them, and it was just easy, you know, they absolutely understood the brief, really fully targeted exactly the right. People put a great long list together, managed the candidates really, really well, and we're delighted with the outcome, right?\n\nInterviewer 4:25: And in terms of, kind of, just, you know, the project, communication, feeling in the loop, all of that was, was good, any anything to improve on there? Tim 4:35 No, not really. We had, at least what we had, one scheduled weekly call throughout the process, it was either led by Stephen, the partner that led the assignment, or his number two, Peter, and they were always available for other queries, you know, more ad hoc stuff,\n\nInterviewer 4:58: and in terms of kind of helping you shape the role. Is that something that they did or had you already really kind of predefined it? Tim 5:06 Yeah, we had a very clear idea of what we were looking for. They were very helpful. I mean, we're unique as a sort of member representation organization, because we don't just do political lobbying and policy sort of public affairs work. We've also got a big commercial operation as well. So where they were helpful is helping us understand the type of candidates we should be looking for that could manage a big PNL and also be a public face, right? And what we've been knocking around beforehand was whether or not that person actually really existed, and whether we should go for one or the other and sort of have some sort of strong number two in the other area, yeah.\n\nInterviewer 5:58: So they're kind of in balancing the skills and the priority that helped in that. Did you use any of their kind of assessment tools to assess the candidates? Or benchmarking pay? Tim 6:09 Yeah, we so we touched on the pay benchmarking. I mean, the person at Korn Ferry that they put me in touch with there, and I agreed pretty quickly that there's not an awful lot of benchmarking that we could do, because there are very few organizations like us, and none that are really at our sort of scale in terms of commercial activity. But we use their psychometric tools for assessment, and they were very, very good, great.\n\nInterviewer 6:42: And do you continue to use those once the person's in place? Do you reflect back on it to kind of create a development plan, or is it kind of just purely for the recruitment process? Tim 6:51 It will be used for a development plan? Yeah, absolutely.\n\nInterviewer 6:55: And I suppose taking that step back onto when you've used them before in consulting. So, I mean, how, how was that experience, beyond search -- 2 of 4 -- Tim 7:11 the psychologists that they used for to explain and to talk about the assessment tools was absolutely first class, really good. Actually, it's complex stuff, and she was presenting it to non exec directors who do come from the logistics sector. So this sort of corporate stuff isn't necessarily their sort of thing. But she did it brilliantly, absolutely, really, clearly, understandable, and really brought it to life. So that was excellent. And in terms of the reward stuff, I can't remember the name of the lady that helped us, but, you know, she's she was very good, but we just didn't need to do a lot together.\n\nInterviewer 7:58: Would you ever use them for anything, like, kind of broader in all consulting, so, kind of, you know, Team design, succession planning, anything like that. Tim 8:09 Yeah, possibly, I think we'd need a bit more scale before we went to somebody of Korn Ferry size to do other work like that. I think, yeah. Is there anything they could do better? I've been trying to think about that, and I've got quite a lot of experience of executive search, and I know it's not really helpful when somebody says, Not really, but it was, it was one of the most seamless processes I've ever been through. No, there isn't a lot, you know. And you know, it wasn't just, it wasn't just Stephen and Peter, but, you know, their admin support was excellent, you know, the team that made all the logistical arrangements for the interviews and lunches and all the rest of it that, you know, use of their offices, it was just first class, all the way through\n\nInterviewer 9:03: amazing in terms of the brand. So, you know, you say you use their competitors too. How important is the brand to you when selecting it? So in terms of having that credibility to open doors. But also, you know, the organizational support that maybe they get when taking on the project. Tim 9:28 the brand is important actually. And I think for a chief exec role, there's probably only four or five companies that I would think about using you've got to look like a serious player. I think if you want to attract the best candidates, and they're not necessarily going to be answering the phone, sort of a second or even a third tier, you know, search consultancy, but if Korn Ferry call up or Spencer Stewart or Rogers, you know, it just shows your intent. I think so. So brand is important. And what was the second part you asked there?\n\nInterviewer 10:05: Well, I mean, there's obviously the it from the opening the doors perspective, but also in terms of when you select them, do you expect then a rigor in the background? Tim 10:16 Oh, 100% Yeah. Sorry, you're absolutely right. And, you know, organizations like Korn Ferry, and indeed, Korn Ferry, I mean, you know you're in safe hands, right? I mean, the people there are top quality and move forward.\n\nInterviewer 10:32: I mean, how involved do you get with them outside of a specific engagement. Do you, I mean, do you attend any events? Is that something you'd be interested in, or is it actually, now I just, I'll call them when I need and then I'm busy. Tim 10:50 It's more the latter, actually. I mean, if they were good events, I would, I would be interested. And if it's sort of ongoing stuff, I mean, one of the things I'm I do, sort of continue with is the Deloitte Academy. I don't know if you've come across that. So it's, it's, it's like, it's a networking platform, and it's for non exec directors. And you know, people that have used Deloitte in the past, and they do lots of thought leadership pieces, they do a lot of sort of webinars, seminars on effectively non exec work. And that's really good quality. So, so yeah, I mean, I'm not the kind of person that turns up for drinks at an art gallery that doesn't do it for me. But if they've got some good, you know, interesting stuff that they're, they're, they're talking about, absolutely, I'd be interested in, you know, in that and that peer to peer -- 3 of 4 -- group piece, which obviously, you know, people business, you kind of think that's something that they could make happen easily.\n\nInterviewer 11:50: Okay great. I think that's it. I mean, is there anything else that you think would be useful to share? Back to the team, I know you said there's not much they can improve on, but I suppose anything that's important to you right now that your biggest challenges is it around AI skills? Is it around kind of shortages? What's going on in in your world? Tim 12:26 I think for me, it's our commercial operation. You know, we rely on great people to make it happen. But it doesn't need a commercial Managing Director, right? These are well run businesses that I don't want to say, run themselves. The most important thing for us is that our outward facing activities are done by really high quality people, and in the CEO that we've hired, we've taken a really significant step forward in being able to promote ourselves as serious players with, you know, really senior politicians. It's that side that's most important to me, and I suspect when the new CEO, you know, really gets his feet under the table, we'll be looking to build out that part of our business quite rightly, right?\n\nInterviewer 13:30: That's really helpful. That's it lovely to meet you. Thanks, Tim, yeah, no problem at all. Tim 13:37 You too. Take care. Bye. Bye. -- 4 of 4 --"
}