{
  "id": "t-042",
  "sourceFile": "T37_NPS7_NA_ES_MARQUEE_DEC25.pdf",
  "client": "",
  "interviewDate": "2025-12-10",
  "project": "Executive Search",
  "score": 7,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Interviewer 2:21",
      "text": "Well, I mean, I appreciate it. Well, look, I I will try not to keep you for the whole half an hour. So just to introduce me, so I'm not from Korn Ferry. I am the managing partner at a consultancy. We work with Korn Ferry, and they've asked us to conduct these interviews in the hope that you can speak more freely. And the other thing is, are you all right if I record this, it's so my team can help me write up the notes and then it gets deleted.let's kick straight off then, so if you can just explain to me your role in the organization and the relationship that you have with Korn Ferry Julie 3:21 absolutely, I am responsible for people in culture. So I'm the, I guess, the chief people and culture officer, and I get my report to the CEO, and I am probably the primary contact. And the majority of searches that we do, I have my head of talent acquisition participate often. But anytime we're doing something that reports to the CEO, he has a tendency to just get, I don't know, a little anxious about the searches, so I try to stay involved."
    },
    {
      "speaker": "Interviewer 3:53",
      "text": "Okay, and so have you worked with Korn Ferry long? Or was it a single project? Julie 3:59 No, we've worked with them for a bit. So we work with them both on the external search, mostly for executives. We typically we only take exact searches out. But also we work with them, we use their leadership competency model. So we've worked with them on the competencies, and then we've also worked with them. Where we buy the tools, we make that available. So I've worked with them both on the search side and on the consultancy side. Unknown Speaker 4:29 right. And how long have you worked with them for Julie 4:33 Off and on, for a few years now, probably two to three overall"
    },
    {
      "speaker": "Interviewer 4:37",
      "text": "Overall, I mean, how can you summarize your experience? Julie 4:42 I would say overall, it's now, it's kind of interesting. You said overall so, it's very positive in terms of the quality of the work that they produce and again, I think this probably led to why you just wanted to have a follow up conversation with me, the quality of the work that we've received, both on the consultancy side and on the search side, is high. I think the people I've worked with, they know the business, they know our industry, they know what they're doing. So to me, the competence and the work is not anything I have concern with. They've been good"
    },
    {
      "speaker": "Interviewer 5:22",
      "text": "is there anything that doesn't meet your expectations? I'll come back to the good stuff in a second. Julie 5:28 Yeah, I would say there and now I realized that it kind of happened on both sides. I hadn't put it together until we were sitting here. But the concern I've had on and I'll keep it to search first, and then I can go to the other is that number one, they're definitely managing up and playing to the CEO. Or -- 1 of 5 -- actually on the other side, we had someone on the consultancy side do an external assessment and do some interviewing of our investors and some of our key executives, and produce a report for our comp and gov committee. And now that I think about it, in both cases, and I'm the primary contact, I feel like they kind of, they're managing up, which, again, I get it. They want to keep the CEO happy. They want to keep the board chair happy, but in a way that felt somewhat disrespectful to me and my role, so that I didn't like. And actually it did really happen on both sides now, so I see that. But in addition on this most recent search, I think what bothered me is, so I'll go ahead and say it up front, we are a little bit chaotic when it comes to searches. We're a PE, we move fast and again, like I said, My CEO gets very engaged in these exact searches, and they can never move fast enough, right? So once he determines we want to have an executive hire, he's like, there's a fire under everyone. So I admit that on our side, we probably make things a little bit more difficult. But in this case, we had probably three, four names, two that were actually quite serious, that we had from our investors or from our network. And we said, hey, let's hold these out of the agreement, because if we hire someone that you know, we find and it's that fine line, listen, they're doing work, and I want to pay them for the work that they're doing, but I don't want to spend $300,000 if I find the candidate and I'm just putting it through their process that that doesn't seem equitable to me. So in this case, the initial candidates, and they did, we put agreement together and said, Hey, if you hire these and we still paid them, of course, a portion of the fee, because they're still working, right? Yeah, but it was fine. We built it into the agreement, and that all worked out fine. But what ended up happening then is, of the candidates they produced, we never found one that met our needs. But then our CEO actually found someone from his prior life that we brought forward, and we ended up hiring that individual for the role. And so Korn Ferry was involved in that, because we, of course, had them, you know, do some of the interviewing and, you know, do an assessment, and kind of compare him to others, so they're absolutely involved. But when it came to the com stuff, like, I personally negotiated all of that, because we're PE it's very confusing. So I negotiated all of that and the offer and everything. And so it kind of felt weird, because it was an in between position where they absolutely worked. We should pay them, for sure. But so did I. So we got them all the candidates, was this weird thing. And I remember thinking the thing that just bugged me, so we paid our three instalments. That was fine. And then, because I'm like, Fine, I'm not even gonna, you know, so $250,000 or whatever it was. But the thing that really bugged me, that I think that led to my comment is, you know how there's the additional final fee based upon the estimate of pay versus what the final pay is. It was like 20 or 30 grand at that point. It's de minimis. They charge this for it. I mean to me, Penny smart, pound foolish. And at the same time, we were setting up another search with them, like right away. So I went to my TA and I said, Listen, I'm not going to ask. I said, but are they really going to charge us? And I got a bill for that last 30 grand, and to me it just seemed..."
    },
    {
      "speaker": "Speaker 1 9:07",
      "text": "churlish, Julie 9:10 Yes, like it's just not like a good relationship building thing. So again, it's like, yeah, they've done great, but being treated like that makes me not want to work with them again, right? I'm like, oh, because it's just, it's Penny smart, pound foolish. And so, my head of TA brought it up with them. They shut her down immediately. So I just paid it. I'm like, whatever. I'll pay the 30 grand. But now I remember, so to me, it's not the work they produce. It's almost an attitudinal thing. I don't know if it's an arrogance. I don't know what to put on it, but it definitely feels like a diminishment of my role, which I don't appreciate. I've been doing this for a while, so to me, that's, that's my beef."
    },
    {
      "speaker": "Interviewer 9:51",
      "text": "It's shifting from what should be a partner mindset to a supplier and a transactional thing. Yeah. Okay, yeah. I mean that makes sense. And so did you move forward to work with them on the next search? Or have you gone to market with others? Julie 10:11 No we did, because it was directly related to the first search. So again, we completed the offer with the external candidate for it was a president and CEO role, and then we also needed someone who was a CRO within our business. And because this role was commercial and so heavily commercially focused, and they already had a list, we did continue on with them. So literally, I'm signing another -- 2 of 5 -- couple $100,000 engagement, and they're charging me 20 grand for a Julie, I found myself, I'm like, what? So it just felt icky. You know,"
    },
    {
      "speaker": "Interviewer 10:42",
      "text": "yeah, yeah. And you said that when you brought it up with them, they pushed back Julie 10:47 well, they shut it down immediately. I didn't, I had my head of TA do it just as a tester to say, hey, really, you know what I mean, informally. And they shut it down. So at that point, I just paid it. I said, Listen, I'm not going to argue about this, but it was notable to me."
    },
    {
      "speaker": "Interviewer 11:01",
      "text": "yeah, fair enough. Okay, and then so going to the positive experience. So in terms of, I suppose, their, you know, your need for speed, did they match that? Did they match speed and quality? Where did they come into their own, if at all? Julie 11:23 I would say yes. So they have been unbelievably responsive. So again, when we move we move quick, and it's actually kind of unrealistic, I realized that, but it is what it is. You know what I mean, and everyone knows it. So they did. They moved very quickly. They adapted. They gave us a good list of people. They had some people. So I'd say on the kickoff, it's very strong. Now, when the second search, we're a few months in, I'd say candidates are drying up a little bit. We do have someone who is very, very strong, which is great, but the internal team wants to hire, excuse me, wants to interview a few more people before they move on this person. Just because know when you find a good person so early, you want to make sure that you, you know, assessed the marketplace. So that's where we are right now. And so we have three, four candidates that we're talking to, two of which, by the way, are internal, so they're kind of working with that, with us on that. But again, that's the other thing. My team has to be involved a lot more heavily than what I would like for an external search. They rely on us very heavily for everything logistical. You know, we've offered. We, our investors, like to get an update on the candidates twice a month, and we had to build a template. They didn't have one. They sent it over twice. We had to correct it, and then when we needed it again, they were like, Oh, we don't have that template. Can you send it again? I'm like, what? So we had to dig through and so it's just they're not I just feel like they're not respectful of my team and our time, and the logistics are leaning a little bit more heavily toward my team than what I would like. Now I get it. We have to be involved, especially with this group, because the calendaring for these people is insane. So I understand my team needs to be involved, but it's almost like they kind of expect us to do their logistics, and we are paying whatever administrative P we're paying for them to do it. So again, it's that's the theme of it, the quality of the work itself, and their understanding of the role, I think, has been really strong, and their understanding of the market has been really strong. It's just their behaviors that I don't really like."
    },
    {
      "speaker": "Interviewer 13:34",
      "text": "Yeah, fair enough. And how does that compare to? I mean, do you use any of their competitors? Julie 13:41 Yes, yes, we do. And so I would say it depends, right? It really depends on the group that you get. I have a pretty good relationship with two other external search firms that I use on a fairly regular basis, but we'll move throughout them based upon what the role is and the level of expertise. So for this one, it was heavily commercial and sales oriented. And the Korn Ferry team is just better. They do really, really well. But if I were hiring a different position, you know, I might do like a little mini RFP for a few to see who's really strongest in that area. So I, you know, I do have other folks that we use as well, right?"
    },
    {
      "speaker": "Interviewer 14:19",
      "text": "And so in terms of Korn Ferry, I mean, what's most important to you? Is it around the individual and the relationship and the network they have? Is it around the brand and the ability to open doors and the infrastructure that they have behind them? -- 3 of 5 -- Julie 14:37 I think it has to be both right, because they have to have the right relationships on their side to bring the people to us, otherwise it's that's to me, is a nonstarter, or wouldn't even be hiring an external firm. But I think the internal relationship with me and my team is really important as well, because we're moving so fast that if we have any misalignment. It just makes things really hard. And like I keep saying, that is the part that's bothering me, not the work itself, but the way that they're working with the team. And again, I guess it's I'm trying to think of better words. I probably should have prepared, but I was picking up. But it is because arrogance is a heavy word, so I kind of hesitate to use it, but it does. It feels like a little bit of a disrespect for my team and an arrogance. And I just, that doesn't work for me."
    },
    {
      "speaker": "Interviewer 15:35",
      "text": "And, focusing in on the consulting side, I mean, obviously it's a different engagement. So how, how does that play out like, I mean, you've said that there are some similarities in terms of managing up, but what's, what's the experience like there? Julie 15:52 I think I would say it's been better, that relationships been around longer. So we've been working with them on the competency side for a few years, and that's at a lower level of my organization and a lower level of their organization, and it is more that, I would say is more transactional, but I don't think there's, we haven't had any problems with that at all. And actually, I have a new, I guess he's been here about a year, a new leader, and I think the relationship's been very good, and he's working really well with them. So that's great. About a year ago, like I said, though we did a special engagement with them where we asked them to do some feedback gathering and interviewing and focus groups on a few things. And that's where, again, it was a kind of a similar theme, where the individual we worked with just wanted to work with the chair of the committee. And again, hey, I get it, if you have you know the audience of the independent chair, that's going to be your focus, but it shouldn't be at the detriment of the relationship with us"
    },
    {
      "speaker": "Speaker 1 16:57",
      "text": "Yeah, exactly. Okay."
    },
    {
      "speaker": "Interviewer 17:02",
      "text": "In terms of, I suppose Korn Ferry themselves, and you know that you're obviously using them across search and consultancy, would you consider using them for anything else? So, you know, in terms of things like, I suppose as a PE firm helping for restructuring or selling? Senior coaching and support, is that something that you would go to them for? Julie 17:30 Oh we don't go outside with any So, like that isn't something that we do externally. It's something that we manage ourself. So I'm not against it. Like, if we were going to do that, they'd probably be on the list of people we would speak to. We just, that's something we do internally."
    },
    {
      "speaker": "Interviewer 17:44",
      "text": "Yeah, okay, I think that's it. I mean, I think that's been really helpful. And thank you for your, you know, complete honesty and transparency. I think what, what will happen now is we will write up a report and recommendation of how they can improve. And if you're happy for us to, you know, be quite open about that, then I suspect someone then might want to just, I mean, they might follow up with you just to rectify some and address some of the issues straight on with your with the team. But, yeah, hopefully, hopefully you'll see an improvement moving forward. That's the plan. Julie 18:21 No, I appreciate that, I do. And again, I'm not trying to get anyone in trouble, but if you want my honest opinion, because if I were them, I would want to know, because this behavior would make me choose someone else, just because the partnership isn't there at my level. And so I would want to know if I'm dumb, but at the same time, I feel bad because I don't want to, you know, I'm not trying to, you know, ruin anyone's holidays or get anyone in trouble, but I would like to see the behavior change if we're going to continue our relationship. -- 4 of 5 --"
    },
    {
      "speaker": "Interviewer 18:48",
      "text": "No, I totally agree, and to be honest with you, that's not how they're taking this. So nobody gets in trouble, but everyone should, you know, kind of correct to make it better, and they can't do that unless you give us honest feedback, which is why I'm doing these interviews and not them. So I think you know, hopefully you will see a positive improvement, but no one's going to get into trouble on their side. Okay. Julie 19:18 Well, thank you so much. I really appreciate your time. and so have a happy holidays. -- 5 of 5 --"
    }
  ],
  "rawText": "Interviewer 2:21: Well, I mean, I appreciate it. Well, look, I I will try not to keep you for the whole half an hour. So just to introduce me, so I'm not from Korn Ferry. I am the managing partner at a consultancy. We work with Korn Ferry, and they've asked us to conduct these interviews in the hope that you can speak more freely. And the other thing is, are you all right if I record this, it's so my team can help me write up the notes and then it gets deleted.let's kick straight off then, so if you can just explain to me your role in the organization and the relationship that you have with Korn Ferry Julie 3:21 absolutely, I am responsible for people in culture. So I'm the, I guess, the chief people and culture officer, and I get my report to the CEO, and I am probably the primary contact. And the majority of searches that we do, I have my head of talent acquisition participate often. But anytime we're doing something that reports to the CEO, he has a tendency to just get, I don't know, a little anxious about the searches, so I try to stay involved.\n\nInterviewer 3:53: Okay, and so have you worked with Korn Ferry long? Or was it a single project? Julie 3:59 No, we've worked with them for a bit. So we work with them both on the external search, mostly for executives. We typically we only take exact searches out. But also we work with them, we use their leadership competency model. So we've worked with them on the competencies, and then we've also worked with them. Where we buy the tools, we make that available. So I've worked with them both on the search side and on the consultancy side. Unknown Speaker 4:29 right. And how long have you worked with them for Julie 4:33 Off and on, for a few years now, probably two to three overall\n\nInterviewer 4:37: Overall, I mean, how can you summarize your experience? Julie 4:42 I would say overall, it's now, it's kind of interesting. You said overall so, it's very positive in terms of the quality of the work that they produce and again, I think this probably led to why you just wanted to have a follow up conversation with me, the quality of the work that we've received, both on the consultancy side and on the search side, is high. I think the people I've worked with, they know the business, they know our industry, they know what they're doing. So to me, the competence and the work is not anything I have concern with. They've been good\n\nInterviewer 5:22: is there anything that doesn't meet your expectations? I'll come back to the good stuff in a second. Julie 5:28 Yeah, I would say there and now I realized that it kind of happened on both sides. I hadn't put it together until we were sitting here. But the concern I've had on and I'll keep it to search first, and then I can go to the other is that number one, they're definitely managing up and playing to the CEO. Or -- 1 of 5 -- actually on the other side, we had someone on the consultancy side do an external assessment and do some interviewing of our investors and some of our key executives, and produce a report for our comp and gov committee. And now that I think about it, in both cases, and I'm the primary contact, I feel like they kind of, they're managing up, which, again, I get it. They want to keep the CEO happy. They want to keep the board chair happy, but in a way that felt somewhat disrespectful to me and my role, so that I didn't like. And actually it did really happen on both sides now, so I see that. But in addition on this most recent search, I think what bothered me is, so I'll go ahead and say it up front, we are a little bit chaotic when it comes to searches. We're a PE, we move fast and again, like I said, My CEO gets very engaged in these exact searches, and they can never move fast enough, right? So once he determines we want to have an executive hire, he's like, there's a fire under everyone. So I admit that on our side, we probably make things a little bit more difficult. But in this case, we had probably three, four names, two that were actually quite serious, that we had from our investors or from our network. And we said, hey, let's hold these out of the agreement, because if we hire someone that you know, we find and it's that fine line, listen, they're doing work, and I want to pay them for the work that they're doing, but I don't want to spend $300,000 if I find the candidate and I'm just putting it through their process that that doesn't seem equitable to me. So in this case, the initial candidates, and they did, we put agreement together and said, Hey, if you hire these and we still paid them, of course, a portion of the fee, because they're still working, right? Yeah, but it was fine. We built it into the agreement, and that all worked out fine. But what ended up happening then is, of the candidates they produced, we never found one that met our needs. But then our CEO actually found someone from his prior life that we brought forward, and we ended up hiring that individual for the role. And so Korn Ferry was involved in that, because we, of course, had them, you know, do some of the interviewing and, you know, do an assessment, and kind of compare him to others, so they're absolutely involved. But when it came to the com stuff, like, I personally negotiated all of that, because we're PE it's very confusing. So I negotiated all of that and the offer and everything. And so it kind of felt weird, because it was an in between position where they absolutely worked. We should pay them, for sure. But so did I. So we got them all the candidates, was this weird thing. And I remember thinking the thing that just bugged me, so we paid our three instalments. That was fine. And then, because I'm like, Fine, I'm not even gonna, you know, so $250,000 or whatever it was. But the thing that really bugged me, that I think that led to my comment is, you know how there's the additional final fee based upon the estimate of pay versus what the final pay is. It was like 20 or 30 grand at that point. It's de minimis. They charge this for it. I mean to me, Penny smart, pound foolish. And at the same time, we were setting up another search with them, like right away. So I went to my TA and I said, Listen, I'm not going to ask. I said, but are they really going to charge us? And I got a bill for that last 30 grand, and to me it just seemed...\n\nSpeaker 1 9:07: churlish, Julie 9:10 Yes, like it's just not like a good relationship building thing. So again, it's like, yeah, they've done great, but being treated like that makes me not want to work with them again, right? I'm like, oh, because it's just, it's Penny smart, pound foolish. And so, my head of TA brought it up with them. They shut her down immediately. So I just paid it. I'm like, whatever. I'll pay the 30 grand. But now I remember, so to me, it's not the work they produce. It's almost an attitudinal thing. I don't know if it's an arrogance. I don't know what to put on it, but it definitely feels like a diminishment of my role, which I don't appreciate. I've been doing this for a while, so to me, that's, that's my beef.\n\nInterviewer 9:51: It's shifting from what should be a partner mindset to a supplier and a transactional thing. Yeah. Okay, yeah. I mean that makes sense. And so did you move forward to work with them on the next search? Or have you gone to market with others? Julie 10:11 No we did, because it was directly related to the first search. So again, we completed the offer with the external candidate for it was a president and CEO role, and then we also needed someone who was a CRO within our business. And because this role was commercial and so heavily commercially focused, and they already had a list, we did continue on with them. So literally, I'm signing another -- 2 of 5 -- couple $100,000 engagement, and they're charging me 20 grand for a Julie, I found myself, I'm like, what? So it just felt icky. You know,\n\nInterviewer 10:42: yeah, yeah. And you said that when you brought it up with them, they pushed back Julie 10:47 well, they shut it down immediately. I didn't, I had my head of TA do it just as a tester to say, hey, really, you know what I mean, informally. And they shut it down. So at that point, I just paid it. I said, Listen, I'm not going to argue about this, but it was notable to me.\n\nInterviewer 11:01: yeah, fair enough. Okay, and then so going to the positive experience. So in terms of, I suppose, their, you know, your need for speed, did they match that? Did they match speed and quality? Where did they come into their own, if at all? Julie 11:23 I would say yes. So they have been unbelievably responsive. So again, when we move we move quick, and it's actually kind of unrealistic, I realized that, but it is what it is. You know what I mean, and everyone knows it. So they did. They moved very quickly. They adapted. They gave us a good list of people. They had some people. So I'd say on the kickoff, it's very strong. Now, when the second search, we're a few months in, I'd say candidates are drying up a little bit. We do have someone who is very, very strong, which is great, but the internal team wants to hire, excuse me, wants to interview a few more people before they move on this person. Just because know when you find a good person so early, you want to make sure that you, you know, assessed the marketplace. So that's where we are right now. And so we have three, four candidates that we're talking to, two of which, by the way, are internal, so they're kind of working with that, with us on that. But again, that's the other thing. My team has to be involved a lot more heavily than what I would like for an external search. They rely on us very heavily for everything logistical. You know, we've offered. We, our investors, like to get an update on the candidates twice a month, and we had to build a template. They didn't have one. They sent it over twice. We had to correct it, and then when we needed it again, they were like, Oh, we don't have that template. Can you send it again? I'm like, what? So we had to dig through and so it's just they're not I just feel like they're not respectful of my team and our time, and the logistics are leaning a little bit more heavily toward my team than what I would like. Now I get it. We have to be involved, especially with this group, because the calendaring for these people is insane. So I understand my team needs to be involved, but it's almost like they kind of expect us to do their logistics, and we are paying whatever administrative P we're paying for them to do it. So again, it's that's the theme of it, the quality of the work itself, and their understanding of the role, I think, has been really strong, and their understanding of the market has been really strong. It's just their behaviors that I don't really like.\n\nInterviewer 13:34: Yeah, fair enough. And how does that compare to? I mean, do you use any of their competitors? Julie 13:41 Yes, yes, we do. And so I would say it depends, right? It really depends on the group that you get. I have a pretty good relationship with two other external search firms that I use on a fairly regular basis, but we'll move throughout them based upon what the role is and the level of expertise. So for this one, it was heavily commercial and sales oriented. And the Korn Ferry team is just better. They do really, really well. But if I were hiring a different position, you know, I might do like a little mini RFP for a few to see who's really strongest in that area. So I, you know, I do have other folks that we use as well, right?\n\nInterviewer 14:19: And so in terms of Korn Ferry, I mean, what's most important to you? Is it around the individual and the relationship and the network they have? Is it around the brand and the ability to open doors and the infrastructure that they have behind them? -- 3 of 5 -- Julie 14:37 I think it has to be both right, because they have to have the right relationships on their side to bring the people to us, otherwise it's that's to me, is a nonstarter, or wouldn't even be hiring an external firm. But I think the internal relationship with me and my team is really important as well, because we're moving so fast that if we have any misalignment. It just makes things really hard. And like I keep saying, that is the part that's bothering me, not the work itself, but the way that they're working with the team. And again, I guess it's I'm trying to think of better words. I probably should have prepared, but I was picking up. But it is because arrogance is a heavy word, so I kind of hesitate to use it, but it does. It feels like a little bit of a disrespect for my team and an arrogance. And I just, that doesn't work for me.\n\nInterviewer 15:35: And, focusing in on the consulting side, I mean, obviously it's a different engagement. So how, how does that play out like, I mean, you've said that there are some similarities in terms of managing up, but what's, what's the experience like there? Julie 15:52 I think I would say it's been better, that relationships been around longer. So we've been working with them on the competency side for a few years, and that's at a lower level of my organization and a lower level of their organization, and it is more that, I would say is more transactional, but I don't think there's, we haven't had any problems with that at all. And actually, I have a new, I guess he's been here about a year, a new leader, and I think the relationship's been very good, and he's working really well with them. So that's great. About a year ago, like I said, though we did a special engagement with them where we asked them to do some feedback gathering and interviewing and focus groups on a few things. And that's where, again, it was a kind of a similar theme, where the individual we worked with just wanted to work with the chair of the committee. And again, hey, I get it, if you have you know the audience of the independent chair, that's going to be your focus, but it shouldn't be at the detriment of the relationship with us\n\nSpeaker 1 16:57: Yeah, exactly. Okay.\n\nInterviewer 17:02: In terms of, I suppose Korn Ferry themselves, and you know that you're obviously using them across search and consultancy, would you consider using them for anything else? So, you know, in terms of things like, I suppose as a PE firm helping for restructuring or selling? Senior coaching and support, is that something that you would go to them for? Julie 17:30 Oh we don't go outside with any So, like that isn't something that we do externally. It's something that we manage ourself. So I'm not against it. Like, if we were going to do that, they'd probably be on the list of people we would speak to. We just, that's something we do internally.\n\nInterviewer 17:44: Yeah, okay, I think that's it. I mean, I think that's been really helpful. And thank you for your, you know, complete honesty and transparency. I think what, what will happen now is we will write up a report and recommendation of how they can improve. And if you're happy for us to, you know, be quite open about that, then I suspect someone then might want to just, I mean, they might follow up with you just to rectify some and address some of the issues straight on with your with the team. But, yeah, hopefully, hopefully you'll see an improvement moving forward. That's the plan. Julie 18:21 No, I appreciate that, I do. And again, I'm not trying to get anyone in trouble, but if you want my honest opinion, because if I were them, I would want to know, because this behavior would make me choose someone else, just because the partnership isn't there at my level. And so I would want to know if I'm dumb, but at the same time, I feel bad because I don't want to, you know, I'm not trying to, you know, ruin anyone's holidays or get anyone in trouble, but I would like to see the behavior change if we're going to continue our relationship. -- 4 of 5 --\n\nInterviewer 18:48: No, I totally agree, and to be honest with you, that's not how they're taking this. So nobody gets in trouble, but everyone should, you know, kind of correct to make it better, and they can't do that unless you give us honest feedback, which is why I'm doing these interviews and not them. So I think you know, hopefully you will see a positive improvement, but no one's going to get into trouble on their side. Okay. Julie 19:18 Well, thank you so much. I really appreciate your time. and so have a happy holidays. -- 5 of 5 --"
}