{
  "id": "t-041",
  "sourceFile": "T36_NPS7_NA_ES_HOUSE_DEC25.pdf",
  "client": "",
  "interviewDate": "2025-12-12",
  "project": "ES",
  "score": 7,
  "overview": "",
  "sections": [],
  "fullTranscript": [
    {
      "speaker": "Interviewer 3:33",
      "text": "Well, I'll jump into it. I won't keep you too long, hopefully. So thanks for agreeing to do the call, and thanks for moving it from last week as well. So just introduce myself. I'm the managing partner for a growth consultancy. We've worked with Korn Ferry for the last five or six years, So they've asked us to do these interviews to encourage more free speech, so as a third party, you can hopefully speak more freely, just quickly, I've got my AI in here to help take notes. You're alright with that. Yeah, great. Thank you. So yeah, I mean, we'll just kick straight off. Obviously be great to just understand the context of relationships. So your role in the organization and how you engage them? Gary 4:25 So I am chairman. I was chairman of the search committee for the San Diego Zoo Wildlife Alliance. I am secretary to the corporation, which means I chair the nominee and governance committee of the board. There are currently 11 board members, and we went through a process, search process for the new Chief Executive Officer this year, and had Korn Ferry as the engagement partner for that."
    },
    {
      "speaker": "Interviewer 5:00",
      "text": "And have you used them before? Is this the first engagement? Gary 5:03 I have not used them. The firm, has not had a relationship with them. I don't think before I've only been on the board five, four and a half years, so certainly not within my tenure, has there been an engagement with them. The firm had an engagement with Heidrick and struggles, I believe, for the for the last CEO."
    },
    {
      "speaker": "Interviewer 5:28",
      "text": "Okay, so what made you choose them in the first place? Gary 5:30 So we did a bake off, as we call them over here. I should tell you that I used to be on the board of directors of Heidrick, so I know the search industry pretty well, and we did an RFP, and wanted to look at a wide variety of different firms. We actually interviewed six firms, which was a lot of work. We interviewed four of the major firms, including, other than Korn Ferry, Heidrick Russ, Reynolds and Spencer Stewart. We also interviewed two local San Diego firms, which I can get you the names if you'd like. There was some, you know, thought that having a local San Diego firm might be better as it's a very locally, what's the word I want, locally focused community, I guess. And, and it's a bit of a unique animal, even though it's a city of some several million people, it's a little kind of a small town. And so we ended up through this process narrowing it down to a couple, and we chose Korn Ferry. We thought that the team did a terrific job understanding the task. They did their homework on the culture and they came out ahead of some pretty stiff competition. And I knew some of the partners at the other firms, the main the national firm, the international firms. And we chose Allison and Charlie as the who are the two partners on the assignment. We chose them over the others, and it was a unanimous decision."
    },
    {
      "speaker": "Interviewer 7:27",
      "text": "And how did it play out? Gary 7:30 So as I wrote in my note, I don't know if you saw my note, but, so look, generally, it was fine, and they were incredibly responsive. They built a really good set of metrics. They did good communications with staff, interviews with the board, interview with some of the broader, they met with the mayor of -- 1 of 5 -- San Diego. They talked to some big donors. They did their homework and really leaned into it. And I would say, and I think Allison and Charlie both understood the dynamics at play. We had to off the record, even though AI is listening to this. We had to change CEOs this year, and we did not renew the contract of the former CEO who had been there five years, which was going to create some uncertainty within the organization, which was also going through a quite a challenging collective bargaining association with one of the major unions, which has a big percentage of the population of the San Diego Zoo Wildlife Alliance. So it was a bit of a challenging time to make this change. And I thought that the partners at Korn Ferry really understood that, did a good job. So I would say overall, you know, how they approach it, how they lined up a set of candidates, inclusivity in terms of input into the process, very well. I think, where it got a little bit off the runway was at the end and it wasn't great. And look, I'm not a complainer as a person. I've been a CEO. I've dealt with lots, juggling, lots of balls. Stuff can happen. I get it. But I thought that they missed a couple of basic things at the end that, and I know my other trustees feel exactly the same way who are on the search committee that was the firm just needs to know this. So essentially, what happened was I was feeding them some names of people just who, because I know this world a little bit. It turns out that two of the three finalists were my contacts, and the third one was the internal contact. So they didn't really generate the level of the candidates that we thought they should have. And in fact, I would say some of the candidates they put in front of us were just dead, they just were like, this person is not competent. They're competent people, but they're not really up to this task, and it was fairly obvious, and the people who ended up rising to the top, not because of me, were the people who we generated, and that's a little disappointing. I mean, I'm in another search right now with a completely different industry, and they have put three candidates in front of the board that are superior candidates that we would not have been able to do ourselves. So that wasn't the case here. I had urged them to, like, Look broad, like, look at college presidents and people like that, who, because I don't know if you're following all of the craziness in the States, little hard to ignore, but one of the things is, attack on higher education has made the life of a college president miserable, and many of them are trying to branch out and look for similar type positions, but not with the stresses necessarily of working at a university. So for instance, the Wildlife Conservation Society just hired the former head of a small New England College called Williams College, who also ran a foundation, and I think he's doing swimmingly as an example, as an example. So I was trying to get them, and they didn't really do that. So they put up, they put up candidates who were, some from the sector, some from the conservation sector. There weren't really people who like, weren't on our radar that that, wow, so and so is interested. That's amazing, right? So we just didn't get people like that. And we should have, I mean, this is the largest zoo in the US. This is perhaps one of the two or three best in the world. It's world renowned, you know, leadership. This is the plum job to be the CEO of the San Diego Zoo Wildlife Alliance in that in that world. And then what happened at the end was, was two of the three candidates dropped out at the last minute, one who was the number two at the World Wildlife Fund who actually used the word for me. She went through the process. The board was very excited about her, and she just, when we invited her and the two others to meet in San Diego in person for the final round, she pulled her name out and said, Well, I can't really move to San Diego because I have family obligations or whatever. What that should have been fleshed out beforehand. That was not okay,"
    },
    {
      "speaker": "Interviewer 13:41",
      "text": "so it's pretty obvious from the outset, right? Gary 13:46 Yeah. And then the second one, which was a bigger blow, was, again, this is all confidential, but we had the head of the National Zoo, the Smithsonian, the National Zoo in Washington, who was eager for the job. She had reached out to me beforehand, and so we put her name in the hopper. She blew everyone away, and we basically decided to offer her the job. And after meeting with her in San Diego, we flew her and her husband out to San Diego, she was going to get a very significant pay jump over the amount of money she was making in Washington. And after we offer her the job, she also pulls her name out and says, Well, we don't really want to move to San Diego, and it was, and it was, you know, maybe she got pressure from her boss in Washington. I'm sure that it was a little bit of a, I'm sure pressure points on her. But she had made such a pitch for the job and had a plan for, you know, a very detailed like, we need this kind of a person on the senior team and very detailed agenda and vision. And this would have been a cap to her career. And I think it would have been a headline grabber for us that we nabbed. and she ends up pulling her name out too. And I just, and then I was like, I'm sorry to use this phrase, but like, WTF, right? I mean, it was sort of, I and the other members had the same reaction. It's like Korn Ferry should have vetted this ahead of time, and they should -- 2 of 5 -- have before we went through this final testing. We each one of these people said, Okay, if you're offered the job, are you prepared to move to San Diego? And now, obviously, sometimes they're contractual issues. I don't think that was the issue here at all. I think, I think they just got, they just finally woke up one day and said, I don't want to leave my, you know, Washington, to the east coast and move out there, even though most people are dying to move out there. It's a very attractive place to live. So that was not good. And so we ended up promoting the internal candidate, who we all had doubts about. He was the COO he was the acting CEO. Now the good news is that he actually did a very good job as acting CEO, and he kind of earned his stripes, and we've, since we've made him the CEO. The guy's doing a great job. So at the end of the day, it all worked out okay, but you do have to wonder, like, what was this all about? At the end of the day, like, if somebody asked me, Would you recommend Korn Ferry, I'd have to take a couple steps, you know, I can't jump in and say, wow, they just knocked it out of the park for us. I'm sorry to say that, because I like these individuals. One of the last thing I'll say, and then I'll shut up, is is, you know, Allison, who is the lead partner. She went out on maternity leave in the middle of the back half of the search process. She was a little more plugged in, I thought, than Charlie and the other partner they had. And it was unfortunate. I mean, I understand and she it's not like she didn't tell us this was coming, but it was, there was a gap when she dropped off the team."
    },
    {
      "speaker": "Interviewer 17:43",
      "text": "did they like when you pushed them on it in terms of delivering the quality of candidates? What was their response for not, kind of not being able to deliver. what did they say? Gary 17:54 Well, so when it got down to the end, I mean, I guess the answer to that is after they both pulled out, you know, Charlie went to the boss and say, Well, should we reopen the search, you know? And this, this is what really got me, quote, unquote, should we look at college presidents? And it was kind of like, you know, it's like, oh my god. Like, I pretend I didn't hear that. So, I don't know, you know, I, I never really got an answer to that particularly, all I do know is, and because I've, I've had a subsequent experience with another firm on a whole different search, where they really did bring in amazing people, I'm just thinking to myself, this is a big enough job that we really should have had, really A-plus candidates, you know, the head of ZSL, or something, probably would have been interested in this job as an example,"
    },
    {
      "speaker": "Interviewer 18:56",
      "text": "And so how? I mean, how are they left with, with them? I mean, you know, in terms of them, you landed an internal candidate. The last three were all ones from you. Did they help? Did they help in negotiation with the last candidate, even though they're internal? Or was it over to you? Gary 19:14 You mean, the woman who dropped out, or the COO, the COO, now they helped. I mean, they did all, you know, look from a process point of view, and managing the timeline and all that, they were fine. It was just at the end of the day, I think the candidate quality, and then this, this lack of, you know, pushing the candidates toward a commitment, were fatal flaws that weren't great"
    },
    {
      "speaker": "Interviewer 19:47",
      "text": "yeah, in terms of the like, just project communication, feeling up to date in what's going on, and that momentum, how was that? Gary 19:54 in terms of where we ended up? Well, no, the whole way through. How was the momentum during the process, I think it was fine. I mean, they, they can't, you know, I had a weekly meeting with them. We, you know, there was good communication. The other members of the team of the search committee weren't quite well with a couple of them weren't really used to doing this before, so we had to kind of bring them along. We had to deal with the parochialism of San Diego a couple of times. It was fine. It was all part of the process. So look, so it wasn't like, Gee, I would never hire them. I mean, I don't feel that way. It was just it was disappointing because it got off to such a good start, and they were so impressive in the selection process. And the first couple months were great. I mean, they really did all this incoming. They met with everybody. It was very inclusive. They did all that really well. They -- 3 of 5 -- started generating some names. Everything was moving along, and then it sort of skidded, as they say, it kind of skidded off the runway,"
    },
    {
      "speaker": "Interviewer 21:07",
      "text": "I mean, is there anything that they could have done, given what you ended up with the last three candidates, to get that back on track? I mean, do you think they should have continued to look even though you had three candidates because they weren't ones that they'd landed. Would you ever expected them to carry on looking? Gary 21:28 Yeah, I mean, I, it's all like in the rearview mirror now, but I, I just think they should have known that those candidates were not going to move to San Diego. They should have known that, and that being the case, they should have said, Uh oh, we better come up with some Cracker Jack alternatives, right? Because what they did is they pushed them forward as their two outside candidates, and they both sort of, you know, got flat tires so, and it was sort of like, yeah, so I guess the way I would answer that is, they had too many eggs in the baskets that then deflated. Okay, I'm mixing metaphors. I apologize."
    },
    {
      "speaker": "Interviewer 22:27",
      "text": "I totally get it in terms of, I suppose you know the broader experience of Korn Ferry, did you feel, I mean, especially having sat on the board and one of their competitors do, how do they compare in terms of infrastructure or even things like assessments, you know, to assess the candidates. Is it like for life, or is there any difference there? Gary 22:48 They did a good job. They even brought in one of, they have, like a psychologist on their staff, and that was a useful session. Actually, was quite interesting about leadership and lining up the resumes with their formula. So, no, in terms of, like, managing a process, having the right inputs, they were fine. I mean, they were fine on that. I don't have anything to complain about. I do. I mean, just between me and you, I don't know if I'd want this repeated, but I do wonder whether Allison's absence really had a lot to do with the outcome. And I don't know it could be, because I have no idea it could be that Charlie had other engagements that he couldn't handle, that all of them at the same time, and it sort of felt like that to me, a little bit an ownership thing, yeah, yeah. And Allison, frankly, played more of a leadership role until she didn't, and once she was gone, it just felt a little bit it. It felt less prioritized at the firm. And that's just subjective, but that's important right?"
    },
    {
      "speaker": "Interviewer 24:07",
      "text": "Because that's how you feel, so it's, it's good feedback, but for them, okay, great. I mean, I think that's probably it. It's really, really useful, and, you know, things for them to go and reflect on and feedback to. Is there anything else that you think would be good to share at this point? Gary 24:26 I don't think so. Look again, I just want you to, because you haven't worked with me before, I'm not one of these people who are never happy and never satisfied. I mean, I give plenty of people like positive reinforcements and reviews, and 'this person's amazing; They did a great job', you know, but in this case, it was just disappointing,"
    },
    {
      "speaker": "Interviewer 24:49",
      "text": "and that's why we have these conversations, right? They need to learn from that. And, you know, appreciate your honesty, and it's not, it doesn't come across in that way at all. So, yeah, and it gives them a chance to call course correct. Wonderful. Gary 25:04 Well, I really, really appreciate the firm reaching out to me and I think if you talk to the other search committee members, they pretty much say the same thing. So I don't feel like I'm an outlier. But anyway, Interviewer, I really thank you for also being flexible on the time, and I know late on a Friday. So enjoy the weekend. Yeah. -- 4 of 5 --"
    },
    {
      "speaker": "Interviewer 25:29",
      "text": "Well, you too. Enjoy the snow if it comes. Gary 25:33 Happy holidays. Take care."
    },
    {
      "speaker": "Interviewer 25:34",
      "text": "You too. Bye. -- 5 of 5 --"
    }
  ],
  "rawText": "Interviewer 3:33: Well, I'll jump into it. I won't keep you too long, hopefully. So thanks for agreeing to do the call, and thanks for moving it from last week as well. So just introduce myself. I'm the managing partner for a growth consultancy. We've worked with Korn Ferry for the last five or six years, So they've asked us to do these interviews to encourage more free speech, so as a third party, you can hopefully speak more freely, just quickly, I've got my AI in here to help take notes. You're alright with that. Yeah, great. Thank you. So yeah, I mean, we'll just kick straight off. Obviously be great to just understand the context of relationships. So your role in the organization and how you engage them? Gary 4:25 So I am chairman. I was chairman of the search committee for the San Diego Zoo Wildlife Alliance. I am secretary to the corporation, which means I chair the nominee and governance committee of the board. There are currently 11 board members, and we went through a process, search process for the new Chief Executive Officer this year, and had Korn Ferry as the engagement partner for that.\n\nInterviewer 5:00: And have you used them before? Is this the first engagement? Gary 5:03 I have not used them. The firm, has not had a relationship with them. I don't think before I've only been on the board five, four and a half years, so certainly not within my tenure, has there been an engagement with them. The firm had an engagement with Heidrick and struggles, I believe, for the for the last CEO.\n\nInterviewer 5:28: Okay, so what made you choose them in the first place? Gary 5:30 So we did a bake off, as we call them over here. I should tell you that I used to be on the board of directors of Heidrick, so I know the search industry pretty well, and we did an RFP, and wanted to look at a wide variety of different firms. We actually interviewed six firms, which was a lot of work. We interviewed four of the major firms, including, other than Korn Ferry, Heidrick Russ, Reynolds and Spencer Stewart. We also interviewed two local San Diego firms, which I can get you the names if you'd like. There was some, you know, thought that having a local San Diego firm might be better as it's a very locally, what's the word I want, locally focused community, I guess. And, and it's a bit of a unique animal, even though it's a city of some several million people, it's a little kind of a small town. And so we ended up through this process narrowing it down to a couple, and we chose Korn Ferry. We thought that the team did a terrific job understanding the task. They did their homework on the culture and they came out ahead of some pretty stiff competition. And I knew some of the partners at the other firms, the main the national firm, the international firms. And we chose Allison and Charlie as the who are the two partners on the assignment. We chose them over the others, and it was a unanimous decision.\n\nInterviewer 7:27: And how did it play out? Gary 7:30 So as I wrote in my note, I don't know if you saw my note, but, so look, generally, it was fine, and they were incredibly responsive. They built a really good set of metrics. They did good communications with staff, interviews with the board, interview with some of the broader, they met with the mayor of -- 1 of 5 -- San Diego. They talked to some big donors. They did their homework and really leaned into it. And I would say, and I think Allison and Charlie both understood the dynamics at play. We had to off the record, even though AI is listening to this. We had to change CEOs this year, and we did not renew the contract of the former CEO who had been there five years, which was going to create some uncertainty within the organization, which was also going through a quite a challenging collective bargaining association with one of the major unions, which has a big percentage of the population of the San Diego Zoo Wildlife Alliance. So it was a bit of a challenging time to make this change. And I thought that the partners at Korn Ferry really understood that, did a good job. So I would say overall, you know, how they approach it, how they lined up a set of candidates, inclusivity in terms of input into the process, very well. I think, where it got a little bit off the runway was at the end and it wasn't great. And look, I'm not a complainer as a person. I've been a CEO. I've dealt with lots, juggling, lots of balls. Stuff can happen. I get it. But I thought that they missed a couple of basic things at the end that, and I know my other trustees feel exactly the same way who are on the search committee that was the firm just needs to know this. So essentially, what happened was I was feeding them some names of people just who, because I know this world a little bit. It turns out that two of the three finalists were my contacts, and the third one was the internal contact. So they didn't really generate the level of the candidates that we thought they should have. And in fact, I would say some of the candidates they put in front of us were just dead, they just were like, this person is not competent. They're competent people, but they're not really up to this task, and it was fairly obvious, and the people who ended up rising to the top, not because of me, were the people who we generated, and that's a little disappointing. I mean, I'm in another search right now with a completely different industry, and they have put three candidates in front of the board that are superior candidates that we would not have been able to do ourselves. So that wasn't the case here. I had urged them to, like, Look broad, like, look at college presidents and people like that, who, because I don't know if you're following all of the craziness in the States, little hard to ignore, but one of the things is, attack on higher education has made the life of a college president miserable, and many of them are trying to branch out and look for similar type positions, but not with the stresses necessarily of working at a university. So for instance, the Wildlife Conservation Society just hired the former head of a small New England College called Williams College, who also ran a foundation, and I think he's doing swimmingly as an example, as an example. So I was trying to get them, and they didn't really do that. So they put up, they put up candidates who were, some from the sector, some from the conservation sector. There weren't really people who like, weren't on our radar that that, wow, so and so is interested. That's amazing, right? So we just didn't get people like that. And we should have, I mean, this is the largest zoo in the US. This is perhaps one of the two or three best in the world. It's world renowned, you know, leadership. This is the plum job to be the CEO of the San Diego Zoo Wildlife Alliance in that in that world. And then what happened at the end was, was two of the three candidates dropped out at the last minute, one who was the number two at the World Wildlife Fund who actually used the word for me. She went through the process. The board was very excited about her, and she just, when we invited her and the two others to meet in San Diego in person for the final round, she pulled her name out and said, Well, I can't really move to San Diego because I have family obligations or whatever. What that should have been fleshed out beforehand. That was not okay,\n\nInterviewer 13:41: so it's pretty obvious from the outset, right? Gary 13:46 Yeah. And then the second one, which was a bigger blow, was, again, this is all confidential, but we had the head of the National Zoo, the Smithsonian, the National Zoo in Washington, who was eager for the job. She had reached out to me beforehand, and so we put her name in the hopper. She blew everyone away, and we basically decided to offer her the job. And after meeting with her in San Diego, we flew her and her husband out to San Diego, she was going to get a very significant pay jump over the amount of money she was making in Washington. And after we offer her the job, she also pulls her name out and says, Well, we don't really want to move to San Diego, and it was, and it was, you know, maybe she got pressure from her boss in Washington. I'm sure that it was a little bit of a, I'm sure pressure points on her. But she had made such a pitch for the job and had a plan for, you know, a very detailed like, we need this kind of a person on the senior team and very detailed agenda and vision. And this would have been a cap to her career. And I think it would have been a headline grabber for us that we nabbed. and she ends up pulling her name out too. And I just, and then I was like, I'm sorry to use this phrase, but like, WTF, right? I mean, it was sort of, I and the other members had the same reaction. It's like Korn Ferry should have vetted this ahead of time, and they should -- 2 of 5 -- have before we went through this final testing. We each one of these people said, Okay, if you're offered the job, are you prepared to move to San Diego? And now, obviously, sometimes they're contractual issues. I don't think that was the issue here at all. I think, I think they just got, they just finally woke up one day and said, I don't want to leave my, you know, Washington, to the east coast and move out there, even though most people are dying to move out there. It's a very attractive place to live. So that was not good. And so we ended up promoting the internal candidate, who we all had doubts about. He was the COO he was the acting CEO. Now the good news is that he actually did a very good job as acting CEO, and he kind of earned his stripes, and we've, since we've made him the CEO. The guy's doing a great job. So at the end of the day, it all worked out okay, but you do have to wonder, like, what was this all about? At the end of the day, like, if somebody asked me, Would you recommend Korn Ferry, I'd have to take a couple steps, you know, I can't jump in and say, wow, they just knocked it out of the park for us. I'm sorry to say that, because I like these individuals. One of the last thing I'll say, and then I'll shut up, is is, you know, Allison, who is the lead partner. She went out on maternity leave in the middle of the back half of the search process. She was a little more plugged in, I thought, than Charlie and the other partner they had. And it was unfortunate. I mean, I understand and she it's not like she didn't tell us this was coming, but it was, there was a gap when she dropped off the team.\n\nInterviewer 17:43: did they like when you pushed them on it in terms of delivering the quality of candidates? What was their response for not, kind of not being able to deliver. what did they say? Gary 17:54 Well, so when it got down to the end, I mean, I guess the answer to that is after they both pulled out, you know, Charlie went to the boss and say, Well, should we reopen the search, you know? And this, this is what really got me, quote, unquote, should we look at college presidents? And it was kind of like, you know, it's like, oh my god. Like, I pretend I didn't hear that. So, I don't know, you know, I, I never really got an answer to that particularly, all I do know is, and because I've, I've had a subsequent experience with another firm on a whole different search, where they really did bring in amazing people, I'm just thinking to myself, this is a big enough job that we really should have had, really A-plus candidates, you know, the head of ZSL, or something, probably would have been interested in this job as an example,\n\nInterviewer 18:56: And so how? I mean, how are they left with, with them? I mean, you know, in terms of them, you landed an internal candidate. The last three were all ones from you. Did they help? Did they help in negotiation with the last candidate, even though they're internal? Or was it over to you? Gary 19:14 You mean, the woman who dropped out, or the COO, the COO, now they helped. I mean, they did all, you know, look from a process point of view, and managing the timeline and all that, they were fine. It was just at the end of the day, I think the candidate quality, and then this, this lack of, you know, pushing the candidates toward a commitment, were fatal flaws that weren't great\n\nInterviewer 19:47: yeah, in terms of the like, just project communication, feeling up to date in what's going on, and that momentum, how was that? Gary 19:54 in terms of where we ended up? Well, no, the whole way through. How was the momentum during the process, I think it was fine. I mean, they, they can't, you know, I had a weekly meeting with them. We, you know, there was good communication. The other members of the team of the search committee weren't quite well with a couple of them weren't really used to doing this before, so we had to kind of bring them along. We had to deal with the parochialism of San Diego a couple of times. It was fine. It was all part of the process. So look, so it wasn't like, Gee, I would never hire them. I mean, I don't feel that way. It was just it was disappointing because it got off to such a good start, and they were so impressive in the selection process. And the first couple months were great. I mean, they really did all this incoming. They met with everybody. It was very inclusive. They did all that really well. They -- 3 of 5 -- started generating some names. Everything was moving along, and then it sort of skidded, as they say, it kind of skidded off the runway,\n\nInterviewer 21:07: I mean, is there anything that they could have done, given what you ended up with the last three candidates, to get that back on track? I mean, do you think they should have continued to look even though you had three candidates because they weren't ones that they'd landed. Would you ever expected them to carry on looking? Gary 21:28 Yeah, I mean, I, it's all like in the rearview mirror now, but I, I just think they should have known that those candidates were not going to move to San Diego. They should have known that, and that being the case, they should have said, Uh oh, we better come up with some Cracker Jack alternatives, right? Because what they did is they pushed them forward as their two outside candidates, and they both sort of, you know, got flat tires so, and it was sort of like, yeah, so I guess the way I would answer that is, they had too many eggs in the baskets that then deflated. Okay, I'm mixing metaphors. I apologize.\n\nInterviewer 22:27: I totally get it in terms of, I suppose you know the broader experience of Korn Ferry, did you feel, I mean, especially having sat on the board and one of their competitors do, how do they compare in terms of infrastructure or even things like assessments, you know, to assess the candidates. Is it like for life, or is there any difference there? Gary 22:48 They did a good job. They even brought in one of, they have, like a psychologist on their staff, and that was a useful session. Actually, was quite interesting about leadership and lining up the resumes with their formula. So, no, in terms of, like, managing a process, having the right inputs, they were fine. I mean, they were fine on that. I don't have anything to complain about. I do. I mean, just between me and you, I don't know if I'd want this repeated, but I do wonder whether Allison's absence really had a lot to do with the outcome. And I don't know it could be, because I have no idea it could be that Charlie had other engagements that he couldn't handle, that all of them at the same time, and it sort of felt like that to me, a little bit an ownership thing, yeah, yeah. And Allison, frankly, played more of a leadership role until she didn't, and once she was gone, it just felt a little bit it. It felt less prioritized at the firm. And that's just subjective, but that's important right?\n\nInterviewer 24:07: Because that's how you feel, so it's, it's good feedback, but for them, okay, great. I mean, I think that's probably it. It's really, really useful, and, you know, things for them to go and reflect on and feedback to. Is there anything else that you think would be good to share at this point? Gary 24:26 I don't think so. Look again, I just want you to, because you haven't worked with me before, I'm not one of these people who are never happy and never satisfied. I mean, I give plenty of people like positive reinforcements and reviews, and 'this person's amazing; They did a great job', you know, but in this case, it was just disappointing,\n\nInterviewer 24:49: and that's why we have these conversations, right? They need to learn from that. And, you know, appreciate your honesty, and it's not, it doesn't come across in that way at all. So, yeah, and it gives them a chance to call course correct. Wonderful. Gary 25:04 Well, I really, really appreciate the firm reaching out to me and I think if you talk to the other search committee members, they pretty much say the same thing. So I don't feel like I'm an outlier. But anyway, Interviewer, I really thank you for also being flexible on the time, and I know late on a Friday. So enjoy the weekend. Yeah. -- 4 of 5 --\n\nInterviewer 25:29: Well, you too. Enjoy the snow if it comes. Gary 25:33 Happy holidays. Take care.\n\nInterviewer 25:34: You too. Bye. -- 5 of 5 --"
}