{
  "lastGenerated": "2026-02-09T10:56:39.791Z",
  "opportunities": [
    {
      "type": "re_engagement",
      "title": "Immediate recovery plan to rebuild trust",
      "description": "The client explicitly stated they would not use Korn Ferry again and has already moved a current senior search to another provider. A targeted recovery plan is needed to prevent further erosion across the group relationship and to reopen dialogue.",
      "urgency": "high",
      "sourceInterviewId": "t-006",
      "client": "Greg Austin",
      "company": "SYNLAB",
      "supportingQuote": "\"Would you use them again? – No and to be honest, we have a senior role now, but I've gone somewhere else...\"",
      "suggestedAction": "Have a senior Korn Ferry leader request a reset meeting, acknowledge gaps, and present a concrete remediation plan (process changes, service guarantees, and value-add) to earn a second chance.",
      "status": "identified",
      "id": "opp-0"
    },
    {
      "type": "improvement",
      "title": "Tighten candidate quality and screening standards",
      "description": "Shortlisted candidates were perceived as average and clearly unsuitable within minutes, indicating weak calibration and/or screening against the brief. Improving quality will directly address the core dissatisfaction driver.",
      "urgency": "high",
      "sourceInterviewId": "t-006",
      "client": "Greg Austin",
      "company": "SYNLAB",
      "supportingQuote": "\"Some of the people on the shortlist had minimal experience... after five minutes, you knew they just were nowhere near what you wanted.\"",
      "suggestedAction": "Run a stricter qualification process (must-have criteria, structured scorecards, and pre-interview validation) and share the screening rationale with the client before presenting candidates.",
      "status": "identified",
      "id": "opp-1"
    },
    {
      "type": "improvement",
      "title": "Clarify complex matrix role briefs upfront",
      "description": "The client felt Korn Ferry did not understand the matrix nature of the COO role, which likely drove misaligned candidates and frustration. More rigorous discovery and role-definition work is needed at the start of the search.",
      "urgency": "high",
      "sourceInterviewId": "t-006",
      "client": "Greg Austin",
      "company": "SYNLAB",
      "supportingQuote": "\"I think they struggled to understand what the matrix nature of the organization... was... that lack of understanding has probably led to the quality of candidates not being as what it should be.\"",
      "suggestedAction": "Add a mandatory deep-dive briefing workshop (stakeholder mapping, success profile, decision rights in the matrix, and 90-day outcomes) before launching sourcing.",
      "status": "identified",
      "id": "opp-2"
    },
    {
      "type": "improvement",
      "title": "Shift from 'difficult role' to solutions",
      "description": "The consultant repeatedly emphasized difficulty rather than offering options, which reduced confidence and made the engagement feel unhelpful. The client wants proactive problem-solving and adjustments when the market is tight.",
      "urgency": "high",
      "sourceInterviewId": "t-006",
      "client": "Greg Austin",
      "company": "SYNLAB",
      "supportingQuote": "\"It was almost an element of, this is really difficult... rather than try to find me a solution.\"",
      "suggestedAction": "Implement a proactive search governance cadence where each update includes market feedback plus 2–3 concrete options (spec changes, target pools, compensation levers, or alternative profiles).",
      "status": "identified",
      "id": "opp-3"
    },
    {
      "type": "improvement",
      "title": "Provide clear compensation and package guidance",
      "description": "The client experienced weak ownership and unclear answers on candidate expectations and negotiation, creating friction at offer stage. Stronger market benchmarking and candidate expectation management would improve outcomes.",
      "urgency": "high",
      "sourceInterviewId": "t-006",
      "client": "Greg Austin",
      "company": "SYNLAB",
      "supportingQuote": "\"When it came to saying... let's negotiate. What does she expect? And the answer was, I don't know.\"",
      "suggestedAction": "Bring compensation benchmarks and a documented candidate expectation range into shortlist stage, and assign the consultant clear responsibility for negotiation support.",
      "status": "identified",
      "id": "opp-4"
    },
    {
      "type": "improvement",
      "title": "Define who leads offer and negotiation",
      "description": "There was misalignment on whether Korn Ferry or the client should lead the initial offer and negotiation, causing confusion and reducing perceived value. A clear, agreed offer process would prevent repeat issues.",
      "urgency": "medium",
      "sourceInterviewId": "t-006",
      "client": "Greg Austin",
      "company": "SYNLAB",
      "supportingQuote": "\"My view was that that initial offer and negotiation should come by the agency... But he felt that was our role, not his.\"",
      "suggestedAction": "Standardize an offer/closing playbook and confirm roles and responsibilities in writing at kickoff (including who leads verbal offer, negotiation, and documentation).",
      "status": "identified",
      "id": "opp-5"
    },
    {
      "type": "improvement",
      "title": "Increase proactive engagement and update cadence",
      "description": "The client compared Korn Ferry unfavorably to competitors who provide weekly proactive updates and market insight. Improving cadence and proactivity would strengthen partnership perception.",
      "urgency": "high",
      "sourceInterviewId": "t-006",
      "client": "Greg Austin",
      "company": "SYNLAB",
      "supportingQuote": "\"[Hunter Healthcare]... The lead consultant has been on the phone every week, without fail. Never had to chase them, and they're proactively engaging with us...\"",
      "suggestedAction": "Commit to a weekly standing update (plus ad-hoc updates when milestones occur) that includes pipeline metrics, market intel, and next-step recommendations.",
      "status": "identified",
      "id": "opp-6"
    },
    {
      "type": "improvement",
      "title": "Be flexible around client availability",
      "description": "The engagement felt one-sided, driven by consultant availability rather than the client’s needs. Improving scheduling flexibility and responsiveness would reduce friction and improve experience.",
      "urgency": "medium",
      "sourceInterviewId": "t-006",
      "client": "Greg Austin",
      "company": "SYNLAB",
      "supportingQuote": "\"We did both [have] fairly regular contact, although it was frequently based on when Thomas was available, maybe not when we were available.\"",
      "suggestedAction": "Agree preferred communication windows and escalation paths at kickoff, and ensure backup coverage so the client can reach someone when needed.",
      "status": "identified",
      "id": "opp-7"
    },
    {
      "type": "re_engagement",
      "title": "Address mandated-use resentment and rebuild partnership",
      "description": "The relationship was undermined because Korn Ferry was perceived as imposed by the group, leading to low buy-in and a feeling of being taken for granted. Reframing the relationship around earned value is necessary to retain future work.",
      "urgency": "high",
      "sourceInterviewId": "t-006",
      "client": "Greg Austin",
      "company": "SYNLAB",
      "supportingQuote": "\"Nobody actually wanted to use Korn Ferry... it was pushed on them by the group.\" / \"Korn Ferry... almost took us for granted a little bit.\"",
      "suggestedAction": "Hold a stakeholder reset to clarify local needs, agree success measures, and demonstrate optional value (not entitlement) through tailored insights and service commitments.",
      "status": "identified",
      "id": "opp-8"
    },
    {
      "type": "improvement",
      "title": "Ensure value when client provides candidate",
      "description": "Paying high fees for a hire the client referred created a major value gap and damaged trust. Korn Ferry needs a clear policy and communication on fee fairness and value delivery in such cases.",
      "urgency": "high",
      "sourceInterviewId": "t-006",
      "client": "Greg Austin",
      "company": "SYNLAB",
      "supportingQuote": "\"We've just paid 70 grand in fees for someone that we gave them, which feels a bit of a stink.\"",
      "suggestedAction": "Introduce and communicate a transparent approach for client-referred candidates (fee adjustment, added services, or credit) and reinforce what Korn Ferry delivers beyond sourcing.",
      "status": "identified",
      "id": "opp-9"
    },
    {
      "type": "expansion",
      "title": "Leverage psychometrics as broader assessment offering",
      "description": "The client found psychometric testing and reporting highly valuable, suggesting an opportunity to position Korn Ferry’s assessment capabilities as a differentiator beyond search. This could open doors to leadership assessment, team effectiveness, or selection support.",
      "urgency": "medium",
      "sourceInterviewId": "t-006",
      "client": "Greg Austin",
      "company": "SYNLAB",
      "supportingQuote": "\"The psychometric testing piece was very detailed and very good reporting... that really helped... that was really valuable.\"",
      "suggestedAction": "Propose an assessment-led package for future senior hires (psychometrics, structured interviews, and onboarding insights) to rebuild credibility and expand services.",
      "status": "identified",
      "id": "opp-10"
    },
    {
      "type": "future_need",
      "title": "Support for current and upcoming senior roles",
      "description": "The client indicated they have a senior role now and will likely have future senior hiring needs, but is currently using other headhunters. Korn Ferry can still position for future opportunities if trust is rebuilt.",
      "urgency": "high",
      "sourceInterviewId": "t-006",
      "client": "Greg Austin",
      "company": "SYNLAB",
      "supportingQuote": "\"...we have a senior role now, but I've gone somewhere else...\"",
      "suggestedAction": "After a recovery conversation, offer a low-risk pilot (e.g., market mapping or assessment-only support) to demonstrate improved delivery before asking for another retained search.",
      "status": "identified",
      "id": "opp-11"
    },
    {
      "type": "expansion",
      "title": "Add value-add networking and industry introductions",
      "description": "Competitors are winning favor by offering introductions, seminars, and health-sector invites that benefit the client’s broader team. Replicating or exceeding this value-add could deepen relationships beyond a single search.",
      "urgency": "medium",
      "sourceInterviewId": "t-006",
      "client": "Greg Austin",
      "company": "SYNLAB",
      "supportingQuote": "\"Those had some value add stuff around we're going to make some introductions, and there's some seminars and invites... which would benefit some of my colleagues...\"",
      "suggestedAction": "Create a client value plan including relevant health-sector roundtables, introductions, and thought leadership sessions tailored to SYNLAB’s medical and operational leaders.",
      "status": "identified",
      "id": "opp-12"
    },
    {
      "type": "improvement",
      "title": "Demonstrate stronger market knowledge and mapping",
      "description": "Korn Ferry was perceived as less knowledgeable and less engaged than competitors who quickly articulated target organizations, constraints, and approach. Stronger upfront market mapping would improve confidence and outcomes.",
      "urgency": "high",
      "sourceInterviewId": "t-006",
      "client": "Greg Austin",
      "company": "SYNLAB",
      "supportingQuote": "\"Immediately, there was a sense of they understood the marketplace... They knew people in that space. They knew the organizations they couldn't talk to...\"",
      "suggestedAction": "Deliver an early market intelligence pack (target list, off-limits constraints, talent availability, and outreach plan) within the first 1–2 weeks of kickoff.",
      "status": "identified",
      "id": "opp-13"
    },
    {
      "type": "future_need",
      "title": "Repeat senior-level executive search support",
      "description": "Harry indicates he will return to Korn Ferry when future senior hiring needs arise, and would use the same team again. This is a clear signal of ongoing executive search demand tied to leadership changes or growth.",
      "urgency": "medium",
      "sourceInterviewId": "t-007",
      "client": "Harry Boot",
      "company": "Maracorp",
      "supportingQuote": "“When the need ultimately arises... you're going to go to people that you know and that you trust...” and “If it would happen again, I would choose exactly the same team.”",
      "suggestedAction": "Set a light-touch quarterly check-in to understand upcoming leadership needs and stay positioned as first call for senior searches.",
      "status": "identified",
      "id": "opp-14"
    },
    {
      "type": "improvement",
      "title": "Strengthen Asian-market candidate coverage",
      "description": "He wanted more candidates with deeper Asia experience, even acknowledging the market is young and supply is limited. Improving access to Asia-experienced talent (or clearly framing scarcity early) would increase perceived fit and reduce friction.",
      "urgency": "medium",
      "sourceInterviewId": "t-007",
      "client": "Harry Boot",
      "company": "Maracorp",
      "supportingQuote": "“I would have liked to see someone with a lot more Asian experience... but... not necessarily a lot of those people exist, right?”",
      "suggestedAction": "Proactively map Asia-experienced talent pools (including adjacent-market proxies) and set expectations early with a market availability brief.",
      "status": "identified",
      "id": "opp-15"
    },
    {
      "type": "expansion",
      "title": "Offer cost-scaled advisory beyond recruitment",
      "description": "He views broader consultancy/OD as expensive for a small company and would not prioritize Korn Ferry for that work, despite valuing Korn Ferry’s quality. A right-sized, modular offering could unlock additional spend without triggering cost concerns.",
      "urgency": "medium",
      "sourceInterviewId": "t-007",
      "client": "Harry Boot",
      "company": "Maracorp",
      "supportingQuote": "“I'm a small company... they are, of course, costly... would they come to me top of the list for an organizational development? No...”",
      "suggestedAction": "Create a small-company package (fixed-fee, limited-scope) for targeted org/leadership advisory tied directly to hiring outcomes.",
      "status": "identified",
      "id": "opp-16"
    },
    {
      "type": "re_engagement",
      "title": "Protect relationship with consistent team continuity",
      "description": "Trust is the primary reason he chose Korn Ferry over investor-recommended alternatives, and he explicitly wants the same team again. Any change in points of contact could weaken the partnership and open the door to competitors.",
      "urgency": "high",
      "sourceInterviewId": "t-007",
      "client": "Harry Boot",
      "company": "Maracorp",
      "supportingQuote": "“I've been dealing with Korn Ferry... for probably two... maybe even three decades.” and “I would choose exactly the same team.”",
      "suggestedAction": "Maintain the same lead partners on the account and document relationship history/preferences to ensure seamless continuity if staffing changes occur.",
      "status": "identified",
      "id": "opp-17"
    },
    {
      "type": "future_need",
      "title": "Ongoing executive searches across clinical leadership",
      "description": "Carilion Clinic expects to continue using Korn Ferry for future executive searches beyond the current slate (six searches this year). This indicates a steady pipeline of leadership hiring needs where Korn Ferry can remain the default partner.",
      "urgency": "medium",
      "sourceInterviewId": "t-008",
      "client": "Tony Seupaul",
      "company": "Carilion Clinic",
      "supportingQuote": "“Tony strongly endorsed Korn Ferry and confirmed they would continue to use them for future searches.” (also: “five completed, a sixth in progress”)",
      "suggestedAction": "Proactively schedule quarterly workforce/leadership planning check-ins to anticipate upcoming chair/director roles and lock in search timelines early.",
      "status": "identified",
      "id": "opp-18"
    },
    {
      "type": "expansion",
      "title": "Provide compensation market data as input",
      "description": "Although compensation benchmarking must be finalized internally for governance reasons, Korn Ferry data could still be valuable as an additional reference point. This is an opportunity to offer targeted compensation insights without positioning it as the final benchmark.",
      "urgency": "low",
      "sourceInterviewId": "t-008",
      "client": "Tony Seupaul",
      "company": "Carilion Clinic",
      "supportingQuote": "“if Korn Ferry had that information, it could help inform us as a data point, but it would not be the benchmark we would use in our final analysis.”",
      "suggestedAction": "Offer a lightweight compensation insights add-on (role-specific market ranges and peer comparisons) packaged explicitly as a supporting data point for their internal process.",
      "status": "identified",
      "id": "opp-19"
    },
    {
      "type": "expansion",
      "title": "Deepen use of Korn Ferry assessments",
      "description": "Tony values Korn Ferry’s assessment tools as an additional data point alongside Carilion’s internal tools. There is room to expand assessment usage by tailoring outputs to complement their existing evaluation framework and decision meetings.",
      "urgency": "low",
      "sourceInterviewId": "t-008",
      "client": "Tony Seupaul",
      "company": "Carilion Clinic",
      "supportingQuote": "“Korn Ferry's tool is good, it's helpful… it's just one additional data point for us as we think through how we assess our candidates.”",
      "suggestedAction": "Align assessment deliverables to Carilion’s internal evaluation criteria (e.g., mapping results to their competencies) and propose a consistent assessment step for finalist slates.",
      "status": "identified",
      "id": "opp-20"
    },
    {
      "type": "improvement",
      "title": "Maintain rapid, always-on communication cadence",
      "description": "Speed and responsiveness are a core value driver for Tony and directly tied to candidate experience and search efficiency. While not a complaint, it is a clear service requirement to preserve and operationalize.",
      "urgency": "medium",
      "sourceInterviewId": "t-008",
      "client": "Tony Seupaul",
      "company": "Carilion Clinic",
      "supportingQuote": "“We'll communicate at any time, any day… they're very responsive… timing in these searches is very important… I insist on very efficient searches.”",
      "suggestedAction": "Formalize response-time and update cadence norms (e.g., same-day feedback loops, proactive text alerts for changes) to ensure consistency across all searches and team members.",
      "status": "identified",
      "id": "opp-21"
    },
    {
      "type": "re_engagement",
      "title": "Protect relationship-led approach vs. over-automation",
      "description": "Tony explicitly values the human touch and does not believe AI/tech would improve the relationship component of the work. This is a signal to reinforce high-touch engagement and avoid leading with automation in this account.",
      "urgency": "low",
      "sourceInterviewId": "t-008",
      "client": "Tony Seupaul",
      "company": "Carilion Clinic",
      "supportingQuote": "“the human touch, the relationship is the key ingredient… I don’t think AI or tech innovation would enhance that in any meaningful way.”",
      "suggestedAction": "Reinforce a relationship-first account plan (regular executive touchpoints, high-touch candidate management) and position any tech only as behind-the-scenes efficiency, not a replacement for human interaction.",
      "status": "identified",
      "id": "opp-22"
    },
    {
      "type": "improvement",
      "title": "Set upfront communication SLAs and channels",
      "description": "Early-stage frustration stemmed from slow responses and a preference for calls over quick email replies. Aligning on response-time expectations, preferred channels, and cadence at kickoff would prevent misalignment and improve the client experience.",
      "urgency": "high",
      "sourceInterviewId": "t-009",
      "client": "Andre Buckles",
      "company": "The Options Clearing Corporation (OCC)",
      "supportingQuote": "\"we are a time sensitive organization...we're hearing back within two three hours... on occasion, instead of just replying to an email, there was a request to have a conversation\"",
      "suggestedAction": "Implement a standard kickoff “ways of working” agreement that documents SLAs (e.g., 2–3 hour response), channel preferences (email vs call), and update cadence.",
      "status": "identified",
      "id": "opp-23"
    },
    {
      "type": "improvement",
      "title": "Maintain candidate pipeline until hire is cleared",
      "description": "The client was uncomfortable when the process narrowed to a single finalist without a ready backup, creating perceived risk if the finalist fell through. Continuing to surface candidates until offer acceptance and background checks are complete would strengthen confidence and reduce time-to-recover.",
      "urgency": "high",
      "sourceInterviewId": "t-009",
      "client": "Andre Buckles",
      "company": "The Options Clearing Corporation (OCC)",
      "supportingQuote": "\"I was not quite comfortable that we had a ready backup pool... other search firms... keep sharing candidates... until an offer is accepted [and] background checks been cleared\"",
      "suggestedAction": "Adopt a consistent “pipeline continuity” standard: keep presenting qualified candidates (or maintain warm alternates) through offer acceptance and clearance milestones.",
      "status": "identified",
      "id": "opp-24"
    },
    {
      "type": "improvement",
      "title": "Proactive notifications for assessment result delivery",
      "description": "Assessment insights were highly valued, but the rollout caused delays because results were sent to a dedicated mailbox without a proactive heads-up. A simple notification and confirmation loop would reduce friction and prevent missed deliverables.",
      "urgency": "medium",
      "sourceInterviewId": "t-009",
      "client": "Andre Buckles",
      "company": "The Options Clearing Corporation (OCC)",
      "supportingQuote": "\"there also wasn't any communication... that said, heads up, they're going to start going out to you now... that sort of proactive nudge... was missing\"",
      "suggestedAction": "Add an automated and/or consultant-sent alert when assessments are released (where sent, what to expect, and a confirmation check within 24 hours).",
      "status": "identified",
      "id": "opp-25"
    },
    {
      "type": "re_engagement",
      "title": "Secure rehire by confirming refinements upfront",
      "description": "Andre explicitly stated willingness to rehire Korn Ferry, contingent on clearer communication expectations and responsiveness. This is a near-term opportunity to lock in future search work by proactively addressing the stated conditions.",
      "urgency": "high",
      "sourceInterviewId": "t-009",
      "client": "Andre Buckles",
      "company": "The Options Clearing Corporation (OCC)",
      "supportingQuote": "\"If we had search to do over again, I would rehire them, as long as we did some early setting of communication preferences, timeliness of responses\"",
      "suggestedAction": "Schedule a short post-search debrief to agree the communication playbook and pipeline approach, and document it as the default for OCC going forward.",
      "status": "identified",
      "id": "opp-26"
    },
    {
      "type": "expansion",
      "title": "Expand from assessments into more executive searches",
      "description": "OCC already uses Korn Ferry broadly for assessments, leadership behaviors, 360 feedback, and development, and the search outcome was positive with strong candidate quality. This creates a clear path to expand search scope beyond the Controller role into additional confidential or leadership hires.",
      "urgency": "medium",
      "sourceInterviewId": "t-009",
      "client": "Andre Buckles",
      "company": "The Options Clearing Corporation (OCC)",
      "supportingQuote": "\"we've worked with them... primarily in our assessment and organizational development functions... we use them for pre hire assessments... deliver 360 feedback and other... development opportunities\" and \"I would rehire them\"",
      "suggestedAction": "Propose a forward-looking hiring roadmap session to identify upcoming leadership roles where Korn Ferry can run search plus assessment as an integrated solution.",
      "status": "identified",
      "id": "opp-27"
    },
    {
      "type": "future_need",
      "title": "Ongoing leadership development and 360 programs",
      "description": "The client indicates continued use of leadership behaviors work, pre-hire assessments, 360 feedback, and ongoing development offerings. These are recurring needs that can be formalized into an annual plan or programmatic engagement.",
      "urgency": "low",
      "sourceInterviewId": "t-009",
      "client": "Andre Buckles",
      "company": "The Options Clearing Corporation (OCC)",
      "supportingQuote": "\"They've been partners to us in developing our list of leadership behaviors... partnered with them to deliver 360 feedback and other sort of ongoing development opportunities\"",
      "suggestedAction": "Offer an annual assessment-and-development calendar (360s, coaching, leadership behavior refresh) with agreed timelines and points of contact.",
      "status": "identified",
      "id": "opp-28"
    },
    {
      "type": "expansion",
      "title": "Package role-shaping advisory into future searches",
      "description": "Korn Ferry’s market insight and CPA credibility helped reframe the role and expand the talent pool, which the client found additive. This advisory component can be positioned as a standard value-add for future searches and workforce planning.",
      "urgency": "medium",
      "sourceInterviewId": "t-009",
      "client": "Andre Buckles",
      "company": "The Options Clearing Corporation (OCC)",
      "supportingQuote": "\"As Anne's a CPA... you're calling this X, this is how it looks in the market... [it] opened up the pool of talent\"",
      "suggestedAction": "Create a repeatable “role calibration + market mapping” module at the start of searches and offer it to OCC for upcoming roles.",
      "status": "identified",
      "id": "opp-29"
    },
    {
      "type": "re_engagement",
      "title": "Rebuild trust after difficult first engagement",
      "description": "The client described the engagement as difficult and indicated Korn Ferry would not be a top choice for future work. A proactive recovery plan could prevent churn and reopen consideration for future searches.",
      "urgency": "high",
      "sourceInterviewId": "t-010",
      "client": "Shannon Fulmer",
      "company": "Western States Petroleum Association, WSPA",
      "supportingQuote": "“this first engagement was a difficult experience and would be hesitant to use Korn Ferry again” and “would not... be on top of the list to call”",
      "suggestedAction": "Schedule an executive-level debrief with Shannon to acknowledge issues, share corrective actions, and agree on a reset plan for any future needs.",
      "status": "identified",
      "id": "opp-30"
    },
    {
      "type": "improvement",
      "title": "Align to governance and communication pathways",
      "description": "The consultant bypassed the agreed recruitment policy by going directly to the Board Chair, which changed timelines and undermined the internal committee’s role. Clear governance mapping and adherence would reduce friction and rebuild confidence.",
      "urgency": "high",
      "sourceInterviewId": "t-010",
      "client": "Shannon Fulmer",
      "company": "Western States Petroleum Association, WSPA",
      "supportingQuote": "“twice when he went to him, he got time frames changed and meetings changed, and that not would not have happened had the internal group been able to have the conversation with our board members.”",
      "suggestedAction": "At kickoff, document and get sign-off on a governance/communications protocol (who can change timelines, who is the single point of contact) and enforce it throughout the search.",
      "status": "identified",
      "id": "opp-31"
    },
    {
      "type": "improvement",
      "title": "Act faster on client feedback and direction",
      "description": "The client had to repeat feedback before it was implemented, especially around narrowing the candidate slate. Improving responsiveness would signal listening and reduce frustration.",
      "urgency": "high",
      "sourceInterviewId": "t-010",
      "client": "Shannon Fulmer",
      "company": "Western States Petroleum Association, WSPA",
      "supportingQuote": "“It took me calling him twice to get that to stop.”",
      "suggestedAction": "Implement a feedback-to-action cadence (e.g., 24–48 hour turnaround with written confirmation of changes) and a weekly alignment check-in.",
      "status": "identified",
      "id": "opp-32"
    },
    {
      "type": "improvement",
      "title": "Improve candidate fit against association needs",
      "description": "Candidates were advanced despite clear feedback they did not match the role’s core requirements (e.g., mediator/consensus builder), which eroded confidence in Korn Ferry’s judgment and alignment.",
      "urgency": "high",
      "sourceInterviewId": "t-010",
      "client": "Shannon Fulmer",
      "company": "Western States Petroleum Association, WSPA",
      "supportingQuote": "“we were really looking for that person that could be a mediator... And so she was an immediate no... And Charlie was like, Well, I don't understand this. Why would you not consider her?”",
      "suggestedAction": "Recalibrate the success profile with explicit ‘must-have’ behaviors (e.g., mediation/coalition-building) and add a stricter internal screening gate before presenting candidates.",
      "status": "identified",
      "id": "opp-33"
    },
    {
      "type": "improvement",
      "title": "Shift from volume outreach to targeted slate",
      "description": "The client wanted a small number of high-quality benchmark candidates given a strong internal contender, but experienced the search as volume-driven. A targeted approach would better match expectations and reduce reputational/political risk.",
      "urgency": "high",
      "sourceInterviewId": "t-010",
      "client": "Shannon Fulmer",
      "company": "Western States Petroleum Association, WSPA",
      "supportingQuote": "“It felt more like he was trying to get us bodies... we need two or three people... this is the bar. They got to be as good as our internal candidate, or better.”",
      "suggestedAction": "Agree upfront on slate size and benchmarking intent (e.g., 2–3 external finalists) and run a targeted sourcing plan with client-approved target lists.",
      "status": "identified",
      "id": "opp-34"
    },
    {
      "type": "improvement",
      "title": "Tighten compensation alignment and screening",
      "description": "At least one candidate was far outside the disclosed compensation range, indicating misalignment in screening and potentially wasting stakeholder time. Stronger compensation calibration would improve efficiency and credibility.",
      "urgency": "high",
      "sourceInterviewId": "t-010",
      "client": "Shannon Fulmer",
      "company": "Western States Petroleum Association, WSPA",
      "supportingQuote": "“He brought us someone who... was well over a million dollars in salary, and he knew ours was like at 600, 700,000 total.”",
      "suggestedAction": "Add a mandatory compensation-range checkpoint before candidate submission and confirm candidate expectations in writing prior to presenting.",
      "status": "identified",
      "id": "opp-35"
    },
    {
      "type": "improvement",
      "title": "Use association-experienced consultants for governance nuance",
      "description": "The consultant struggled with the operational and governance dynamics of a membership-driven association, contributing to missteps with board/committee interactions and candidate evaluation. Deploying sector-specialized leadership would improve outcomes.",
      "urgency": "medium",
      "sourceInterviewId": "t-010",
      "client": "Shannon Fulmer",
      "company": "Western States Petroleum Association, WSPA",
      "supportingQuote": "“Limited association understanding... struggled to fully grasp the unique operational and governance model of associations, where both board and members play central roles.”",
      "suggestedAction": "Assign an association-sector lead (or add a governance-savvy co-lead) for future work and incorporate an association-governance briefing into the kickoff.",
      "status": "identified",
      "id": "opp-36"
    },
    {
      "type": "improvement",
      "title": "Reassess assessment tool value and timing",
      "description": "The assessment was perceived as adding little value given the clear strength of the internal candidate. Better tailoring when and how assessments are used could improve perceived ROI.",
      "urgency": "medium",
      "sourceInterviewId": "t-010",
      "client": "Shannon Fulmer",
      "company": "Western States Petroleum Association, WSPA",
      "supportingQuote": "“The provided assessment added little value in this search, as the internal candidate was clearly the strongest option.”",
      "suggestedAction": "Align on decision points for assessment use (e.g., only for finalists or internal/external comparisons) and explain how results will influence board decisions.",
      "status": "identified",
      "id": "opp-37"
    },
    {
      "type": "future_need",
      "title": "Future executive search support for association roles",
      "description": "Although hesitant now, the client may need future senior searches and previously selected Korn Ferry due to association-sector credibility. Maintaining a relationship and demonstrating improvements could position Korn Ferry for the next opportunity.",
      "urgency": "medium",
      "sourceInterviewId": "t-010",
      "client": "Shannon Fulmer",
      "company": "Western States Petroleum Association, WSPA",
      "supportingQuote": "Korn Ferry was chosen based on prior association-sector experience... but Shannon noted they “would not... be on top of the list to call” right now for future searches.",
      "suggestedAction": "Maintain light-touch engagement (quarterly check-ins, sector insights) and offer a no-cost governance/search process review to be considered for the next role.",
      "status": "identified",
      "id": "opp-38"
    },
    {
      "type": "expansion",
      "title": "Offer governance-aligned search process redesign",
      "description": "The core friction centered on governance, decision rights, and communication pathways between committee and board chair. Korn Ferry can expand value by providing a structured governance-aligned search playbook tailored to associations.",
      "urgency": "medium",
      "sourceInterviewId": "t-010",
      "client": "Shannon Fulmer",
      "company": "Western States Petroleum Association, WSPA",
      "supportingQuote": "“Bypassing agreed governance... overriding the recruitment policy” and “Governance alignment was critical.”",
      "suggestedAction": "Propose a short consulting engagement to map decision rights, stakeholder roles, and escalation paths for future searches within WSPA’s association governance model.",
      "status": "identified",
      "id": "opp-39"
    },
    {
      "type": "improvement",
      "title": "Align assessment approach upfront to avoid overlap",
      "description": "Cargill has an intensive internal assessment process, and Korn Ferry’s automatic 30-minute assessment created friction due to duplication. A clearer early conversation would prevent wasted time and candidate fatigue.",
      "urgency": "high",
      "sourceInterviewId": "t-011",
      "client": "Michael Baker",
      "company": "Cargill",
      "supportingQuote": "“make sure you have a very clear conversation with your client about your assessment, whether they have one, and whether it makes sense to do both… upfront.”",
      "suggestedAction": "Add an explicit assessment-alignment step in kickoff (client assessment map, decision on KF assessment, and documented rationale) before candidate outreach.",
      "status": "identified",
      "id": "opp-40"
    },
    {
      "type": "improvement",
      "title": "Maintain broader pipeline visibility through late stages",
      "description": "The search briefly felt overly dependent on a single finalist, creating stakeholder stress about having sufficient options. Ensuring a consistently broad-looking slate and communicating pipeline depth would increase confidence.",
      "urgency": "high",
      "sourceInterviewId": "t-011",
      "client": "Michael Baker",
      "company": "Cargill",
      "supportingQuote": "“There was some stress at one point that… are we putting all our eggs in one basket… at the 11th hour, Korn Ferry pulled a rabbit out of their hat.”",
      "suggestedAction": "Set a pipeline coverage plan (e.g., minimum viable shortlist/backup candidates) and provide weekly pipeline dashboards showing active prospects, readiness, and risks.",
      "status": "identified",
      "id": "opp-41"
    },
    {
      "type": "re_engagement",
      "title": "Proactively reinforce trusted-partner status across searches",
      "description": "Cargill does not use Korn Ferry exclusively, even though they view Korn Ferry as a trusted, high-performing partner. Proactive relationship management can help protect share-of-wallet and keep Korn Ferry top-of-mind for upcoming senior roles.",
      "urgency": "medium",
      "sourceInterviewId": "t-011",
      "client": "Michael Baker",
      "company": "Cargill",
      "supportingQuote": "“While they do not use Korn Ferry exclusively, they view them as a trusted partner who consistently delivers high-quality results.”",
      "suggestedAction": "Schedule a quarterly talent/recruiting strategy check-in with Michael to review upcoming leadership needs, lessons learned, and where Korn Ferry can lead vs. support.",
      "status": "identified",
      "id": "opp-42"
    },
    {
      "type": "expansion",
      "title": "Leverage performance audit to win more search volume",
      "description": "Michael’s five-year audit indicates Korn Ferry outperforms other firms on outcomes like retention and diversity, which is strong proof to justify allocating more searches to Korn Ferry. This can be used to expand engagement beyond ad-hoc selection among multiple firms.",
      "urgency": "medium",
      "sourceInterviewId": "t-011",
      "client": "Michael Baker",
      "company": "Cargill",
      "supportingQuote": "“I did a five-year audit… their performance is the best compared to the three that we work with regularly.”",
      "suggestedAction": "Propose a preferred-partner or tiered allocation model using the audit data, with agreed success metrics and a target increase in annual search assignments.",
      "status": "identified",
      "id": "opp-43"
    },
    {
      "type": "future_need",
      "title": "Ongoing senior finance leadership searches likely",
      "description": "Cargill values Korn Ferry’s ability to access and engage top-tier CAO-level talent and provide expert process guidance, suggesting future needs for similar senior finance/accounting leadership roles. Maintaining market mapping and readiness will support faster future searches.",
      "urgency": "low",
      "sourceInterviewId": "t-011",
      "client": "Michael Baker",
      "company": "Cargill",
      "supportingQuote": "“you should know who the Fortune 100, Fortune 200 CAOs are… You should be able to get some of them to the table” and “worked with Korn Ferry on several senior searches.”",
      "suggestedAction": "Offer an annual/biannual CAO/CFO succession and market-mapping refresh for Cargill to keep target lists warm and shorten time-to-slate for future roles.",
      "status": "identified",
      "id": "opp-44"
    },
    {
      "type": "improvement",
      "title": "Set clear response-time and update cadence",
      "description": "The client experienced slow email responses and wanted more frequent interim updates to maintain confidence and reassure stakeholders. Establishing explicit SLAs and a predictable communication rhythm would reduce frustration and prevent misinterpretations of disengagement.",
      "urgency": "high",
      "sourceInterviewId": "t-012",
      "client": "Dr. Nina Johanna Haltern",
      "company": "Tengelmann Twenty-One",
      "supportingQuote": "“Sometimes it took 30 hours or so... you would have thought at least one of them could just tell me... but [we got nothing]” and a desire for “quicker interim updates to reassure stakeholders.”",
      "suggestedAction": "Agree and document response SLAs and a weekly (or twice-weekly) progress update cadence at kickoff, including who covers inbox/queries when the lead is unavailable.",
      "status": "identified",
      "id": "opp-45"
    },
    {
      "type": "improvement",
      "title": "Share early draft profiles to guide direction",
      "description": "They valued quality but wanted earlier visibility of initial profiles to give feedback and confirm the search was on track, rather than waiting weeks for a polished shortlist. Earlier “directional” profiles would increase speed and stakeholder confidence without sacrificing quality.",
      "urgency": "high",
      "sourceInterviewId": "t-012",
      "client": "Dr. Nina Johanna Haltern",
      "company": "Tengelmann Twenty-One",
      "supportingQuote": "“It would have been better to just get...the first profile to work with...and tell them [yes] that's going in the right direction.”",
      "suggestedAction": "Introduce an early-market calibration step (e.g., 3–5 draft profiles or target list within the first 7–10 days) to validate criteria and adjust quickly.",
      "status": "identified",
      "id": "opp-46"
    },
    {
      "type": "improvement",
      "title": "Increase flexibility versus standard procedure rigidity",
      "description": "Korn Ferry’s structured methodology was respected but sometimes felt slower and less pragmatic than boutique firms. More flexibility in process steps and deliverable timing would better match the client’s working style.",
      "urgency": "medium",
      "sourceInterviewId": "t-012",
      "client": "Dr. Nina Johanna Haltern",
      "company": "Tengelmann Twenty-One",
      "supportingQuote": "“I sometimes [had] the impression they really need[ed] to follow their standard procedure... sometimes I would have liked them to be a bit more...flexible.”",
      "suggestedAction": "Offer a tailored project plan at kickoff with optional “fast-track” variants (e.g., parallel referencing, earlier stakeholder check-ins, lighter initial documentation) while maintaining quality controls.",
      "status": "identified",
      "id": "opp-47"
    },
    {
      "type": "re_engagement",
      "title": "Repair CFO’s early disengagement perception",
      "description": "The CFO initially felt Korn Ferry did not want the assignment and questioned responsiveness/engagement, which could affect future selection decisions. Proactive senior-level outreach can rebuild confidence and prevent the issue from resurfacing.",
      "urgency": "high",
      "sourceInterviewId": "t-012",
      "client": "Dr. Nina Johanna Haltern",
      "company": "Tengelmann Twenty-One",
      "supportingQuote": "“In the very beginning [the CFO] really had the impression they didn't want to do the job... it was too low level for them.”",
      "suggestedAction": "Schedule a brief debrief with Dr. Nina and the CFO led by the partner to acknowledge the early experience, share what will change (SLAs/early profiles), and reaffirm commitment.",
      "status": "identified",
      "id": "opp-48"
    },
    {
      "type": "improvement",
      "title": "Align compensation expectations earlier in process",
      "description": "A strong candidate progressed with compensation expectations far beyond what the client would pay, creating wasted effort and risk of late-stage fallout. Earlier, explicit compensation alignment would improve efficiency and candidate transparency.",
      "urgency": "medium",
      "sourceInterviewId": "t-012",
      "client": "Dr. Nina Johanna Haltern",
      "company": "Tengelmann Twenty-One",
      "supportingQuote": "“It makes sense to talk about packages early in the process” and a candidate had “a package far beyond what we were able to or willing to pay.”",
      "suggestedAction": "Add a mandatory early compensation/total package alignment checkpoint (with documented range confirmation) before advancing candidates to later stages.",
      "status": "identified",
      "id": "opp-49"
    },
    {
      "type": "improvement",
      "title": "Use secure shared drive for profile sharing",
      "description": "The client preferred not to receive candidate profiles by email and requested a shared drive approach for better data security and cleanup after the search. Updating the document-sharing method would improve trust and client experience.",
      "urgency": "medium",
      "sourceInterviewId": "t-012",
      "client": "Dr. Nina Johanna Haltern",
      "company": "Tengelmann Twenty-One",
      "supportingQuote": "“I didn't want to have any profiles in my inbox... [I'd rather you] share your drive... once the search is finished, I'm going to close the drive.”",
      "suggestedAction": "Default to a client-approved secure workspace (shared drive/portal) for all candidate materials and agree retention/closure steps at project start.",
      "status": "identified",
      "id": "opp-50"
    },
    {
      "type": "expansion",
      "title": "Leverage prior success to secure repeat searches",
      "description": "They stated they would use Korn Ferry again and were happy with the outcome, indicating strong potential for repeat executive search work. Formalizing a forward-looking relationship plan can convert satisfaction into pipeline.",
      "urgency": "medium",
      "sourceInterviewId": "t-012",
      "client": "Dr. Nina Johanna Haltern",
      "company": "Tengelmann Twenty-One",
      "supportingQuote": "“Yes, absolutely [would use them again]... I'm really happy with the result.”",
      "suggestedAction": "Propose a quarterly talent/leadership hiring outlook check-in with HR and the CPO to identify upcoming roles early and reserve capacity.",
      "status": "identified",
      "id": "opp-51"
    },
    {
      "type": "future_need",
      "title": "Ongoing stakeholder reassurance during future searches",
      "description": "They highlighted the need for interim updates to reassure stakeholders, suggesting future searches will require more visible momentum reporting. This is a recurring support need, especially with senior stakeholders like the CFO.",
      "urgency": "medium",
      "sourceInterviewId": "t-012",
      "client": "Dr. Nina Johanna Haltern",
      "company": "Tengelmann Twenty-One",
      "supportingQuote": "A desire for “quicker interim updates to reassure stakeholders” and tension from “waiting period.”",
      "suggestedAction": "Create a lightweight stakeholder update pack (weekly progress, market signals, next steps) and agree distribution to key stakeholders for future assignments.",
      "status": "identified",
      "id": "opp-52"
    },
    {
      "type": "improvement",
      "title": "Add stronger QA for presentation materials",
      "description": "Occasional calculation/formula mistakes in deliverables undermine confidence even in an otherwise trusted relationship. A tighter quality-control process would reduce errors before materials reach the committee.",
      "urgency": "high",
      "sourceInterviewId": "t-013",
      "client": "Stephen Zelkowicz",
      "company": "DLH Holdings",
      "supportingQuote": "\"there are times where I have found mistakes... It could be a certain formula wasn't used properly. Or...something that's not the median...\"",
      "suggestedAction": "Implement a two-step QA review (analyst + senior reviewer) for all benchmarking and committee decks, with a pre-send checklist for formulas/medians.",
      "status": "identified",
      "id": "opp-53"
    },
    {
      "type": "expansion",
      "title": "Broaden services as DLH grows",
      "description": "Stephen indicated openness to using Korn Ferry more broadly as the company matures. This is a clear opening to expand beyond the current compensation committee retainer into adjacent governance and talent offerings.",
      "urgency": "medium",
      "sourceInterviewId": "t-013",
      "client": "Stephen Zelkowicz",
      "company": "DLH Holdings",
      "supportingQuote": "He \"would consider using them more broadly as DLH Holdings grows.\"",
      "suggestedAction": "Propose a growth-aligned roadmap of additional services (e.g., broader board/governance advisory, executive pay strategy, leadership assessment) timed to DLH’s maturity milestones.",
      "status": "identified",
      "id": "opp-54"
    },
    {
      "type": "future_need",
      "title": "Advisory on AI impact to skills and pay",
      "description": "Stephen is actively thinking about how AI will change workforce development and compensation structures, signaling a future need for guidance. Korn Ferry can position thought leadership and advisory support at the intersection of AI, talent, and rewards.",
      "urgency": "medium",
      "sourceInterviewId": "t-013",
      "client": "Stephen Zelkowicz",
      "company": "DLH Holdings",
      "supportingQuote": "\"AI awareness is something always on my mind… it’s confusing, but it’s changing how younger generations develop within the workforce.\"",
      "suggestedAction": "Offer an executive briefing/workshop on AI-driven workforce and rewards implications, followed by an optional diagnostic on skills, job architecture, and pay structures.",
      "status": "identified",
      "id": "opp-55"
    },
    {
      "type": "re_engagement",
      "title": "Reinforce value after competitive pricing pressure",
      "description": "They recently ran a competitive review where other firms were ~30% cheaper, so continued reinforcement of value and differentiation is important to protect the retainer. Proactive check-ins can prevent price-driven reconsideration and keep the partnership strong.",
      "urgency": "medium",
      "sourceInterviewId": "t-013",
      "client": "Stephen Zelkowicz",
      "company": "DLH Holdings",
      "supportingQuote": "\"so and so is offering 30% less than what you are... we consider price but... we consider the quality of the relationship\"",
      "suggestedAction": "Schedule a semi-annual value review summarizing outcomes, responsiveness metrics, and specialist expertise delivered, and align on priorities for the next 6–12 months.",
      "status": "identified",
      "id": "opp-56"
    },
    {
      "type": "expansion",
      "title": "Leverage advocacy and introductions for referrals",
      "description": "Stephen has already introduced Korn Ferry to peers, indicating strong advocacy that can be converted into a structured referral pipeline. Formalizing this can deepen the relationship and generate new opportunities.",
      "urgency": "low",
      "sourceInterviewId": "t-013",
      "client": "Stephen Zelkowicz",
      "company": "DLH Holdings",
      "supportingQuote": "\"I have introduced them to people I know who are in the private sector... two or three times. I've made introductions...\"",
      "suggestedAction": "Ask permission to formalize referrals (target list + warm-intro plan) and provide Stephen with a short, tailored capabilities deck he can forward to peers.",
      "status": "identified",
      "id": "opp-57"
    },
    {
      "type": "improvement",
      "title": "Standardize earlier candidate report delivery timelines",
      "description": "The first candidate report arrived too close to the interview, reducing the client’s preparation time. Making earlier delivery a standard expectation would prevent recurrence and improve consistency across searches.",
      "urgency": "medium",
      "sourceInterviewId": "t-014",
      "client": "Vanessa Didden",
      "company": "Heidelberg Materials Benelux SA",
      "supportingQuote": "“They sent the first candidate report...48 hours before the interview...I told them that this was too short”",
      "suggestedAction": "Set and agree a minimum lead time SLA for candidate reports (e.g., 5 business days pre-interview) and bake it into the search project plan.",
      "status": "identified",
      "id": "opp-58"
    },
    {
      "type": "improvement",
      "title": "Ensure consistent completeness of candidate reports",
      "description": "An early report missed specific details needed for interviews, even though it was corrected later. A quality-control step would ensure every report includes the required information from the start.",
      "urgency": "medium",
      "sourceInterviewId": "t-014",
      "client": "Vanessa Didden",
      "company": "Heidelberg Materials Benelux SA",
      "supportingQuote": "“There was also some information missing... but they were very reactive and adapted it for the next reports.”",
      "suggestedAction": "Introduce a standardized report checklist aligned to the client’s interview needs and run an internal QA review before sending.",
      "status": "identified",
      "id": "opp-59"
    },
    {
      "type": "future_need",
      "title": "Post-placement follow-up and onboarding check-ins",
      "description": "The client explicitly wants structured follow-up with the placed candidate after start to confirm integration and share feedback back to HR. This is a clear future support need that can be productized as part of executive search delivery.",
      "urgency": "high",
      "sourceInterviewId": "t-014",
      "client": "Vanessa Didden",
      "company": "Heidelberg Materials Benelux SA",
      "supportingQuote": "“I really hope that they will do a follow up...when she's been here for a few weeks and then maybe within three or six months....Give her a call...and then give me the feedback because that's really valuable for me”",
      "suggestedAction": "Schedule and deliver a formal post-placement cadence (e.g., 2–4 weeks, 3 months, 6 months) with documented feedback to client and candidate.",
      "status": "identified",
      "id": "opp-60"
    },
    {
      "type": "expansion",
      "title": "Position Korn Ferry for future executive-level searches",
      "description": "Vanessa indicates strong intent to reuse Korn Ferry for ExCo/general management roles, where premium fees are justified. This creates an opportunity to secure preferred-partner status for senior mandates in Benelux.",
      "urgency": "medium",
      "sourceInterviewId": "t-014",
      "client": "Vanessa Didden",
      "company": "Heidelberg Materials Benelux SA",
      "supportingQuote": "“For ExCo positions, yes.” / “If I had to do this again…I would work with Korn Ferry definitely”",
      "suggestedAction": "Proactively map upcoming ExCo/GM succession needs and agree a forward-looking plan for senior searches (including confidentiality approach and timelines).",
      "status": "identified",
      "id": "opp-61"
    },
    {
      "type": "re_engagement",
      "title": "Reinforce partnership via proactive follow-up touchpoints",
      "description": "The client values relationship continuity and explicitly asks for follow-up; acting on this will strengthen the partnership and keep Korn Ferry top-of-mind for the next senior mandate. Without proactive touchpoints, the relationship may remain transactional and limited to occasional searches.",
      "urgency": "high",
      "sourceInterviewId": "t-014",
      "client": "Vanessa Didden",
      "company": "Heidelberg Materials Benelux SA",
      "supportingQuote": "“Part of it is indeed the trust I have in Olivier Top as a consultant” and “I really hope that they will do a follow up...”",
      "suggestedAction": "Set quarterly relationship check-ins with Vanessa (separate from active searches) and include a post-placement review as a standard agenda item.",
      "status": "identified",
      "id": "opp-62"
    },
    {
      "type": "expansion",
      "title": "Offer cost-calibrated options for non-ExCo roles",
      "description": "She would likely use other firms for less senior hires due to Korn Ferry’s higher fees, limiting share of wallet. A tiered or scoped offering could capture additional roles while preserving premium positioning for top mandates.",
      "urgency": "low",
      "sourceInterviewId": "t-014",
      "client": "Vanessa Didden",
      "company": "Heidelberg Materials Benelux SA",
      "supportingQuote": "“For other positions, no, because actually their fees are higher than all the other headhunters in Belgium.”",
      "suggestedAction": "Propose a differentiated delivery model for sub-ExCo roles (e.g., lighter-touch search, fixed-fee, or hybrid RPO/search) while keeping full executive search for top roles.",
      "status": "identified",
      "id": "opp-63"
    },
    {
      "type": "re_engagement",
      "title": "Clarify broader Korn Ferry capabilities without pushing",
      "description": "Vanessa currently views Korn Ferry primarily as a headhunting firm and notes existing leadership/HR partnerships and group-level control over benchmarks. A light, consultative clarification can prevent missed opportunities while respecting her stated constraints.",
      "urgency": "low",
      "sourceInterviewId": "t-014",
      "client": "Vanessa Didden",
      "company": "Heidelberg Materials Benelux SA",
      "supportingQuote": "“Not really because I think their core business is headhunting…we have a partnership…expert in leadership…I know they also do salary benchmarks…these…would be decided by our group in Germany”",
      "suggestedAction": "Share a concise capability overview tailored to Benelux needs (e.g., assessments tied to search, onboarding support) and ask where local discretion exists versus group-controlled decisions.",
      "status": "identified",
      "id": "opp-64"
    },
    {
      "type": "future_need",
      "title": "Ongoing ELT and strategic role searches",
      "description": "PartnerRe will continue to use external search firms for ELT and other strategic roles that cannot be filled through succession, especially amid leadership changes and reshuffles.",
      "urgency": "medium",
      "sourceInterviewId": "t-015",
      "client": "Lisa Bolger",
      "company": "Unknown",
      "supportingQuote": "They partner with external search firms for ELT and key strategic roles that cannot be filled through succession.",
      "suggestedAction": "Proactively map likely upcoming critical roles with Lisa/CEO and propose a forward-looking search roadmap and timelines.",
      "status": "identified",
      "id": "opp-65"
    },
    {
      "type": "expansion",
      "title": "Expand leader profiling and benchmarking support",
      "description": "Lisa is already using Korn Ferry leader profiles and benchmark/data and signals openness to drawing on more of Korn Ferry’s broader expertise when needs arise.",
      "urgency": "medium",
      "sourceInterviewId": "t-015",
      "client": "Lisa Bolger",
      "company": "Unknown",
      "supportingQuote": "We've done a number of the leader profiles... having conversations around benchmark... I've used their data for other things as well... I actually need something in this area, have you got something that would help.",
      "suggestedAction": "Offer a packaged quarterly talent/leadership insights session combining leader profiles, benchmarking, and targeted recommendations for current priorities.",
      "status": "identified",
      "id": "opp-66"
    },
    {
      "type": "expansion",
      "title": "Increase share of wallet despite non-exclusivity",
      "description": "Korn Ferry is one of three firms and the relationship is non-exclusive, but Korn Ferry has been winning most tenders—creating an opportunity to formalize preferred-partner status or secure more mandates.",
      "urgency": "medium",
      "sourceInterviewId": "t-015",
      "client": "Lisa Bolger",
      "company": "Unknown",
      "supportingQuote": "Korn Ferry is one of three partners... the relationship remains non-exclusive... [tenders] heavily weighted towards Korn Ferry.",
      "suggestedAction": "Propose a preferred supplier framework (service levels, pricing bands, and governance) to convert strong performance into more consistent mandate flow.",
      "status": "identified",
      "id": "opp-67"
    },
    {
      "type": "improvement",
      "title": "Improve listening balance on US-led searches",
      "description": "Lisa noted that on a US-based search, consultants sometimes over-talk; improving listening and local sensitivity would strengthen delivery and stakeholder confidence.",
      "urgency": "high",
      "sourceInterviewId": "t-015",
      "client": "Lisa Bolger",
      "company": "Unknown",
      "supportingQuote": "There's probably a little bit more listening needed on the US side... sometimes... you can over-talk... just that opportunity really, really just listen.",
      "suggestedAction": "Coach the US search team on listening-first behaviors and build structured stakeholder listening checkpoints into the search process.",
      "status": "identified",
      "id": "opp-68"
    },
    {
      "type": "improvement",
      "title": "Strengthen multi-region team communication and coordination",
      "description": "When multiple teams/regions are involved, coordination and communication can slip; tightening governance would reduce friction and improve client experience.",
      "urgency": "high",
      "sourceInterviewId": "t-015",
      "client": "Lisa Bolger",
      "company": "Unknown",
      "supportingQuote": "[There's] an opportunity to work on communication when there are multiple teams around the table.",
      "suggestedAction": "Assign a single engagement coordinator and implement a clear RACI, shared tracker, and agreed cadence for cross-region updates.",
      "status": "identified",
      "id": "opp-69"
    },
    {
      "type": "improvement",
      "title": "Fix short-notice scheduling and diary management",
      "description": "There were issues getting interviews/meetings scheduled last minute for a stakeholder not led by Lisa; improving scheduling discipline would prevent avoidable frustration.",
      "urgency": "medium",
      "sourceInterviewId": "t-015",
      "client": "Lisa Bolger",
      "company": "Unknown",
      "supportingQuote": "There's been some [difficulty] trying to get meetings in the diary... or interviews... last minute, which is never going to work for her.",
      "suggestedAction": "Set scheduling SLAs (minimum notice periods, scheduling owner, and escalation path) at kickoff and use a shared scheduling plan for all stakeholders.",
      "status": "identified",
      "id": "opp-70"
    },
    {
      "type": "improvement",
      "title": "Apply learnings consistently across repeat mandates",
      "description": "Lisa implied that in repeat or sensitive searches, Korn Ferry should carry forward prior learnings more consistently to avoid enthusiasm being perceived as over-talking.",
      "urgency": "medium",
      "sourceInterviewId": "t-015",
      "client": "Lisa Bolger",
      "company": "Unknown",
      "supportingQuote": "In a search previously managed by another firm... consultants' enthusiasm occasionally came across as over-talking when Lisa saw scope to apply learnings.",
      "suggestedAction": "Create a short 'client preferences and lessons learned' brief for PartnerRe and require all consultants on the account to review it before stakeholder meetings.",
      "status": "identified",
      "id": "opp-71"
    },
    {
      "type": "re_engagement",
      "title": "Increase post-placement check-ins to reduce risk",
      "description": "Challenging searches and a candidate withdrawal indicate a need to reinforce post-offer and post-start engagement to protect outcomes and strengthen trust.",
      "urgency": "medium",
      "sourceInterviewId": "t-015",
      "client": "Lisa Bolger",
      "company": "Unknown",
      "supportingQuote": "We've had some challenging searches... we've had one that's pulled out... Monitor post-placement phase. Ensure early check-ins with placed candidates and hiring leaders.",
      "suggestedAction": "Implement a standard post-offer and 30/60/90-day check-in plan with both candidate and hiring leaders, with rapid escalation if risk signals appear.",
      "status": "identified",
      "id": "opp-72"
    },
    {
      "type": "improvement",
      "title": "Standardize delivery quality across all search teams",
      "description": "The client experiences variability in engagement and effectiveness when searches are led by consultants outside Jerry’s core team. Creating consistent ways of working would protect the strong brand experience and reduce reliance on a single relationship lead.",
      "urgency": "high",
      "sourceInterviewId": "t-016",
      "client": "Cana Iwahara",
      "company": "Macquarie Group Ltd.",
      "supportingQuote": "\"I wasn't as impressed... it depends on the team that you're working with.\"",
      "suggestedAction": "Implement a consistent delivery playbook (cadence, stakeholder updates, candidate management standards) and ensure every Macquarie search has a senior oversight/check-in to maintain Jerry-level quality.",
      "status": "identified",
      "id": "opp-73"
    },
    {
      "type": "re_engagement",
      "title": "Reduce key-person dependency on Jerry relationship",
      "description": "The partnership is highly anchored to Jerry; when other consultants led, engagement dropped until Jerry took over. This creates continuity risk if Jerry is unavailable and signals a need to broaden trusted touchpoints.",
      "urgency": "medium",
      "sourceInterviewId": "t-016",
      "client": "Cana Iwahara",
      "company": "Macquarie Group Ltd.",
      "supportingQuote": "\"Jerry took over and we were able to move the process along pretty quickly.\"",
      "suggestedAction": "Create a named account bench (primary + deputy leads) and run periodic joint check-ins so Cana builds confidence in multiple Korn Ferry leaders.",
      "status": "identified",
      "id": "opp-74"
    },
    {
      "type": "future_need",
      "title": "Provide periodic compensation and benchmarking insights",
      "description": "Cana expressed interest in receiving light-touch, periodic compensation benchmarking similar to what they received from another firm. This indicates an ongoing advisory need beyond individual searches.",
      "urgency": "medium",
      "sourceInterviewId": "t-016",
      "client": "Cana Iwahara",
      "company": "Macquarie Group Ltd.",
      "supportingQuote": "\"if we could get more comp benchmarking surveys... they would send us an annual comp report which was helpful.\"",
      "suggestedAction": "Offer an annual (or semi-annual) compensation/market benchmarking pack tailored to private markets roles, with a short readout session for HR and key hiring leaders.",
      "status": "identified",
      "id": "opp-75"
    },
    {
      "type": "expansion",
      "title": "Expand into DEI support for senior hiring",
      "description": "DEI is a stated HR priority, especially increasing diverse representation in senior roles. Korn Ferry can deepen the relationship by adding structured DEI sourcing, slate goals, and inclusive assessment practices to searches.",
      "urgency": "medium",
      "sourceInterviewId": "t-016",
      "client": "Cana Iwahara",
      "company": "Macquarie Group Ltd.",
      "supportingQuote": "Key HR priorities include: \"Diversity, Equity & Inclusion: increasing diverse representation in senior hiring.\"",
      "suggestedAction": "Propose a DEI-enhanced search approach (diverse pipeline mapping, inclusive scorecards, and progress reporting) for upcoming senior MD and executive searches.",
      "status": "identified",
      "id": "opp-76"
    },
    {
      "type": "expansion",
      "title": "Support digital and AI capability hiring strategy",
      "description": "Macquarie is prioritizing digital and AI integration and data-led decision-making, which may require new leadership profiles and scarce-skill talent mapping. Korn Ferry can extend from search execution into workforce and capability advisory for these areas.",
      "urgency": "medium",
      "sourceInterviewId": "t-016",
      "client": "Cana Iwahara",
      "company": "Macquarie Group Ltd.",
      "supportingQuote": "Key HR priorities include: \"Digital and AI integration: expanding technological capability and data-led decision-making across the business.\"",
      "suggestedAction": "Offer a targeted market map and role/competency framework for digital/AI leadership and critical hires within private markets and adjacent investment teams.",
      "status": "identified",
      "id": "opp-77"
    },
    {
      "type": "future_need",
      "title": "Talent development for new growth areas",
      "description": "The business is moving into new growth areas (private equity adjacencies and entrepreneurial fund structures), implying future needs for new role design, leadership assessment, and succession planning. This is an opportunity to support beyond immediate searches.",
      "urgency": "low",
      "sourceInterviewId": "t-016",
      "client": "Cana Iwahara",
      "company": "Macquarie Group Ltd.",
      "supportingQuote": "Key HR priorities include: \"Talent development for new growth areas: including private equity adjacencies and entrepreneurial fund structures.\"",
      "suggestedAction": "Initiate a discovery session on upcoming growth-area talent needs and propose a phased plan covering role architecture, assessment, and succession/leadership development.",
      "status": "identified",
      "id": "opp-78"
    },
    {
      "type": "improvement",
      "title": "Maintain proactive post-placement follow-up consistently",
      "description": "The client values that Korn Ferry stays in touch with placed candidates and can advise on onboarding, but this should be consistently executed across all teams. Formalizing post-placement touchpoints would strengthen outcomes and retention.",
      "urgency": "low",
      "sourceInterviewId": "t-016",
      "client": "Cana Iwahara",
      "company": "Macquarie Group Ltd.",
      "supportingQuote": "\"I think you know they do stay in touch [with placed candidates] ...they can also give the hires advice on how to best on board into Macquarie and be successful.\"",
      "suggestedAction": "Standardize a post-placement plan (e.g., 30/60/90-day check-ins with candidate and hiring manager) and share a brief onboarding success guide tailored to Macquarie.",
      "status": "identified",
      "id": "opp-79"
    },
    {
      "type": "expansion",
      "title": "Offer forensic referencing as an optional add-on",
      "description": "They have used Korn Ferry for forensic referencing when requested by hiring managers, despite it not being Cana’s preference. Packaging this as an optional, clearly scoped add-on could increase value while aligning to stakeholder needs.",
      "urgency": "low",
      "sourceInterviewId": "t-016",
      "client": "Cana Iwahara",
      "company": "Macquarie Group Ltd.",
      "supportingQuote": "\"when the hiring manager wanted it, we’ve done it a few times.\"",
      "suggestedAction": "Create a clear forensic referencing option (when to use, turnaround time, outputs) and socialize it with HR and hiring managers as an on-demand service.",
      "status": "identified",
      "id": "opp-80"
    },
    {
      "type": "improvement",
      "title": "Resource early-stage mapping and research better",
      "description": "Early-stage market mapping and research arrived later than expected and appeared under-resourced, which extended the search timeline. Improving research capacity and timing would increase speed and reduce reliance on the lead consultant to cover gaps.",
      "urgency": "high",
      "sourceInterviewId": "t-017",
      "client": "Mike Arshinskiy",
      "company": "Inflexion Private Equity Partners",
      "supportingQuote": "\"We mapped out all private equity firms... I felt like this came slightly later in the search than it should have... it felt like Dan had to pull the weight.\"",
      "suggestedAction": "Assign stronger research support upfront with clear mapping milestones and QA checks in week 1–2 of the search.",
      "status": "identified",
      "id": "opp-81"
    },
    {
      "type": "improvement",
      "title": "Standardize search operations and tracking",
      "description": "The client expected stronger “run of the mill” search operations (candidate tracking, benchmarking) to keep the process efficient. More consistent operational rigor would reduce delays and improve predictability.",
      "urgency": "medium",
      "sourceInterviewId": "t-017",
      "client": "Mike Arshinskiy",
      "company": "Inflexion Private Equity Partners",
      "supportingQuote": "\"I would expect [Korn Ferry] to just [do a] slightly better job at run of the mill skilled operations, like mapping out candidate tracking... benchmarking.\"",
      "suggestedAction": "Implement a standardized search ops playbook (tracking templates, benchmarking outputs, weekly status reporting) used across all engagements.",
      "status": "identified",
      "id": "opp-82"
    },
    {
      "type": "improvement",
      "title": "Improve consistency beyond the lead consultant",
      "description": "Mike’s positive experience was driven primarily by Dan, while other team contributions felt average, creating risk that future engagements may not meet the same standard. Consistency across teams would protect the relationship and brand perception.",
      "urgency": "high",
      "sourceInterviewId": "t-017",
      "client": "Mike Arshinskiy",
      "company": "Inflexion Private Equity Partners",
      "supportingQuote": "\"I didn't feel like I was working exactly with Korn Ferry... I'm not sure that's endemic of Korn Ferry... the junior research analyst was average at best.\"",
      "suggestedAction": "Introduce tighter team selection, training, and internal QA so delivery quality is consistent regardless of the individual consultant.",
      "status": "identified",
      "id": "opp-83"
    },
    {
      "type": "improvement",
      "title": "Rework assessment outputs for actionable insight",
      "description": "Assessment results were perceived as slow and lacking the specific comparative insights requested (peers, upward comparisons), and less candid/actionable than competitor outputs. Enhancing assessment design and tailoring would increase perceived value and differentiation.",
      "urgency": "high",
      "sourceInterviewId": "t-017",
      "client": "Mike Arshinskiy",
      "company": "Inflexion Private Equity Partners",
      "supportingQuote": "\"It took a long time and the insights were lacking... [I asked] specifically [for] data on peers, data on up... [but they] didn't do what was instructed.\"",
      "suggestedAction": "Redesign assessment deliverables to explicitly answer agreed questions (peer/up comparisons, performance risks, team dynamics) with clearer, more candid recommendations and faster turnaround SLAs.",
      "status": "identified",
      "id": "opp-84"
    },
    {
      "type": "improvement",
      "title": "Benchmark assessments against competitor 'Pebble'",
      "description": "Mike explicitly compared Korn Ferry’s assessment experience unfavorably to Pebble’s clarity and practicality. Using this as a benchmark can guide improvements in candour, relevance, and actionability.",
      "urgency": "medium",
      "sourceInterviewId": "t-017",
      "client": "Mike Arshinskiy",
      "company": "Inflexion Private Equity Partners",
      "supportingQuote": "\"Pebble were very clear... it's useful information to have, and it's actionable.\"",
      "suggestedAction": "Conduct a competitive review of Pebble-style outputs and incorporate best practices into Korn Ferry’s assessment reporting and debrief approach.",
      "status": "identified",
      "id": "opp-85"
    },
    {
      "type": "improvement",
      "title": "Improve KF4D usability and insight retrieval",
      "description": "KF4D was described as information-rich but difficult to navigate, limiting the client’s ability to extract value quickly. Better UX and guided summaries would increase adoption and satisfaction.",
      "urgency": "medium",
      "sourceInterviewId": "t-017",
      "client": "Mike Arshinskiy",
      "company": "Inflexion Private Equity Partners",
      "supportingQuote": "\"KF4D... has a treasure trove of valuable information... it's incredibly hard to get out.\"",
      "suggestedAction": "Provide a simplified client-facing view (dashboards/summaries) and a short enablement session to help clients find key insights quickly.",
      "status": "identified",
      "id": "opp-86"
    },
    {
      "type": "expansion",
      "title": "Extend assessment interpretation and advisory support",
      "description": "Mike valued the added step of connecting with an assessment expert to interpret results, suggesting appetite for deeper advisory around assessment insights. This can be packaged as a premium debrief/coaching offering for hiring teams.",
      "urgency": "low",
      "sourceInterviewId": "t-017",
      "client": "Mike Arshinskiy",
      "company": "Inflexion Private Equity Partners",
      "supportingQuote": "\"He connected me with the individual who runs those assessments... he explained the profile... showed what was worth looking at... that was super helpful.\"",
      "suggestedAction": "Offer a structured assessment debrief package (expert-led readout + hiring decision workshop) as an add-on for future searches.",
      "status": "identified",
      "id": "opp-87"
    },
    {
      "type": "future_need",
      "title": "Ongoing executive searches across portfolio lifecycle",
      "description": "Mike supports portfolio companies across the investment lifecycle, implying recurring leadership and specialist hiring needs as portfolios evolve. Korn Ferry can position itself as a repeat partner for future portfolio searches.",
      "urgency": "medium",
      "sourceInterviewId": "t-017",
      "client": "Mike Arshinskiy",
      "company": "Inflexion Private Equity Partners",
      "supportingQuote": "Mike supports portfolio companies in enterprise technology, product innovation, and software engineering \"throughout the investment lifecycle.\"",
      "suggestedAction": "Proactively propose a portfolio talent roadmap and a repeatable search model for technology/product leadership roles across Inflexion’s portfolio.",
      "status": "identified",
      "id": "opp-88"
    },
    {
      "type": "re_engagement",
      "title": "Protect relationship from brand-consistency risk",
      "description": "The client’s loyalty is strongly tied to Dan rather than Korn Ferry overall, creating retention risk if Dan is unavailable or team composition changes. A deliberate relationship plan can anchor trust in the broader firm.",
      "urgency": "high",
      "sourceInterviewId": "t-017",
      "client": "Mike Arshinskiy",
      "company": "Inflexion Private Equity Partners",
      "supportingQuote": "Mike’s experience was shaped primarily by Dan’s personal approach rather than the Korn Ferry brand; \"I didn't get to experience Korn Ferry beyond them in the search.\"",
      "suggestedAction": "Schedule an executive check-in with a senior Korn Ferry leader to reinforce firm-wide commitment, introduce a consistent delivery team, and agree service standards for future work.",
      "status": "identified",
      "id": "opp-89"
    },
    {
      "type": "expansion",
      "title": "Expand beyond finance into broader functions",
      "description": "Korn Ferry is heavily used for finance searches, while other parts of IVC use Korn Ferry for CEO/general management roles. There is an opportunity to formalize and broaden coverage across additional functions and business units.",
      "urgency": "medium",
      "sourceInterviewId": "t-018",
      "client": "Briony McKinn",
      "company": "IVC Acquisition Limited",
      "supportingQuote": "“I use them extensively for finance...but there are other parts of the organization [that] use Korn Ferry for CEO, general management type roles.”",
      "suggestedAction": "Map current usage by function and propose a cross-functional executive search partnership plan with named leads for each major stakeholder group.",
      "status": "identified",
      "id": "opp-90"
    },
    {
      "type": "future_need",
      "title": "Potential future leadership development support",
      "description": "Leadership development is currently delivered in-house due to budget constraints, but Briony has had very positive prior experience with Korn Ferry’s development offering. This suggests future demand if budget priorities shift or if a targeted, lower-cost program is proposed.",
      "urgency": "low",
      "sourceInterviewId": "t-018",
      "client": "Briony McKinn",
      "company": "IVC Acquisition Limited",
      "supportingQuote": "“Leadership development is delivered in-house at IVC due to budget priorities, though Briony previously had an excellent experience with Korn Ferry’s development offering.”",
      "suggestedAction": "Offer a modular, budget-sensitive leadership development option (e.g., targeted assessments + coaching for critical leaders) timed to their planning/budget cycle.",
      "status": "identified",
      "id": "opp-91"
    },
    {
      "type": "expansion",
      "title": "Bundle assessments and compensation intelligence more explicitly",
      "description": "Briony values Korn Ferry’s inclusion of assessments and compensation intelligence as differentiators versus competitors who charge extra. Packaging these elements as a standard, clearly articulated value proposition could help win more searches and increase share of wallet.",
      "urgency": "medium",
      "sourceInterviewId": "t-018",
      "client": "Briony McKinn",
      "company": "IVC Acquisition Limited",
      "supportingQuote": "“I find for some of these key C suite roles...it's the basic thing nowadays...I do appreciate that side of and also to the comp Intel as well.”",
      "suggestedAction": "Create a concise ‘what’s included’ executive search pack highlighting assessments, comp intel, and referencing as standard and socialize it with other IVC stakeholders.",
      "status": "identified",
      "id": "opp-92"
    },
    {
      "type": "re_engagement",
      "title": "Proactively reinforce value after multiple searches",
      "description": "They have completed four searches in 12 months and Briony explicitly asks for consideration on repeat business. This is a signal to proactively strengthen the partnership with a structured review and commercial approach to retain preference.",
      "urgency": "high",
      "sourceInterviewId": "t-018",
      "client": "Briony McKinn",
      "company": "IVC Acquisition Limited",
      "supportingQuote": "“this is our fourth search in 12 months, ‘what can you do for me?’ she takes that on board.”",
      "suggestedAction": "Schedule a quarterly partnership review and propose a repeat-search commercial framework (e.g., volume-based fee flexibility or added-value services).",
      "status": "identified",
      "id": "opp-93"
    },
    {
      "type": "improvement",
      "title": "Offer flexible portal vs high-touch communication options",
      "description": "Briony notes that portals can be efficient for some leaders but not suitable for others who prefer email reports and phone feedback. Providing stakeholder-specific workflow options would improve experience and reduce friction across different leader preferences.",
      "urgency": "medium",
      "sourceInterviewId": "t-018",
      "client": "Briony McKinn",
      "company": "IVC Acquisition Limited",
      "supportingQuote": "“some...will very happily log into a portal...but there are some stakeholders who are used to getting a report sent through on email, feedback on a phone call…so...depends on the stakeholders.”",
      "suggestedAction": "Implement a ‘communication and reporting preferences’ kickoff step per search, offering both portal-based and high-touch (email/call) reporting tracks by stakeholder.",
      "status": "identified",
      "id": "opp-94"
    },
    {
      "type": "improvement",
      "title": "Formalize stakeholder communication and update cadence",
      "description": "The search involved multiple stakeholders, but there was no agreed communication structure, creating potential inefficiency and reliance on ad hoc outreach. Establishing a clear cadence and points of contact would streamline coordination and reduce friction in future engagements.",
      "urgency": "medium",
      "sourceInterviewId": "t-019",
      "client": "Dawn Willoughby",
      "company": "International Flavors & Fragrances",
      "supportingQuote": "“we didn't really talk about a formal communication process...they didn't necessarily have a point person...Perhaps an efficiency would be for me to understand who do you want me to connect with on your side”",
      "suggestedAction": "At kickoff, agree a communication plan (single client POC(s), KF POC(s), escalation path, and weekly/biweekly update rhythm) and document it in writing.",
      "status": "identified",
      "id": "opp-95"
    },
    {
      "type": "improvement",
      "title": "Add performance metrics to candidate profiles",
      "description": "The client valued additional quantitative context (e.g., market cap, TSR) to compare candidates across different scales and industries. Including these metrics would strengthen decision-making and reduce dependence on informal market knowledge.",
      "urgency": "medium",
      "sourceInterviewId": "t-019",
      "client": "Dawn Willoughby",
      "company": "International Flavors & Fragrances",
      "supportingQuote": "“Perhaps seeing some TSR during the 10 years for the CEO candidates and CFF candidates...it is important to see what were the results” and “we did add it to our profiles...I don't think we had market cap in there originally”",
      "suggestedAction": "Standardize candidate profile templates to include relevant scale/performance indicators (e.g., market cap, revenue, TSR where applicable) with clear sourcing and time horizons.",
      "status": "identified",
      "id": "opp-96"
    },
    {
      "type": "re_engagement",
      "title": "Reduce reliance on single consultant for continuity",
      "description": "The relationship is strongly tied to Jane’s personal network and responsiveness, which the client implicitly flagged as a continuity risk. Broadening visibility of the broader team and codifying knowledge would protect the partnership if staffing changes occur.",
      "urgency": "medium",
      "sourceInterviewId": "t-019",
      "client": "Dawn Willoughby",
      "company": "International Flavors & Fragrances",
      "supportingQuote": "“Reliance on Jane's personal network noted as a potential continuity consideration” and “I always use Jane as my point of contact”",
      "suggestedAction": "Introduce a named deputy/bench lead and ensure shared documentation (market maps, candidate intel, decision rationale) is accessible to the broader Korn Ferry team.",
      "status": "identified",
      "id": "opp-97"
    },
    {
      "type": "expansion",
      "title": "Extend board advisory using board matrix approach",
      "description": "The client found the tailored board matrix especially helpful for visualizing end-state composition and gaps. This can be expanded into ongoing board effectiveness, refreshment planning, and committee/skills evolution advisory beyond individual searches.",
      "urgency": "low",
      "sourceInterviewId": "t-019",
      "client": "Dawn Willoughby",
      "company": "International Flavors & Fragrances",
      "supportingQuote": "“a matrix...a little more in depth to see here's what the end state looks like, and what gaps do we have to fill...So that was really helpful”",
      "suggestedAction": "Propose an annual/biannual board composition and succession planning workshop leveraging the matrix to guide refreshment and committee planning.",
      "status": "identified",
      "id": "opp-98"
    },
    {
      "type": "future_need",
      "title": "Support CEO succession and leadership transitions",
      "description": "IFF has already re-engaged Korn Ferry for CEO succession work, indicating an ongoing need for senior leadership succession planning and related governance support. This suggests continued demand for executive succession, assessment, and transition planning services.",
      "urgency": "high",
      "sourceInterviewId": "t-019",
      "client": "Dawn Willoughby",
      "company": "International Flavors & Fragrances",
      "supportingQuote": "“Korn Ferry has since been re-engaged for CEO succession work” and “We also did a bit of an RFP on CEO succession...and did select [them]”",
      "suggestedAction": "Align on a CEO succession roadmap (timeline, stakeholder governance, candidate benchmarking/assessment options, and communications plan) and confirm next milestones.",
      "status": "identified",
      "id": "opp-99"
    },
    {
      "type": "expansion",
      "title": "Broaden use of assessment and benchmarking tools",
      "description": "No assessment or benchmarking tools were used in the board searches, yet the client values structured, data-backed evaluation (e.g., TSR/scale metrics). Introducing Korn Ferry’s assessment/benchmarking capabilities could deepen rigor for CEO succession and future board/exec decisions.",
      "urgency": "low",
      "sourceInterviewId": "t-019",
      "client": "Dawn Willoughby",
      "company": "International Flavors & Fragrances",
      "supportingQuote": "“While no assessment or benchmarking tools were used for these board searches” and interest in “seeing some TSR” / “market cap”",
      "suggestedAction": "Offer an optional assessment/benchmarking module for CEO succession and key board roles, explaining how it complements network-based referencing and background checks.",
      "status": "identified",
      "id": "opp-100"
    },
    {
      "type": "future_need",
      "title": "Future board hiring when stability changes",
      "description": "While there are no immediate hiring needs, future board or executive search support may be required if the currently stable board composition changes or new priorities emerge.",
      "urgency": "low",
      "sourceInterviewId": "t-020",
      "client": "Kristin Skogen Lund",
      "company": "Delivery Hero Holding GMBH",
      "supportingQuote": "“At present, the board is stable with no immediate hiring needs.”",
      "suggestedAction": "Set a light-touch check-in cadence (e.g., semi-annual) to monitor upcoming succession or new role needs and stay top-of-mind.",
      "status": "identified",
      "id": "opp-101"
    },
    {
      "type": "future_need",
      "title": "Governance and structural change advisory support",
      "description": "The client is actively discussing governance and structural change, which may create demand for advisory support (e.g., board effectiveness, operating model, governance design).",
      "urgency": "medium",
      "sourceInterviewId": "t-020",
      "client": "Kristin Skogen Lund",
      "company": "Delivery Hero Holding GMBH",
      "supportingQuote": "“Discussions focus on governance, structural change, and ongoing portfolio matters.”",
      "suggestedAction": "Offer a targeted governance/structure workshop or diagnostic aligned to the board’s current agenda and propose a short advisory engagement.",
      "status": "identified",
      "id": "opp-102"
    },
    {
      "type": "future_need",
      "title": "Portfolio and succession planning support",
      "description": "Ongoing portfolio matters suggest potential future needs around leadership succession, talent mapping, and scenario planning as the portfolio evolves.",
      "urgency": "medium",
      "sourceInterviewId": "t-020",
      "client": "Kristin Skogen Lund",
      "company": "Delivery Hero Holding GMBH",
      "supportingQuote": "“Discussions focus on governance, structural change, and ongoing portfolio matters.”",
      "suggestedAction": "Propose a portfolio talent map and succession risk review to anticipate leadership needs before roles become urgent.",
      "status": "identified",
      "id": "opp-103"
    },
    {
      "type": "expansion",
      "title": "Expand from search into executive assessment",
      "description": "Kristin has prior positive experience with Korn Ferry assessments, creating a natural path to expand beyond search into assessment for board/leadership evaluation and development.",
      "urgency": "low",
      "sourceInterviewId": "t-020",
      "client": "Kristin Skogen Lund",
      "company": "Delivery Hero Holding GMBH",
      "supportingQuote": "“Kristin had also been assessed by Korn Ferry several times as an executive.”",
      "suggestedAction": "Recommend an assessment-based board/leadership effectiveness or succession readiness program leveraging Korn Ferry’s assessment capability.",
      "status": "identified",
      "id": "opp-104"
    },
    {
      "type": "expansion",
      "title": "Broaden relationships across HR and board stakeholders",
      "description": "Multiple stakeholders (HR director, board, nomination committee) were highly satisfied, creating an opportunity to deepen multi-threaded relationships and increase repeat engagements.",
      "urgency": "medium",
      "sourceInterviewId": "t-020",
      "client": "Kristin Skogen Lund",
      "company": "Delivery Hero Holding GMBH",
      "supportingQuote": "“the HR director...[was] incredibly happy” and “unanimous positive feedback from the board, HR, and nomination committee.”",
      "suggestedAction": "Schedule stakeholder debriefs with HR and nomination committee members to capture upcoming priorities and position Korn Ferry for future work.",
      "status": "identified",
      "id": "opp-105"
    },
    {
      "type": "expansion",
      "title": "Leverage trusted consultants for regional needs",
      "description": "Kristin explicitly values specific consultants (Mette, Phoebe, Stieg) and sees Stieg as strong in the Norwegian market, suggesting an opportunity to expand into regional or market-specific searches.",
      "urgency": "low",
      "sourceInterviewId": "t-020",
      "client": "Kristin Skogen Lund",
      "company": "Delivery Hero Holding GMBH",
      "supportingQuote": "“she has a colleague called Stieg...I see him as a Norwegian market type of person. He's really good there.”",
      "suggestedAction": "Proactively share a regional market outlook and offer support for any Norway/Nordics leadership needs using the trusted team.",
      "status": "identified",
      "id": "opp-106"
    },
    {
      "type": "re_engagement",
      "title": "Maintain momentum despite no immediate hiring",
      "description": "With no near-term requisitions, there is a risk the relationship goes dormant; maintaining engagement will protect future share-of-wallet when needs arise.",
      "urgency": "medium",
      "sourceInterviewId": "t-020",
      "client": "Kristin Skogen Lund",
      "company": "Delivery Hero Holding GMBH",
      "supportingQuote": "“At present, the board is stable with no immediate hiring needs.”",
      "suggestedAction": "Create a relationship plan with periodic value-add touchpoints (market insights, governance trends, succession check-ins) to stay engaged.",
      "status": "identified",
      "id": "opp-107"
    },
    {
      "type": "improvement",
      "title": "Ensure consistent quality across supporting team",
      "description": "Although the experience was excellent, the client’s trust is strongly tied to specific individuals; ensuring consistent delivery across the broader team reduces key-person dependency risk.",
      "urgency": "low",
      "sourceInterviewId": "t-020",
      "client": "Kristin Skogen Lund",
      "company": "Delivery Hero Holding GMBH",
      "supportingQuote": "“it has quite a lot to do with the individual...she knows me” and “I'm very happy with the team, Mette...but also Phoebe.”",
      "suggestedAction": "Document client preferences and success factors in an account playbook and ensure continuity planning across consultants for future searches.",
      "status": "identified",
      "id": "opp-108"
    },
    {
      "type": "improvement",
      "title": "Prevent missed updates to avoid blindsiding",
      "description": "There was one instance where Fiona felt blindsided due to a missed update. While it was resolved quickly, tightening update discipline would protect the consistently strong communication experience.",
      "urgency": "medium",
      "sourceInterviewId": "t-021",
      "client": "Fiona Motley",
      "company": "NatWest Group PLC",
      "supportingQuote": "\"I've just had one occasion where I was blindsided.\"",
      "suggestedAction": "Implement a simple communication SLA (e.g., stakeholder touchpoints and update cadence) and a backup owner to ensure no updates are missed.",
      "status": "identified",
      "id": "opp-109"
    },
    {
      "type": "improvement",
      "title": "Ensure continuity of NatWest-savvy consultants",
      "description": "Fiona perceives better outcomes when long-standing Korn Ferry consultants who know NatWest’s culture remain actively involved, even when functional practice leads are engaged. Standardizing continuity would improve consistency across functions (e.g., HR).",
      "urgency": "high",
      "sourceInterviewId": "t-021",
      "client": "Fiona Motley",
      "company": "NatWest Group PLC",
      "supportingQuote": "In HR work, \"we just felt that Hilary and Samira got what we were looking for... they ended up being more involved and taking the lead... we felt that we gained a better service when [they] were involved.\"",
      "suggestedAction": "Create an account continuity model that keeps a core NatWest account team embedded on every search, with practice leads added as specialists rather than replacing core leads.",
      "status": "identified",
      "id": "opp-110"
    },
    {
      "type": "improvement",
      "title": "Standardize delivery approach across business areas",
      "description": "The interview highlights a need to embed shared client knowledge and ways of working so delivery remains seamless when consultants are less familiar with NatWest. This reduces variability and protects Korn Ferry’s trusted reputation amid more frequent competitive pitches.",
      "urgency": "high",
      "sourceInterviewId": "t-021",
      "client": "Fiona Motley",
      "company": "NatWest Group PLC",
      "supportingQuote": "\"Ensure consistent approach across business areas... so delivery remains seamless, even when consultants are less familiar [with] the client.\"",
      "suggestedAction": "Build a NatWest playbook (role scoping, stakeholder mapping, comms templates, cultural markers) and require onboarding for any new team member joining NatWest searches.",
      "status": "identified",
      "id": "opp-111"
    },
    {
      "type": "future_need",
      "title": "Ongoing assessment and development insights for hires",
      "description": "NatWest uses Korn Ferry assessments not only for selection but as a development tool after candidates land. This indicates continued demand for post-hire development insights and onboarding/coaching support tied to assessment outputs.",
      "urgency": "medium",
      "sourceInterviewId": "t-021",
      "client": "Fiona Motley",
      "company": "NatWest Group PLC",
      "supportingQuote": "\"we get a great richness of data... quite often [we use it as] a development tool for when they land.\"",
      "suggestedAction": "Offer a structured post-placement package (e.g., 30/60/90-day coaching and development planning) leveraging assessment results for placed executives.",
      "status": "identified",
      "id": "opp-112"
    },
    {
      "type": "future_need",
      "title": "Rapid market insights and benchmarking support",
      "description": "Fiona values Korn Ferry’s ability to quickly provide targeted market information and benchmarking beyond active searches. This suggests ongoing need for ad-hoc intelligence and potentially more formalized insight services.",
      "urgency": "medium",
      "sourceInterviewId": "t-021",
      "client": "Fiona Motley",
      "company": "NatWest Group PLC",
      "supportingQuote": "\"sometimes we might be asked to find insights on something specific... and they will always go out and come back with information for us... [they] went above and beyond... came back to us with that really quickly.\"",
      "suggestedAction": "Propose an always-on insights retainer (market mapping, compensation benchmarks, talent availability snapshots) with agreed turnaround times.",
      "status": "identified",
      "id": "opp-113"
    },
    {
      "type": "expansion",
      "title": "Expand assessment into broader leadership development",
      "description": "Because assessments are already embedded and valued, Korn Ferry can deepen the relationship by extending assessment outputs into broader leadership development, succession planning, and team effectiveness work.",
      "urgency": "low",
      "sourceInterviewId": "t-021",
      "client": "Fiona Motley",
      "company": "NatWest Group PLC",
      "supportingQuote": "\"all of our successful, and sometimes the final two candidates, are assessed by Korn Ferry... that's always utilised very well...\"",
      "suggestedAction": "Introduce a proposal to connect executive search assessments to succession pipelines and leadership development programs for key functions.",
      "status": "identified",
      "id": "opp-114"
    },
    {
      "type": "re_engagement",
      "title": "Proactively reinforce preferred status amid more pitches",
      "description": "Competitive pitches are becoming more frequent to balance supplier selection and reduce internal risk, which could dilute share of work if Korn Ferry is not proactively differentiating. This is a signal to strengthen executive sponsorship and demonstrate measurable value.",
      "urgency": "high",
      "sourceInterviewId": "t-021",
      "client": "Fiona Motley",
      "company": "NatWest Group PLC",
      "supportingQuote": "\"competitive pitches have become more frequent to support balanced supplier selection and reduce internal risk.\"",
      "suggestedAction": "Schedule quarterly value reviews with Fiona and key hiring-manager stakeholders, sharing outcomes (time-to-shortlist, diversity metrics, offer acceptance, assessment impact) and case studies to defend and grow share.",
      "status": "identified",
      "id": "opp-115"
    },
    {
      "type": "expansion",
      "title": "Deepen multi-stakeholder relationships with hiring managers",
      "description": "Korn Ferry is often appointed directly or recommended by hiring managers based on previous success. Strengthening relationships with those hiring managers can increase direct awards and reduce exposure to competitive processes.",
      "urgency": "medium",
      "sourceInterviewId": "t-021",
      "client": "Fiona Motley",
      "company": "NatWest Group PLC",
      "supportingQuote": "Korn Ferry is \"often appointed directly or recommended by hiring managers based on previous success.\"",
      "suggestedAction": "Map top hiring-manager advocates and run targeted engagement (check-ins, market briefings, post-search debriefs) to increase direct appointments.",
      "status": "identified",
      "id": "opp-116"
    },
    {
      "type": "future_need",
      "title": "Future searches for scarce specialist talent",
      "description": "The client anticipates ongoing difficulty sourcing specialist talent (medical, actuarial, finance) due to tight market supply, implying future reliance on external search support.",
      "urgency": "medium",
      "sourceInterviewId": "t-022",
      "client": "Daryl Teitler",
      "company": "Blue Cross Blue Shield of Nebraska",
      "supportingQuote": "“Future talent challenges include sourcing specialists in areas such as medical, actuarial, and finance functions, where market supply remains tight.”",
      "suggestedAction": "Proactively share a point-of-view on specialist talent availability and propose a forward-looking search plan/pipeline approach for these roles.",
      "status": "identified",
      "id": "opp-117"
    },
    {
      "type": "future_need",
      "title": "Support to complete ongoing VP Finance search",
      "description": "One senior search (VP Finance & Accounting) was still in progress with final interviews planned, indicating near-term need to close and de-risk the hire.",
      "urgency": "high",
      "sourceInterviewId": "t-022",
      "client": "Daryl Teitler",
      "company": "Blue Cross Blue Shield of Nebraska",
      "supportingQuote": "“one for a Vice President of Finance and Accounting, which was ongoing at the time of the interview with final interviews planned.”",
      "suggestedAction": "Run a tight close-out plan for the final stage (timeline, decision checkpoints, offer strategy, backup candidates) to ensure successful placement.",
      "status": "identified",
      "id": "opp-118"
    },
    {
      "type": "expansion",
      "title": "Position Korn Ferry as preferred future search partner",
      "description": "Daryl indicated Korn Ferry will be considered for future searches; there is an opportunity to formalize preferred-provider status and reduce competitive price pressure.",
      "urgency": "medium",
      "sourceInterviewId": "t-022",
      "client": "Daryl Teitler",
      "company": "Blue Cross Blue Shield of Nebraska",
      "supportingQuote": "Daryl confirmed that Korn Ferry would “definitely be in consideration” for future searches.",
      "suggestedAction": "Schedule a post-search debrief and propose a preferred partnership model (rate card, SLAs, role scoping) for upcoming leadership and specialist roles.",
      "status": "identified",
      "id": "opp-119"
    },
    {
      "type": "expansion",
      "title": "Expand use of assessment and data services",
      "description": "The client values assessment data to build CEO confidence and HR credibility, suggesting opportunity to broaden assessment usage across more roles or add complementary talent advisory services.",
      "urgency": "medium",
      "sourceInterviewId": "t-022",
      "client": "Daryl Teitler",
      "company": "Blue Cross Blue Shield of Nebraska",
      "supportingQuote": "“we're really trying to focus on data to make decisions... being able to present to the CEO... the assessment data... gives us more credibility as an HR function... he loves the data”",
      "suggestedAction": "Offer an expanded assessment package (benchmarking, structured interview guides, onboarding/coaching insights) for future hires and internal leaders.",
      "status": "identified",
      "id": "opp-120"
    },
    {
      "type": "re_engagement",
      "title": "Reinforce trust after confidentiality hiccup",
      "description": "A sensitive communication incident created risk to trust; while Korn Ferry owned and apologized, a proactive follow-up can strengthen confidence and prevent recurrence.",
      "urgency": "high",
      "sourceInterviewId": "t-022",
      "client": "Daryl Teitler",
      "company": "Blue Cross Blue Shield of Nebraska",
      "supportingQuote": "“somehow during that conversation the employee was able to determine who we selected... we hadn't communicated [it] yet... Brian absolutely owned it, he absolutely apologised.”",
      "suggestedAction": "Conduct a brief client-facing process review, confirm confidentiality safeguards, and document agreed communication protocols for future searches.",
      "status": "identified",
      "id": "opp-121"
    },
    {
      "type": "improvement",
      "title": "Clarify who communicates candidate outcomes",
      "description": "Candidate outcome messaging reached an internal employee before the hiring leader communicated, indicating a need to align roles and timing for candidate notifications.",
      "urgency": "high",
      "sourceInterviewId": "t-022",
      "client": "Daryl Teitler",
      "company": "Blue Cross Blue Shield of Nebraska",
      "supportingQuote": "“The employee's first understanding that they didn't get the job came from Korn Ferry as opposed to the leader.”",
      "suggestedAction": "Create a communication RACI and a 'no-notify until client confirms' rule for internal candidates and finalists.",
      "status": "identified",
      "id": "opp-122"
    },
    {
      "type": "improvement",
      "title": "Strengthen confidentiality and information handling",
      "description": "An employee inferred the selected candidate before official communication, signaling the need for tighter controls on sensitive discussions and signals during late-stage searches.",
      "urgency": "high",
      "sourceInterviewId": "t-022",
      "client": "Daryl Teitler",
      "company": "Blue Cross Blue Shield of Nebraska",
      "supportingQuote": "“the employee was able to determine who we selected... we hadn't communicated [it] yet”",
      "suggestedAction": "Implement late-stage confidentiality protocols (need-to-know access, scripted updates, and internal reminders) and train the team on inference risk.",
      "status": "identified",
      "id": "opp-123"
    },
    {
      "type": "improvement",
      "title": "Maintain regular cadence during quiet phases",
      "description": "The client wants proactive weekly/biweekly touchpoints even when there are no new candidates, to maintain alignment and confidence.",
      "urgency": "medium",
      "sourceInterviewId": "t-022",
      "client": "Daryl Teitler",
      "company": "Blue Cross Blue Shield of Nebraska",
      "supportingQuote": "“Maybe being more proactive in setting up weekly or biweekly meetings even when they didn't have candidates or any additional [information].”",
      "suggestedAction": "Set standing weekly/biweekly check-ins with a standard agenda (market intel, pipeline health, risks, next actions) regardless of candidate flow.",
      "status": "identified",
      "id": "opp-124"
    },
    {
      "type": "improvement",
      "title": "Sustain recruiting momentum until offer signed",
      "description": "The client perceived a slowdown once finalists were identified and wants continued recruiting to avoid ending with no acceptable hire.",
      "urgency": "high",
      "sourceInterviewId": "t-022",
      "client": "Daryl Teitler",
      "company": "Blue Cross Blue Shield of Nebraska",
      "supportingQuote": "“making sure that they continue to recruit until an offer is signed, sealed and delivered, it feels like it slows down considerably once two or three candidates are kind of at the top of the list.”",
      "suggestedAction": "Adopt a 'keep building the bench' policy with explicit pipeline targets and continued outreach until the candidate accepts and clears contingencies.",
      "status": "identified",
      "id": "opp-125"
    },
    {
      "type": "improvement",
      "title": "Introduce loyalty-based pricing for repeat searches",
      "description": "Lew feels the current fee model is largely standard and doesn’t sufficiently recognize the volume and longevity of the relationship. A clearer repeat-client pricing structure could protect loyalty and reduce price friction in future searches.",
      "urgency": "medium",
      "sourceInterviewId": "t-023",
      "client": "Lew Little",
      "company": "Giving Home Health Care",
      "supportingQuote": "“It's a pretty standard offering from a pricing perspective... we've negotiated a slight discount... although I think I deserve a lower fee.”",
      "suggestedAction": "Propose a tiered preferred-client/volume pricing agreement (e.g., annual retainer or multi-search bundle) tied to expected search cadence.",
      "status": "identified",
      "id": "opp-126"
    },
    {
      "type": "improvement",
      "title": "Make post-placement follow-up more visible",
      "description": "Lew isn’t consistently aware of structured post-placement check-ins with placed candidates, even though he assumes it happens. Increasing visibility would reinforce value, improve retention outcomes, and strengthen trust.",
      "urgency": "medium",
      "sourceInterviewId": "t-023",
      "client": "Lew Little",
      "company": "Giving Home Health Care",
      "supportingQuote": "“I'm not aware of them following back up with candidates... they obviously always check on the people that they placed.”",
      "suggestedAction": "Implement and share a standard post-placement cadence (e.g., 30/60/90/180-day check-ins) with brief written updates to Lew.",
      "status": "identified",
      "id": "opp-127"
    },
    {
      "type": "expansion",
      "title": "Cross-sell broader consulting and strategy services",
      "description": "Lew primarily associates Korn Ferry with executive search and has low awareness of non-search offerings. This is an opportunity to expand into adjacent services (e.g., org/leadership effectiveness, workforce strategy) that support his talent agenda.",
      "urgency": "low",
      "sourceInterviewId": "t-023",
      "client": "Lew Little",
      "company": "Giving Home Health Care",
      "supportingQuote": "“In my mind they are great long-term partners in helping me secure talent.” (and) “Broader awareness of Korn Ferry's non-search offerings... remains low.”",
      "suggestedAction": "Schedule a short capabilities session tailored to Giving Home Health Care’s priorities, highlighting 1–2 relevant non-search offerings with concrete use cases.",
      "status": "identified",
      "id": "opp-128"
    },
    {
      "type": "re_engagement",
      "title": "Strengthen relationship with executive events and touches",
      "description": "Lew values personal relationships and explicitly noted he’s still waiting for an invite to a Korn Ferry Tour Pro-Am. Small, high-touch engagement can reinforce loyalty and keep Korn Ferry top-of-mind between searches.",
      "urgency": "low",
      "sourceInterviewId": "t-023",
      "client": "Lew Little",
      "company": "Giving Home Health Care",
      "supportingQuote": "“I'm a relationship guy...” and he “was still waiting for an invite to go Pro AM on the Korn Ferry tour.”",
      "suggestedAction": "Invite Lew to a relevant Korn Ferry event (including the Pro-Am if feasible) and set a quarterly relationship touchpoint outside active searches.",
      "status": "identified",
      "id": "opp-129"
    },
    {
      "type": "future_need",
      "title": "Ongoing senior talent searches at high cadence",
      "description": "Lew has used Korn Ferry roughly ten times across two organizations and has completed five searches in the last 3.5 years in his current role, indicating continued demand for senior hiring support. Planning for recurring searches could improve speed and consistency.",
      "urgency": "medium",
      "sourceInterviewId": "t-023",
      "client": "Lew Little",
      "company": "Giving Home Health Care",
      "supportingQuote": "“In my previous role, I probably used Korn Ferry five times... in this role, this is the fifth time in three and a half years that we've used Korn Ferry.”",
      "suggestedAction": "Proactively align on a 12–18 month talent roadmap and create a standing success-profile library to accelerate future searches.",
      "status": "identified",
      "id": "opp-130"
    },
    {
      "type": "future_need",
      "title": "Support upcoming second Senior Director hire",
      "description": "Generac expects to open another Senior Director role next year, creating a clear near-term need for search support. Staying close now increases likelihood Korn Ferry is engaged as the default partner.",
      "urgency": "high",
      "sourceInterviewId": "t-024",
      "client": "Jen Anderson",
      "company": "Generac Power Systems",
      "supportingQuote": "“Generac plans to open a second Senior Director role next year; maintain visibility to support that hire.”",
      "suggestedAction": "Set a quarterly check-in cadence and pre-align on role scope/compensation so Korn Ferry can launch quickly when the requisition opens.",
      "status": "identified",
      "id": "opp-131"
    },
    {
      "type": "expansion",
      "title": "Expand beyond search into people advisory work",
      "description": "Jen already values Korn Ferry for org and culture work, indicating openness to additional advisory engagements beyond executive search. This can deepen the relationship and increase share of wallet.",
      "urgency": "medium",
      "sourceInterviewId": "t-024",
      "client": "Jen Anderson",
      "company": "Generac Power Systems",
      "supportingQuote": "“We used them last year for our spans and layers exercise, our culture assessment... and a few other HR related projects.”",
      "suggestedAction": "Proactively propose a 6–12 month people/organization roadmap (e.g., org design, capability building) tied to Strategy/M&A/ESG priorities.",
      "status": "identified",
      "id": "opp-132"
    },
    {
      "type": "future_need",
      "title": "Higher-level talent for AI-driven operating model",
      "description": "Automation and AI are shifting work away from execution toward higher-level analysis and oversight, implying future demand for more senior, analytically strong leaders in Strategy/M&A/ESG-adjacent roles. Korn Ferry can help define roles and source this upgraded talent.",
      "urgency": "medium",
      "sourceInterviewId": "t-024",
      "client": "Jen Anderson",
      "company": "Generac Power Systems",
      "supportingQuote": "“[It’s] driving [a need for] higher level people to be able to analyse... and then [ensure] we're driving the correct conclusions out of all the data.”",
      "suggestedAction": "Offer a short workforce/role design session to translate the AI/automation shift into updated role profiles and a target talent map.",
      "status": "identified",
      "id": "opp-133"
    },
    {
      "type": "improvement",
      "title": "Flag compensation and level misalignment earlier",
      "description": "The ESG search stalled partly because compensation and role seniority were misaligned with the market, and Jen felt Korn Ferry did not push this strongly enough upfront. Earlier, firmer market calibration would prevent wasted cycles and protect credibility.",
      "urgency": "high",
      "sourceInterviewId": "t-024",
      "client": "Jen Anderson",
      "company": "Generac Power Systems",
      "supportingQuote": "“They probably didn't flag it [compensation misalignment] as much as we realistically needed... it was a mismatch upfront with expectation versus compensation.”",
      "suggestedAction": "Implement a mandatory early-market calibration deliverable (comp ranges, level mapping, feasibility) with explicit go/no-go recommendations.",
      "status": "identified",
      "id": "opp-134"
    },
    {
      "type": "improvement",
      "title": "Improve candidate seniority and fit for ESG role",
      "description": "For the ESG director search, candidates presented skewed too junior for Generac’s needs, indicating a gap in level-setting, sourcing strategy, or screening against the true bar. Tightening the level definition and screening criteria would improve slate quality.",
      "urgency": "high",
      "sourceInterviewId": "t-024",
      "client": "Jen Anderson",
      "company": "Generac Power Systems",
      "supportingQuote": "“We ended up getting quite junior people for a director-level role... [that wasn't] going to work for our organisation.”",
      "suggestedAction": "Reconfirm the role’s level and success profile with a structured intake and adjust sourcing channels/target companies to reach appropriately senior ESG leaders.",
      "status": "identified",
      "id": "opp-135"
    },
    {
      "type": "improvement",
      "title": "Standardize client experience across search teams",
      "description": "Jen experienced meaningful variation between the M&A and ESG teams, with the M&A process setting a higher benchmark for structure and reporting. Standardizing best practices would create a consistent, premium experience regardless of practice area.",
      "urgency": "medium",
      "sourceInterviewId": "t-024",
      "client": "Jen Anderson",
      "company": "Generac Power Systems",
      "supportingQuote": "“Variation in experience and delivery style between teams.”",
      "suggestedAction": "Codify the M&A team’s weekly tracker/reporting and candidate prep package as a firmwide standard for all searches.",
      "status": "identified",
      "id": "opp-136"
    },
    {
      "type": "re_engagement",
      "title": "Proactively follow up on paused ESG search",
      "description": "The ESG role was paused rather than definitively closed, and Jen noted an opportunity for proactive communication and follow-up when roles remain open or paused. Continued light-touch engagement can rebuild momentum and position Korn Ferry for restart.",
      "urgency": "high",
      "sourceInterviewId": "t-024",
      "client": "Jen Anderson",
      "company": "Generac Power Systems",
      "supportingQuote": "“Opportunity to strengthen continuity through proactive communication and follow-up when roles remain open or paused.”",
      "suggestedAction": "Agree a reactivation plan (monthly market pulse + occasional standout profiles) and schedule a decision checkpoint to revisit scope/compensation.",
      "status": "identified",
      "id": "opp-137"
    },
    {
      "type": "expansion",
      "title": "Formalize relationship manager across engagements",
      "description": "Jen valued an informal relationship manager who provided continuity across two different search teams, suggesting a scalable model to deepen trust and reduce fragmentation. Making this role explicit can improve retention and cross-sell.",
      "urgency": "medium",
      "sourceInterviewId": "t-024",
      "client": "Jen Anderson",
      "company": "Generac Power Systems",
      "supportingQuote": "“She kind of shepherded the processes to make sure things were going well... that was really beneficial for me.”",
      "suggestedAction": "Assign a named account/relationship lead for Generac to coordinate across practices and surface adjacent needs proactively.",
      "status": "identified",
      "id": "opp-138"
    },
    {
      "type": "future_need",
      "title": "Use assessment tools when hiring increases",
      "description": "Jen sees Korn Ferry’s assessment/benchmarking tools as optional for single hires but would consider them if hiring volume increases. This indicates future potential to attach assessments to larger hiring waves or team builds.",
      "urgency": "low",
      "sourceInterviewId": "t-024",
      "client": "Jen Anderson",
      "company": "Generac Power Systems",
      "supportingQuote": "“If I were hiring more people, I would have probably engaged in [it].”",
      "suggestedAction": "Keep a lightweight assessment option ready and revisit when the next multi-hire initiative or team build is planned.",
      "status": "identified",
      "id": "opp-139"
    },
    {
      "type": "future_need",
      "title": "Next phase of lifecycle measurement support",
      "description": "Ferrero is moving beyond engagement surveying into broader employee lifecycle measurement and will likely need continued advisory, design, and rollout support on Trix and related measurement strategy.",
      "urgency": "high",
      "sourceInterviewId": "t-025",
      "client": "Matthew Hussein",
      "company": "Ferrero Trading Lux S.A.",
      "supportingQuote": "“Korn Ferry continues to partner with Ferrero on the next phase of employee lifecycle measurement.”",
      "suggestedAction": "Proactively propose a phased roadmap for lifecycle measurement (listening architecture, governance, cadence, and analytics) with clear milestones for the next 6–12 months.",
      "status": "identified",
      "id": "opp-140"
    },
    {
      "type": "future_need",
      "title": "Support cultural integration through acquisitions",
      "description": "Ferrero’s rapid growth via acquisition creates a need to understand and unify sentiment across different legacy cultures, where measurement insights can be translated into integration actions.",
      "urgency": "high",
      "sourceInterviewId": "t-025",
      "client": "Matthew Hussein",
      "company": "Ferrero Trading Lux S.A.",
      "supportingQuote": "“we've doubled the number of employees within the last 10 years...50% of our employees didn't start their journey in Ferrero, they were acquired by Ferrero.”",
      "suggestedAction": "Offer an acquisition integration listening and action-planning package (segmented insights by legacy group, integration pulse checks, and leader toolkits).",
      "status": "identified",
      "id": "opp-141"
    },
    {
      "type": "expansion",
      "title": "Expand into senior leader engagement and training",
      "description": "Matthew valued Korn Ferry’s proactive involvement with senior leaders and training; formalizing this could deepen the partnership and increase impact of survey results.",
      "urgency": "medium",
      "sourceInterviewId": "t-025",
      "client": "Matthew Hussein",
      "company": "Ferrero Trading Lux S.A.",
      "supportingQuote": "“maybe we need to do a meeting with your senior leaders... If I can get involved with the training, that would be great.”",
      "suggestedAction": "Package and propose recurring senior-leader readouts plus manager training on interpreting results and driving actions, aligned to the survey calendar.",
      "status": "identified",
      "id": "opp-142"
    },
    {
      "type": "expansion",
      "title": "Broaden footprint across existing Ferrero services",
      "description": "Korn Ferry already supports Ferrero with 360 feedback and pay grading; there is an opportunity to connect these offerings with engagement and lifecycle insights for an integrated people strategy.",
      "urgency": "medium",
      "sourceInterviewId": "t-025",
      "client": "Matthew Hussein",
      "company": "Ferrero Trading Lux S.A.",
      "supportingQuote": "“They've supported our business in other elements, we've used them for 360 and they work with us on pay grading.”",
      "suggestedAction": "Run an account planning session to identify cross-sell opportunities that link engagement insights to leadership development (360) and rewards/job architecture (pay grading).",
      "status": "identified",
      "id": "opp-143"
    },
    {
      "type": "re_engagement",
      "title": "Maintain momentum and stay proactively involved",
      "description": "The client explicitly values Korn Ferry’s proactive, long-term partnership approach; maintaining frequent, forward-looking touchpoints will help protect and strengthen the relationship as needs evolve.",
      "urgency": "medium",
      "sourceInterviewId": "t-025",
      "client": "Matthew Hussein",
      "company": "Ferrero Trading Lux S.A.",
      "supportingQuote": "“it really felt like they wanted to create a really strong partnership with us for the long term” and “they've always been really proactive.”",
      "suggestedAction": "Set a quarterly partnership governance cadence (QBR-style) to review outcomes, upcoming people priorities, and next-phase initiatives.",
      "status": "identified",
      "id": "opp-144"
    },
    {
      "type": "improvement",
      "title": "Standardize more reassuring, solution-oriented communication",
      "description": "One project manager’s risk-heavy tone created fear and undermined confidence despite strong technical delivery; aligning communication style to be balanced and success-oriented would improve stakeholder experience.",
      "urgency": "medium",
      "sourceInterviewId": "t-025",
      "client": "Matthew Hussein",
      "company": "Ferrero Trading Lux S.A.",
      "supportingQuote": "“focus on the risks and the negatives... struck a lot of fear... rather than focusing on how we were going to succeed.”",
      "suggestedAction": "Coach project leads on stakeholder communication (risk framing, constructive language, and confidence-building updates) and add a simple comms standard for status meetings.",
      "status": "identified",
      "id": "opp-145"
    },
    {
      "type": "improvement",
      "title": "Be more assertive in compensation negotiations",
      "description": "The client wanted Korn Ferry to challenge candidate compensation expectations more strongly and provide clearer negotiation guidance. This was the only recurring improvement point and directly affects offer acceptance and client confidence in advisory support.",
      "urgency": "high",
      "sourceInterviewId": "t-026",
      "client": "Gerd Pircher and Marco Trovo",
      "company": "HSBC Continental Europe, Italy",
      "supportingQuote": "\"I would have expected a little bit more of support... I would have appreciated a little bit more of challenging behaviour versus the candidate.\"",
      "suggestedAction": "Provide a structured compensation advisory package (benchmarking, negotiation strategy, and candidate expectation management) and proactively lead the client through it before offer stage.",
      "status": "identified",
      "id": "opp-146"
    },
    {
      "type": "improvement",
      "title": "Improve alignment in the initial briefing",
      "description": "One stakeholder felt the first briefing did not fully capture the nuance of what they wanted, even though it was later resolved. Tightening early discovery reduces risk of misalignment and accelerates delivery on complex briefs.",
      "urgency": "medium",
      "sourceInterviewId": "t-026",
      "client": "Gerd Pircher and Marco Trovo",
      "company": "HSBC Continental Europe, Italy",
      "supportingQuote": "\"My experience of the actual briefing call was not a good one... I felt they didn't fully grasp what we wanted.\"",
      "suggestedAction": "Run a more rigorous kickoff (role success profile, must-haves vs nice-to-haves, and written alignment recap) and confirm sign-off before sourcing.",
      "status": "identified",
      "id": "opp-147"
    },
    {
      "type": "future_need",
      "title": "Offer compensation benchmarking and market intelligence",
      "description": "They negotiated autonomously and Korn Ferry did not provide compensation benchmarking; future searches would benefit from market data to set ranges and strengthen negotiation posture. This is a natural add-on given the niche market context.",
      "urgency": "medium",
      "sourceInterviewId": "t-026",
      "client": "Gerd Pircher and Marco Trovo",
      "company": "HSBC Continental Europe, Italy",
      "supportingQuote": "\"We did it autonomously... we had our numbers in our mind.\" (and Korn Ferry was not asked to manage the final offer and did not advise on compensation benchmarking)",
      "suggestedAction": "Proactively include compensation benchmarking and a recommended offer framework as a standard deliverable for senior searches.",
      "status": "identified",
      "id": "opp-148"
    },
    {
      "type": "expansion",
      "title": "Add post-placement onboarding and follow-up",
      "description": "It was unclear whether Korn Ferry followed up with the hire, suggesting an opportunity to formalize post-placement check-ins to protect retention and strengthen the partnership. Even if not needed in this case, offering it consistently can differentiate service.",
      "urgency": "low",
      "sourceInterviewId": "t-026",
      "client": "Gerd Pircher and Marco Trovo",
      "company": "HSBC Continental Europe, Italy",
      "supportingQuote": "\"I don't know. I have no idea if they did follow up... there was no need for them to support us.\"",
      "suggestedAction": "Introduce a standard 30/60/90-day post-placement follow-up with both client and candidate and communicate it clearly at the start of the engagement.",
      "status": "identified",
      "id": "opp-149"
    },
    {
      "type": "re_engagement",
      "title": "Convert strong advocacy into repeat search pipeline",
      "description": "Both stakeholders explicitly said they would use Korn Ferry again and recommend them, creating a clear opening to secure future mandates and referrals. A timely follow-up can lock in preferred-supplier status for similar niche senior roles.",
      "urgency": "medium",
      "sourceInterviewId": "t-026",
      "client": "Gerd Pircher and Marco Trovo",
      "company": "HSBC Continental Europe, Italy",
      "supportingQuote": "\"I would say yes, yes.\" and \"I would advise other people using them.\"",
      "suggestedAction": "Schedule an executive debrief to capture upcoming leadership needs, ask for referrals internally, and agree a plan for future searches in the same niche area.",
      "status": "identified",
      "id": "opp-150"
    },
    {
      "type": "future_need",
      "title": "Be first call for future executive searches",
      "description": "Michael indicated Korn Ferry would be his first contact for future searches, suggesting likely upcoming demand for additional executive search support as needs arise.",
      "urgency": "medium",
      "sourceInterviewId": "t-027",
      "client": "Michael Citro",
      "company": "University of Pennsylvania",
      "supportingQuote": "He noted that they would be the first people contacted for any future searches.",
      "suggestedAction": "Maintain regular check-ins and proactively discuss upcoming leadership needs and succession priorities to be positioned for the next search.",
      "status": "identified",
      "id": "opp-151"
    },
    {
      "type": "expansion",
      "title": "Extend continuity model across Penn engagements",
      "description": "Continuity of consultants who know Penn was explicitly valued and improved communication; formalizing this as an account approach can deepen the relationship and increase repeat work.",
      "urgency": "medium",
      "sourceInterviewId": "t-027",
      "client": "Michael Citro",
      "company": "University of Pennsylvania",
      "supportingQuote": "“We were really impressed by Sophie... because she knows the institution, she knows us... It served all of us really well - she could speak both Korn Ferry and Penn.”",
      "suggestedAction": "Propose a dedicated Penn core team/bench (with named roles) to support all future searches and related advisory work.",
      "status": "identified",
      "id": "opp-152"
    },
    {
      "type": "expansion",
      "title": "Leverage stakeholder-management strength for similar roles",
      "description": "Korn Ferry’s “white-glove” handling of a sensitive government relations search is a differentiator that can be positioned for other high-stakes, stakeholder-heavy roles across the university.",
      "urgency": "low",
      "sourceInterviewId": "t-027",
      "client": "Michael Citro",
      "company": "University of Pennsylvania",
      "supportingQuote": "“It felt as though it was a level of white-glove service... managing expectations throughout... they did a phenomenal job.”",
      "suggestedAction": "Share a brief case study/approach document and suggest where this stakeholder-management playbook could apply to other Penn leadership searches.",
      "status": "identified",
      "id": "opp-153"
    },
    {
      "type": "re_engagement",
      "title": "Sustain between-search touchpoints with Peter",
      "description": "Regular check-ins between searches are a key relationship anchor; continuing (and slightly formalizing) them reduces risk of competitor entry and keeps Korn Ferry top-of-mind.",
      "urgency": "medium",
      "sourceInterviewId": "t-027",
      "client": "Michael Citro",
      "company": "University of Pennsylvania",
      "supportingQuote": "“Peter remains Michael’s main point of contact, maintaining regular check-ins between searches.”",
      "suggestedAction": "Set a quarterly cadence with a light agenda (market intel, talent mapping, upcoming needs) and document action items to reinforce partnership value.",
      "status": "identified",
      "id": "opp-154"
    },
    {
      "type": "improvement",
      "title": "Clarify division of labor for candidate-day logistics",
      "description": "On-campus candidate visit logistics were repeatedly “clunky,” driven by unclear coordination and duplicated back-and-forth; tightening ownership and process would improve experience.",
      "urgency": "high",
      "sourceInterviewId": "t-027",
      "client": "Michael Citro",
      "company": "University of Pennsylvania",
      "supportingQuote": "Candidate-day logistics... were described as “a bit clunky” and there was “an opportunity... to just sync... ‘what’s the division of labour? Who’s going to do what?’ rather than... back and forth emails.”",
      "suggestedAction": "Introduce a single logistics owner and a pre-visit planning checklist/RACI agreed at kickoff to streamline scheduling, communications, and day-of execution.",
      "status": "identified",
      "id": "opp-155"
    },
    {
      "type": "improvement",
      "title": "Rework or right-size KF4D assessment value",
      "description": "The KF4D assessment was perceived as underwhelming and potentially expendable in cost containment; improving delivery, tailoring insights, or offering an opt-in alternative would protect value perception.",
      "urgency": "high",
      "sourceInterviewId": "t-027",
      "client": "Michael Citro",
      "company": "University of Pennsylvania",
      "supportingQuote": "“I wasn't blown away... If given a choice, and if we were in cost containment mode, I would cut that [KF4D] and feel like we wouldn't lose anything.”",
      "suggestedAction": "Conduct a brief post-search debrief on assessment usefulness and propose a revised, role-specific assessment readout (or alternative) with clear decision-impact examples.",
      "status": "identified",
      "id": "opp-156"
    },
    {
      "type": "re_engagement",
      "title": "Senior leadership relationship recovery conversation",
      "description": "Leslie’s confidence was undermined by repeated process failures, but she is explicitly open to discussing feedback with senior leadership. A proactive executive-level outreach can acknowledge impact, demonstrate accountability, and rebuild trust.",
      "urgency": "high",
      "sourceInterviewId": "t-028",
      "client": "Leslie Fall",
      "company": "Aquifer, Inc",
      "supportingQuote": "They valued Korn Ferry’s openness to feedback and said they would be comfortable discussing these points further with senior leadership to help improve future delivery.",
      "suggestedAction": "Arrange a senior leader call to acknowledge issues, apologize for impact, share corrective actions, and agree a communication/QA plan for any future work.",
      "status": "identified",
      "id": "opp-157"
    },
    {
      "type": "improvement",
      "title": "Fix scheduling and interview coordination controls",
      "description": "Multiple scheduling/coordination breakdowns created client embarrassment and wasted executive time, directly eroding trust. Stronger operational controls and confirmations are needed to prevent repeats.",
      "urgency": "high",
      "sourceInterviewId": "t-028",
      "client": "Leslie Fall",
      "company": "Aquifer, Inc",
      "supportingQuote": "“the guy pulled out from the interview 15 minutes before the Zoom call and no one told us… So three executives sitting on this call” and “my most important candidate got invited to a zoom interview with the other leading candidate.”",
      "suggestedAction": "Implement a mandatory pre-interview confirmation protocol (candidate confirmation + client notification), double-check attendee lists, and a real-time escalation path for last-minute changes.",
      "status": "identified",
      "id": "opp-158"
    },
    {
      "type": "improvement",
      "title": "Standardize client recovery and apology playbook",
      "description": "When issues occurred, Leslie perceived responses as defensive rather than empathetic, missing a key moment to restore confidence. A consistent recovery approach should emphasize ownership, apology, and concrete remediation.",
      "urgency": "high",
      "sourceInterviewId": "t-028",
      "client": "Leslie Fall",
      "company": "Aquifer, Inc",
      "supportingQuote": "“It was just always like ‘Oh, we’re so sorry that happened, but I was in the meeting.’… what you should be saying is ‘We’re so embarrassed… This will never happen again… We’ve already fixed the problem, what else can we do…?’”",
      "suggestedAction": "Train teams on a client-recovery script and require a same-day recovery call/email that includes apology, root-cause summary, fix implemented, and make-good options.",
      "status": "identified",
      "id": "opp-159"
    },
    {
      "type": "improvement",
      "title": "Increase QA oversight across search execution",
      "description": "Repeated errors led Leslie to question whether other critical steps (contracts, references, background checks) were being done correctly. A visible QA layer would reduce perceived risk and restore confidence in delivery.",
      "urgency": "high",
      "sourceInterviewId": "t-028",
      "client": "Leslie Fall",
      "company": "Aquifer, Inc",
      "supportingQuote": "“Then it makes you start to question everything else. Are they going to get the contract right?… You’re doing the background checks… They’re the one doing the references, not me.”",
      "suggestedAction": "Add a formal QA checkpoint cadence (e.g., weekly QA review + checklist sign-offs for scheduling, candidate comms, references, offer process) and share status transparently with the client.",
      "status": "identified",
      "id": "opp-160"
    },
    {
      "type": "improvement",
      "title": "Upgrade deliverable quality beyond AI repurposing",
      "description": "Leslie expected Korn Ferry’s expert, human-led insight and was disappointed by materials that appeared AI-generated and required her to redo them. Improving the quality and customization of early deliverables would better match brand expectations.",
      "urgency": "medium",
      "sourceInterviewId": "t-028",
      "client": "Leslie Fall",
      "company": "Aquifer, Inc",
      "supportingQuote": "“I was a little disappointed… I could tell they had leveraged AI a lot… I need you to actually be the human who knows what they’re doing… I ended up redoing it.”",
      "suggestedAction": "Set a deliverable standard that requires consultant-authored synthesis (role/scorecard, outreach narrative, market mapping) with a senior review before sending to the client.",
      "status": "identified",
      "id": "opp-161"
    },
    {
      "type": "improvement",
      "title": "Strengthen candidate commitment and risk monitoring",
      "description": "A finalist accepted and then took another job, and Leslie was surprised Korn Ferry was unaware of competing processes. More rigorous candidate risk tracking and communication could reduce late-stage surprises.",
      "urgency": "medium",
      "sourceInterviewId": "t-028",
      "client": "Leslie Fall",
      "company": "Aquifer, Inc",
      "supportingQuote": "“He signed the offer… and I got a voicemail… saying he’s taken another job… [Korn Ferry was] completely surprised too and I’m like ‘how could you be this surprised?’”",
      "suggestedAction": "Introduce a candidate risk log (competing interviews, decision timelines, counteroffer risk) with frequent check-ins and immediate client alerts when risk indicators change.",
      "status": "identified",
      "id": "opp-162"
    },
    {
      "type": "future_need",
      "title": "Ongoing support for future executive hiring",
      "description": "Leslie has used Korn Ferry successfully before and came back after two failed searches elsewhere, indicating likely future leadership hiring needs if trust is restored. Ensuring a stronger delivery model positions Korn Ferry for repeat searches.",
      "urgency": "medium",
      "sourceInterviewId": "t-028",
      "client": "Leslie Fall",
      "company": "Aquifer, Inc",
      "supportingQuote": "Leslie engaged Korn Ferry to recruit a Chief Success Officer after two failed searches with other firms and previously used Korn Ferry to appoint a Chief Learning Officer, described as a “good search” that delivered “the right person.”",
      "suggestedAction": "Propose a forward-looking hiring partnership plan (next likely roles, timelines, and a refined delivery/QA approach) once relationship recovery steps are completed.",
      "status": "identified",
      "id": "opp-163"
    },
    {
      "type": "expansion",
      "title": "Offer process improvement and search governance package",
      "description": "The issues described are largely operational (scheduling, comms, QA, recovery), suggesting an opportunity to provide a more structured governance model and premium project management layer. This can deepen the relationship by reducing client burden and risk.",
      "urgency": "medium",
      "sourceInterviewId": "t-028",
      "client": "Leslie Fall",
      "company": "Aquifer, Inc",
      "supportingQuote": "“It feels like it’s a systems thing… a system that failed them” and concerns about “communication, scheduling, quality control, and client recovery.”",
      "suggestedAction": "Offer an enhanced search governance option (dedicated project manager, documented comms cadence, QA checklist, escalation paths) for future engagements.",
      "status": "identified",
      "id": "opp-164"
    },
    {
      "type": "future_need",
      "title": "Future CEO or leadership searches",
      "description": "Michael indicated he would re-engage Jena immediately for any future CEO search, implying likely future executive search needs as leadership changes arise.",
      "urgency": "low",
      "sourceInterviewId": "t-029",
      "client": "Michael De Lucca",
      "company": "OneBlood, Inc.",
      "supportingQuote": "He \"would immediately re-engage Jena for any future CEO search.\"",
      "suggestedAction": "Set a light-touch cadence with Michael/Jena (e.g., quarterly check-ins) to stay close to upcoming leadership succession needs.",
      "status": "identified",
      "id": "opp-165"
    },
    {
      "type": "expansion",
      "title": "Expand beyond executive search services",
      "description": "OneBlood currently uses Korn Ferry only for Executive Search, creating an opening to introduce adjacent offerings that support the CEO/board (e.g., leadership assessment, onboarding, succession planning, compensation/benefits advisory).",
      "urgency": "medium",
      "sourceInterviewId": "t-029",
      "client": "Michael De Lucca",
      "company": "OneBlood, Inc.",
      "supportingQuote": "Michael confirmed this is the only service they currently use Korn Ferry for.",
      "suggestedAction": "Propose a targeted add-on package for the new CEO transition (onboarding + leadership team assessment + succession planning) tied to the mid-November start.",
      "status": "identified",
      "id": "opp-166"
    },
    {
      "type": "re_engagement",
      "title": "Protect relationship centered on Jena",
      "description": "The relationship is strongly person-dependent, with Jena described as the linchpin; Korn Ferry should ensure continuity and avoid single-threaded risk by broadening trusted connections while keeping Jena front-and-center.",
      "urgency": "medium",
      "sourceInterviewId": "t-029",
      "client": "Michael De Lucca",
      "company": "OneBlood, Inc.",
      "supportingQuote": "Jena was viewed as central to the relationship: \"She was the linchpin… when something works for you, you stick with it.\"",
      "suggestedAction": "Create a relationship map and introduce 1–2 additional Korn Ferry leaders (with Jena) to the board to build resilience without diluting trust.",
      "status": "identified",
      "id": "opp-167"
    },
    {
      "type": "expansion",
      "title": "Leverage referrals and advocacy momentum",
      "description": "Michael has already recommended Jena to others and views Korn Ferry as operating at a higher level than competitors, presenting an opportunity to formalize referrals and capture new healthcare search work.",
      "urgency": "medium",
      "sourceInterviewId": "t-029",
      "client": "Michael De Lucca",
      "company": "OneBlood, Inc.",
      "supportingQuote": "\"I’ve recommended her to other people that I know.\" and Korn Ferry operates at a \"higher level.\"",
      "suggestedAction": "Ask Michael for 2–3 specific introductions to peer board chairs/CEOs in healthcare and provide a short, shareable case summary of the OneBlood search.",
      "status": "identified",
      "id": "opp-168"
    },
    {
      "type": "future_need",
      "title": "New CEO onboarding and early success support",
      "description": "With a new CEO starting mid-November, OneBlood may benefit from structured onboarding, stakeholder alignment, and first-90-days planning to sustain the successful placement outcome.",
      "urgency": "high",
      "sourceInterviewId": "t-029",
      "client": "Michael De Lucca",
      "company": "OneBlood, Inc.",
      "supportingQuote": "The search concluded successfully with the appointment of a new CEO starting mid-November.",
      "suggestedAction": "Offer a CEO onboarding and assimilation program (board/exec stakeholder interviews + 90-day plan facilitation) timed to the CEO’s start date.",
      "status": "identified",
      "id": "opp-169"
    },
    {
      "type": "improvement",
      "title": "Codify and replicate the “magic” process",
      "description": "While no gaps were raised, the client praised specific elements (structured timeline, transparent communication, negotiation support, board-feedback tools) that can be standardized as a repeatable best-practice playbook.",
      "urgency": "low",
      "sourceInterviewId": "t-029",
      "client": "Michael De Lucca",
      "company": "OneBlood, Inc.",
      "supportingQuote": "\"They figured out their magic\" and \"We set up a timeline... we were on a schedule... everything moved.\"",
      "suggestedAction": "Document the end-to-end approach used here as a reusable healthcare CEO search playbook and train relevant teams to replicate it.",
      "status": "identified",
      "id": "opp-170"
    },
    {
      "type": "expansion",
      "title": "Broaden relationship beyond Sasha to Korn Ferry",
      "description": "The initial buying decision was driven by Sasha’s personal reputation more than Korn Ferry’s brand, creating an opportunity to institutionalize the relationship and reduce key-person dependency.",
      "urgency": "medium",
      "sourceInterviewId": "t-030",
      "client": "Matthias Hug",
      "company": "Format Vermögen und Anlagen",
      "supportingQuote": "“The decision was based more on the individual’s reputation than on the organisation.”",
      "suggestedAction": "Introduce Matthias to relevant Korn Ferry leaders/experts in Switzerland and position Korn Ferry’s team-based delivery model for continuity.",
      "status": "identified",
      "id": "opp-171"
    },
    {
      "type": "future_need",
      "title": "Support follow-on hiring in central Switzerland",
      "description": "Korn Ferry has already been re-engaged, indicating likely ongoing hiring needs as Format builds its business in central Switzerland.",
      "urgency": "high",
      "sourceInterviewId": "t-030",
      "client": "Matthias Hug",
      "company": "Format Vermögen und Anlagen",
      "supportingQuote": "“Korn Ferry has already been re-engaged for a subsequent mandate.”",
      "suggestedAction": "Run a forward-looking workforce/hiring plan discussion to map upcoming roles and timelines and propose a multi-search roadmap.",
      "status": "identified",
      "id": "opp-172"
    },
    {
      "type": "expansion",
      "title": "Position assessment services for future mandates",
      "description": "Although assessments were not used this time, Korn Ferry’s assessment options were discussed and could be valuable for future hires where differentiation is less clear or risk is higher.",
      "urgency": "low",
      "sourceInterviewId": "t-030",
      "client": "Matthias Hug",
      "company": "Format Vermögen und Anlagen",
      "supportingQuote": "“While Korn Ferry offered additional assessment options, Matthias chose not to use them.”",
      "suggestedAction": "Offer a light-touch, role-specific assessment package (optional) for the next mandate, tied to decision risk and onboarding success.",
      "status": "identified",
      "id": "opp-173"
    },
    {
      "type": "improvement",
      "title": "Maintain bi-weekly updates and transparent candor",
      "description": "The client strongly valued pragmatic, bi-weekly communication and frank calibration of candidate strength; maintaining this standard is critical to preserve satisfaction in future searches.",
      "urgency": "medium",
      "sourceInterviewId": "t-030",
      "client": "Matthias Hug",
      "company": "Format Vermögen und Anlagen",
      "supportingQuote": "“bi-weekly calls with updates… so that was perfectly fine” and “This is not the strongest… you decide.”",
      "suggestedAction": "Codify the communication cadence and ‘candor standard’ in the kickoff plan for each new mandate and review it mid-search.",
      "status": "identified",
      "id": "opp-174"
    },
    {
      "type": "improvement",
      "title": "Continue high responsiveness during final negotiations",
      "description": "Fast turnaround and accessibility were especially important in the closing phase when competing for the candidate; replicating this will improve close rates on future mandates.",
      "urgency": "medium",
      "sourceInterviewId": "t-030",
      "client": "Matthias Hug",
      "company": "Format Vermögen und Anlagen",
      "supportingQuote": "“in the final phase… [they] returned calls immediately [and were] accessible.”",
      "suggestedAction": "Set an internal ‘final-stage SLA’ (same-day responses, rapid scheduling) and assign clear ownership for offer/closing support.",
      "status": "identified",
      "id": "opp-175"
    },
    {
      "type": "future_need",
      "title": "Ongoing help selling performance-based compensation model",
      "description": "Format’s distinctive compensation structure requires careful positioning to candidates; continued support in messaging and negotiation will likely be needed for future hires.",
      "urgency": "medium",
      "sourceInterviewId": "t-030",
      "client": "Matthias Hug",
      "company": "Format Vermögen und Anlagen",
      "supportingQuote": "“He had to clearly sell ourselves in an appropriate way” regarding the lower base/higher bonus model.",
      "suggestedAction": "Develop a repeatable candidate pitch pack and negotiation narrative for the compensation model to use across future searches.",
      "status": "identified",
      "id": "opp-176"
    },
    {
      "type": "re_engagement",
      "title": "Proactively connect broader Korn Ferry capabilities",
      "description": "There is an explicit recommendation to increase awareness of Korn Ferry’s wider expertise, suggesting a need to re-engage beyond the immediate search work to strengthen the partnership.",
      "urgency": "medium",
      "sourceInterviewId": "t-030",
      "client": "Matthias Hug",
      "company": "Format Vermögen und Anlagen",
      "supportingQuote": "“Extend awareness of broader expertise… proactively link Korn Ferry's relevant wider capabilities to Format's ongoing people and organisational priorities.”",
      "suggestedAction": "Schedule an executive check-in to explore Format’s broader people priorities and present 2–3 relevant Korn Ferry offerings with clear use cases.",
      "status": "identified",
      "id": "opp-177"
    },
    {
      "type": "expansion",
      "title": "Become preferred partner for future searches",
      "description": "Philippe indicated strong intent to work with Korn Ferry again and not benchmark other firms, creating an opportunity to formalize Korn Ferry as the go-to partner for EMEA executive search needs.",
      "urgency": "medium",
      "sourceInterviewId": "t-031",
      "client": "Philippe Brands",
      "company": "Avanos Headquarters",
      "supportingQuote": "\"Definitely no brainer... I wouldn't even benchmark.\"",
      "suggestedAction": "Propose a preferred-supplier/partnering agreement for EMEA executive search with agreed ways of working and points of contact.",
      "status": "identified",
      "id": "opp-178"
    },
    {
      "type": "future_need",
      "title": "Ongoing senior EMEA hiring support",
      "description": "As HR Manager for EMEA responsible for all hiring, Philippe is likely to have recurring senior hiring needs where Korn Ferry can support beyond this first assignment.",
      "urgency": "medium",
      "sourceInterviewId": "t-031",
      "client": "Philippe Brands",
      "company": "Avanos Headquarters",
      "supportingQuote": "Philippe is \"responsible for all hiring across the region\" and said he would choose Korn Ferry again.",
      "suggestedAction": "Schedule a quarterly talent/hiring planning check-in to anticipate upcoming senior roles and align on search support early.",
      "status": "identified",
      "id": "opp-179"
    },
    {
      "type": "expansion",
      "title": "Extend market mapping and compensation benchmarking",
      "description": "Philippe valued Korn Ferry’s market insight and detailed compensation breakdowns, suggesting an opportunity to provide ongoing benchmarking, role calibration, and talent mapping services.",
      "urgency": "low",
      "sourceInterviewId": "t-031",
      "client": "Philippe Brands",
      "company": "Avanos Headquarters",
      "supportingQuote": "\"They were crystal clear... a complete drill down about the salary package.\" and \"It was always an open discussion... finding common grounds.\"",
      "suggestedAction": "Offer a light annual/biannual compensation and talent-market benchmarking pack for key EMEA functions (starting with Finance).",
      "status": "identified",
      "id": "opp-180"
    },
    {
      "type": "re_engagement",
      "title": "Protect relationship beyond single trusted contact",
      "description": "The relationship is strongly anchored on Olivier personally; Korn Ferry should broaden stakeholder connections to reduce key-person dependency and strengthen the institutional partnership.",
      "urgency": "medium",
      "sourceInterviewId": "t-031",
      "client": "Philippe Brands",
      "company": "Avanos Headquarters",
      "supportingQuote": "They \"already knew Olivier personally\" and Philippe said he would choose \"him/Korn Ferry again.\"",
      "suggestedAction": "Introduce 1–2 additional Korn Ferry leaders (e.g., EMEA Search lead, Research lead) in a short post-search debrief to build multi-threaded relationships.",
      "status": "identified",
      "id": "opp-181"
    },
    {
      "type": "improvement",
      "title": "Codify and repeat the winning delivery playbook",
      "description": "No service gaps were raised, but Philippe explicitly valued specific elements (early researcher involvement, structured candidate materials, transparent communication) that should be standardized to ensure consistent delivery on future assignments.",
      "urgency": "low",
      "sourceInterviewId": "t-031",
      "client": "Philippe Brands",
      "company": "Avanos Headquarters",
      "supportingQuote": "\"He involved his researchers straight away... otherwise you always lose some essence about it.\" and \"The PowerPoint was built quite well... one pager with matching points... salary.\"",
      "suggestedAction": "Document this engagement’s process (researcher kickoff, touchpoints cadence, candidate one-pager + comp drill-down templates) as the default approach for similar searches.",
      "status": "identified",
      "id": "opp-182"
    },
    {
      "type": "expansion",
      "title": "Introduce broader Korn Ferry offerings proactively",
      "description": "Keith is highly satisfied with search but does not naturally consider Korn Ferry for other services due to limited time and headspace. A simple, targeted approach could expand the relationship beyond executive search without changing what he values most (trusted, human-led partnership).",
      "urgency": "medium",
      "sourceInterviewId": "t-032",
      "client": "Keith VanOrden",
      "company": "The TCW Group",
      "supportingQuote": "“When I need something, I go looking... I don't often pick my head up and look around...I get great emails... I just don't ever find the time.”",
      "suggestedAction": "Have Chris schedule a brief quarterly value-review to surface 1–2 relevant non-search supports (e.g., onboarding/leader integration using assessments) tied to current hires and business priorities.",
      "status": "identified",
      "id": "opp-183"
    },
    {
      "type": "future_need",
      "title": "Curated peer networking for retail distribution leaders",
      "description": "Keith would value Korn Ferry-facilitated, smaller peer groups as an alternative to large industry forums he finds unproductive. This is a clear future support need that aligns with relationship-building and thought partnership.",
      "urgency": "medium",
      "sourceInterviewId": "t-032",
      "client": "Keith VanOrden",
      "company": "The TCW Group",
      "supportingQuote": "“If networking became part of that... that would be helpful.” (and industry forums are “exhausting” and lack meaningful value)",
      "suggestedAction": "Offer an invite-only, small-group peer roundtable for senior retail distribution leaders (virtual or local), curated and lightly facilitated by Korn Ferry.",
      "status": "identified",
      "id": "opp-184"
    },
    {
      "type": "re_engagement",
      "title": "Reduce single-thread dependency on Chris relationship",
      "description": "Keith’s loyalty is strongly tied to one individual, creating retention risk if Chris changes roles or becomes less available. Strengthening multi-threaded relationships can protect and deepen the partnership while maintaining the personal feel Keith values.",
      "urgency": "high",
      "sourceInterviewId": "t-032",
      "client": "Keith VanOrden",
      "company": "The TCW Group",
      "supportingQuote": "“Anywhere Chris went, I would go.”",
      "suggestedAction": "Introduce one additional senior Korn Ferry contact (kept consistent) into key touchpoints so Keith builds trust beyond a single relationship without adding complexity.",
      "status": "identified",
      "id": "opp-185"
    },
    {
      "type": "improvement",
      "title": "Reinforce human-led search; limit AI emphasis",
      "description": "Keith explicitly prefers human judgment and would react negatively to an AI-forward search experience. Ensuring the process is clearly consultant-led (with any AI positioned as behind-the-scenes support) will protect satisfaction and advocacy.",
      "urgency": "high",
      "sourceInterviewId": "t-032",
      "client": "Keith VanOrden",
      "company": "The TCW Group",
      "supportingQuote": "“I would hate it if... there's weird AI searches” and “The slower Korn Ferry is to adopt some of the AI stuff... probably the better.”",
      "suggestedAction": "Proactively communicate that searches remain human-led and, if AI is used, explain it only as an assistive tool that does not replace consultant judgment or relationship-driven evaluation.",
      "status": "identified",
      "id": "opp-186"
    },
    {
      "type": "expansion",
      "title": "Expand assessment use into onboarding integration",
      "description": "Keith already finds Korn Ferry assessments helpful and uses them for onboarding and management, indicating openness to deeper, structured support around leader integration and early performance. This can extend value post-hire without shifting away from search.",
      "urgency": "low",
      "sourceInterviewId": "t-032",
      "client": "Keith VanOrden",
      "company": "The TCW Group",
      "supportingQuote": "“Yes, I use that tool. I find it very helpful.”",
      "suggestedAction": "Package a lightweight post-hire onboarding/90-day integration session using assessment insights for the new hire and hiring manager.",
      "status": "identified",
      "id": "opp-187"
    },
    {
      "type": "improvement",
      "title": "Send candidate packs the night before",
      "description": "Late delivery of candidate materials is repeatedly cited as the main operational friction, reducing Paul’s ability to prepare and making meetings less efficient. Providing packs earlier would improve meeting quality and client experience immediately.",
      "urgency": "high",
      "sourceInterviewId": "t-033",
      "client": "Paul Lester",
      "company": "Hudson Advisors UK Ltd.",
      "supportingQuote": "“They would always send the book out usually in the morning, two hours before the meeting… You just haven't got time to look at it… It would be really good to get that the night before… it would speed up the meeting.”",
      "suggestedAction": "Set and enforce an internal SLA to deliver candidate packs by end-of-day prior to client meetings (with a named owner and backup).",
      "status": "identified",
      "id": "opp-188"
    },
    {
      "type": "expansion",
      "title": "Introduce assessment for CEO/CFO hiring",
      "description": "Paul was unaware Korn Ferry offers assessment, indicating an opportunity to add assessment to executive search engagements to strengthen decision-making and de-risk hires. This can deepen the relationship beyond search-only delivery.",
      "urgency": "medium",
      "sourceInterviewId": "t-033",
      "client": "Paul Lester",
      "company": "Hudson Advisors UK Ltd.",
      "supportingQuote": "“I didn't know they had an assessment.”",
      "suggestedAction": "Proactively propose a tailored assessment package (e.g., leadership assessment and referencing) as a standard option alongside CEO/CFO shortlists.",
      "status": "identified",
      "id": "opp-189"
    },
    {
      "type": "expansion",
      "title": "Cross-sell organisation consulting and advisory services",
      "description": "Paul primarily associates Korn Ferry with search and says other offerings haven’t been promoted, suggesting untapped demand for broader support (e.g., org design, leadership advisory). A clearer, joined-up story could expand share of wallet with the Chair/Board.",
      "urgency": "medium",
      "sourceInterviewId": "t-033",
      "client": "Paul Lester",
      "company": "Hudson Advisors UK Ltd.",
      "supportingQuote": "“They wouldn't register in my head because they've never pushed it… Their practices need a bit more joined up thinking.”",
      "suggestedAction": "Schedule a short capabilities session with Paul to map upcoming board/leadership priorities to Korn Ferry’s consulting and advisory solutions.",
      "status": "identified",
      "id": "opp-190"
    },
    {
      "type": "re_engagement",
      "title": "Strengthen cross-practice coordination and visibility",
      "description": "Paul’s comment about siloed practices signals a risk that Korn Ferry is seen as search-only and not fully integrated, which can limit future opportunities. Improving coordination and proactive communication can reinforce partnership strength.",
      "urgency": "medium",
      "sourceInterviewId": "t-033",
      "client": "Paul Lester",
      "company": "Hudson Advisors UK Ltd.",
      "supportingQuote": "“Their practices need a bit more joined up thinking.”",
      "suggestedAction": "Assign an account lead to orchestrate a unified cross-practice plan and ensure consistent, proactive updates on relevant capabilities.",
      "status": "identified",
      "id": "opp-191"
    },
    {
      "type": "future_need",
      "title": "Support hard-to-fill niche sector searches",
      "description": "Paul highlights low mobility in housebuilding and difficulty attracting senior talent, implying future need for creative sourcing, market mapping, and potentially broader candidate adjacency strategies. Korn Ferry can position itself as the go-to partner for these constrained talent markets.",
      "urgency": "medium",
      "sourceInterviewId": "t-033",
      "client": "Paul Lester",
      "company": "Hudson Advisors UK Ltd.",
      "supportingQuote": "“It’s a very specific market… people don’t change jobs that often.”",
      "suggestedAction": "Offer a proactive talent mapping and adjacency-market strategy for niche sectors (e.g., housebuilding) ahead of the next senior hire.",
      "status": "identified",
      "id": "opp-192"
    },
    {
      "type": "expansion",
      "title": "Leverage selective peer events to deepen ties",
      "description": "Paul attends Korn Ferry peer events and values occasional participation, which can be used to strengthen relationships and surface new needs. This is a low-friction way to maintain engagement between searches.",
      "urgency": "low",
      "sourceInterviewId": "t-033",
      "client": "Paul Lester",
      "company": "Hudson Advisors UK Ltd.",
      "supportingQuote": "“Engagement appetite for networking events… sees value in selective, occasional participation.”",
      "suggestedAction": "Invite Paul to a small number of highly relevant Chair/Board peer sessions and follow up with a 1:1 to capture emerging needs.",
      "status": "identified",
      "id": "opp-193"
    },
    {
      "type": "improvement",
      "title": "Tighten candidate scheduling across time zones",
      "description": "There was a one-off escalation where a candidate struggled to connect with a Korn Ferry representative due to time zone and coordination issues. Improving scheduling reliability would reduce friction in a critical, high-visibility part of the engagement.",
      "urgency": "medium",
      "sourceInterviewId": "t-034",
      "client": "Joanne DeSantis",
      "company": "Project Management Institute",
      "supportingQuote": "\"They had a candidate who couldn't seem to connect... it was like phone tag and email tag... Over five, six years, that was the only escalation I ever had.\"",
      "suggestedAction": "Implement a standardized global scheduling protocol (clear SLAs, backup contacts, and automated scheduling options) for candidate assessments.",
      "status": "identified",
      "id": "opp-194"
    },
    {
      "type": "future_need",
      "title": "Guidance on AI use in recruitment",
      "description": "Joanne flagged AI in recruitment as an emerging concern and wants practical guidance on pitfalls and candidate impacts. This indicates a near-term advisory need as PMI evolves its application and assessment processes.",
      "urgency": "high",
      "sourceInterviewId": "t-034",
      "client": "Joanne DeSantis",
      "company": "Project Management Institute",
      "supportingQuote": "“AI in recruitment is an emerging concern… need for guidance on pitfalls and candidate impacts related to AI tools in application processes.”",
      "suggestedAction": "Provide a short briefing and tailored recommendations on responsible AI use in candidate screening and assessment for PMI’s governance context.",
      "status": "identified",
      "id": "opp-195"
    },
    {
      "type": "expansion",
      "title": "Increase awareness of Korn Ferry capabilities",
      "description": "Joanne wants a better understanding of Korn Ferry’s broader offerings so she can route internal inquiries appropriately. This creates an opportunity to expand into adjacent services through informed internal referrals rather than direct selling.",
      "urgency": "medium",
      "sourceInterviewId": "t-034",
      "client": "Joanne DeSantis",
      "company": "Project Management Institute",
      "supportingQuote": "\"Better understanding the breadth of what they offer... would be helpful.\" / \"I probably... wouldn't know where else to point them to.\"",
      "suggestedAction": "Share a concise, role-relevant capabilities map and hold a short enablement session focused on common PMI use cases and referral paths.",
      "status": "identified",
      "id": "opp-196"
    },
    {
      "type": "expansion",
      "title": "Facilitate peer-to-peer governance leader network",
      "description": "Joanne is interested in learning from peers who run similar nominating and governance processes, beyond Korn Ferry’s direct guidance. Korn Ferry can deepen the relationship by convening a curated peer forum or roundtable series.",
      "urgency": "medium",
      "sourceInterviewId": "t-034",
      "client": "Joanne DeSantis",
      "company": "Project Management Institute",
      "supportingQuote": "\"I would welcome that... I'm not learning from others that are facilitating a nominating process... peer-to-peer networking would always be [helpful].\"",
      "suggestedAction": "Create a quarterly virtual roundtable for governance/nominating leaders with curated topics and anonymized benchmarking insights.",
      "status": "identified",
      "id": "opp-197"
    },
    {
      "type": "future_need",
      "title": "Ongoing trend synthesis and practical interpretation",
      "description": "Joanne relies on Korn Ferry to bring trends and data points she should be paying attention to, and she has limited time to seek these insights independently. This suggests continued demand for structured, periodic advisory updates.",
      "urgency": "medium",
      "sourceInterviewId": "t-034",
      "client": "Joanne DeSantis",
      "company": "Project Management Institute",
      "supportingQuote": "\"She's able to bring trends and data points in this space that I better be paying attention to.\" / \"High interest in industry insights but limited time to seek them independently.\"",
      "suggestedAction": "Offer a lightweight cadence (e.g., biannual governance insights briefing) translating market trends into implications for PMI’s board and volunteer governance processes.",
      "status": "identified",
      "id": "opp-198"
    },
    {
      "type": "re_engagement",
      "title": "Reduce single-thread dependency on Miriam",
      "description": "The relationship is heavily centered on one lead (Miriam), which is a continuity risk even in a highly positive account. Strengthening the broader relationship network would protect the partnership and improve resilience.",
      "urgency": "medium",
      "sourceInterviewId": "t-034",
      "client": "Joanne DeSantis",
      "company": "Project Management Institute",
      "supportingQuote": "\"It is all Miriam.\" / \"Her relationship with Korn Ferry is longstanding... led primarily by Miriam Michaels.\"",
      "suggestedAction": "Introduce a small, consistent bench (secondary relationship owner and specialist leads) with defined roles while keeping Miriam as primary sponsor.",
      "status": "identified",
      "id": "opp-199"
    },
    {
      "type": "improvement",
      "title": "Add bonus vs non-bonus benchmarking filters",
      "description": "Metro needs market data outputs that can clearly differentiate and filter companies that pay bonuses versus those that do not. This would improve the accuracy and usability of their benchmarking submissions.",
      "urgency": "high",
      "sourceInterviewId": "t-035",
      "client": "Felix Roth",
      "company": "Metro",
      "supportingQuote": "\"I miss... very specific aspects... I cannot say I don't want to see only companies who pay a bonus... sometimes I'm not happy with this kind of data submission.\"",
      "suggestedAction": "Enhance market data configurability by adding explicit bonus-practice filters and clearly labeling bonus-included vs bonus-excluded peer groups in outputs.",
      "status": "identified",
      "id": "opp-200"
    },
    {
      "type": "improvement",
      "title": "Provide practical, affordable grading tool",
      "description": "Felix built an internal grading tool because Korn Ferry did not provide one that was both useful and reasonably priced. Offering a fit-for-purpose tool would remove friction and increase adoption of the methodology.",
      "urgency": "high",
      "sourceInterviewId": "t-035",
      "client": "Felix Roth",
      "company": "Metro",
      "supportingQuote": "\"I've also created a grading tool by ourselves, because they don't provide one which is very useful or not too expensive.\"",
      "suggestedAction": "Offer a cost-effective grading tool (or tiered pricing) aligned to the job evaluation methodology, with a clear value proposition versus building in-house.",
      "status": "identified",
      "id": "opp-201"
    },
    {
      "type": "improvement",
      "title": "Modernize training with interactive e-learning",
      "description": "The client wants more contemporary, engaging learning materials (e-learning, videos) to make training easier to consume and scale internally. Updating training formats would improve user experience and capability building.",
      "urgency": "medium",
      "sourceInterviewId": "t-035",
      "client": "Felix Roth",
      "company": "Metro",
      "supportingQuote": "\"I would wish to have something like more interactive... a nice movie and e-learning would also be helpful... could be a bit more modern.\"",
      "suggestedAction": "Develop modular e-learning and short video-based training for the methodology, with role-based learning paths for HR and business users.",
      "status": "identified",
      "id": "opp-202"
    },
    {
      "type": "improvement",
      "title": "Guidance for functional vs hierarchical leadership roles",
      "description": "Benchmarking and evaluation are harder for roles with functional leadership or mixed reporting lines, especially in project organizations. Practical guidance and examples would help Metro apply the methodology consistently.",
      "urgency": "medium",
      "sourceInterviewId": "t-035",
      "client": "Felix Roth",
      "company": "Metro",
      "supportingQuote": "\"Many people have functional leadership roles in comparison with hierarchical... can be difficult.\"",
      "suggestedAction": "Provide a playbook with examples, decision rules, and advisory support for evaluating roles in matrix/project structures and functional leadership scenarios.",
      "status": "identified",
      "id": "opp-203"
    },
    {
      "type": "future_need",
      "title": "Ongoing support for evolving project scope",
      "description": "Metro’s internal plans and project goals changed repeatedly, creating complexity that may recur in future compensation framework work. They may need structured change-management support and flexible delivery to accommodate shifting requirements.",
      "urgency": "medium",
      "sourceInterviewId": "t-035",
      "client": "Felix Roth",
      "company": "Metro",
      "supportingQuote": "\"We changed the project goals many times... it was very, very complicated to Korn Ferry... it was more our chaotic project style.\"",
      "suggestedAction": "Propose a flexible engagement model (change-control, sprint-based checkpoints, and governance) to support future projects with shifting scope.",
      "status": "identified",
      "id": "opp-204"
    },
    {
      "type": "expansion",
      "title": "Upsell market data enhancements and analytics",
      "description": "Because data flexibility is a key pain point, Metro is a candidate for expanded data/analytics offerings that provide more configurable peer groups and clearer benchmarking outputs. This deepens reliance on Korn Ferry for compensation decision support.",
      "urgency": "medium",
      "sourceInterviewId": "t-035",
      "client": "Felix Roth",
      "company": "Metro",
      "supportingQuote": "Felix noted a \"significant gap\" in the ability to customize benchmarking groups, especially regarding bonus practices, and dissatisfaction with current data submissions.",
      "suggestedAction": "Schedule a data-focused working session to map required peer-group filters (e.g., bonus practices) and propose an upgraded data package or custom analytics solution.",
      "status": "identified",
      "id": "opp-205"
    },
    {
      "type": "expansion",
      "title": "Offer training subscription for broader internal rollout",
      "description": "Interest in modern training suggests an opportunity to expand from project-based support to ongoing enablement for HR and managers. A scalable training offering could increase adoption and stickiness of the methodology.",
      "urgency": "low",
      "sourceInterviewId": "t-035",
      "client": "Felix Roth",
      "company": "Metro",
      "supportingQuote": "\"A nice movie and e-learning would also be helpful.\"",
      "suggestedAction": "Propose an annual enablement package including e-learning access, refresher sessions, and office hours for new users and managers.",
      "status": "identified",
      "id": "opp-206"
    },
    {
      "type": "re_engagement",
      "title": "Proactively confirm future use-case and context",
      "description": "Felix is open to using Korn Ferry again but framed it as context-dependent, indicating a need for proactive follow-up to secure the next engagement. Reinforcing value in the areas they care about (data flexibility, tools, training) can convert passives to promoters.",
      "urgency": "medium",
      "sourceInterviewId": "t-035",
      "client": "Felix Roth",
      "company": "Metro",
      "supportingQuote": "They \"would consider using Korn Ferry again depending on context.\"",
      "suggestedAction": "Set a follow-up meeting to understand upcoming compensation/rewards initiatives and present a targeted roadmap addressing data filters, tooling, and modern training.",
      "status": "identified",
      "id": "opp-207"
    },
    {
      "type": "future_need",
      "title": "CEO onboarding and transition support",
      "description": "The client expects Korn Ferry to provide onboarding support for the newly hired CEO, but it has not started yet. Delivering this well will be important to sustain the strong search experience into the transition phase.",
      "urgency": "high",
      "sourceInterviewId": "t-036",
      "client": "Duffield Ashmead IV",
      "company": "Wadsworth Atheneum Museum of Art",
      "supportingQuote": "“They have promised us that they will be there... but it hasn't really begun yet.”",
      "suggestedAction": "Proactively schedule and launch a structured CEO onboarding plan with clear milestones, roles, and timelines.",
      "status": "identified",
      "id": "opp-208"
    },
    {
      "type": "expansion",
      "title": "Extend leadership assessment to broader team",
      "description": "They valued KF4D assessments for candidates and for ensuring complementary leadership with the museum director. This creates an opening to expand assessments to the executive team and board-facing leaders to improve alignment and effectiveness.",
      "urgency": "medium",
      "sourceInterviewId": "t-036",
      "client": "Duffield Ashmead IV",
      "company": "Wadsworth Atheneum Museum of Art",
      "supportingQuote": "“We asked them to administer that... because we wanted to be sure their skill sets... were complementary.”",
      "suggestedAction": "Propose a post-hire leadership alignment engagement using KF4D for the CEO and key direct reports (and/or board stakeholders).",
      "status": "identified",
      "id": "opp-209"
    },
    {
      "type": "expansion",
      "title": "Continue compensation and market benchmarking support",
      "description": "The museum has previously used Korn Ferry for salary surveys and market analyses, indicating ongoing needs around compensation competitiveness and market positioning. This can be formalized into an annual or semi-annual benchmarking cadence.",
      "urgency": "low",
      "sourceInterviewId": "t-036",
      "client": "Duffield Ashmead IV",
      "company": "Wadsworth Atheneum Museum of Art",
      "supportingQuote": "“They had helped us with salary surveys... market analyses... job description... we'd been working with them on and off for two or three years.”",
      "suggestedAction": "Offer a recurring compensation/market insights package tied to executive retention and workforce planning.",
      "status": "identified",
      "id": "opp-210"
    },
    {
      "type": "re_engagement",
      "title": "Confirm onboarding kickoff to maintain momentum",
      "description": "Because onboarding support was promised but not yet visible, there is a risk of a perceived drop-off after the search. A proactive check-in will reinforce partnership continuity and trust.",
      "urgency": "high",
      "sourceInterviewId": "t-036",
      "client": "Duffield Ashmead IV",
      "company": "Wadsworth Atheneum Museum of Art",
      "supportingQuote": "“They have promised us that they will be there... but it hasn't really begun yet.”",
      "suggestedAction": "Set an immediate executive sponsor check-in with the board/search committee to confirm onboarding scope, start date, and points of contact.",
      "status": "identified",
      "id": "opp-211"
    },
    {
      "type": "improvement",
      "title": "Establish a single point of contact early",
      "description": "Early-stage communication was confusing due to multiple Korn Ferry contacts reaching out, making it hard to track information. A single accountable lead (with clear backup roles) would reduce friction and improve client experience.",
      "urgency": "medium",
      "sourceInterviewId": "t-036",
      "client": "Duffield Ashmead IV",
      "company": "Wadsworth Atheneum Museum of Art",
      "supportingQuote": "“Early on, it was a little confusing... several different people... reaching out... we couldn't search for [emails] easily.”",
      "suggestedAction": "Assign one named client-facing project lead from day one and route all communications through that person (with a shared mailbox if needed).",
      "status": "identified",
      "id": "opp-212"
    },
    {
      "type": "improvement",
      "title": "Standardize communication cadence from project start",
      "description": "Once a predictable cadence was established, the process felt smooth and well managed. Starting with an agreed communication rhythm and update format would prevent early uncertainty.",
      "urgency": "low",
      "sourceInterviewId": "t-036",
      "client": "Duffield Ashmead IV",
      "company": "Wadsworth Atheneum Museum of Art",
      "supportingQuote": "“We had a regular check-in... a Zoom call every other week... once we hit our stride, it was very smooth and a predictable cadence.”",
      "suggestedAction": "Kick off each engagement with a written communication plan (meeting schedule, update templates, and decision checkpoints).",
      "status": "identified",
      "id": "opp-213"
    },
    {
      "type": "improvement",
      "title": "Deliver gender-balanced shortlists without reminders",
      "description": "Jeanette repeatedly had to push for female candidates, indicating the search process did not reliably produce diverse slates. A more explicit, measurable diversity sourcing approach is needed to meet expectations and protect trust.",
      "urgency": "high",
      "sourceInterviewId": "t-037",
      "client": "Jeanette Rooms",
      "company": "Ocorian",
      "supportingQuote": "“We had to remind the guys a number of times that we want to see women as well as men… It was quite difficult to get them to bring women to the short list.”",
      "suggestedAction": "Set and track slate diversity targets from kickoff (with weekly reporting) and expand sourcing channels to ensure qualified women are presented early.",
      "status": "identified",
      "id": "opp-214"
    },
    {
      "type": "improvement",
      "title": "Adjust team composition to support diversity outcomes",
      "description": "The all-male consulting team negatively affected Jeanette’s perception and confidence in Korn Ferry’s ability to deliver gender-balanced sourcing. Team composition and visible commitment to inclusion can influence both outcomes and client trust.",
      "urgency": "medium",
      "sourceInterviewId": "t-037",
      "client": "Jeanette Rooms",
      "company": "Ocorian",
      "supportingQuote": "“All the consultants from Korn Ferry were all men… it didn't really sit very well.”",
      "suggestedAction": "Staff future searches with a visibly diverse team (or add a senior female leader/advisor) and communicate the diversity sourcing plan upfront.",
      "status": "identified",
      "id": "opp-215"
    },
    {
      "type": "improvement",
      "title": "Fix compensation discovery and offer-stage readiness",
      "description": "Difficulty obtaining accurate compensation details created major delays, slowed offer creation, and contributed to losing a preferred candidate. Korn Ferry needs a structured, early compensation discovery process with clear data requirements.",
      "urgency": "high",
      "sourceInterviewId": "t-037",
      "client": "Jeanette Rooms",
      "company": "Ocorian",
      "supportingQuote": "“Trying to get out of them what current comp was, was impossible… it took forever to put an offer together… We nearly lost one of the candidates because of it.”",
      "suggestedAction": "Implement a mandatory compensation data capture template at first candidate engagement (base/bonus/LTI/equity/guarantees/notice) and validate it before finalists progress.",
      "status": "identified",
      "id": "opp-216"
    },
    {
      "type": "improvement",
      "title": "Provide deeper, actionable compensation benchmarking",
      "description": "Jeanette felt Korn Ferry’s compensation guidance was too generic and not decision-useful. More specific benchmarking and rationale would improve confidence and speed in offer decisions.",
      "urgency": "high",
      "sourceInterviewId": "t-037",
      "client": "Jeanette Rooms",
      "company": "Ocorian",
      "supportingQuote": "“We didn't get any support… we got a very blanket ‘the expectation is around about half a million’.”",
      "suggestedAction": "Deliver a tailored comp benchmark pack early (role/location/sector/size) with ranges, pay mix guidance, and implications for attraction/closing.",
      "status": "identified",
      "id": "opp-217"
    },
    {
      "type": "improvement",
      "title": "Send candidate reports with adequate lead time",
      "description": "Materials arriving shortly before calls prevented preparation and reduced the quality of discussions. Better pre-read timing and meeting discipline would improve the client experience immediately.",
      "urgency": "medium",
      "sourceInterviewId": "t-037",
      "client": "Jeanette Rooms",
      "company": "Ocorian",
      "supportingQuote": "“The reports would often land an hour or two before the call… you have no hope in hell of getting to it.”",
      "suggestedAction": "Adopt an SLA to send all candidate materials at least 24–48 hours before meetings and confirm receipt/readiness ahead of calls.",
      "status": "identified",
      "id": "opp-218"
    },
    {
      "type": "improvement",
      "title": "Lead the process with assertiveness and recommendations",
      "description": "Jeanette expected Korn Ferry to guide decision-making, facilitate calls, and make clear recommendations, but felt she had to run the process. Stronger ownership and consultative leadership would reduce client burden and improve outcomes.",
      "urgency": "high",
      "sourceInterviewId": "t-037",
      "client": "Jeanette Rooms",
      "company": "Ocorian",
      "supportingQuote": "“We ended up running the calls… It always felt very hesitant… It just wasn't assertive enough.”",
      "suggestedAction": "Assign a single accountable search lead to run meetings, provide explicit shortlists/rankings with rationale, and drive next-step decisions each week.",
      "status": "identified",
      "id": "opp-219"
    },
    {
      "type": "improvement",
      "title": "Increase pace and maintain search momentum",
      "description": "The search took far longer than expected, creating frustration and risking candidate loss. A tighter operating cadence and milestone management is needed, especially for time-sensitive roles.",
      "urgency": "high",
      "sourceInterviewId": "t-037",
      "client": "Jeanette Rooms",
      "company": "Ocorian",
      "supportingQuote": "“It just took way, way longer than we thought… the best part of five months, six months.”",
      "suggestedAction": "Agree a milestone plan at kickoff (with weekly progress reporting) and escalate immediately when timelines slip or candidate responsiveness slows.",
      "status": "identified",
      "id": "opp-220"
    },
    {
      "type": "improvement",
      "title": "Surface brief misalignment early and recalibrate",
      "description": "Jeanette felt Korn Ferry continued in the wrong direction for too long instead of proactively flagging misalignment and adjusting. Earlier course correction would save time and improve slate quality.",
      "urgency": "high",
      "sourceInterviewId": "t-037",
      "client": "Jeanette Rooms",
      "company": "Ocorian",
      "supportingQuote": "“They just weren't hitting the right brief… They didn't seem to instinctively pick up that it wasn't quite right… they just kept pushing forward.”",
      "suggestedAction": "Run an early calibration checkpoint (after first market map/initial profiles) to confirm the brief and adjust search strategy before progressing candidates.",
      "status": "identified",
      "id": "opp-221"
    },
    {
      "type": "re_engagement",
      "title": "Immediate recovery to prevent loss of future work",
      "description": "Jeanette expressed doubt about using Korn Ferry again due to accumulated frustration. A proactive service recovery is needed to rebuild confidence and protect the relationship.",
      "urgency": "high",
      "sourceInterviewId": "t-037",
      "client": "Jeanette Rooms",
      "company": "Ocorian",
      "supportingQuote": "“I'm not sure we'll go back there again, because that was really hard work at the end.”",
      "suggestedAction": "Have a senior Korn Ferry leader conduct a post-search debrief, acknowledge issues, share corrective actions, and agree a service plan for any future engagement.",
      "status": "identified",
      "id": "opp-222"
    },
    {
      "type": "expansion",
      "title": "Leverage CEO relationship to rebuild sponsorship",
      "description": "The engagement was initiated through an existing CEO relationship, which can be used to reset expectations and reinforce executive sponsorship while addressing Jeanette’s concerns. Aligning CEO and CPO on what “good” looks like can stabilize future collaboration.",
      "urgency": "medium",
      "sourceInterviewId": "t-037",
      "client": "Jeanette Rooms",
      "company": "Ocorian",
      "supportingQuote": "They engaged Korn Ferry… “through an existing relationship initiated by the CEO.”",
      "suggestedAction": "Coordinate a joint check-in with the CEO and Jeanette to review lessons learned and agree governance, diversity expectations, and pace standards for future searches.",
      "status": "identified",
      "id": "opp-223"
    },
    {
      "type": "future_need",
      "title": "Ongoing senior hiring support with faster execution",
      "description": "As CPO working closely with the CEO on senior hiring, Jeanette is likely to need future executive search support, but with higher urgency, structure, and leadership than experienced here. Meeting these expectations is key to being considered again.",
      "urgency": "medium",
      "sourceInterviewId": "t-037",
      "client": "Jeanette Rooms",
      "company": "Ocorian",
      "supportingQuote": "Jeanette is the Chief People Officer… “working closely with the CEO on senior hiring.”",
      "suggestedAction": "Propose a refreshed executive search delivery model for Ocorian (clear timelines, governance, diversity commitments, and compensation benchmarking) to support upcoming senior roles.",
      "status": "identified",
      "id": "opp-224"
    },
    {
      "type": "future_need",
      "title": "Independent succession evaluations to reduce blind spots",
      "description": "Greg indicated a lack of confidence in their current succession/assessment matrix and wants third-party evaluations and analysis to ensure they are not missing risks or talent gaps.",
      "urgency": "high",
      "sourceInterviewId": "t-038",
      "client": "Greg Aarssen",
      "company": "TriSummit Utilities Inc.",
      "supportingQuote": "\"I don't have any confidence in our matrix anymore. I think we need to have someone that is doing some of these... evaluations and analysis to make sure that we don't have blind spots.\"",
      "suggestedAction": "Propose a structured succession assessment program (roles, readiness, risk, development plans) facilitated by Korn Ferry for the CEO and key executives.",
      "status": "identified",
      "id": "opp-225"
    },
    {
      "type": "expansion",
      "title": "Expand into broader succession planning support",
      "description": "Beyond the CEO replacement, Greg explicitly sees scope to involve Korn Ferry in improving succession planning and board-level understanding of leadership readiness.",
      "urgency": "medium",
      "sourceInterviewId": "t-038",
      "client": "Greg Aarssen",
      "company": "TriSummit Utilities Inc.",
      "supportingQuote": "He \"see[s] potential to involve Korn Ferry in improving succession planning and reducing blind spots\" and is \"already exploring this with Korn Ferry.\"",
      "suggestedAction": "Schedule a follow-up working session with the Compensation/Governance Committees to scope succession planning deliverables, timeline, and stakeholders.",
      "status": "identified",
      "id": "opp-226"
    },
    {
      "type": "expansion",
      "title": "Board-level governance and coaching support",
      "description": "As chair of Compensation and Governance, Greg signaled openness to board-related support, implying an opportunity to extend services into governance effectiveness, committee advisory, or board coaching.",
      "urgency": "low",
      "sourceInterviewId": "t-038",
      "client": "Greg Aarssen",
      "company": "TriSummit Utilities Inc.",
      "supportingQuote": "Key theme noted: \"Opportunity for broader succession and board-related work\" and recommendation to \"Explore further work on succession planning and board coaching.\"",
      "suggestedAction": "Offer a board/committee effectiveness and governance advisory package aligned to their Compensation and Governance Committee priorities.",
      "status": "identified",
      "id": "opp-227"
    },
    {
      "type": "future_need",
      "title": "Future executive search and leadership transitions",
      "description": "Greg strongly indicated intent to reuse Korn Ferry, suggesting future needs for additional searches or leadership transition support as the organization evolves.",
      "urgency": "medium",
      "sourceInterviewId": "t-038",
      "client": "Greg Aarssen",
      "company": "TriSummit Utilities Inc.",
      "supportingQuote": "\"Would I ever use these people again? I can't imagine not using them again.\"",
      "suggestedAction": "Establish a forward-looking talent roadmap conversation to identify upcoming leadership risks, retirements, and potential search needs over the next 12–24 months.",
      "status": "identified",
      "id": "opp-228"
    },
    {
      "type": "improvement",
      "title": "Increase Korn Ferry visibility with client stakeholders",
      "description": "Greg struggled to find issues but suggested Korn Ferry could strengthen its visibility, implying a need for more proactive presence/brand reinforcement with the board and broader stakeholder set.",
      "urgency": "low",
      "sourceInterviewId": "t-038",
      "client": "Greg Aarssen",
      "company": "TriSummit Utilities Inc.",
      "supportingQuote": "He \"struggled to identify any issues with the work itself, suggesting only that Korn Ferry could potentially strengthen its visibility.\"",
      "suggestedAction": "Implement a light-touch visibility plan (periodic board-ready insights, check-ins, and thought leadership relevant to utilities leadership and governance).",
      "status": "identified",
      "id": "opp-229"
    },
    {
      "type": "re_engagement",
      "title": "Proactively follow up to convert interest into work",
      "description": "Greg’s strong advocacy and stated interest in succession work creates a near-term window to formalize next steps before momentum fades after the CEO transition.",
      "urgency": "medium",
      "sourceInterviewId": "t-038",
      "client": "Greg Aarssen",
      "company": "TriSummit Utilities Inc.",
      "supportingQuote": "\"Would I ever use these people again? I can't imagine not using them again.\" and he is \"already exploring this with Korn Ferry.\"",
      "suggestedAction": "Set a specific next meeting date with Greg to define scope, outcomes, and a proposal for succession/board support within the next 2–3 weeks.",
      "status": "identified",
      "id": "opp-230"
    },
    {
      "type": "future_need",
      "title": "Compensation benchmarking via independent partner model",
      "description": "They needed CEO compensation benchmarking but could not use Korn Ferry due to perceived conflict, forcing them to engage another firm; future leadership changes will likely require a repeatable approach.",
      "urgency": "medium",
      "sourceInterviewId": "t-038",
      "client": "Greg Aarssen",
      "company": "TriSummit Utilities Inc.",
      "supportingQuote": "\"Korn Ferry does some of that, they were now a bit of a conflicted party. So we ended up having to go to... Meridian... [who] identify that we were 11% below market.\"",
      "suggestedAction": "Offer a conflict-safe compensation benchmarking solution (clear independence boundaries or a vetted partner ecosystem) integrated into future CEO/executive transition projects.",
      "status": "identified",
      "id": "opp-231"
    },
    {
      "type": "improvement",
      "title": "Sharpen assessment reports with executive summaries",
      "description": "The client finds assessment documents too long and overly nuanced, and would prefer clearer, more decisive conclusions. Adding a short, “black and white” summary would make outputs more actionable for senior hiring decisions.",
      "urgency": "medium",
      "sourceInterviewId": "t-039",
      "client": "Francis Kint",
      "company": "Unknown",
      "supportingQuote": "\"The documents are long and very nuanced... you might sometimes maybe have wished them to be a little bit more black and white.\"",
      "suggestedAction": "Add a 1-page executive summary to every assessment highlighting key strengths, risks, and clear behavioural calls.",
      "status": "identified",
      "id": "opp-232"
    },
    {
      "type": "improvement",
      "title": "Make behavioural risk flags more explicit",
      "description": "The CEO wanted more concrete statements on specific behaviours critical to transformation contexts (e.g., conflict handling, restructuring). More explicit behavioural “watch-outs” would increase confidence and speed decision-making.",
      "urgency": "medium",
      "sourceInterviewId": "t-039",
      "client": "Francis Kint",
      "company": "Unknown",
      "supportingQuote": "He suggested clearer, more concrete statements on \"ability to handle conflict and restructuring situations\" and \"on the very concrete things, how things will work.\"",
      "suggestedAction": "Include a dedicated section in assessments for transformation-critical behaviours (conflict tolerance, restructuring leadership) with clear ratings and examples.",
      "status": "identified",
      "id": "opp-233"
    },
    {
      "type": "improvement",
      "title": "Improve client visit logistics and parking",
      "description": "A minor but repeated friction point was the inconvenience of parking when visiting the office. While not impacting perceived quality, it detracts from the premium experience.",
      "urgency": "low",
      "sourceInterviewId": "t-039",
      "client": "Francis Kint",
      "company": "Unknown",
      "supportingQuote": "\"I'd wish they had parking spaces in their own office... it's a bit annoying.\"",
      "suggestedAction": "Provide pre-arranged parking instructions/validation or offer alternative meeting options (client site/nearby venue/virtual) by default.",
      "status": "identified",
      "id": "opp-234"
    },
    {
      "type": "future_need",
      "title": "Support transformation leadership and restructuring capability",
      "description": "The company is in a transformation driven by a Bain-led review and profitability challenges, with a time-bound transformation role. This context suggests ongoing need for leadership advisory, org design, and restructuring/change support beyond the initial hires.",
      "urgency": "high",
      "sourceInterviewId": "t-039",
      "client": "Francis Kint",
      "company": "Unknown",
      "supportingQuote": "The CTO role was requested \"to drive and follow up on transformation work\" given \"current profitability challenges,\" and the CEO emphasized restructuring/conflict capability.",
      "suggestedAction": "Proactively propose a transformation support package (org/operating model, change leadership, restructuring support, leadership coaching) aligned to the Bain roadmap.",
      "status": "identified",
      "id": "opp-235"
    },
    {
      "type": "expansion",
      "title": "Extend partnership through Solemn Partners network",
      "description": "Solemn Partners already uses Korn Ferry extensively and influenced the selection, creating a clear path to broaden work across the portfolio and deepen the sponsor relationship.",
      "urgency": "high",
      "sourceInterviewId": "t-039",
      "client": "Francis Kint",
      "company": "Unknown",
      "supportingQuote": "\"Oh, we work a lot, this is the main firm we also work with.\"",
      "suggestedAction": "Coordinate with the Solemn Partners relationship owner to identify upcoming portfolio needs and position Korn Ferry for multi-company search and advisory engagements.",
      "status": "identified",
      "id": "opp-236"
    },
    {
      "type": "expansion",
      "title": "Offer post-hire onboarding and integration support",
      "description": "Two senior leaders have just joined (CHRO and CTO), and success will depend on fast integration in a transformation environment. Structured onboarding and coaching can protect the search outcome and create follow-on advisory work.",
      "urgency": "medium",
      "sourceInterviewId": "t-039",
      "client": "Francis Kint",
      "company": "Unknown",
      "supportingQuote": "\"The two people that are now on board...\" and the transformation role is intended to deliver within ~2 years.",
      "suggestedAction": "Schedule 30/60/90-day integration check-ins and offer executive coaching/onboarding support for the CHRO and CTO.",
      "status": "identified",
      "id": "opp-237"
    },
    {
      "type": "re_engagement",
      "title": "Follow up to reinforce value after successful placements",
      "description": "With both roles filled and high satisfaction, a timely follow-up can lock in advocacy and uncover next priorities (especially transformation milestones and HR leadership needs). This is a strong moment to formalize a longer-term partnership plan.",
      "urgency": "medium",
      "sourceInterviewId": "t-039",
      "client": "Francis Kint",
      "company": "Unknown",
      "supportingQuote": "Overall experience was \"very positive\" and \"strong satisfaction with the collaboration and with the appointees.\"",
      "suggestedAction": "Set an executive debrief with the CEO and sponsor to review outcomes, capture lessons learned (including assessment format), and map next 6–12 month needs.",
      "status": "identified",
      "id": "opp-238"
    },
    {
      "type": "improvement",
      "title": "Restore dual-consultant coverage on key searches",
      "description": "The client experienced higher perceived value and richer consultation when two consultants with different cultural backgrounds attended meetings. Removing the paired model reduced differentiation and the overall experience, even though delivery still met expectations.",
      "urgency": "high",
      "sourceInterviewId": "t-040",
      "client": "Dr. Jan Stefan Scheld",
      "company": "Boehringer Ingelheim",
      "supportingQuote": "“That was the differentiating factor... two different individuals from two different cultures.” / “It still worked, but it was not the same great experience as we had at the beginning.”",
      "suggestedAction": "Reintroduce a paired-consultant model for this account’s priority roles (or key milestones) and explicitly position it as a value differentiator.",
      "status": "identified",
      "id": "opp-239"
    },
    {
      "type": "re_engagement",
      "title": "Proactively address capacity-driven service change",
      "description": "Korn Ferry communicated that limited capacity ended the dual-consultant approach, which weakened the experience. This is a signal to re-engage, explain the service model, and agree on coverage expectations to protect the relationship.",
      "urgency": "high",
      "sourceInterviewId": "t-040",
      "client": "Dr. Jan Stefan Scheld",
      "company": "Boehringer Ingelheim",
      "supportingQuote": "“We got the message... we have limited capacity, so now we are splitting up and working individually.”",
      "suggestedAction": "Schedule an executive check-in to acknowledge the change, align on the preferred engagement model, and commit to a coverage plan for upcoming searches.",
      "status": "identified",
      "id": "opp-240"
    },
    {
      "type": "improvement",
      "title": "Make assessments optional and clearly value-based",
      "description": "Assessment tools were provided but not used because they did not help decision-making for these hires. Better framing and fit-to-purpose guidance would prevent wasted effort and improve perceived relevance.",
      "urgency": "medium",
      "sourceInterviewId": "t-040",
      "client": "Dr. Jan Stefan Scheld",
      "company": "Boehringer Ingelheim",
      "supportingQuote": "“We got that for free in some instances, but honestly, I didn't use it... It didn't need that tool, and didn't really help me in my decision making.”",
      "suggestedAction": "Introduce a brief decision guide at kickoff explaining when assessments add value for the role and only include them when the client agrees on the use case.",
      "status": "identified",
      "id": "opp-241"
    },
    {
      "type": "expansion",
      "title": "Position broader consulting with dedicated experts",
      "description": "The client does not assume search capability translates to transformation or development work and would re-evaluate providers for those needs. This is an opportunity to expand by introducing the right Korn Ferry experts and demonstrating distinct capability.",
      "urgency": "medium",
      "sourceInterviewId": "t-040",
      "client": "Dr. Jan Stefan Scheld",
      "company": "Boehringer Ingelheim",
      "supportingQuote": "“No, because that's a different skill set... I would again pitch and see who's best.”",
      "suggestedAction": "Arrange a targeted introduction to Korn Ferry transformation/development specialists with relevant pharma Japan case examples, positioned separately from search.",
      "status": "identified",
      "id": "opp-242"
    },
    {
      "type": "future_need",
      "title": "Future executive search support in Japan",
      "description": "The client has repeatedly used Korn Ferry for multiple search projects over two years and indicates willingness to continue. This suggests ongoing future hiring/search needs where Korn Ferry can secure preferred-partner status.",
      "urgency": "medium",
      "sourceInterviewId": "t-040",
      "client": "Dr. Jan Stefan Scheld",
      "company": "Boehringer Ingelheim",
      "supportingQuote": "“That's why we've been keeping working with them over the past two years.” / “Would you use them again? - Yes.”",
      "suggestedAction": "Propose an annual hiring/search roadmap and preferred-terms framework to lock in continuity, speed, and consistent consultant coverage.",
      "status": "identified",
      "id": "opp-243"
    },
    {
      "type": "improvement",
      "title": "Broaden and deepen candidate sourcing strategy",
      "description": "The client expected Korn Ferry to surface a wider, higher-caliber slate—especially candidates not already in the committee’s network. Expanding beyond familiar pools and delivering more “surprise” A-plus candidates would increase perceived value-add.",
      "urgency": "high",
      "sourceInterviewId": "t-041",
      "client": "Gary Knell",
      "company": "San Diego Zoo Wildlife Alliance",
      "supportingQuote": "“They didn't really generate the level of the candidates that we thought they should have… Two of the three finalists were my contacts… This is a big enough job that we really should have had A-plus candidates.”",
      "suggestedAction": "Present a revised sourcing plan for future searches that explicitly targets adjacent sectors (e.g., higher ed presidents), includes named target lists, and sets measurable pipeline expectations early.",
      "status": "identified",
      "id": "opp-244"
    },
    {
      "type": "improvement",
      "title": "Proactively explore adjacent-sector leadership profiles",
      "description": "Gary explicitly urged the team to look outside traditional sector boundaries (e.g., college presidents) but felt this did not happen. A more imaginative cross-sector mapping approach would better match expectations for a marquee CEO role.",
      "urgency": "high",
      "sourceInterviewId": "t-041",
      "client": "Gary Knell",
      "company": "San Diego Zoo Wildlife Alliance",
      "supportingQuote": "“I had urged them to look broad... like college presidents... and they didn't really do that.”",
      "suggestedAction": "Build an adjacent-sector market map at kickoff and review it with the committee within the first 2–3 weeks to confirm breadth and priority targets.",
      "status": "identified",
      "id": "opp-245"
    },
    {
      "type": "improvement",
      "title": "Validate relocation and commitment earlier",
      "description": "Two external finalists withdrew late due to relocation concerns, which the client viewed as preventable with earlier vetting. Earlier confirmation of practical constraints would reduce late-stage disruption and board frustration.",
      "urgency": "high",
      "sourceInterviewId": "t-041",
      "client": "Gary Knell",
      "company": "San Diego Zoo Wildlife Alliance",
      "supportingQuote": "“That should have been fleshed out beforehand… Korn Ferry should have vetted this ahead of time… They should have known those candidates were not going to move.”",
      "suggestedAction": "Implement a mandatory early-stage commitment checkpoint (relocation, compensation, timing, family constraints) before candidates advance to final assessment/testing.",
      "status": "identified",
      "id": "opp-246"
    },
    {
      "type": "improvement",
      "title": "Maintain consistent senior ownership through close",
      "description": "The client perceived reduced prioritization and ownership after the lead partner’s temporary absence. Stronger continuity planning and visible leadership coverage would preserve confidence through the final stages.",
      "urgency": "medium",
      "sourceInterviewId": "t-041",
      "client": "Gary Knell",
      "company": "San Diego Zoo Wildlife Alliance",
      "supportingQuote": "“Once she was gone, it felt less prioritised… It just felt a little bit… an ownership thing.”",
      "suggestedAction": "Define a named deputy lead and continuity plan at kickoff, with scheduled senior check-ins that continue uninterrupted through finalist selection and closing.",
      "status": "identified",
      "id": "opp-247"
    },
    {
      "type": "improvement",
      "title": "Recalibrate search earlier when pipeline narrows",
      "description": "Late-stage suggestions to reopen the search and shift profiles felt reactive and undermined confidence. Earlier data-driven recalibration would help maintain momentum and avoid end-stage surprises.",
      "urgency": "medium",
      "sourceInterviewId": "t-041",
      "client": "Gary Knell",
      "company": "San Diego Zoo Wildlife Alliance",
      "supportingQuote": "“It got off to such a good start... and then it sort of skidded off the runway… [reopening the search] was experienced as reactive rather than proactive.”",
      "suggestedAction": "Set predefined pipeline health triggers (e.g., number of qualified/committed candidates by week X) that automatically prompt an early strategy reset with the committee.",
      "status": "identified",
      "id": "opp-248"
    },
    {
      "type": "re_engagement",
      "title": "Executive sponsor follow-up to rebuild confidence",
      "description": "As an NPS 7 passive with clear late-stage dissatisfaction, the relationship would benefit from a senior-level debrief and service recovery. This can convert constructive feedback into renewed trust for future work.",
      "urgency": "high",
      "sourceInterviewId": "t-041",
      "client": "Gary Knell",
      "company": "San Diego Zoo Wildlife Alliance",
      "supportingQuote": "“It was just disappointing… It felt less prioritised at the firm.”",
      "suggestedAction": "Have a senior Korn Ferry leader conduct a structured post-search debrief, acknowledge gaps, share process changes (sourcing breadth, commitment vetting, continuity), and agree on success metrics for any future engagement.",
      "status": "identified",
      "id": "opp-249"
    },
    {
      "type": "future_need",
      "title": "Future board and C-suite leadership searches",
      "description": "Gary leads nomination and governance and chaired the CEO search committee, indicating likely ongoing needs for senior leadership and governance-related searches. A proactive plan for upcoming leadership needs could position Korn Ferry for repeat work.",
      "urgency": "medium",
      "sourceInterviewId": "t-041",
      "client": "Gary Knell",
      "company": "San Diego Zoo Wildlife Alliance",
      "supportingQuote": "“Chair of the Board Search Committee… responsibility for leading the nomination and governance committee… search for a new Chief Executive Officer.”",
      "suggestedAction": "Offer a forward-looking leadership and succession roadmap discussion (CEO direct reports, key executives, and board refresh cycles) to identify upcoming search needs.",
      "status": "identified",
      "id": "opp-250"
    },
    {
      "type": "expansion",
      "title": "Expand into assessment and onboarding support",
      "description": "The client valued Korn Ferry’s assessment infrastructure (including psychologist involvement) and the CEO outcome is positive, creating an opening to extend into structured onboarding and leadership assessment for the broader team.",
      "urgency": "low",
      "sourceInterviewId": "t-041",
      "client": "Gary Knell",
      "company": "San Diego Zoo Wildlife Alliance",
      "supportingQuote": "“They even brought in… a psychologist on their staff, and that was a useful session… The guy's doing a great job.”",
      "suggestedAction": "Propose an onboarding and first-180-days effectiveness package for the new CEO and optional assessment/coaching for the executive team to sustain the successful placement.",
      "status": "identified",
      "id": "opp-251"
    },
    {
      "type": "re_engagement",
      "title": "Repair relationship with primary client contact",
      "description": "Julie feels sidelined when Korn Ferry engages senior stakeholders in ways that diminish her role. This creates a real risk of losing future work despite strong technical delivery.",
      "urgency": "high",
      "sourceInterviewId": "t-042",
      "client": "Julie Tschida Brown",
      "company": "Zayo Group",
      "supportingQuote": "“They're managing up... in a way that felt somewhat disrespectful to me and my role.” / “It definitely feels like a diminishment of my role.”",
      "suggestedAction": "Schedule an executive-level reset with Julie to acknowledge the impact, agree engagement norms, and confirm she is the primary decision partner for day-to-day governance.",
      "status": "identified",
      "id": "opp-252"
    },
    {
      "type": "re_engagement",
      "title": "Address fee dispute and rebuild trust",
      "description": "The additional fee tied to a CEO-sourced candidate was experienced as transactional and threatens repeat business. The dismissive response when concerns were raised amplified the damage.",
      "urgency": "high",
      "sourceInterviewId": "t-042",
      "client": "Julie Tschida Brown",
      "company": "Zayo Group",
      "supportingQuote": "“It just seemed... penny smart, pound foolish... That behavior would make me not want to work with them again.” / “They shut her down immediately.”",
      "suggestedAction": "Proactively revisit the specific fee incident, offer a goodwill adjustment or clarified credit policy, and align on a partnership-based commercial approach for future searches.",
      "status": "identified",
      "id": "opp-253"
    },
    {
      "type": "improvement",
      "title": "Clarify hybrid sourcing and fee rules upfront",
      "description": "Unclear expectations on how internally sourced candidates are handled creates friction late in the process. A clear, pre-agreed policy would prevent future disputes and protect the relationship.",
      "urgency": "high",
      "sourceInterviewId": "t-042",
      "client": "Julie Tschida Brown",
      "company": "Zayo Group",
      "supportingQuote": "“Clarify shared ownership during hybrid candidate sourcing... align on how internally sourced candidates are handled.” (summary) / “additional fee charged following a CEO-sourced candidate” (issue described)",
      "suggestedAction": "Add a standard kickoff module that documents hybrid sourcing scenarios, ownership, and fee treatment with written sign-off before candidate outreach begins.",
      "status": "identified",
      "id": "opp-254"
    },
    {
      "type": "improvement",
      "title": "Reduce client burden for logistics and coordination",
      "description": "Julie believes Korn Ferry is relying too heavily on Zayo for scheduling and operational logistics, which undermines perceived value. Rebalancing responsibilities would improve the experience and efficiency.",
      "urgency": "high",
      "sourceInterviewId": "t-042",
      "client": "Julie Tschida Brown",
      "company": "Zayo Group",
      "supportingQuote": "“They rely on us very heavily for everything logistical... It feels like they kind of expect us to do their logistics.” / “We are paying... for them to do it.”",
      "suggestedAction": "Assign dedicated search operations support (or clearly defined coordinator ownership) and provide a logistics plan/RACI so Korn Ferry owns scheduling, comms, and tracking.",
      "status": "identified",
      "id": "opp-255"
    },
    {
      "type": "improvement",
      "title": "Fix template reuse and process continuity",
      "description": "Repeated requests for previously shared templates and materials create avoidable friction and signal poor internal continuity. A consistent process repository would reduce duplication and speed delivery.",
      "urgency": "medium",
      "sourceInterviewId": "t-042",
      "client": "Julie Tschida Brown",
      "company": "Zayo Group",
      "supportingQuote": "“They were like, 'Oh, we don't have that template. Can you send it again?'”",
      "suggestedAction": "Implement a client-specific engagement folder and standardized artifacts checklist so all team members can access agreed templates and prior materials.",
      "status": "identified",
      "id": "opp-256"
    },
    {
      "type": "improvement",
      "title": "Adopt more collaborative issue-handling behaviors",
      "description": "When concerns were raised, the response was perceived as closed rather than collaborative, increasing the likelihood of switching firms. Improving how objections are handled would strengthen partnership perception.",
      "urgency": "high",
      "sourceInterviewId": "t-042",
      "client": "Julie Tschida Brown",
      "company": "Zayo Group",
      "supportingQuote": "“They shut her down immediately.” / “Behaviour outweighs technical competence... ‘This behavior would make me choose someone else.’”",
      "suggestedAction": "Coach search leaders on a consistent escalation and resolution approach (listen, validate, options, agree next steps) and ensure Julie receives timely follow-up after any concern.",
      "status": "identified",
      "id": "opp-257"
    },
    {
      "type": "future_need",
      "title": "Support fast-paced PE operating cadence",
      "description": "Zayo’s private equity environment drives expectations for speed, responsiveness, and low-friction execution. Korn Ferry can better tailor delivery to match this cadence and reduce operational drag.",
      "urgency": "medium",
      "sourceInterviewId": "t-042",
      "client": "Julie Tschida Brown",
      "company": "Zayo Group",
      "supportingQuote": "“We’re a PE… we move fast.” / “They have been unbelievably responsive... they moved very quickly.”",
      "suggestedAction": "Offer a PE-optimized search operating model (rapid kickoff, weekly decision checkpoints, tight SLAs, and streamlined logistics) aligned to Zayo’s pace.",
      "status": "identified",
      "id": "opp-258"
    },
    {
      "type": "expansion",
      "title": "Expand assessments and leadership competency work",
      "description": "Julie values Korn Ferry’s psychometric tools and leadership competency models, indicating an opportunity to broaden these offerings beyond current use. This could deepen the relationship outside of executive search.",
      "urgency": "low",
      "sourceInterviewId": "t-042",
      "client": "Julie Tschida Brown",
      "company": "Zayo Group",
      "supportingQuote": "“We use their psychometric tools for assessment, and they were very, very good.” / “The quality of the work... on the consultancy side... is high.”",
      "suggestedAction": "Propose a roadmap to extend assessments/competency work into broader leadership development, succession planning, or selection processes tied to upcoming roles.",
      "status": "identified",
      "id": "opp-259"
    },
    {
      "type": "future_need",
      "title": "Post-hire leadership development planning support",
      "description": "Tim intends to use Korn Ferry’s psychometric assessment outputs to build a development plan, indicating a need for structured post-hire coaching/development support.",
      "urgency": "medium",
      "sourceInterviewId": "t-043",
      "client": "Tim Rolfe",
      "company": "Logistics UK",
      "supportingQuote": "“We use their psychometric tools for assessment... It will be used for a development plan, yeah, absolutely.”",
      "suggestedAction": "Offer a packaged post-placement development plan service (e.g., debrief + coaching + 90/180-day plan) tied to the assessment results.",
      "status": "identified",
      "id": "opp-260"
    },
    {
      "type": "expansion",
      "title": "Broaden psychometric assessments beyond hiring",
      "description": "The client values Korn Ferry’s psychometrics and has positive experiences with interpretation, creating an opening to extend assessments to wider leadership/team development use cases.",
      "urgency": "medium",
      "sourceInterviewId": "t-043",
      "client": "Tim Rolfe",
      "company": "Logistics UK",
      "supportingQuote": "“We use their psychometric tools for assessment, and they were very, very good.”",
      "suggestedAction": "Propose an assessment-led leadership capability program for the senior team (e.g., leadership profiles, team effectiveness, succession insights).",
      "status": "identified",
      "id": "opp-261"
    },
    {
      "type": "expansion",
      "title": "Support outward-facing leadership capability build",
      "description": "Tim flagged outward-facing credibility as a growing organisational priority, suggesting opportunities for targeted executive search, assessment, and development focused on external influence roles.",
      "urgency": "high",
      "sourceInterviewId": "t-043",
      "client": "Tim Rolfe",
      "company": "Logistics UK",
      "supportingQuote": "“The most important thing for us is that our outward facing activities are done by really high-quality people.”",
      "suggestedAction": "Initiate a conversation about upcoming roles and capability gaps in external affairs/advocacy leadership and offer a combined search + assessment + onboarding plan.",
      "status": "identified",
      "id": "opp-262"
    },
    {
      "type": "expansion",
      "title": "Introduce remuneration benchmarking and advisory",
      "description": "Tim has previously used and valued Korn Ferry remuneration consulting, indicating potential to reintroduce this service for pay benchmarking or reward strategy as needs arise.",
      "urgency": "low",
      "sourceInterviewId": "t-043",
      "client": "Tim Rolfe",
      "company": "Logistics UK",
      "supportingQuote": "Past experiences with “remuneration consulting were described positively.”",
      "suggestedAction": "Share a light-touch reward/benchmarking offer and ask about any upcoming pay reviews, role leveling, or market competitiveness concerns.",
      "status": "identified",
      "id": "opp-263"
    },
    {
      "type": "re_engagement",
      "title": "Stay close until organisation reaches scale",
      "description": "Tim suggested broader consulting may not fit until the organisation has more scale; this is a signal to maintain proactive contact and offer right-sized options rather than waiting for inbound demand.",
      "urgency": "medium",
      "sourceInterviewId": "t-043",
      "client": "Tim Rolfe",
      "company": "Logistics UK",
      "supportingQuote": "“I think we'd need a bit more scale before we went to somebody of Korn Ferry size to do other work like that.”",
      "suggestedAction": "Set a quarterly check-in and present modular, scalable offerings (pilot engagements) that feel proportionate to Logistics UK’s size.",
      "status": "identified",
      "id": "opp-264"
    },
    {
      "type": "improvement",
      "title": "Maintain structured weekly updates and accessibility",
      "description": "The weekly cadence and ad hoc availability were explicitly valued; preserving this approach is a concrete action to sustain the experience quality in future searches.",
      "urgency": "medium",
      "sourceInterviewId": "t-043",
      "client": "Tim Rolfe",
      "company": "Logistics UK",
      "supportingQuote": "“We had one scheduled weekly call throughout the process... and they were always available for other queries.”",
      "suggestedAction": "Standardise the weekly governance rhythm and response-time expectations as part of the engagement kickoff for future assignments.",
      "status": "identified",
      "id": "opp-265"
    },
    {
      "type": "improvement",
      "title": "Continue first-class interview logistics and admin",
      "description": "Administrative and logistical coordination was a standout strength; ensuring this remains consistent will protect a key differentiator in the client experience.",
      "urgency": "low",
      "sourceInterviewId": "t-043",
      "client": "Tim Rolfe",
      "company": "Logistics UK",
      "supportingQuote": "“Their admin support was excellent... all the logistical arrangements... it was just first class, all the way through.”",
      "suggestedAction": "Document and replicate the logistics playbook used on this search and confirm responsibilities/timelines at the start of each assignment.",
      "status": "identified",
      "id": "opp-266"
    },
    {
      "type": "re_engagement",
      "title": "Follow up on passive NPS score",
      "description": "The client is a passive (NPS 7), which signals moderate satisfaction but risk of churn if value is not reinforced. A structured follow-up can uncover what would move them to a 9–10 and strengthen the partnership.",
      "urgency": "high",
      "sourceInterviewId": "t-046",
      "client": "Luke Dale",
      "company": "Kone",
      "supportingQuote": "NPS: 7 (passive)",
      "suggestedAction": "Schedule a 30-minute debrief with Luke to understand the drivers of the 7 score and agree 2–3 concrete improvements and next steps.",
      "status": "identified",
      "id": "opp-267"
    }
  ]
}